[{"class_mtg_info": [{"meet_t": "Th 2:00PM - 4:50PM", "meet_l": "Scott Hall 201 Ripton Room"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "34273", "title": "WCAS POLI_SCI 408-0-20 Methods of Political Inquiry", "class_attributes": "", "section": "34273", "instructors": [{"instructor_phone": "847 491 2632", "instructor_name": "Michael M Loriaux", "instructor_addr": "601 University Place, Scott Hall #325"}], "topic": "", "course": "408-0", "descriptions": [{"name": "Overview of class", "value": "Political science research relies on concepts (?country,' ?democracy,' ?voting,' ?power,' ?market') that are human, linguistic constructions. Their meaning, power, and relevance depend on how they are used and understood. Knowing how they are used and understood, in turn, requires interpretation. This course introduces students to methodological issues raised by interpretation. It is not limited to interpretive work alone, but addresses problems of interpretation as they crop up generally in political science scholarship. The goals of such scholarship vary from predicting to explaining to understanding to destabilizing and contesting dominant discourses. But in all cases there is interpretation. The gathering of events or people into &quot;kinds&quot; of events or &quot;kinds&quot; of people so as to manipulate them as variables in small-n or large-n analyses, for example, is an interpretive undertaking. For this reason this course seeks not only to introduce the student to interpretive methods narrowly conceived, but to place such methods against the backdrop of broader questions regarding what knowledge is, how we acquire it, and how interpretation contributes to that effort. To this end, we examine, successively, hermeneutics, genealogy, and deconstruction."}, {"name": "Teaching Method", "value": "Seminar."}, {"name": "Evaluation Method", "value": "Final term paper."}, {"name": "Class Materials (Required)", "value": "Thomas Kuhn, The Structure of Scientific Revolutions. <br/>Larry Laudan, Science and Values. <br/>Mary Hesse, &quot;Theory and Value in the Social Sciences&quot;<br/>Jean Grondin, Introduction to Philosophical Hermeneutics, chs. 3, 4, 6.<br/>Quentin Skinner, &quot;Meaning and Understanding in the History of Ideas&quot;<br/>Peter Winch, The Idea of a Social Science and Its Relation to Philosophy, chs. 1, 2, 4.<br/>Robert Hariman, Political Style: The Artistry of Power, chs. 1, 2, 4.<br/>Paul Ric?ur, Hermeneutics and the Human Sciences, chs. 1, 2, 4, 5, 7<br/>Mary Poovey, A History of the Modern Fact, chs. 1-3<br/>Lorraine J. Daston, Peter Gallison, Objectivity, Prologue, chs. 1, 2, 4, 7<br/>Michel Foucault, The Foucault Reader, Introduction, &quot;Truth and Power,&quot; &quot;Nietzsche, Genealogy, History,&quot; &quot;Enlghtenment,&quot; &quot;What is an Author?,&quot; &quot;The Great Confinement,&quot; &quot;The Birth of the Asylum.&quot;<br/>Michael Dillon and Andrew W. Neal, Foucault on Politics, Security, and War<br/>Ferdinand de Saussure, &quot;Nature of the Linguistic Sign,&quot; Pt. I, ch. 1, Pt. II ch. 4.<br/>Jacques Derrida, &quot;Differance,&quot;<br/>Jacques Derrida, &quot;The Deconstruction of Actuality&quot;<br/>Jacques Derrida, Rogues"}], "lmod": "4/3/16 8:17 PM (CT)", "subject": "POLI_SCI"}]