[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Loder Hall Lower Level 023"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "37745", "title": "WCAS ASIAN_AM 392-0-1 Seminar in Asian American Studies", "class_attributes": "", "section": "37745", "instructors": [{"instructor_phone": "", "instructor_name": "Andrew Way Leong", "instructor_addr": "1897 Sheridan Rd #215"}], "topic": "Manga &amp; The Graphic Novel", "course": "392-0", "descriptions": [{"name": "Overview of class", "value": "In this seminar, students will develop their own research projects on manga, comics, or graphic<br/>novels while working together through a comparative reading list of Jewish, Japanese, and American<br/>graphic narratives. Although the course readings will focus primarily on documentary, historical, and<br/>realist works, students are encouraged to pursue interests in other genres and styles.<br/>The point of departure for our collective readings will be the rhetorical figure of &quot;metastasis&quot; or<br/>displacement. We will examine metastasis not only in formal terms?as the production of narrative<br/>movement through sequences of static images, but also in historical terms?as psychological and physical<br/>displacements wrought by Japanese and Jewish immigration to the United States, Japanese American<br/>internment, and the Holocaust."}, {"name": "Evaluation Method", "value": "AttendanceClass participation: active<br/>Other: Drawing exercises<br/>Paper, final: * must be turned in to pass the course<br/>Peer assessmentPresentations: Midterm presentation<br/>Research project"}, {"name": "Class Materials (Required)", "value": "1. McCLOUD, Scott. Understanding Comics: The Invisible Art. New York: Harper Collins, 1993.<br/>2. KIYAMA, Henry (Yoshitaka). The Four Immigrants Manga: A Japanese Experience in San Francisco,<br/>1904-1924. Trans. Frederik L. Schodt. Berkeley, CA: Stonebridge Press, 1999.<br/>3. FINCK, Liana. A Bintel Brief: Love and Longing in Old New York. New York: Ecco, 2014.<br/>4. CHABON, Michael. The Amazing Adventures of Kavalier &amp; Clay. New York: Random House, 2000.<br/>5. YASHIMA, Taro. The New Sun. Honolulu, HI: University of Hawaii Press, 2008 (reprint).<br/>6. OKUBO, Miné. Citizen 13660. Seattle, WA: University of Washington Press, 2014 (reprint).<br/>7. SPIEGELMAN, Art. The Complete Maus, 25th Anniversary Edition. New York: Pantheon, 1996.<br/>8. TATSUMI Yoshihiro. Good-Bye. Ed. Adrian Tomine. Montreal: Drawn and Quarterly, 2008.<br/>9. EISNER, Will. A Contract with God. New York: W.W. Norton, 2006 (reprint)."}, {"name": "Class Materials (Suggested)", "value": "Recommended:<br/>1. HAYOT, Eric. The Elements of Academic Style. New York: Columbia, 2014.<br/>2. BOOTH, Wayne, et. al.. The Craft of Research. Third edition. Chicago: U of Chicago, 2008."}], "lmod": "4/3/16 7:44 PM (CT)", "subject": "ASIAN_AM"}]