[{"class_mtg_info": [{"meet_t": "Mo 2:00PM - 4:50PM", "meet_l": "University Hall 418"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Winter 2016", "name": "25518", "title": "WCAS ENGLISH 422-0-20 Studies in Medieval Literature", "class_attributes": "", "section": "25518", "instructors": [{"instructor_phone": "", "instructor_name": "Susan E Phillips", "instructor_addr": ""}], "topic": "Chaucer's &quot;Canterbury Tales&quot;", "course": "422-0", "descriptions": [{"name": "Overview of class", "value": "From the fifteenth-century glossators to twenty-first century critics, readers of Chaucer's Canterbury Tales have sought to interpret and contain this constantly shifting text. The poem poses numerous interpretative puzzles? the &quot;correct&quot; order of the tales, the identity of their tellers, the objects of the poem's irony, the politics of its author, and the demographics of its intended audience, to name a few?puzzles that have been &quot;solved&quot; in strikingly different ways at different historical moments. <br/> <br/>This course takes as its subject the Canterbury Tales and its reception history, exploring in detail both the poem and its multiple interpretative contexts. As we read the Tales, we will consider the narratives (and narrative conventions) that Chaucer transforms and the contemporary voices with whom he is in dialogue. We will investigate the ways in which the tales circulated both individually and as a collection (which tales were the most popular? how and by whom were they published? with which other texts did they travel?) and analyze the various paratexts that accompanied them (glosses, prologues, illustrations, and &quot;spurious&quot; links and tales). <br/> <br/>Along with these early publication contexts, we will explore recent Chaucer criticism and the scholarly history to which it responds (old and new historicist approaches, Marxist and exegetical analysis, psychoanalytic, feminist and queer theory readings, etc.)"}, {"name": "Registration Requirements", "value": "permission of department required"}, {"name": "Learning Objectives", "value": "By the end of the course, students will be proficient in both Chaucer criticism and Chaucer's Middle English."}, {"name": "Evaluation Method", "value": "primarily discussion combined with student presentations and occasional lectures."}, {"name": "Class Materials (Required)", "value": "N.B. Please read the General Prologue to The Canterbury Tales as preparation for the first class."}], "lmod": "1/9/16 6:47 PM (CT)", "subject": "ENGLISH"}]