[{"class_mtg_info": [{"meet_t": "Fr 6:15PM - 9:15PM", "meet_l": "McMillen Crowe Hall 3-130"}], "school": "SCS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "27765", "title": "SCS CHINESE 121-B-62 Chinese II", "class_attributes": "", "section": "27765", "instructors": [{"instructor_phone": "8474918130", "instructor_name": "Chyi   Chung", "instructor_addr": "CROWE 1860 Campus Dr 1-159 EV2161"}], "topic": "", "course": "121-B", "descriptions": [{"name": "Overview of class", "value": "This intermediate Chinese three-course sequence is designed to link to the first year Chinese curriculum by continuing to provide a practical, learner-centered learning experience for intermediate level students. Conversation, listening comprehension, character practicing, grammar, communicative exercises and essay writing are included throughout the course. The content and activities in this course build upon what has been studied in the introductory level curriculum, gradually adding more sophisticated vocabulary and grammatical structures. Students learn to build from words and phrases, to sentences and cohesive passages, and then to application in communicative tasks."}, {"name": "Registration Requirements", "value": "CHINESE 121-A or equivalent. The Chinese II course is suggested to be taken in sequence."}, {"name": "Learning Objectives", "value": "The content and activities in this course build upon what has been studied in the introductory level curriculum, gradually adding more sophisticated vocabulary and grammatical structures. Students learn to build from words and phrases, to sentences and cohesive passages, and then to application in communicative tasks. In this course, students will study Units 17- 20 from the Modern Chinese - Textbook 2A"}, {"name": "Class Materials (Required)", "value": "Textbook: Modern Chinese 1B 1st ed, Better Chinese LLC. ISBN: 978-1-60603-484-2"}, {"name": "Class Notes", "value": "For each lesson, students will study the new vocabulary items, grammar notes and sentence patterns, and will learn to use them in different life-like situations. Students will be actively engaged in the learning process through various kinds of in-class exercises, which include vocabulary dictations, pattern drills, listening comprehension exercises, reading practice, situational dialogue, role-play, and language games, etc."}], "lmod": "1/9/16 6:41 PM (CT)", "subject": "CHINESE"}]