[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "University Hall 018 English"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: REASON: Pre-registration is not allowed for this class. Please try again during regular registration.", "qtr": "Spring 2017", "name": "33283", "title": "WCAS ENGLISH 307-0-21 Advanced Creative Writing", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "33283", "instructors": [{"instructor_phone": "", "instructor_name": "Ahmad Z Amin", "instructor_addr": ""}], "topic": "Writing the Unspeakable", "course": "307-0", "descriptions": [{"name": "Overview of class", "value": "As writers of fiction, we try to delve deep into uncomfortable emotions: desire, loss, belonging, madness, personal and historical trauma. We start with our own raw experiences, but all too often find them hard to formulate, and end up self-censoring or resorting to clichés and conventional narrative strategies. How then do we create works of insight, clarity, and narrative power? In this class, we will learn from contemporary writers who have successfully engaged this difficult terrain. Since writing the unspeakable depends on creating innovative forms-and re-inventing existing ones-we will focus intensively on the narrative structure of these published pieces. Reading like writers, we will also take them apart to examine craft issues like point-of-view, time management, characterization, and dialogue. Five short, craft-based writing assignments will approach the unspeakable in different ways, and spark ideas/forms for your final project, a full-length short story. A draft of this will be workshopped in class, and you will also provide critical feedback for one other student's story. The final grade will be based on a writing portfolio consisting of the short assignments and a second draft of your full-length story. This is an intensive class aimed at creating a community of engaged, thoughtful writers, and class participation is essential."}, {"name": "Teaching Method", "value": "Class discussion, workshop."}, {"name": "Class Materials (Required)", "value": "Short stories, novellas and novel excerpts by Cormac McCarthy, Toni Morrison, Paul Harding, Ian McEwen, Junot Diaz, Michael Cunningham, Haruki Murakami, Rohinton Mistry, Doris Lessing, Sam Shepard, David Means, Dinaw Mengestu."}], "lmod": "2/14/17 6:44 PM (CT)", "subject": "ENGLISH"}]