[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Kresge Centennial Hall 4-410"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24143", "title": "WCAS ITALIAN 348-0-20 The Italian Novella", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "24143", "instructors": [{"instructor_phone": "847/491-8259", "instructor_name": "Alessia   Ricciardi", "instructor_addr": "1860 S. Campus Drive, Crowe Hall #2-133"}], "topic": "The Short Story in Italian Lit.", "course": "348-0", "descriptions": [{"name": "Overview of class", "value": "This course examines the illustrious genre of the short story in Italian literature, starting with the fundamental paradigm offered by Boccaccio's novellas in The Decameron. We will read short stories written in a realistic and fantastic style. How may we distinguish the narrative speed, concision, and logic of form as well as the narrator's use of time and space in each case? Through critical close reading and exploration of the historical and social context of each text, we will focus in particular on issues of love, sexuality, and friendship in the works of Boccaccio, Verga, Pirandello, Calvino, Pavese, Morante, and Tondelli. The goal of the course is to improve students' ability to write and speak in Italian while also providing them with a thorough grounding in an important literary canon. In addition to critical responses, course requirements include one creative writing assignment that focuses on rewriting one of the works covered in the syllabus?for example, by adopting a different point of view than that of the narrator, or imagining a different ending, or reinventing a crucial scene."}, {"name": "Teaching Method", "value": "Taught in Italian, seminar style"}, {"name": "Evaluation Method", "value": "Participation (20%); 1 Oral Presentation (25%); 2 Short Papers (of 3 pages each) (20%); Final Paper (5-6 pages) (35%)"}, {"name": "Class Materials (Required)", "value": "Class reader available at Quartet Copies"}], "lmod": "12/24/16 7:03 PM (CT)", "subject": "ITALIAN"}]