[{"school": "MEAS", "overview_of_class": "Applications of the principles of energy engineering analysis to the design of thermal systems. Consideration of such systems as air conditioning, oil piping, refrigeration, fluid distribution, and pneumatic control. Projects will be tailored to the class. Solution of open-ended design problems including introduction to EES (Engineering Equation Solver) software that has built-in thermophysical properties.<br/><br/>Topics to include: Energy Engineering Design, Design Constraints, Workable Thermal Design Region, Fluid Distribution System, Psychrometry (study of mixture of two ideal gases: dry air and water vapor), Humidity Control, Thermal Insulation, Heat Exchange Equipment Design, and System Modeling.", "name": "Special Topics in Mechanical Engineering", "section": "21", "topic": "Thermal Energy Systems Design", "course": "395-0", "meeting_time": ["MoWeFr 10:00AM - 10:50AM"], "path": "/class-descriptions/4620/MEAS/MECH_ENG/395-0/37430", "instructor": ["Manohar Ramchandra Kulkarni"], "id": "37430", "subject": "MECH_ENG"}, {"school": "MEAS", "overview_of_class": "The scope of this course is to provide insight and knowledge into the use of computational methods for forensic and failure analysis. This study will range from accident investigation to the use of finite element methods to determine a root cause of failure.<br/><br/> Introduction and review of the finite element method <br/> Product design and product liability<br/> Accident investigation, data gathering and hypothesis development<br/> Fractography and fractured components<br/> Intro to computational fracture mechanics<br/> Finite element analysis and forensic analysis<br/> Interfacing and problem solving with other disciplines<br/> Engineering and professional ethics", "name": "Special Topics in Mechanical Engineering", "section": "24", "topic": "Comp Forensics &amp; Failure Anal", "course": "395-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4620/MEAS/MECH_ENG/395-0/37431", "instructor": ["Mark A. Fleming"], "id": "37431", "subject": "MECH_ENG"}]