[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "University Hall 101"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-registration is reserved for Sociology, SHC, or Global Health students.", "qtr": "Spring 2017", "name": "35567", "title": "WCAS SOCIOL 355-0-20 Medical Sociology", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "35567", "instructors": [{"instructor_phone": "", "instructor_name": "Carol A Heimer", "instructor_addr": ""}], "topic": "", "course": "355-0", "descriptions": [{"name": "Overview of class", "value": "This course introduces some of the main topics of medical sociology: the social construction of health and illness; inequalities in the distribution of illness and health care; the globalization of health care; and the organization of health care work, the medical professions, and the health care system. Students will learn about variations in who gets sick and why, how the health professions evolved in the United States and how the health care &quot;turf&quot; has been divided among professions, whether and when patients and their families participate in medical decision making, why physicians have more authority and receive higher incomes in the U.S. than elsewhere, what doctors do when interns and residents make mistakes, what the relationship is between hospitals and other health care organizations and how that relationship has changed over time, how the American healthcare system compares to other healthcare systems, how expenditures on preventive medicine compare with expenditures on high-tech cutting-edge medicine, and why the U.S. invests so much in high-tech medicine."}, {"name": "Registration Requirements", "value": "attendance at first class mandatory, no p/n option<br/>During preregistration this course is only open to Sociology, SHC, &amp; Global Health Majors &amp; Minors.<br/><br/>This course is open to all undergraduates during regular registration."}, {"name": "Teaching Method", "value": "Lectures with discussion"}, {"name": "Evaluation Method", "value": "Papers, final exam"}, {"name": "Class Materials (Suggested)", "value": "This is a tentative reading list. Please confirm before purchase.<br/><br/>Required:</br><br/>Abraham, Laurie Kaye. 1993. Mama Might Be Better Off Dead: The Failure of Health Care in Urban America. Chicago: University of Chicago Press.</br><br/>Bosk, Charles L. 2003 (1979). Forgive and Remember: Managing Medical Failure, 2nd edition. Chicago: University of Chicago Press.</br><br/>Chambliss, Daniel F. 1996. Beyond Caring: Hospitals, Nurses, and the Social Organization of Ethics. Chicago: University of Chicago Press.</br><br/>Conrad, Peter, and Valerie Leiter, eds. 2013. The Sociology of Health and Illness: Critical Perspectives, 9th edition. New York: Worth Publishers.</br><br/>Heimer, Carol A., and Lisa R. Staffen. 1998. For the Sake of the Children: The Social Organization of Responsibility in the Hospital and the Home. Chicago: University of Chicago Press.</br><br/>Starr, Paul. 1982. The Social Transformation of American Medicine. New York: Basic Books.</br><br/><br/>Plus one of the following:</br><br/><br/>Fadiman, Anne. 1997. The Spirit Catches You and You Fall Down. New York: Farrar, Straus, and Giroux.</br><br/>Epstein, Helen. 2008. The Invisible Cure: Why We Are Losing the Fight Against AIDS in Africa. Picador.</br><br/>Kidder, Tracy. 2004. Mountains Beyond Mountains: The Quest of Dr. Paul Farmer, a Man Who Would Cure the World. New York: Random House.</br><br/>Ravage, Barbara. 2004. Burn Unit: Saving Lives After the Flames. Cambridge, MA: Da Capo Press.</br>"}], "lmod": "2/8/17 6:46 PM (CT)", "subject": "SOCIOL"}]