[{"class_mtg_info": [{"meet_t": "We 6:15PM - 9:15PM", "meet_l": "Wieboldt Hall 406"}], "school": "SCS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "27597", "title": "SCS ORG_BEH 372-CN-15 International Business", "class_attributes": "", "section": "27597", "instructors": [{"instructor_phone": "", "instructor_name": "Joan M McCarthy", "instructor_addr": ""}], "topic": "", "course": "372-CN", "descriptions": [{"name": "Overview of class", "value": "This is a business leadership course which provides students with a global perspective for business. Students will collaborate to build partnerships and drive solutions through business acumen and judgment to efficiently execute key business drivers of global organizations. The course will cover diverse global issues, including the challenges of cultural differences in a corporation when increasing its international platform to contribute to its core growth strategies, influencing global functional departments, negotiation, leadership, project management, managing risk, building consensus on global business opportunities, advising on international expansion and integrating global businesses. Students should develop the critical analytical skills to effectively contribute to a corporation's successful international growth.<br/>.<br/>The course readings consist of articles and intriguing business cases which profile major multinational corporations and their challenges to expand internationally in various countries."}, {"name": "Teaching Method", "value": "Discussion with class participation. Classes will be interactive with a collaborative approach of all students discussing the assigned materials along with their experiences."}, {"name": "Evaluation Method", "value": "Before each class, students should review and be prepared to discuss the details of the assigned course readings. Grades will be based on the following: (a) 50% for class participation and preparation of the assigned readings and (b) 50% for the final assignment (a brief team presentation and paper). The final assignment is a key learning component of the course."}, {"name": "Class Materials (Required)", "value": "Before the first class, students will need the Course Packet from NU's Chicago campus bookstore (312-503-8486). Please call at least one week before the first class to check if the Course Packet is available and let the bookstore know that you need it."}], "lmod": "12/25/16 6:51 PM (CT)", "subject": "ORG_BEH"}]