[{"class_mtg_info": [{"meet_t": "MoTuWeThFr 12:00PM - 12:50PM", "meet_l": "University Library 3370"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Prerequisite: Students must have passed Japanese 121-2 with at least a C- or  be placed in according to placement test results.<br/><br/>Prerequisite: Students must have passed Japanese 121-2 with at least a C- or  be placed in according to placement test results.", "qtr": "Spring 2017", "name": "32506", "title": "WCAS JAPANESE 121-3-21 Japanese II", "class_attributes": "Prerequisites apply, see description<br/><br/>Specific requirements in the language<br/><br/>", "section": "32506", "instructors": [{"instructor_phone": "8474671986", "instructor_name": "Noriko Taira   Yasohama", "instructor_addr": "1880 Campus Drive, Kresge Hall, Office 4-552"}], "topic": "", "course": "121-3", "descriptions": [{"name": "Overview of class", "value": "Japanese II (JAPANESE 121-1, 2 and 3), a yearlong course, sequel to Japanese I (JAPANESE 111), covers the second half of basic Japanese grammar and prepares students for intermediate Japanese (JAPANESE 211). In this course, students continue developing the four skills (speaking, listening, reading, and writing) through readings, video viewing, written assignments, and in-class activities. The emphasis will be on developing the skills necessary to use auxiliary verbs and complex sentences to express subtle differences in meaning and developing accuracy appropriate to the given contexts as well as building a solid foundation of Japanese with accurate use of vocabulary and sentence structures. Student will also practice describing their experiences and situations as well as summarizing a story that they heard/read/watched in an organized speech/writing. To be independent learners, students will learn to identify and self-correct errors in their language use. The instructor will assist in this process with oral and written feedback."}, {"name": "Registration Requirements", "value": "Students must pass the preceding course with C- or above, or must be placed into the course by the departmental placement test."}, {"name": "Learning Objectives", "value": "Upon the satisfactory completion of the course, students will be able to handle various types of more complex daily conversational situations and passages. The year-end proficiency goal of Japanese II is for the students to reach the Intermediate-Mid level defined by the American Council on Teaching of Foreign Languages (ACTFL) proficiency guidelines (http://actflproficiencyguidelines2012.org/)."}, {"name": "Teaching Method", "value": "Class hours are spent mainly on oral proficiency development, and written assignments are given for reading and writing skills development. Students are expected to be fully prepared for each lesson and to review what they did in each class.   They are expected read the textbook thoroughly, and do listening practices with CD on a regular basis. Useful expressions in daily life and social and cultural aspects in modern Japan are introduced through a series of videos. This course is conducted mostly in Japanese."}, {"name": "Evaluation Method", "value": "Class participation and performance; assignments; quizzes; oral and written examinations; essays"}, {"name": "Class Materials (Required)", "value": "Hasegawa, Y. (2006) Elementary Japanese, vol. 2. Vermont: Tuttle Language Library. ISBN-13: 978-0804835060;  ISBN-10: 0804835063; <br/>Course Packet ($8-$10)."}, {"name": "Class Materials (Suggested)", "value": "Kodansha's Essential Kanji Dictionary. Tokyo: Kodansha. ISBN: 978-4-7700-2891-4; Endo-Hudson, M. (1994). English Grammar for Students of Japanese. Ann Arbor: The Olivia and Hill Press. ISBN: 978-0-934034-16-6; Yoshida, M. &amp; Nakamura, Y. (2002). Kodansha's Furigana English-Japanese Dictionary. Tokyo: Kodansha. ISBN: 978-4-7700-2751-1; Yoshida, M. &amp; Nakamura, Y. (2002). Kodansha's Furigana Japanese-English Dictionary. Tokyo: Kodansha. ISBN: 978-4-7700-2750-4; Yoshida, M. &amp; Nakamura, Y. (1999). Kodansha' Furigana Japanese Dictionary. Tokyo: Kodansha. ISBN: 978-4-7700-2480-0; Makino, S. &amp; Tsutsui, M. (1989). Dictionary of Basic Japanese Grammar. Tokyo: The Japan Times. ISBN 978-4-7890-0454-1"}], "lmod": "2/13/17 6:46 PM (CT)", "subject": "JAPANESE"}]