[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "University Hall 118"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Winter 2017", "name": "22843", "title": "WCAS PHIL 273-1-20 The Brady Scholars Program", "class_attributes": "Ethics &amp; Values Distro Area<br/><br/>", "section": "22843", "instructors": [{"instructor_phone": "847/467-6249", "instructor_name": "Stephen John White", "instructor_addr": "Crowe Hall, Room 1-159"}], "topic": "The Good Life", "course": "273-1", "descriptions": [{"name": "Overview of class", "value": "This is the second in the sequence of three courses required of sophomores in the Brady Scholars Program in Ethics and Civic Life. In this course, we will be exploring rival philosophical theories of well-being. What, fundamentally, makes a person's life go well? Is a person better off the more he or she gets what she wants? Or the more enjoyment he or she gets out of life? And what of things like love, friendship, health, education, and creative expression? Do these things contribute to a good life in and of themselves, or only insofar as they enhance a person's satisfaction or enjoyment? In addition to such fundamental issues, we will consider some more specific questions related to the good life. For instance, what is the relation between being happy and being moral? Would it be better if we could live much longer lives than humans presently live? Is it bad to die? And is there a connection between having a good life and finding meaning or purpose in one's life?"}, {"name": "Registration Requirements", "value": "Limited to sophomores in the Brady Scholars Program."}, {"name": "Learning Objectives", "value": "Students will<br/>(1) learn to articulate and critically assess arguments for and against rival theories of well-being.<br/>(2) be able to apply different theories of well-being to answer specific questions about the role that such things as pleasure, the length of life, work, and morality play in a good life.<br/>(3) Learn to construct arguments and clearly explain philosophical ideas in writing."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Grades will be determined by performance on essay assignments and in-class participation."}, {"name": "Class Materials (Required)", "value": "Thomas Hurka, The Best Things in Life: A Guide to What Really Matters (Oxford U. Press)<br/>Richard Kraut, What is Good and Why?<br/>Guy Fletcher, ed. The Routledge Handbook of Philosophy of Well-Being (Routlege)"}], "lmod": "12/25/16 7:04 PM (CT)", "subject": "PHIL"}]