[{"school": "WCAS", "overview_of_class": "The work of many poets, fiction writers, and nonfiction writers is informed by archival investigations, interviews, informal conversations, or immersion experiences. This multi-genre creative writing course will investigate how research might be used to generate ideas, to move a creative work forward, and to facilitate revision. Students will learn to use research as an integral component of the creative process rather than as a preamble or an afterthought. Readings, writing assignments, and research assignments will be designed to promote an exploration of how creative writers approach research and how research might manifest differently in poetry, fiction, and nonfiction writing. Students will have the option of writing in one or more genres.", "name": "Advanced Creative Writing", "section": "20", "location": "Harris Hall L04", "topic": "Writing from Research", "course": "307-0", "meeting_time": ["MoWe 12:30PM - 1:50PM"], "path": "/class-descriptions/4660/WCAS/ENGLISH/307-0/33282", "instructor": ["Eula Ruth Biss"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>Prerequisites apply, see description<br/><br/>", "id": "33282", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "As writers of fiction, we try to delve deep into uncomfortable emotions: desire, loss, belonging, madness, personal and historical trauma. We start with our own raw experiences, but all too often find them hard to formulate, and end up self-censoring or resorting to clichés and conventional narrative strategies. How then do we create works of insight, clarity, and narrative power? In this class, we will learn from contemporary writers who have successfully engaged this difficult terrain. Since writing the unspeakable depends on creating innovative forms-and re-inventing existing ones-we will focus intensively on the narrative structure of these published pieces. Reading like writers, we will also take them apart to examine craft issues like point-of-view, time management, characterization, and dialogue. Five short, craft-based writing assignments will approach the unspeakable in different ways, and spark ideas/forms for your final project, a full-length short story. A draft of this will be workshopped in class, and you will also provide critical feedback for one other student's story. The final grade will be based on a writing portfolio consisting of the short assignments and a second draft of your full-length story. This is an intensive class aimed at creating a community of engaged, thoughtful writers, and class participation is essential.", "name": "Advanced Creative Writing", "section": "21", "location": "University Hall 018 English", "topic": "Writing the Unspeakable", "course": "307-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4660/WCAS/ENGLISH/307-0/33283", "instructor": ["Ahmad Z Amin"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "id": "33283", "subject": "ENGLISH"}]