[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Kresge Centennial Hall 2-435"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "20519", "title": "WCAS GERMAN 322-0-20 German Contributions to World Literature", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "20519", "instructors": [{"instructor_phone": "847/491-5788", "instructor_name": "Martina F Kerlova", "instructor_addr": "1880 Campus Dr. (Kresge) Office 3325"}], "topic": "", "course": "322-0", "descriptions": [{"name": "Overview of class", "value": "German 322: German Contribution to World Literature<br/>Slavic 393: Prague: City of Cultures, City of Conflict<br/><br/>This course examines Prague, one of the most beautiful and culturally vibrant cities in Europe. The city`s magnificent streets and buildings both conceal and reveal a past full of multiethnic coexistence and interethnic conflict. The course aims to understand the development of Prague over the past two centuries from a multicultural, democratic city to a homogeneous, communist one, and ultimately to its present open and capitalist incarnation. <br/>We will read a range of literary and historical sources, including the story of the Golem and writings by Milan Kundera, Václav Havel, and Franz Kafka. We will also study the architecture of the city and watch several films set on its streets. "}, {"name": "Registration Requirements", "value": "None."}, {"name": "Learning Objectives", "value": "- To consider the productive (as well as the destructive) consequences of interethnic strife and political repression, in particular, in the development of literature. <br/>- To investigate how cultural producers and consumers respond to divisive pressures from within and censorious pressures from without.<br/>- To understand the contingent and malleable nature of national and other identities."}, {"name": "Teaching Method", "value": "Readings, discussion, presentations, lecture, films"}, {"name": "Evaluation Method", "value": "Class attendance, participation, journals and presentation - 25%<br/>Three medium-length papers (5-6 pp.) - 75%"}, {"name": "Class Materials (Required)", "value": "Hrabal, Bohumil: I served the King of England<br/>Kundera, Milan: The Unbearable Lightness of Being<br/>Kovály, Heda Margolius: Under a Cruel Star: A Life in Prague, 1941-1968<br/>The Course pack includes the Golem legend and selections from Kafka, Havel, and Patocka.<br/>Films (streamed)"}], "lmod": "12/24/16 6:59 PM (CT)", "subject": "GERMAN"}]