[{"class_mtg_info": [{"meet_t": "We 2:00PM - 4:50PM", "meet_l": "RCMA 1-176"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "12230", "title": "WCAS GNDR_ST 490-0-21 Topics in Gender Studies", "class_attributes": "", "section": "12230", "instructors": [{"instructor_phone": "847/491-5705", "instructor_name": "Linda P Austern", "instructor_addr": "l-austern@northwestern.edu"}], "topic": "Music and Gender in the Early Modern Era", "course": "490-0", "descriptions": [{"name": "Overview of class", "value": "This discussion-oriented seminar will provide introductory insights into some of the many intersections between music and ideas of gender and sexuality during the late sixteenth-, seventeenth- and early eighteenth centuries. We will consider late twentieth- and early twenty-first century histories and theories of gender and sexuality, particularly of the periods in question, as well as key ideas that are especially applicable to early modern constructs of the body, selfhood, and gender identity, such as cross-dressing, castration, and forms of desire. The course is open to any graduate student with previous course work on the early modern era OR gender &amp; sexuality studies, in any subject or department. In true seminar style, class meetings will consist of discussion of shared material plus presentations by individual students based on their particular interests within each set of topical parameters. It is hoped that, collectively, we can answer some of the open questions about gender and sexuality of the early modern era by using musical evidence, one of the fields most likely to be overlooked by professional scholars of the histories of gender and sexuality. Other evidence will come from the histories of philosophy and medicine, visual arts, religious history, and material culture, especially as they intersect with early modern ideas of music."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Based primarily on weekly contributions to discussion (55%), and also on a research paper (45%). Since this is a graduate seminar, it is hoped that paper topics will help students explore areas for further research."}, {"name": "Class Materials (Required)", "value": "Consists of a range books and articles from multiple disciplines in Early Modern Studies with a focus on gender and sexuality, most of which will be available through Canvas Reserves or on reserve in the University Library. Core books will include Katherine Crawford's European Sexualities, 1400-1800 and Merry Wiesner's Women and Gender in Early Modern Europe, 3rd edition. Course materials will also include a variety of streamed audio recordings of music (scores will be on reserve for those who read them), and video recordings of opera and other staged works."}], "lmod": "10/30/16 7:05 PM (CT)", "subject": "GNDR_ST"}]