[{"class_mtg_info": [{"meet_t": "MoWeFr 11:00AM - 11:50AM", "meet_l": "Harris Hall L05"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores<br/>Add Consent: Department Consent Required<br/>", "qtr": "Fall 2016", "name": "14760", "title": "WCAS ENGLISH 105-6-24 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "14760", "instructors": [{"instructor_phone": "847/491-7690", "instructor_name": "Barbara L Shwom", "instructor_addr": "555 Clark St., 247"}], "topic": "How to Become an Expert ...", "course": "105-6", "descriptions": [{"name": "Overview of class", "value": "Every day on television and radio, on the streets and in classrooms, we hear people expressing opinions about a variety of topics. The people who are most persuasive, however, are those who are most informed. This course is designed to give students the tools to develop an informed opinion, to present that opinion to others orally and in writing, and to persuade others to consider (and even accept) their point of view.<br/><br/>In this seminar, you will have the opportunity to select a topic of your choice and research it in depth, using library resources, the Internet, interviews and surveys. You will also learn a number of techniques for presenting your ideas persuasively, both orally and in writing. By the end of the course, you will be in position to discuss your ideas in a thoughtful, authoritative way. In this sense, you will have earned the right to call yourself an expert on your topic."}, {"name": "Teaching Method", "value": "Discussion."}, {"name": "Evaluation Method", "value": "Class participation (20%), writing assignments (60%), and 10-15 minute oral presentation (20%)"}, {"name": "Class Materials (Required)", "value": "READING: Two textbooks are required:<br/><br/>Rules for Writers by Diana Hacker; The Craft of Research, by Wayne Booth, Gregory Colomb, and Joseph Williams. Most of the reading, however, will be keyed to the students own expert research projects."}], "lmod": "10/30/16 7:04 PM (CT)", "subject": "ENGLISH"}]