[{"school": "WCAS", "overview_of_class": "*INFORMATION IS SUBJECT TO CHANGE*<br/><br/><br/>The instructor of &quot;Lessons in Non-Profit Management&quot; is: Seth Green.<br/><br/><br/>In this course, we will dive into the exciting world of non-profits and immerse ourselves in everything from how non-profits finance their efforts to how they measure their performance. We will also look at what makes a great consultant, as you serve as a consultant to a non-profit client.<br/><br/><br/>This course brings together students from a variety of academic disciplines and leverages their diverse talents in the field to consult nonprofits facing organizational challenges in addressing issues such as poverty, homelessness and education. Bridging the divide between academic experience and civic engagement, teams of five undergraduate students have the opportunity to work on ten-week engagements with nonprofits under the supervision of Kellogg MBA students.<br/><br/><br/>To inform and guide students` interaction with nonprofits, this course will provide an overview of the nonprofit sector and the growing trends towards greater accountability, transparency and performance management. Students will explore the changing roles and responsibilities of nonprofits, as shaped by both the public and private sector, and they will examine the implications of these trends. The first half of the course will be spent introducing students to the Third Sector and the present political and economic systems that influence how it serves the public good. The second half of the course will be spent examining business strategy and management and their applicability to nonprofits. The overarching goal of the course is to create a foundation of knowledge from which students can draw upon as they work together with community nonprofits. This course is an opportunity to innovate, collaborate, learn and apply a new set of skills and knowledge while impacting the community.", "name": "Professional Linkage Seminar", "section": "24", "topic": "Lessons in Non-Profit Mgmt", "course": "394-0", "meeting_time": ["Tu 2:00PM - 4:50PM"], "path": "/class-descriptions/4620/WCAS/BUS_INST/394-0/30911", "instructor": ["Seth Jacob Green"], "id": "30911", "subject": "BUS_INST"}, {"school": "WCAS", "overview_of_class": "*INFORMATION IS SUBJECT TO CHANGE*<br/><br/><br/>The instructor of &quot;The History of Investing&quot; is: Scott Bondurant.<br/><br/><br/>The goal of the course is to provide a basic understanding of markets and investing. We will review the history of investments from early civilization to present day with a focus on developments in the last 80 years. In conjunction with this work, we will study the evolution of investment theory with the goal of having students understand some of the basic concepts. We will also survey the major investment categories with a focus on how investing takes place in the &quot;real world&quot; with leading investment professionals as guest lecturers.<br/><br/><br/>The hope is that the class will stimulate an interest in/passion for investing, enable students to begin to build their own framework for future investing, and provide an overview and insights into the investment profession.<br/><br/>", "name": "Professional Linkage Seminar", "section": "28", "topic": "The History of Investing", "course": "394-0", "meeting_time": ["Mo 6:00PM - 9:00PM"], "path": "/class-descriptions/4620/WCAS/BUS_INST/394-0/30912", "instructor": ["Scott   Bondurant"], "id": "30912", "subject": "BUS_INST"}, {"school": "WCAS", "overview_of_class": "*INFORMATION IS SUBJECT TO CHANGE*<br/><br/><br/>The instructor of &quot;Positive Entrepreneurship&quot; is: Gregg Latterman.<br/><br/><br/>Positive Entrepreneurship: Profits and Meaning is a class consisting of nine classes/topics that will take students on a journey from where they are today to where they want to end up in their lifetime as successful positive entrepreneurs. The goal of this course is to help prepare students who want to start a company and live to their full potential in life both personally and professionally. The class will integrate entrepreneurship, Conscious Capitalism, and other related subjects to teach the skills and knowledge to enable students to build a life that matters through starting their own company. This class is the start of the student's journey to find meaning and true passion in their work and personal life.<br/>", "name": "Professional Linkage Seminar", "section": "29", "topic": "Positive Entrepreneurship", "course": "394-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4620/WCAS/BUS_INST/394-0/30913", "instructor": ["Gregg   Latterman"], "id": "30913", "subject": "BUS_INST"}, {"school": "WCAS", "overview_of_class": "*INFORMATION IS SUBJECT TO CHANGE*<br/><br/><br/><br/>Instructor for &quot;Theories of Financial Investing&quot; is: William McLean<br/><br/><br/>This course studies the field of investment management for institutional portfolios. It is intended as a combination of modern financial theory and industry practice, giving insight into the investment process used in large foundations, endowments, and pension funds. It covers best practices in risk management, diversification theory, modern portfolio theory, and new issues in investment management. In particular, the field of alternative investments namely, hedge funds, private equity, venture capital, and real asset-based investments will be featured.<br/>", "name": "Professional Linkage Seminar", "section": "30", "topic": "Theories of Financial Investing", "course": "394-0", "meeting_time": ["Tu 6:30PM - 9:30PM"], "path": "/class-descriptions/4620/WCAS/BUS_INST/394-0/30914", "instructor": ["William H McLean"], "id": "30914", "subject": "BUS_INST"}]