[{"school": "WCAS", "overview_of_class": "How the 99% Live: Inequalities in American Cities This course title refers both to the famous 1889 Jacob Riis photo-documentary on poverty in New York City, How the Other Half Lives, and to the slogans of the Occupy Wall Street protests of 2011 and of Black Lives Matter today. It does so to underline the return, over the past few decades, of the extreme levels of economic inequality in the United States characteristic of the late 19th and early 20th centuries. In this seminar, students will read about, discuss, write about, and thus gain the intellectual tools to evaluate past and present American urban inequalities-including not only class, but race/ethnicity, gender & sexuality, nationality. We will read across several different academic disciplines and journalism to become familiar with key analytic concepts and methods, such as political economy, the Great Compression, urban regimes, ethnography. Using them, we will explore arenas of inequality: employment; urban space, housing, and neighborhoods; schooling, criminal justice, the public sphere. And we will also consider movements to ameliorate those inequalities.", "name": "First-Year Seminar", "section": "21", "location": "ANTHRO Sem Rm 104 - 1810 Hinmn", "topic": "How The Other 99% Live", "course": "101-6", "meeting_time": ["Tu 5:00PM - 8:00PM"], "path": "/class-descriptions/4650/WCAS/ANTHRO/101-6/23063", "instructor": ["Micaela   di Leonardo"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "23063", "subject": "ANTHRO"}, {"school": "WCAS", "overview_of_class": "In the movies, lemurs dance, capuchins slap people in the face, and apes take over the world. We are faced with images of our closest living relatives everyday. But how accurate are these images? How do they affect our perspectives on primates and their place in the world? In this course we will explore the intersections between human and primate lives in an effort to understand how we view primates, what factors influence those views, and how both humans and primates are ultimately affected. Using writing and discussion, we will consider primates in the media, primates as pets, primates in research, and primate conservation, among other topics. At the end of this course you will be able to evaluate how accurately primates are portrayed in a range of contexts and understand the consequences of those portrayals. You will have a stronger appreciation for the complex relationship between humans and primates worldwide and how it affects our everyday lives. And most importantly, you will have challenged and enriched your own perspectives on primates.", "name": "First-Year Seminar", "section": "22", "location": "ANTHRO Lab A58 - 1810 Hinmn", "topic": "Perspectives on Primates", "course": "101-6", "meeting_time": ["MoWeFr 10:00AM - 10:50AM"], "path": "/class-descriptions/4650/WCAS/ANTHRO/101-6/23064", "instructor": ["Katherine Ryan Amato"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "23064", "subject": "ANTHRO"}]