[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "University Hall 218"}], "school": "WCAS", "overview_of_class": "Settler Colonialism & Indigeneity looks at colonialism as continuing structural power rather than an historical event. With a focus on the Asia, the Pacific Islands and the Americas, this course examines and questions the creation and maintenance of settler, indigenous and arrivant identities. The course will seek to answer these key questions: What cultural, economic and political work does settler colonialism do to justify imperialism? What does settler colonialism look like in contemporary culture? How have Indigenous peoples challenged settler colonialism through political action and art? What alternative world-views push back against policies of coloniality and the rhetoric of modernity?  This course will engage with current discussions in Asian American Studies, Native American/Indigenous Studies and Ethnic Studies.", "qtr": "Winter 2016", "name": "Advanced Topics in Social and Cultural Analysis", "title": "WCAS ASIAN_AM 303-0-1 Advanced Topics in Social and Cultural Analysis", "lmod": "1/9/16 6:43 PM (CT)", "section": "1", "instructors": [{"instructor_phone": "847/467-7114", "instructor_name": "Laura Sachiko Fugikawa", "instructor_addr": "1819 Hinman Avenue, Room 207"}], "topic": "", "course": "303-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Settler Colonialism &amp; Indigeneity looks at colonialism as continuing structural power rather than an historical event. With a focus on the Asia, the Pacific Islands and the Americas, this course examines and questions the creation and maintenance of settler, indigenous and arrivant identities. The course will seek to answer these key questions: What cultural, economic and political work does settler colonialism do to justify imperialism? What does settler colonialism look like in contemporary culture? How have Indigenous peoples challenged settler colonialism through political action and art? What alternative world-views push back against policies of coloniality and the rhetoric of modernity? This course will engage with current discussions in Asian American Studies, Native American/Indigenous Studies and Ethnic Studies."}, {"name": "Registration Requirements", "value": "None."}, {"name": "Teaching Method", "value": "Class participationDiscussionGroup workLecturePresentationsSeminarWriting assignments"}, {"name": "Evaluation Method", "value": "AttendanceClass participationExam, finalExam, mid-term"}, {"name": "Class Materials (Required)", "value": "Course materials on Canvas."}], "path": "/class-descriptions/4610/WCAS/ASIAN_AM/303-0/22807", "instructor": ["Laura Sachiko Fugikawa"], "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "id": "22807", "subject": "ASIAN_AM"}]