[{"class_mtg_info": [{"meet_t": "We 12:00PM - 2:50PM", "meet_l": "Annie May Swift Hall 219"}], "school": "SoC", "enrl_requirement": "", "qtr": "Spring 2017", "name": "34649", "title": "SoC RTVF 360-0-23 Topics in Media Writing", "class_attributes": "Prerequisites apply, see description<br/><br/>", "section": "34649", "instructors": [{"instructor_phone": "", "instructor_name": "William Grant Bleich", "instructor_addr": ""}], "topic": "Write Inspir/Transform Script", "course": "360-0", "descriptions": [{"name": "Overview of class", "value": "Writing the Inspirational Film<br/>That movie changed my life. That play made me a better person. I laughed. I cried. I was inspired or transformed. Is there an art and craft to the creation of these types of stories or are their emotional effects more a matter of personal inclination? Different strokes for different folks or is there a method to the madness? What is the story mechanism that drives It's a Wonderful Life, To Kill a Mockingbird or Groundhog Day to make them inspirational? Why do we cry at Love, Actually, laugh at Some Like It Hot or scream at Halloween? One of the goals of this class will be to place Aristotle's theory of catharsis, the purgative release from pity and fear, into a modern context. Is there a common thread between Oedipus Rex, Romeo and Juliet and The Lion King? Are there narrative strategies to employ to emotionally engage and release an audience? And on a personal level, might the process of creating such a narrative ultimately transform the author as well? Students in this advanced media writing class will collaborate to answer these questions and define what it means to write an inspirational/transformational script. Their projects will be developed through mastery of all elements of the art and craft of scriptwriting. Particular emphasis will be placed on character development. Each student will create a complete outline and write at least thirty to forty pages for an inspirational feature-length film or play. At their option, students may complete their scripts during the class. This workshop course will be augmented by readings, lectures, discussion, in-class viewing and at-home streaming of selected films.<br/><br/>Pre-Requisite: RTVF 260. Estimated Copies: 300<br/>Required textbooks: <br/>Howard, David (2004). How to Build a Great Screenplay: A Master Class in Storytelling for Film [Paperback] New York: St. Martin's Griffin. # ISBN-10: 031235262X; # ISBN-13: 978-0312352622<br/>Waldeback, Zara and Batty, Craig (2012). The Creative Screenwriter. New York: Methuen Drama. #ISBN-13 9781408137192"}], "lmod": "2/16/17 6:39 PM (CT)", "subject": "RTVF"}]