[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "University Hall 101"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "23932", "title": "WCAS ENGLISH 368-0-20 Studies in 20th-Century Literature", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "23932", "instructors": [{"instructor_phone": "", "instructor_name": "Brian T Edwards", "instructor_addr": "1897 Sheridan Rd #215"}], "topic": "Wartime Books", "course": "368-0", "descriptions": [{"name": "Overview of class", "value": "This course examines the body of recent literature that has emerged in the wake of the US wars in the Middle East, and the ways in which the figure of the Muslim is variously figured. In the past decade, a number of returning US veterans have published novels and short stories set in Iraq and Afghanistan, many of them ambitious and sophisticated. We will read some of the more provocative and evocative of these literary texts by returning veterans and fiction by Iraqi authors in the wake of the US invasion and occupation. On the US side, the novelists considered both invoke or allude to American fiction of the WWII and Vietnam periods, but also seem to have picked up on, in the most interesting cases, lessons gleaned from postcolonial studies, namely the question of the silenced subaltern subject and the relationship of representation to military/geopolitical occupation. So we will also read major works of literature from WWII and Vietnam, and a selection of essays from postcolonial studies."}, {"name": "Teaching Method", "value": "Seminar with discussion."}, {"name": "Evaluation Method", "value": "Short paper, presentation, reading quizzes, final paper."}, {"name": "Class Materials (Required)", "value": "Works by writers such as Gertrude Stein, John Hersey, Miné Okubo, Hisaye Yamamoto, Norman Mailer, Gwendolyn Brooks, Joseph Heller, Ralph Ellison, Tim O'Brien, Michael Herr, Siobhan Fallon, Ben Fountain, Phil Klay, Michael Pitre, Elliott Ackerman, Hassan Blassim, Sinan Antoon, Gayatri Spivak, Edward Said, and others. Substitutes will be satisfying."}], "lmod": "12/24/16 6:58 PM (CT)", "subject": "ENGLISH"}]