[{"class_mtg_info": [{"meet_t": "TuTh 1:00PM - 3:45PM", "meet_l": "No Room Needed"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Registration is reserved for students who have completed BIOL_SCI 115-0 or 215-0.", "qtr": "Spring 2016", "name": "32143", "title": "WCAS BIOL_SCI 344-0-20 Anatomy of Vertebrates", "class_attributes": "Prerequisites apply, see description<br/><br/>", "section": "32143", "instructors": [{"instructor_phone": "", "instructor_name": "Olivier Cedric Rieppel", "instructor_addr": ""}], "topic": "", "course": "344-0", "descriptions": [{"name": "Overview of class", "value": "The course deals with the major structural and functional transformations and innovations that characterize the evolution of vertebrates from fish to man. It integrates findings from vertebrate paleontology with the study of living vertebrates, and it includes practical lab work that will offer the opportunity to dissect a shark and/or a bony fish. In order to maintain a phylogenetic perspective and integration with paleontology, the course will start out with a brief introduction into the methods of phylogeny reconstruction. This will be followed by an introduction to vertebrate hard tissues as a basis for an understanding of the musculoskeletal system throughout vertebrates. Highlights are the origin of jawed vertebrates, the transition from water to land and the origin of the tetrapod limb, the diversification of tetrapods and the origin of amniotes, the origin of birds from theropod dinosaurs, endothermy and the evolution of mammals. The final class will put human skeletal anatomy into its evolutionary, i.e., historical, perspective."}, {"name": "Registration Requirements", "value": "BIOL 115 or 215"}, {"name": "Teaching Method", "value": "Lectures and Lab."}, {"name": "Evaluation Method", "value": "Exams, lab quizzes, paper."}, {"name": "Class Materials (Required)", "value": "Required:<br/>Dissection kits - preferred dissection kit :<br/>20 PCS ADVANCED BIOLOGY LAB ANATOMY MEDICAL STUDENT DISSECTING DISSECTION KIT SET WITH SCALPEL KNIFE HANDLE BLADES #10 + #11 ( HTI BRAND) <br/><br/>The Evolution of Vertebrate Design, 1987, L.B Radinsky, The University of Chicago Press ISBN 0-226-70236-7<br/><br/>TENTATIVE: In addition to the textbook, students will be given hand-outs, and will rely on lecture and lab notes."}, {"name": "Class Materials (Suggested)", "value": "READING: Recommended:<br/>Your Inner Fish, 2009, N. Shubin, The University of Chicago Press ISBN 9780307277459"}, {"name": "Class Notes", "value": "Class will be taught at the Field Museum of Natural History by Dr. Olivier Rieppel. Transportation will be provided; class with travel time will be 12:15-4:45pm. The bus to the museum departs promptly from the parking lot between Lunt Hall and Garrett Theologlical Seminary at 12:15pm and will return students to the same lot no later than 4:45pm, traffic permitting. Bus should drop off students at the East Entrance of the Field Museum."}], "lmod": "4/3/16 7:46 PM (CT)", "subject": "BIOL_SCI"}]