[{"class_mtg_info": [{"meet_t": "MoWe 12:30PM - 1:50PM", "meet_l": "ANTHRO Lab A56 - 1810 Hinmn"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "23090", "title": "WCAS ANTHRO 390-0-25 Topics In Anthropology", "class_attributes": "", "section": "23090", "instructors": [{"instructor_phone": "847 4914565", "instructor_name": "Emily N Haynes", "instructor_addr": "1810 Hinman Ave 206"}], "topic": "Borderland Languages", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "Though borders, particularly those delimiting different nation states, often appear as fixed and self-evident, the areas surrounding them?borderlands?often reveal their fluidity, porousness, and openness to change. This course engages with the concept of borderlands, broadly defined, and all the ways that language works to define what is constituted by a border, delimit what belongs and does not, and negotiate identities that span multiple &quot;sides&quot; of a border. It engages with both the kinds of borders that appear on maps, as well as those that become apparent only through lived experience, interrogating the ways that language discursively constructs both these boundaries and the identities of those people whose come to be defined by them. Themes include transborder migration, diaspora, and lived experience; urban borderlands related to class and race; intra-national borders and ethnicity; border conflicts; and discourses of borders and security. Geographically this course considers borders in North and South America, the Caribbean, Asia, and the Middle East."}, {"name": "Learning Objectives", "value": "Students will be able to<br/>1. understand human diversity and similarity <br/>2. identify characteristics of borders and borderlands<br/>3. understand key topics and methodological approaches in linguistic anthropology <br/>4. understand the relationship between language, identity, class, race, gender, ethnicity, etc. <br/>5. enhance their creative, critical, and informed thinking about language and culture<br/>6. engage with the significance of theoretical debates regarding borderlands and language"}, {"name": "Teaching Method", "value": "Lecture and Discussion"}, {"name": "Evaluation Method", "value": "Participation<br/>Class Presentation<br/>Writing Assignments"}, {"name": "Class Materials (Required)", "value": "Homegirls: Language and Cultural Practice Among Latina Youth Gangs<br/>Gossip and the Everyday Production of Politics<br/>Norma Mendoza-Denton<br/>ISBN-13: 978-0631234906<br/>ISBN-10: 063123490X<br/><br/>Turf Wars: Discourse, Diversity, and the Politics of Place<br/>Gabriella Modan<br/>ISBN-13: 978-1405129558<br/>ISBN-10: 1405129557"}], "lmod": "12/25/16 6:54 PM (CT)", "subject": "ANTHRO"}]