[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Locy Hall 111"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24752", "title": "WCAS SOCIOL 322-0-20 Sociology of Immigration", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "24752", "instructors": [{"instructor_phone": "", "instructor_name": "Diego Felipe De Los Rios", "instructor_addr": ""}], "topic": "", "course": "322-0", "descriptions": [{"name": "Overview of class", "value": "This course examines global migration from a sociological lens, paying particular attention to migration to the United States and Western Europe. We will explore how the social, political, and historical contexts of sending and receiving nations shape migration patterns, as well as the relationships between migrants and existing institutions and identities. The first part of the course will focus on understanding migration patterns, outlining the factors and policies that have shaped migration across time and space. Following this, we explore questions and debates about immigrant assimilation and incorporation, considering how factors such as gender, race, ethnicity, and religion, affect the reception and integration of migrants. Finally, we will examine the consequences of immigration and transnationalism on nation-states and diasporic communities."}, {"name": "Learning Objectives", "value": "- Have a solid understanding of theories and patterns of migration.<br/>- Be able to differentiate historical and national factors and policies, and understand what the consequences of these differences are, both for immigrants and nations. <br/>- Be able to critically evaluate different theories of assimilation and incorporation.<br/>- Be familiar with the concept of transnationalism and its implications for understanding the lives of immigrants."}, {"name": "Teaching Method", "value": "Lecture and discussion"}, {"name": "Evaluation Method", "value": "Class participation, response papers, midterm and final (take home) exam."}, {"name": "Class Materials (Required)", "value": "Readings will be available online."}], "lmod": "12/29/16 7:05 PM (CT)", "subject": "SOCIOL"}]