[{"class_mtg_info": [{"meet_t": "Mo 2:00PM - 4:50PM", "meet_l": "Kresge Centennial Hall 3-410"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Winter 2017", "name": "27455", "title": "WCAS WRITING 303-0-20 The Art of Nonfiction", "class_attributes": "", "section": "27455", "instructors": [{"instructor_phone": "847/467-4099", "instructor_name": "Alex W Kotlowitz", "instructor_addr": "555 Clark Street, Room 218"}], "topic": "Telling Stories", "course": "303-0", "descriptions": [{"name": "Overview of class", "value": "There is such beauty and power in storytelling. The best of nonfiction narrative pokes and prods our preconceptions, pushing us to imagine the world through the eyes of others. What makes for a compelling story? How can we make nonfiction read like literature? How do we tell true stories that are both intimate and vivid? We'll explore the craft of reporting and research which borrows from a variety of disciplines, including anthropology, history and sociology - and work with rigor and discipline on the art of good writing. We'll read nonfiction narratives - both book and magazine articles (and listen to some radio) - on a host of subjects, ranging from war and poverty to the environment and sports. We'll work in this class as a professional writer might, from draft to draft. There will be regular writing assignments, and students will be asked to craft a longer narrative on a subject of their choosing. The course will be run as a seminar so there will be an emphasis on critical class discussion - and workshopping your writing."}, {"name": "Registration Requirements", "value": "Students need a permission number to register for the course. There is a form students must submit to considered for the class that can be found at: http://www.northwestern.edu/writing-arts/<br/><br/>Contact the Assistant Director, Stacy Oliver and request to submit a form. <br/>words@northwestern.edu"}, {"name": "Class Materials (Required)", "value": "Best Intentions by Robert Sam Anson?.ISBN-13: 978-0394757070<br/><br/>The Laramie Project... ISBN-10: 0804170398<br/> <br/>Behind the Beautiful Forevers by Katherine Boo ... ISBN-10: 081297932X<br/><br/>Articles and chapters will be given to read. These are free and given out by the instructor."}], "lmod": "12/25/16 7:08 PM (CT)", "subject": "WRITING"}]