[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Locy Hall 305"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "24033", "title": "WCAS SPANISH 341-0-1 Latin American Modernismo", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "24033", "instructors": [{"instructor_phone": "", "instructor_name": "Maria Alejandra Uslenghi", "instructor_addr": ""}], "topic": "", "course": "341-0", "descriptions": [{"name": "Overview of class", "value": "We will work comparatively with texts from Latin American modernismo and European fin-de-siècle traditions to elaborate on different conceptualizations of the modern imagination. Modernismo characterizes by its strategies of cultural appropriation on one side, and of cultural exhibition on the other, as it marks a moment of intense traffic of symbolic and material goods between metropolitan centers, and at the same time, it claims its cultural autonomy. We explore this system of cultural appropriation and creative transformation in Latin American modernista writers chronicles, poetry and travel writing and we consider the Latin American inflexion on such topics as literature and cosmopolitism; the poetic representation of the street and metropolitan cities; the organization of urban leisure; the woman as objet d'art; the metropolitan fascination with subaltern cultures and debates on the production and consumption of mass urban culture. This course is taught in Spanish."}, {"name": "Registration Requirements", "value": "Pre-req: 1 course chosen from SPAN 250, 251, 260, 261."}, {"name": "Learning Objectives", "value": "They will be familiar with the literary movement of Latin American Modernismo and main authors, having read different genres such as poetry, short stories, and chronicles. <br/>They will be able to compare modern literary projects from diverse traditions (Spanish America, North America, Europe)<br/>They will be able to relate these literary projects to their socio-cultural and historical context"}, {"name": "Class Materials (Required)", "value": "An Anthology of Spanish American Modernismo, edited by Kelly Washbourne, trans. Kelly Washbourne, Sergio Waisman. MLA, New York, 2007. ISBN 978-0-87352-939-6<br/>Additional readings will be available in a course package"}], "lmod": "1/9/16 6:54 PM (CT)", "subject": "SPANISH"}]