[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Kresge Centennial Hall 2-425"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: PRE-REG: Reserved for African American Studies majors &amp; minors.", "qtr": "Spring 2017", "name": "32188", "title": "WCAS AF_AM_ST 381-0-1 Topics in Transnational Black Studies", "class_attributes": "", "section": "32188", "instructors": [{"instructor_phone": "", "instructor_name": "Melanie Lee Chambliss", "instructor_addr": ""}], "topic": "Archives and Absences", "course": "381-0", "descriptions": [{"name": "Overview of class", "value": "This course will introduce students to how the past is preserved and retold through archives and their absences. As an interdisciplinary course, we will investigate histories and theories of archives' construction and their function in societies. Our shared definition of an &quot;archive&quot; will range from repositories to memory to rituals to online outlets, and we will explore through discussions of how these different forms of preservation impact the histories that emerge from them. The course will conclude with an examination of different methods used for navigating the archive and its absences. The readings and discussions during those weeks will focus on recuperating the African diasporic past as a case study in those varying methods."}, {"name": "Learning Objectives", "value": "By the end of the semester, students will understand what is at stake in how history is preserved and written, and they will learn different techniques for addressing absences in their own narratives."}, {"name": "Teaching Method", "value": "Discussion of reading assignments and the occasional hands-on examination of archival material"}, {"name": "Evaluation Method", "value": "Class Discussion Posts (15%)<br/>Primary Source Submissions (10%) <br/>Four-page exploration of two collections at any archive (20%)<br/>Midterm Class Presentation (25%)<br/>Final Paper (30%)"}, {"name": "Class Materials (Suggested)", "value": "Students will be reading excerpts from the following books:<br/>Paula Byrne, Belle: The Slave Daughter and the Lord Chief Justice<br/>Tina M. Campt, Image Matters: Archive, Photography and the African Diaspora in Europe<br/>Jose van Dijck, Mediated Memories in the Digital Age<br/>Caroline Frick, Saving Cinema: The Politics of Preservation<br/>Ellen Gruber Garvey, Writing with Scissors: American Scrapbooks from the Civil War to the Harlem <br/>Renaissance<br/>Amelie Hastie, Cupboards of Curiosity: Women, Recollection, and Film History<br/>Saidiya Hartman, Lose Your Mother: A Journey Along the Atlantic Slave Route<br/>Toni Morrison, Beloved<br/>Carla L. Peterson, Black Gotham: A Family History of African Americans in Nineteenth-Century <br/>New York City<br/>Ann Laura Stoler, Along the Archival Grain: Epistemic Anxieties and Colonial Common Sense<br/>Diana Taylor, The Archive and the Repertoire: Performing Cultural Memory in the Americas <br/>Michel-Rolph Trouillot, Silencing the Past: Power and the Production of History<br/>Timothy B. Tyson, Blood Done Signed My Name"}], "lmod": "2/14/17 6:41 PM (CT)", "subject": "AF_AM_ST"}]