[{"school": "WCAS", "overview_of_class": "In this capstone seminar, we explore how slavery as an institution has been a feature of global human societies since antiquity. We will examine various forms of captivity, servitude, and slavery-from the ancient world to the New World-we will explore competing and sometimes overlapping ideas and practices of slavery, look at debates about the nature and meaning of slavery, consider how iterations of the ideologies and practices of slavery and servitude manifested in sites less familiar in the American imagination. Taking a long view approach to \"slavery\" will help expand our conceptualization of the institution to a global scale. We will also engage material about the linkages and shifts between older forms of captivity and bonded labor and what scholars deem \"modern slavery\" as a result of new and radically evolving technologies. We will examine issues of human trafficking, sex trafficking, and child labor in tandem with the role that new technologies play in facilitating/foreclosing these forms of bonded and forced labor.", "name": "Integrating Project Seminar", "section": "20", "location": "Harris Hall L04", "topic": "Slavery in Global Relational Perspective", "course": "395-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4660/WCAS/INTL_ST/395-0/36780", "instructor": ["Sureshi Madhuka   Jayawardene"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "id": "36780", "subject": "INTL_ST"}, {"school": "WCAS", "overview_of_class": "Material inequality is central to many contemporary global conflicts, injustices, and political dynamics. The differential distribution of resources, wealth, and access to finance has roots in colonial history and is maintained by a set of powerful governing institutions, ideas, and practices. Extremes disparities in wealth in poverty in the global South and North are at the root of differences in health outcomes, educational opportunity, land ownership, patterns of migration, employment prospects and protections, and environmental impact. Why is our world so unequal? What are the effects of inequality on lived experience, the social and physical environment, and conflict? Is it ethical to live a world with a high levels of inequality? What can be done to mitigate inequality?", "name": "Integrating Project Seminar", "section": "21", "location": "Annenberg Hall G29", "topic": "Global Inequality", "course": "395-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4660/WCAS/INTL_ST/395-0/36781", "instructor": ["Erin Kay Lockwood"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "id": "36781", "subject": "INTL_ST"}]