[{"class_mtg_info": [{"meet_t": "Sa 9:00AM - 12:00PM", "meet_l": "Wieboldt Hall 511"}], "school": "SCS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "18437", "title": "SCS ENGLISH 324-CN-17 Studies in Medieval Literature:", "class_attributes": "", "section": "18437", "instructors": [{"instructor_phone": "", "instructor_name": "Raymond E Gleason", "instructor_addr": ""}], "topic": "Legend of King Arthur", "course": "324-CN", "descriptions": [{"name": "Overview of class", "value": "The purpose of this course is to familiarize participants with the major texts which define the Arthurian tradition and to trace the development of a major Arthurian theme, the Holy Grail, from their medieval origins to their manifestations in modern media, culture and literature. There are no language prerequisites. All readings will be done in modern English. Participants should have completed an introductory level course (or have competencies in) literature and expository writing based on research. This course meets pre-1798 requirement for majors."}, {"name": "Registration Requirements", "value": "Previous literature courses are strongly recommended. Students should have fulfilled the SCS writing requirement or taken equivalent writing courses. Ability in academic writing and a foundation in literature and literary theory recommended. A little Latin or Old French won't hurt."}, {"name": "Learning Objectives", "value": "At the end of the course, you will be able to:<br/>-Describe the development of the major Arthurian cycles;<br/>-Identify the major themes and motifs of the Arthurian tradition with emphasis on the Grail;<br/>-Describe the significance of &quot;Arthur&quot; in divergent literary traditions;<br/>-Define the major medieval literary genres;<br/>-Develop an interpretive context for reading medieval literature;<br/>-Write a clear and concise essay based on literary research."}, {"name": "Teaching Method", "value": "Reading Primary &amp; Secondary Texts<br/>Films / Videos<br/>Class Discussion<br/>Lecture<br/>Research Project<br/>Independent Study<br/>Writing Assignment"}, {"name": "Evaluation Method", "value": "Class Participation and Attendance<br/>Research Benchmarks<br/>End-of-Term Research Paper"}, {"name": "Class Materials (Required)", "value": "Texts may include the following. Visit the campus bookstore or its website, or inquire with the instructor to confirm materials for the course: <br/><br/>Lacy, Norris J. and James J. Wilhelm, eds. The Romance of Arthur. 3rd ed. New York: Routledge, 2013 ISBN: 978-0-415-78289 (pbk).<br/>Brown, Dan. The Da Vinci Code (Any copy, paper or electronic).<br/>Various primary texts posted on a class website provided by the instructor.<br/>Arthurian / Grail films provided by the instructor."}, {"name": "Class Notes", "value": "According to Chaucer, the purpose of literature is &quot;sentence and solaas&quot;?that is, to learn about ourselves while enjoying the experience? we'll try to achieve both Chaucerian goals in this class? read about it; talk about it; write about it ? maybe even have a little fun ? after all, you'll be missing the Sataurday mornng cartoons to attend class!."}], "lmod": "10/30/16 6:54 PM (CT)", "subject": "ENGLISH"}]