[{"class_mtg_info": [{"meet_t": "WeFr 3:00PM - 4:50PM", "meet_l": "Annie May Swift Hall 103"}], "school": "SoC", "overview_of_class": "The course introduces students to methods and theories of adapting novels and short stories for stage presentation, or for group performance in educational settings. The primary goal is the practice-based introduction to two different methods of staging narrators and narration. The secondary goal is the theoretical investigation of \"adaptation\" as a contemporary mode of text-and-image-based writing for the theater.", "qtr": "Winter 2016", "name": "Adapting Narrative for Group Performance", "title": "SoC PERF_ST 224-0-20 Adapting Narrative for Group Performance", "lmod": "1/9/16 6:39 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "847/491-3171", "instructor_name": "Paul C Edwards", "instructor_addr": "Annie May Swift Hall, Room G03"}], "topic": "", "course": "224-0", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "descriptions": [{"name": "Overview of class", "value": "The course introduces students to methods and theories of adapting novels and short stories for stage presentation, or for group performance in educational settings. The primary goal is the practice-based introduction to two different methods of staging narrators and narration. The secondary goal is the theoretical investigation of &quot;adaptation&quot; as a contemporary mode of text-and-image-based writing for the theater."}, {"name": "Registration Requirements", "value": "PERFORMANCE STUDIES MAJORS / DEVISING AND ADAPTATION MODULE MEMBERS.<br/>Spaces will be held for all Performance Studies majors provided that they request the course by the beginning of SoC pre-registration week. <br/>Spaces will be held for all students &quot;registered to complete&quot; the Devising and Adaptation Module (for whom the course is a requirement) provided that they request the course by the beginning of SoC pre-registration week. <br/><br/>ENROLLMENT. <br/>Approx. 24. E-mail a request for permission directly to instructor, at the beginning of SoC pre-registration, at: edwdoyle@northwestern.edu. Majors in departments other than Theatre and Performance Studies are most welcome."}, {"name": "Evaluation Method", "value": "Students read and discuss a group of core texts, participate in a variety of in-class exercises, and complete essay and performance assignments. Typically a student collaborates in the adaptation, rehearsal, and performance of two major scenes (midterm and final). Two essays (in place of midterm and final exams) relate to problems in transforming the literary text into a performance text, and in performing narrators and narration. In addition, each student regularly posts informal written critiques of in-class performances to the course website. Attendance is mandatory. Outside-of-class rehearsal, negotiated by members of small groups, is mandatory.<br/><br/>GRADING.<br/>Outcome-based rather than bell-curve based."}, {"name": "Class Materials (Required)", "value": "-Paul Edwards, 224 Handbook, rev. 2011 (on course website)<br/>-Robert Breen, selections from Chamber Theatre (on course website)<br/>-Peter Brook, The Empty Space (from bookseller)<br/>-selected essays and stories (on course website)"}, {"name": "Class Notes", "value": "In Spring 2010, the 224 &quot;Adapting Narrative&quot; course changed its structure to anticipate inclusion in a proposed undergraduate &quot;module&quot; in devising and adaptation. One change is the inclusion of first-year MFA students in the Theatre Directing Program, who work with groups of actors in the final performance for 224. The second change is an increased emphasis on audio-visual design, which utilizes the equipment in the AMS Krause Studio."}], "path": "/class-descriptions/4610/SoC/PERF_ST/224-0/20493", "instructor": ["Paul C Edwards"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>Permission of department<br/><br/>", "id": "20493", "subject": "PERF_ST"}]