[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "Fisk Hall 114"}], "school": "WCAS", "overview_of_class": "In this seminar we will examine economic, political, and cultural variations of public goods provision around the world. Who should pay for education and health care? Is social security spending bad for economic development? Is democracy good for the poor? What beliefs lie behind the statist systems of social provision? Addressing these and similar questions in class, students will develop a complex understanding of the issue, which will help them research a real world problem in their final projects. The course puts a strong emphasis on systematic library research performed by the students and gives them a chance to practice various analytic and communication skills: choosing relevant literature and data sources, putting them in dialog, framing the argument, and effectively presenting it to the audience. Final projects and their presentation contribute about 50% to the final course grade; the rest is divided between class participation, topic presentation, library report, and an annotated bibliography for the final project. The seminar assumes that students have completed a substantial portion of the International Studies core curriculum, including the Thematic and Regional clusters before the seminar begins. Students will draw upon their experiences as an International Studies major to integrate their interdisciplinary training with discussions of current world issues.", "qtr": "Spring 2016", "name": "Integrating Project Seminar", "title": "WCAS INTL_ST 395-0-20 Integrating Project Seminar", "lmod": "4/3/16 8:09 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Natalia   Forrat", "instructor_addr": ""}], "topic": "Public Goods in Global Persp", "course": "395-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "In this seminar we will examine economic, political, and cultural variations of public goods provision around the world. Who should pay for education and health care? Is social security spending bad for economic development? Is democracy good for the poor? What beliefs lie behind the statist systems of social provision? Addressing these and similar questions in class, students will develop a complex understanding of the issue, which will help them research a real world problem in their final projects. The course puts a strong emphasis on systematic library research performed by the students and gives them a chance to practice various analytic and communication skills: choosing relevant literature and data sources, putting them in dialog, framing the argument, and effectively presenting it to the audience. Final projects and their presentation contribute about 50% to the final course grade; the rest is divided between class participation, topic presentation, library report, and an annotated bibliography for the final project. The seminar assumes that students have completed a substantial portion of the International Studies core curriculum, including the Thematic and Regional clusters before the seminar begins. Students will draw upon their experiences as an International Studies major to integrate their interdisciplinary training with discussions of current world issues."}, {"name": "Learning Objectives", "value": "-engage with the key debates related to the provision of public goods across the world;<br/>-learn the techniques of putting together a comprehensive bibliography on a topic and create a basic -bibliography for the final research project;<br/>-learn to formulate research questions and to engage scholarly sources in answering the research question;<br/>-learn to critique research arguments of other scholars and to put together a good one;<br/>-practice presentation and writing skills."}, {"name": "Evaluation Method", "value": "10% Class attendance and participation: Many classes in this course involve discussions and peer-review, which requires active student participation. Students should attend all classes. If a student misses five or more classes for any reason, she will fail the course.<br/><br/>15% Topic presentation<br/><br/>20% Annotated bibliography for the final paper and library report<br/><br/>15% Conference presentation and serving as discussant: The presentation should effectively communicate the main points of the final paper, be well-structured, easy to follow, and stay on time. Discussant's role is to provide a quality feedback.<br/><br/>40% Final paper"}, {"name": "Class Materials (Required)", "value": "Eco, Umberto. 2015. How to Write a Thesis. Translated by Caterina Mongiat Farina and Geoff Farina. Cambridge, Massachusetts: MIT Press. ISBN: 978-0-262-52713-2<br/><br/>Mann, Thomas. 2015. The Oxford Guide to Library Research. Fourth edition. Oxford?; New York: Oxford University Press. ISBN: 978-0-19-993104-0"}], "path": "/class-descriptions/4620/WCAS/INTL_ST/395-0/31239", "instructor": ["Natalia   Forrat"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "id": "31239", "subject": "INTL_ST"}]