[{"school": "WCAS", "overview_of_class": "This course examines the body of recent literature that has emerged in the wake of the US wars in the Middle East, and the ways in which the figure of the Muslim is variously figured. In the past decade, a number of returning US veterans have published novels and short stories set in Iraq and Afghanistan, many of them ambitious and sophisticated. We will read some of the more provocative and evocative of these literary texts by returning veterans and fiction by Iraqi authors in the wake of the US invasion and occupation. On the US side, the novelists considered both invoke or allude to American fiction of the WWII and Vietnam periods, but also seem to have picked up on, in the most interesting cases, lessons gleaned from postcolonial studies, namely the question of the silenced subaltern subject and the relationship of representation to military/geopolitical occupation. So we will also read major works of literature from WWII and Vietnam, and a selection of essays from postcolonial studies.", "name": "Studies in 20th-Century Literature", "section": "20", "topic": "Wartime Books", "course": "368-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4650/WCAS/ENGLISH/368-0/23932", "instructor": ["Brian T Edwards"], "id": "23932", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "How odd was Lolita? How odd was the world that produced it? To answer these questions, we will look at salient figures from postwar American fiction and their relationship to some of the stranger, most pervasive myths and narratives of the 1950s: the rise of the teenager, the contested space of middlebrow culture, the encroachment of suburbia, and the celebration of the outsider and its concomitant critique of the conformist. The reading list will range from the well-known and the celebrated to works that are just as intriguing but a bit more obscure, so we'll read from Vladimir Nabokov's Lolita, but also his less well-known Pnin, as well as James Baldwin's Giovanni's Room, John Updike's Rabbit, Run, Walker Percy's The Moviegoer, and Flannery O'Connor's Wise Blood. We will also look at media that reflect, contest, or complicate these narratives: movies by Nicholas Ray, Douglas Sirk, and others, exploitation and health films, rockabilly and country songs, sitcoms, and Mad Men.", "name": "Studies in 20th-Century Literature", "section": "21", "topic": "Roadside Oddities: Lolita &amp; Postwar Novelists", "course": "368-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4650/WCAS/ENGLISH/368-0/23933", "instructor": ["Juan M Martinez"], "id": "23933", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "", "name": "Studies in 20th-Century Literature", "section": "22", "topic": "Virginia Woolf", "course": "368-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4650/WCAS/ENGLISH/368-0/23934", "instructor": ["Christine   Froula"], "id": "23934", "subject": "ENGLISH"}]