[{"class_mtg_info": [{"meet_t": "Mo 12:00PM - 2:50PM", "meet_l": "Louis Hall 118"}], "school": "SoC", "enrl_requirement": "Enrollment Requirements: Pre-requisite: Students must have taken, be currently enrolled, or concurrently registered for RTVF 190 for the upcoming quarter.", "qtr": "Fall 2016", "name": "14328", "title": "SoC RTVF 370-0-20 Topics in Pre-Production", "class_attributes": "Prerequisites apply, see description<br/><br/>", "section": "14328", "instructors": [{"instructor_phone": "847/491-4229", "instructor_name": "Eric Adrian Patrick", "instructor_addr": "AMS 307"}], "topic": "Storyboarding", "course": "370-0", "descriptions": [{"name": "Overview of class", "value": "This class will explore the process of pre-production visualization through storyboarding. A great deal of the class will focus on drawing for filmmakers, and as such, the class is designed for students that have little or no drawing experience. Students will be introduced to one, two and three-point perspective, shape consciousness, geons, gestural drawings, visual research, rendering, and applying all of these principles in the digital environment. We will additionally work on breaking down a script into consecutive shots and talk about the language of storyboards.<br/> <br/> <br/>Prerequisite 190 or permission of instructor<br/> <br/> <br/> Learning Objectives <br/> What will the student be expected to know by the end of the class? <br/> <br/>Upon completion of the course, students should be able to create a drawing of an imagined scene from diverse viewing angles by using the rules of perspective, visual research, rudimentary figure drawing, and basic lighting/rendering. Students should also be able to take a written script and create a detailed storyboard that uses the visual syntax of narrative cinema and the language of storyboards.<br/><br/>Students will need a sketchbook for daily use, and various media to draw with (pen, pencil, charcoal)."}], "lmod": "10/30/16 6:50 PM (CT)", "subject": "RTVF"}]