[{"school": "WCAS", "overview_of_class": "We recently celebrated the 200th anniversary of Charles Darwin's birth. But what would he think of our world today? We have a sophisticated understanding of genes and the ability to trace our ancestry over generations. Yet despite this knowledge, conclusive and irrefutable proof that we have or are continuing to evolve has not been found. In this course we will address where we might have come from and where we might be going. We will cover some of the major &quot;issues&quot; in biological evolution ranging from those of originating in Darwin's time to the many questions that persist today.", "name": "First-Year Seminar", "section": "21", "topic": "Making of the Fittest: Issues in Evolution", "course": "101-6", "meeting_time": ["MoWe 11:00AM - 12:20PM"], "path": "/class-descriptions/4640/WCAS/ANTHRO/101-6/10069", "instructor": ["Erin Beth Waxenbaum Dennison"], "id": "10069", "subject": "ANTHRO"}, {"school": "WCAS", "overview_of_class": "Food is on everyone's minds these days. On the one hand, we have an unprecedented panoply of choices on supermarket shelves, while on the other, food activists call attention to issues of food politics, sustainability, and inequality. This class explores food through the lens of cultures past and present, to examine alternatives to and the roots of our modern food system. Anthropology is uniquely positioned to address the complexity of factors that define and motivate food practices. Food is at once culturally defined, biologically necessary, and historically situated. Some of the questions we will address in this class include: How do people decide what is edible, and what is not? What roles does food play in different cultures? What do our current concerns with food, from the obesity epidemic to the push for local, sustainable food sources, tell us about our own culture(s)?", "name": "First-Year Seminar", "section": "22", "topic": "Food &amp; Culture", "course": "101-6", "meeting_time": ["MoWe 11:00AM - 12:20PM"], "path": "/class-descriptions/4640/WCAS/ANTHRO/101-6/10070", "instructor": ["Amanda Lee Logan"], "id": "10070", "subject": "ANTHRO"}, {"school": "WCAS", "overview_of_class": "Recently ideas about the &quot;paleo-lifestyle&quot; have begun to be spread in popular culture, often with prescriptions about how modern humans should conduct their lives in order to achieve better health and well-being. This course will survey some of these &quot;paleo&quot; recommendations and popular conceptions of our ancestors. These popular conceptions will be viewed critically against the evidence for what our ancestors actually did and what, if anything, it means for people living in the modern era. Some of the included topics will include dietary recommendations, exercise/barefoot running, childcare and feeding practices, and pathogen exposure/immune function.", "name": "First-Year Seminar", "section": "23", "topic": "Going Paleo", "course": "101-6", "meeting_time": ["MoWe 5:00PM - 6:20PM"], "path": "/class-descriptions/4640/WCAS/ANTHRO/101-6/10071", "instructor": ["Aaron Allen Miller"], "id": "10071", "subject": "ANTHRO"}]