[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "555 Clark B01"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "14243", "title": "WCAS COMP_LIT 305-0-20 World Cinemas", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "14243", "instructors": [{"instructor_phone": "847/467-0283", "instructor_name": "Patrick James Noonan", "instructor_addr": "1880 Campus Drive, Kresge Hall, Office 4-550"}], "topic": "Cinema Japan", "course": "305-0", "descriptions": [{"name": "Overview of class", "value": "This course surveys Japanese cinema from its earliest days to the contemporary moment. We will consider how film and other moving image technologies have reflected historical periods and shaped cultural discourses in modern Japan. Focusing on films that raise disciplinary questions related to the cinematic medium and Japan, we will examine, among other topics, the relationship between nationhood and the formation of a &quot;national&quot; cinema; genre theory and melodrama; J-horror and digital media. We will also study the place of important individual directors - Ozu, Mizoguchi, and Kurosawa - within the broader economic and institutional contexts of Japanese cinema and its global circulation."}, {"name": "Learning Objectives", "value": "Students will learn how to critically analyze various films from multiple theoretical perspectives while gaining an understanding of the major figures and movements in the history of Japanese cinema."}, {"name": "Teaching Method", "value": "Lecture and Discussion"}, {"name": "Evaluation Method", "value": "Attendance and Participation: 20%<br/>Screening Notebook: 20%<br/>Film Review (3-4pgs): 10%<br/>Critical Essay (4-5pgs): 20%<br/>Final Paper (6-7pgs): 30%"}, {"name": "Class Materials (Required)", "value": "Alastair Phillips and Julian Stringer. Japanese Cinema: Texts and Contexts. New York: Routledge, 2007. <br/>Timothy Corrigan. A Short Guide to Writing About Film, 8th Edition. Pearson, 2012.<br/>Course Reader (Available at Quartet Digital Printing, 825 Clark St.) <br/>Films (Streamed through Canvas)"}], "lmod": "10/30/16 7:02 PM (CT)", "subject": "COMP_LIT"}]