[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Frances Searle Building 2407"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "33377", "title": "WCAS HISTORY 343-0-20 Modern Italy", "class_attributes": "Historical Studies Distro Area<br/><br/>Attendance at 1st class mandatory<br/><br/>Registration for discussion section required<br/><br/>", "section": "33377", "instructors": [{"instructor_phone": "847/491-3653", "instructor_name": "Edward Wallace   Muir Jr", "instructor_addr": "Harris Hall Room 244"}], "associated_classes": [{"component": "DIS", "room": "Harris Hall L28", "meeting_time": "Fr 12:00PM - 12:50PM"}, {"component": "DIS", "room": "University Hall 112", "meeting_time": "Fr 2:00PM - 2:50PM"}, {"component": "DIS", "room": "Harris Hall L28", "meeting_time": "Fr 3:00PM - 3:50PM"}], "topic": "", "course": "343-0", "descriptions": [{"name": "Overview of class", "value": "An examination of the history of Italy from the Unification to the present. Principal topics will include the movement for national unification, the tenacious economic backwardness of the South, the history of the Sicilian Mafia and similar criminal organizations in Naples and Calabria, the dictatorship of Mussolini and Fascism, Italian participation in World War II and the Allied invasion of the peninsula, the role of the Roman Catholic Church in society, the economic miracles of the 1960s and 1980s, the Red Brigades and terrorism, the struggle for women's rights, and the &quot;bloodless&quot; political revolution of 1992-93. The course concentrates on political and social history but includes several novels in the readings. Some of the most important post-war films will be shown in extra evening meetings."}, {"name": "Teaching Method", "value": "Lecture/discussion"}, {"name": "Evaluation Method", "value": "There will be regular quizzes on the readings. The mid-term examination will consist of essays. Questions for the final take-home paper (6-8) pages will cover the entire course."}, {"name": "Class Materials (Required)", "value": "READING LIST: <br/>Giuseppe Tomasi di Lampedusa, The Leopard (novel) Denis Mack Smith, Mussolini: A Biography (biography) Ignazio Silone, Bread and Wine (novel) Alexander Stille, Benevolence and Betrayal: Five Italian Jewish Families under Fascism (history) Giovanni Levi, Christ Stopped at Eboli (memoire) Roberto Saviano, Gamorrah: A Personal Journey into the Violent International Empire of Naples' Organized Crime System (personal history <br/><br/>Films (All films shown in the Video Theater of the Mitchell Multimedia Center, University Library; schedule to be announced): Padre Padrone [My Father, My Master] (Paolo and Vittorio Taviani, directors) Ladri di biciclette/The Bicycle Thief (Vittorio de Sica, director) La strada [The Road] (Federico Fellini, director) Amarcord [I Remember] (Federico Fellini, director) La notte di San Lorenzo/The Night of the Shooting Stars (Paolo and Vittorio Taviani, directors)"}, {"name": "Class Notes", "value": "P/N permitted. Attendance at first class mandatory<br/><br/>HISTORY AREA OF CONCENTRATION: European"}], "lmod": "4/3/16 8:03 PM (CT)", "subject": "HISTORY"}]