[{"class_mtg_info": [{"meet_t": "MoWeFr 11:00AM - 11:50AM", "meet_l": "Swift Hall 231"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores<br/>Add Consent: Department Consent Required<br/>Drop Consent: Department Consent Required<br/>", "qtr": "Fall 2016", "name": "10175", "title": "WCAS PSYCH 101-6-20 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>Attendance at 1st class mandatory<br/><br/>Prerequisites apply, see description<br/><br/>", "section": "10175", "instructors": [{"instructor_phone": "847/467-1839", "instructor_name": "Benjamin J Gorvine", "instructor_addr": "Swift 306"}], "topic": "The Economics and Politics of Mental Health Diagno", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "While those going in to the field of mental health typically think about it as a &quot;helping profession&quot;, there is much more than meets the eye when it comes to the economics and politics that have defined the development of the field. The purpose of this course is to explore some of the historical and economic forces that have shaped the field as it exists today. The course will begin with an exploration of the role of state mental hospitals in the U.S. in the early to mid-20th century, and examine the political forces that drove the de-institutionalization movement of the 1970s and 1980s. The course will also focus on the evolution of the Diagnostic and Statistical Manual of Mental Disorders (now in its 5th edition), and some of the problems that have emerged from the disease-based framework utilized in the manual. The aggressive way in which the DSM has been marketed internationally will be discussed. Finally, the course will explore critiques of the pharmaceutical industry and modern psychiatry. Some of these themes will also be explored through analysis of popular films and other media."}, {"name": "Registration Requirements", "value": "First-year seminar - assigned by WCAS"}, {"name": "Learning Objectives", "value": "-Enhance critical thinking skills;<br/>-Improve expression of arguments in writing while using appropriate evidence;<br/>-Improve expression of arguments verbally while using appropriate evidence;<br/>-Growth in capacity to express ideas and opinions coherently and concisely in class, while respecting the ideas of others;<br/>-Engage in thoughtful discussion and reflection on themes including (but not limited to) the following:<br/>o How has the consumer mentality impacted our understandings of mental illness and mental health? What has that impact been?<br/>o What are the particular economic forces that have shaped the modern mental health industry (both psychological and psychiatric services)?<br/>o What drove the deinstitutionalization movement of the late 20th century? What have the (intended and unintended) consequences of this movement been?<br/>o What factors have contributed to the radical shifts in the way that our culture handles mental illness? How have economic and political trends shaped these changes?<br/>o What are the implications of the disease-based framework utilized by modern Clinical Psychology and Psychiatry (as reified in the DSM)? What are the forces driving the high rates of psychiatric diagnoses in our culture? What are the implications of these diagnoses - economic, political, individual, etc.?<br/>o How has the DSM and the disease-model been marketed, both domestically and internationally? What are the implications of the &quot;internationalization&quot; of the DSM? Relatedly, what is the impact of the globalization of American ideas about mental illness? <br/>o What are the major critiques of the DSM framework and the related use of pharmaceuticals to treat psychological disorders? How valid are those critiques?"}, {"name": "Teaching Method", "value": "Class participationDiscussionFilms / videosGroup workResearch projectWriting assignments"}, {"name": "Evaluation Method", "value": "Class participationGroup workResearch projectWriting assignments"}, {"name": "Class Materials (Required)", "value": "Gnaulati, E. (2013). Back to Normal: Why ordinary childhood behavior is mistaken for ADHD, Bipolar Disorder, and Autism Spectrum Disorder. Boston: Beacon Press. ISBN: 978-0-8070-6115-2 <br/> <br/>Paulson, G. (2012). Closing the Asylums: Causes and Consequences of the Deinstitutionalization Movement. Jefferson, NC: McFarland &amp; Co. ISBN: 978-0-7864-7098-3.<br/><br/>Schwartz, B. (2005). The Paradox of Choice: Why more is less. New York: Harper. ISBN: 978- 0060005696.<br/><br/>Watters, E. (2011). Crazy Like Us: The Globalization of the American Psyche. New York: Free Press. ISBN: 978-1-4165-8708-8."}], "lmod": "10/30/16 7:09 PM (CT)", "subject": "PSYCH"}]