[{"class_mtg_info": [{"meet_t": "We 6:15PM - 9:15PM", "meet_l": "Wieboldt Hall 516"}], "school": "SCS", "overview_of_class": "In this course, you'll delve deeper into the world of creative nonfiction. Readings will include writings by Seneca, Montaigne, Virginia Woolf, Annie Dillard, Joan Didion, David Foster Wallace, et al. Modes of creative nonfiction covered will be memoir/the personal essay, the narrative essay, the lyric essay, the opinion essay/op-ed, the interview/Q&A (a la Jimmy Fallon, Billy on the Street, John Oliver, and the Paris Review), reviewing, and food writing. Craft topics will include devising a premise, finding a subject, constructing scenes, creating characters, conducting interviews, doing research, writing reviews, and blogging (in an interesting way). Ultimately, this course will help you strengthen your craft, sharpen your writing habits (or develop new ones), and become a better reader of your work and the work of others. You'll leave with a portfolio of original writing, a new perspective on what it means to write creative nonfiction, and a stronger connection to the literary community. The focus will be on short forms.", "qtr": "Fall 2017", "name": "Reading and Writing Creative Nonfiction", "title": "SCS ENGLISH 208-CN-15 Reading and Writing Creative Nonfiction", "lmod": "9/12/17 6:54 PM (CT)", "section": "15", "topic": "", "course": "208-CN", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "In this course, you'll delve deeper into the world of creative nonfiction. Readings will include writings by Seneca, Montaigne, Virginia Woolf, Annie Dillard, Joan Didion, David Foster Wallace, et al. Modes of creative nonfiction covered will be memoir/the personal essay, the narrative essay, the lyric essay, the opinion essay/op-ed, the interview/Q&A (a la Jimmy Fallon, Billy on the Street, John Oliver, and the Paris Review), reviewing, and food writing. Craft topics will include devising a premise, finding a subject, constructing scenes, creating characters, conducting interviews, doing research, writing reviews, and blogging (in an interesting way). Ultimately, this course will help you strengthen your craft, sharpen your writing habits (or develop new ones), and become a better reader of your work and the work of others. You'll leave with a portfolio of original writing, a new perspective on what it means to write creative nonfiction, and a stronger connection to the literary community. The focus will be on short forms."}, {"name": "Registration Requirements", "value": "Course requirements include attendance and participation in all in-class writing exercises, two reading responses, leading two critiques, one street interview, and one longer piece that has been revised, edited and proofread. This class may not be audited or taken P/N. Advanced composition class and strong basic writing skills highly recommended."}, {"name": "Learning Objectives", "value": "-To identify, contrast, and draw connections among the many subgenres of creative nonfiction: memoir, food writing, book reviews, interviews/profiles, personal essays, persuasive essays, blogs, literary reportage, literary journalism, multi-media homepages, and creative criticism<br/>-To analyze four texts of creative nonfiction, including a summary of the text, an analysis of an aspect of the text, and a reflection on what it means to each student as a writer and a reader<br/>-To select and produce written examples of at least three of the aformentioned subgenres<br/>-On four separate occasions, construct verbal analyses and evaluations of another student's writing and lead a critique/workshop in class<br/> -To demonstrate working knowledge of the processes of revision, editing, and proofreading of their own work and the work of others<br/>-To think critically about Internet content and demonstrate a working knowledge of basic Web-writing skills"}, {"name": "Teaching Method", "value": "Class participation<br/>Discussion<br/>Group work<br/>Lecture<br/>Online work <br/>Presentations<br/>Readings<br/>Research project<br/>Writing assignments"}, {"name": "Evaluation Method", "value": "Attendance<br/>Participation<br/>Peer assessment<br/>Group work<br/>Readings<br/>Writing assignments"}, {"name": "Class Materials (Required)", "value": "Texts may include the following. Visit the campus bookstore or its website, or inquire with the instructor to confirm materials for the course: <br/><br/>David Foster Wallace, essay and literary reportage <br/>Annie Dillard, \"Seeing\"<br/>Anne Carson, \"On Waterproofing,\" \"On Orchids\"<br/>Seneca, \"On Noise\"<br/>Michel de Montaigne, \"Of Friendship\"<br/>Mark Greif, \"Against Exercise\"<br/>Philip Gerard, \"The Art of the Interview\"<br/>David Remnick, \"Introduction\" (to Life Stories: Profiles from the New Yorker)<br/>Ross, Lillian, \"How Do You Like It Now, Gentlemen?\" (profile on Hemingway)<br/>Mac McClelland, \"Schizophrenic. Killer. My Cousin.\"<br/>Ernest Hemingway, \"The Christmas Gift\"<br/>M.F.K Fisher, \"Love and Death Among Molluscs\"<br/>David Foster Wallace, \"Consider the Lobster\"<br/>Virginia Woolf, \"Street Haunting\"<br/>Sarah McCarthy, \"Streetwise\"<br/>Ruth Reichl, \"Paris: One Sad Night\""}], "instructor": ["Sarah   Fay"], "class_attributes": "", "id": "17530", "subject": "ENGLISH"}]