[{"school": "WCAS", "overview_of_class": "This course introduces students to major debates in the comparative history of revolution. The global analysis starts in France; proceeds with the spread of revolutionary ideologies in the Americas; returns to Europe for 1848 and 1917; tacks back to the Americas for peasant revolutions in Mexico and Cuba; and then migrates to China and Iran, before ending by considering the revolutions that never happened. En route we will consider not just current scholarship, but also the intellectual history of revolution in the work of Tocqueville, Marx, Lenin, Guevara and Scott. Assessment will be on the basis of short critical essays, blog posts and a final term paper on a topic of your choice.", "name": "Seminar in Historical Analysis", "section": "20", "location": "Harris Hall L40", "topic": "Revolution", "course": "405-0", "meeting_time": ["We 10:00AM - 12:50PM"], "path": "/class-descriptions/4650/WCAS/HISTORY/405-0/22058", "instructor": ["Paul James Gillingham"], "class_attributes": "Graduate Students Only<br/><br/>", "id": "22058", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "In the past few decades, scholars in the field of global history have challenged others to move beyond the framework of the region or the nation-state. But as many have argued recently, scholars invested in \"thinking big\" about history sometimes have difficulty addressing people who did not move across political boundaries, and they have typically neglected small, ordinary stories and domestic spaces. Since these have been the traditional interests of women's historians, the fields of global and women's history often seem irreconcilable, especially in the era before the twentieth century. One possible solution to this impasse is to deploy the analytical category of gender, which should be able to speak to both fields and across long spans of time. How have historians done this? What does gender history look like on a global scale? In this seminar, we will consider these questions, reading recent work that combines global and gender history in the early modern and modern eras.", "name": "Seminar in Historical Analysis", "section": "22", "location": "Harris Hall L40", "topic": "Gender History as Global History", "course": "405-0", "meeting_time": ["We 2:00PM - 4:50PM"], "path": "/class-descriptions/4650/WCAS/HISTORY/405-0/22059", "instructor": ["Amy Beth Stanley"], "class_attributes": "Graduate Students Only<br/><br/>", "id": "22059", "subject": "HISTORY"}]