[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Parkes Hall 223"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "23410", "title": "WCAS HUM 325-6-1 Humanities in the Digital Age", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "23410", "instructors": [{"instructor_phone": "", "instructor_name": "Wendy L Wall", "instructor_addr": ""}, {"instructor_phone": "", "instructor_name": "William N West", "instructor_addr": ""}], "topic": "Shakespeare's Circuits: Global, Local, Digital", "course": "325-6", "descriptions": [{"name": "Overview of class", "value": "Shakespeare's Circuits: Global, Local, Digital<br/><br/>What can you do with Shakespeare's plays? Perform them, behold them, read them, interpret them, imitate them, adapt them? Track them as they travel the globe and mutate into new forms? Shakespeare's infinite variety?in diverse applications?has travelled everywhere: in Renaissance London and Germany, nineteenth and twentieth century India, South Africa before and after apartheid, Israel, modern China. In this class we will reflect on the unique position of Shakespeare in cultures of the world at every scale, from local to global, and through a range of media?from the digital to traditional forms like print, theater, or opera. <br/><br/>Learning in this course will take place in the classroom, the computer lab, and spaces for experiencing Shakespeare around Chicago, from rare book rooms at the Newberry Library, to the Lyric Opera and the Chicago Shakespeare Theater. Students will discuss The Tempest, Othello, and The Merchant of Venice not only in Shakespeare's time but across the globe in many eras and in many media (visual arts, film, print, and performing arts). Our study will culminate with students collaborating to create a digital interactive map of Shakespeare's influences over time and across the globe."}, {"name": "Evaluation Method", "value": "Papers, discussion, collaborative digital project."}, {"name": "Class Materials (Required)", "value": "Shakespeare's Merchant of Venice, Othello, and The Tempest; articles and films on class website."}], "lmod": "1/9/16 6:49 PM (CT)", "subject": "HUM"}]