[{"school": "WCAS", "overview_of_class": "This course explores the construction of gender in the Middle East. Drawing on the historical, sociological and anthropological research in the region, the course aims to question stereotypes about the subordination of Muslim women and to offer a systematic reading and an analytical discussion of the political, economic and cultural structures that inform gender relations and sexuality. The course starts with an examination of early Islam and religious sources with regard to women's status, then moves on to nationalist and modernization movements in the 19th and 20th centuries, and finally focuses on women and men's lives in contemporary Egypt, Turkey and Iran. In this framework, special attention is given to Islamist mobilizations, the family, sexuality, neoliberalism, women's labor and LGBT.", "name": "Race, Gender, and Sexuality", "section": "22", "location": "Locy Hall 111", "topic": "Gendr&SexualityinMidEst", "course": "382-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4610/WCAS/GNDR_ST/382-0/23347", "instructor": ["Ayca   Alemdaroglu"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "23347", "subject": "GNDR_ST"}, {"school": "WCAS", "overview_of_class": "This discussion-based course will introduce students to the genealogy and significance of Chicana Feminist thinkers such as Gloria Anzaldúa, Emma Pérez, Antonia Castañeda, Cherrie Morraga, and other artists and activists.  It will highlight their contributions to knowledge regarding heteropatriarchy, settler colonialism, race, borders, community organizing, transnationalism, and globalization.  More importantly, it will accentuate how Chicana feminists have been foundational to our understanding of decolonial ethics or praxis.", "name": "Race, Gender, and Sexuality", "section": "23", "location": "University Hall 121", "topic": "Xicana Feminism", "course": "382-0", "meeting_time": ["Th 5:00PM - 7:50PM"], "path": "/class-descriptions/4610/WCAS/GNDR_ST/382-0/23348", "instructor": ["John David Marquez"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "23348", "subject": "GNDR_ST"}]