[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "Harris Hall L28"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "34421", "title": "WCAS SOCIOL 306-0-20 Sociological Theory", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "34421", "instructors": [{"instructor_phone": "", "instructor_name": "Charles M Camic", "instructor_addr": ""}], "topic": "", "course": "306-0", "descriptions": [{"name": "Overview of class", "value": "This course seeks to provide a thorough understanding of the central ideas of the three &quot;classical' social thinkers whose work has been foundational for sociological analysis: Emile Durkheim (1858-1917), Karl Marx (1818-1883), and Max Weber (1864-1920). Class sessions will explore each thinker's major concepts, the larger arguments that he builds from those concepts, and the distinctive manner in which he proposes to analyze the social world."}, {"name": "Registration Requirements", "value": "During preregistration this course is only open to Sociology Majors &amp; Minors.<br/><br/>This course is open to all undergraduates during regular registration, starting February 22, 2016."}, {"name": "Class Materials (Required)", "value": "This is a tentative booklist. Please confirm all books before purchase.<br/><br/>Emile Durkheim, The Division of Labor in Society. Translation by W.D.Halls. Free Press<br/><br/>Emile Durkheim, The Elementary Forms of Religious Life. Translation by Karen E. Fields. Free Press. <br/><br/>Emile Durkheim, The Rules of Sociological Method and Selected Texts on Sociology and its Method. Edited by Steven Lukes. Free Press<br/><br/>Karl Marx, Karl Marx: Selected Writings. REVISED Edition. Edited by David McLellan. Oxford University Press. <br/><br/>Max Weber, From Max Weber: Essays in Sociology. Edited by H. H. Gerth and C. W. Mills. Oxford University Press <br/><br/>Max Weber, The Protestant Ethic and the Spirit of Capitalism. Routledge edition. <br/> <br/>Max Weber, The Theory of Social and Economic Organization. Edited by Talcott Parsons. Free Press"}], "lmod": "4/3/16 8:22 PM (CT)", "subject": "SOCIOL"}]