[{"school": "SoC", "overview_of_class": "Overview<br/>This is a production course in which students will study contemporary examples of successful and creative web series and work in groups to produce their own. In this course we will focus on improvisational acting and directing techniques to enable us to work quickly and achieve naturalistic performances. Groups will produce three episodes of an original web series and students will be evaluated based on effort and participation. The class will end with a public screening of student work. <br/><br/>Evaluation Method<br/>Students will be graded on the clarity, producibility and compelling concept of an individual pitch, in addition to the performance and technical accomplishments of three collaboratively produced episodes, as well as attendance/participation.<br/><br/>Class Materials<br/> <br/>- Mac formatted hard drive (USB 3 and/or Thunderbolt, spindle speed 7200 rpm, suggested at least 2 TB, any brand/vendor). For example: G-Tech G-Drive Gen5, 2TB, USB 3.0/FireWire 800, 0G02529<br/> <br/>- RTVF studio lab deposit ($100) + studio key deposit ($50), both refundable at end of quarter or at graduation from program", "name": "Topics in Film/Video/Audio Production", "section": "20", "topic": "Improvised Comedy Web Series", "course": "379-0", "meeting_time": ["Mo 12:00PM - 2:50PM"], "path": "/class-descriptions/4650/SoC/RTVF/379-0/24495", "instructor": [""], "id": "24495", "subject": "RTVF"}, {"school": "SoC", "overview_of_class": "HYBRID CINEMA 1<br/><br/> <br/><br/>In recent years film programmers and critics have been praising \"the art of the real\" and cinema of \"in-between-ness,\" a hybrid cinema that blurs (or sometimes even denies) the boundaries between fiction and fact, staging and spontaneity, narrative and documentary. Throughout the history of cinema, however, filmmakers have been complicating and questioning these distinctions, and producing powerful results (e.g. Robert Flaherty, Jean Rouch, Barbara Loden, Chantal Ackerman, Abbas Kiarostami, Pedro Costa, Jia Zhangke, Apichatpong Weerasethakul, to name a few). Through a survey of works that explore hybridity, short written responses, and short production assignments, students will gain not only a broader understanding of hybrid film history but also a range of approaches to hybrid film production.<br/><br/> <br/><br/>No textbook required. Readings will be distributed in Canvas.<br/><br/> <br/><br/>NOTE: there is an additional (optional) Tuesday evening screening 6-9pm that will be held as needed.", "name": "Topics in Film/Video/Audio Production", "section": "21", "topic": "Hybrid I", "course": "379-0", "meeting_time": ["We 6:00PM - 8:50PM"], "path": "/class-descriptions/4650/SoC/RTVF/379-0/24496", "instructor": ["John Paul Sniadecki"], "id": "24496", "subject": "RTVF"}]