[{"class_mtg_info": [{"meet_t": "MoTuWeTh 10:00AM - 10:50AM", "meet_l": "University Library 5722"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24093", "title": "WCAS FRENCH 115-2-20 Intensive Elementary French", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "24093", "instructors": [{"instructor_phone": "847/467-3884", "instructor_name": "Margaret M Dempster", "instructor_addr": "1860 S. Campus Drive, Crowe Hall #2-121"}], "topic": "", "course": "115-2", "descriptions": [{"name": "Overview of class", "value": "French 115-2 is the second course of a two-quarter sequence (Fall and Winter) that covers the same material as the three-quarter sequence of French 111, but which assumes some prior knowledge of the language. The aim of the course is to review and develop skills in speaking, understanding, reading, writing and cultural competence."}, {"name": "Registration Requirements", "value": "French 115-1 or department placement. No PN allowed. Attendance at the first class is mandatory"}, {"name": "Teaching Method", "value": "Classes meet four times a week (MTWTh) and will include a variety of activities designed to help students review and develop their knowledge of basic French vocabulary and structures along with the ability to use what they have learned in communicative activities. Classes will be conducted exclusively in French except when explanation of grammar or other material may necessitate the use of English. Students are expected to prepare outside of class, to participate actively in class activities, and to work independently with the En Avant! online listening program and Internet activities."}, {"name": "Evaluation Method", "value": "Final grades are based on class participation and attendance, homework, two compositions, one class presentation, quizzes, four unit tests and a final oral exam."}, {"name": "Class Materials (Required)", "value": "Anderson, Golato and Blatty, En Avant!, second edition Anderson, Golato and Blatty, (The text is available at Norris Bookstore.) Course packet (online)"}], "lmod": "12/24/16 6:58 PM (CT)", "subject": "FRENCH"}]