[{"class_mtg_info": [{"meet_t": "Tu 6:30PM - 9:00PM", "meet_l": "ANTHRO Sem Rm 104 - 1810 Hinmn"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "10128", "title": "WCAS ANTHRO 490-0-21 Topics in Anthropology", "class_attributes": "", "section": "10128", "instructors": [{"instructor_phone": "847/491-4825", "instructor_name": "Caroline H Bledsoe", "instructor_addr": "1810 Hinman Ave., Room 201, EV Campus"}], "topic": "Reproduction &amp; Its Regulation Across Time &amp; Space", "course": "490-0", "descriptions": [{"name": "Overview of class", "value": "This course addresses a series of debates in anthropology about ?nature' and legitimacy in a variety of contexts that tend to be overlaid by heavy regulatory, if not bureaucratic, structures: sociocultural, political, biological, technological, legal, religious, economic. For this complex set of issues, there could be no better focus than the reproduction of society, especially that of children, across time and place. An explicit focus on reproduction and regulation makes clear connections to the core of the classic sociocultural anthropology canon. However, its application to contemporary debates in areas such as the technologies of birth control and assisted/biogenetic reproduction, international migration and ?integration,' human rights legislation, and the conveyance legitimacy across nations, generations and monetary currencies - all these offer rich new promise."}, {"name": "Evaluation Method", "value": "METHOD OF EVALUATION - Evaluation is based first and foremost on a research paper. Next will be class participation and presentations, and short write-ups. <br/>WRITING ASSIGNMENTS - One paper, no more than 20 pages, plus a short précis that accompanies formal class presentations."}, {"name": "Class Materials (Required)", "value": "READINGS - Selected monographs and a photocopied reader, available at Quartet Copies.<br/><br/>Required books:<br/>1) Abrego, Leisy J. 2014. Sacrificing Families: Navigating Laws, Labor and Love across Borders. Stanford: Stanford University Press.<br/><br/>2) Boyd, Lydia. 2015. Preaching Prevention: Born-Again Christianity and the Moral Politics of AIDS in Uganda. Athens, Ohio: Ohio University Press.<br/><br/>3) Brunson, Jan. 2016. Planning Families in Nepal: Global and Local Projects of Reproduction. Rutgers University Press. <br/><br/>4) Evans-Pritchard, E.E. 1951. Kinship and Marriage among the Nuer, Oxford: University Press.<br/>Greenhalgh, Susan M. 2010. Cultivating Global Citizens: Population in the Rise of China. Cambridge, MA: Harvard University Press.<br/><br/>5) Klotz, Maren. 2014. (K)information: Gamete Donation and Kinship Knowledge in Germany and Britain. Verlag. Chicago: University of Chicago Press.<br/><br/>6) Necochea López, Raúl. 2014. A History of Family Planning in Twentieth-Century Peru. Chapel Hill, NC: University of North Carolina Press. <br/><br/>7) Raissiguier, Catherine. 2010 Reinventing the republic: Gender, migration, and citizenship in France. Stanford University Press."}], "lmod": "10/30/16 6:58 PM (CT)", "subject": "ANTHRO"}]