[{"class_mtg_info": [{"meet_t": "MoWe 12:30PM - 1:50PM", "meet_l": "2122 Sheridan Rd Classroom 232"}], "school": "WCAS", "overview_of_class": "This course will focus on Black women's perspectives on the environment?that is, the ways in which Black women experience, narrate, and analyze the relationship between humans and nature, non-human life, and land.  The course will not be a traditional literature course.  Rather it will weave Black women's writing in history, political economy, and sociology with autobiography, poetry, and speculative fiction.  The class will include units on remembering erased landscapes of slavery, environmental justice, Hurricane Katrina, and Black women writing on the future of human/ non-human relationships.", "qtr": "Winter 2016", "name": "Black Women Writers", "title": "WCAS AF_AM_ST 379-0-20 Black Women Writers", "lmod": "1/9/16 6:42 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Jessica   Quizar", "instructor_addr": ""}], "topic": "", "course": "379-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "This course will focus on Black women's perspectives on the environment?that is, the ways in which Black women experience, narrate, and analyze the relationship between humans and nature, non-human life, and land. The course will not be a traditional literature course. Rather it will weave Black women's writing in history, political economy, and sociology with autobiography, poetry, and speculative fiction. The class will include units on remembering erased landscapes of slavery, environmental justice, Hurricane Katrina, and Black women writing on the future of human/ non-human relationships."}, {"name": "Teaching Method", "value": "Lecture/discussion"}, {"name": "Evaluation Method", "value": "30% each essay<br/>25% creative project<br/>15% in-class writing and work"}, {"name": "Class Materials (Suggested)", "value": "Lose Your Mother by Saidiya Hartman<br/>Dawn by Octavia Butler<br/>Reading packet of shorter pieces, articles, and single chapters"}], "path": "/class-descriptions/4610/WCAS/AF_AM_ST/379-0/26462", "instructor": ["Jessica   Quizar"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "26462", "subject": "AF_AM_ST"}]