[{"class_mtg_info": [{"meet_t": "MoWeFr 2:00PM - 2:50PM", "meet_l": "Kresge 3354 German Seminar Rm."}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "12255", "title": "WCAS GERMAN 205-0-20 Focus Writing", "class_attributes": "Reading, writing, speaking proficiency<br/><br/>", "section": "12255", "instructors": [{"instructor_phone": "847/491-8290", "instructor_name": "Ingrid   Zeller", "instructor_addr": "Kresge Hall, Rm 3319, 1880 Campus Drive"}], "topic": "Berlin Faces of the Metropolis", "course": "205-0", "descriptions": [{"name": "Overview of class", "value": "This grammar and composition course is designed for students who wish to improve their writing and grammar skills in order to become independent, confident, and proficient writers of German. During this quarter, we will focus on the analysis and production of portraits, descriptions of places, narratives, film reviews, literary interpretations and cultural reports. The thematic basis for the course is the city of Berlin and the personalities, places, historical events, cultural and artistic trends, and visions that have shaped this historically unique, increasingly diverse, dynamic, and fascinating city during the twentieth and are shaping it during the twenty-first century. Course materials will include current and historical materials from a variety of sources, fictional works by German-speaking authors, news features, cultural reports, several feature films, excerpts from a television series, and short films. An emphasis during Fall 2016 will be on topics that relate to different stages in the history of Berlin and its development into a global and ethnically diverse city. We will also plan an excursion to Chicago to explore connections between Chicago and Berlin with a focus on architecture and on German heritage. You will have many chances to express yourselves creatively in a variety of different contexts. The production of a student magazine will be among the highlights."}, {"name": "Teaching Method", "value": "Class participation, Discussion, Field trips, Films/Videos, Group work, Online work, Presentations, Readings Simulation/role-play, Writing assignments"}, {"name": "Evaluation Method", "value": "Attendance, Class participation, Exams, Field trips, Group project, Homework, Online work, Presentations, Final project, Quizzes, Writing assignments"}, {"name": "Class Materials (Required)", "value": "Handbuch zur deutschen Grammatik- Rankin<br/>Schreiben lernen: A Writing Guide for Learners of German- Dykstra-Pruim<br/>Fokus Schreiben: Berlin - Gesichter der Metrople - Course Packet"}], "lmod": "10/30/16 7:05 PM (CT)", "subject": "GERMAN"}]