[{"class_mtg_info": [{"meet_t": "Th 2:00PM - 5:00PM", "meet_l": "ANTHRO Sem Rm 104 - 1810 Hinmn"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Graduate Students.", "qtr": "Spring 2017", "name": "32284", "title": "WCAS ANTHRO 474-0-20 Seminar in Religion and Values", "class_attributes": "Permission of Instructor<br/><br/>Graduate Students Only<br/><br/>", "section": "32284", "instructors": [{"instructor_phone": "847/491-4841", "instructor_name": "Robert   Launay", "instructor_addr": "1810 Hinman Ave., Room #205, EV Campus"}], "topic": "", "course": "474-0", "descriptions": [{"name": "Overview of class", "value": "For most of its history, the anthropology of religion has focused on what used to be called &quot;primitive&quot; religions. In the last few decades, anthropologists have begun to turn their attention more systematically to scriptural religions - Islam, Christianity, Judaism, and Buddhism. First of all, anthropologists have ceased to define their discipline as the study of &quot;primitive&quot; peoples. Moreover, many of the peoples they study have by now adopted one or another of these scriptural religions, making their presence difficult to ignore. One way or the other, the anthropological study of scriptural religions raises specific theoretical problems which articulate well with recent trends within the discipline at large. In the first place, any study, anthropological or other, of these religions entails a sensitive understanding of their history. More concretely, the analysis of scriptural religion at any specific place and time entails the investigation of the articulation of a global tradition with its local practice.<br/>The course will focus on four groups of paired readings, centering on the following topics: 1) circumscribing the domain of inquiry 2) colonialism and conversion in the global spread of Christianity 3) forms of piety and their implications 4) secularism and its discontents"}, {"name": "Registration Requirements", "value": "Instructor permission needed for undergraduates"}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Students will write four papers, one for each set of books. Each paper should be approximately 5-7 typed pages, and should focus on any one specific issue as it relates to either or both of the readings. These papers will be due: 1) April 27 2) May 11 3) May 25 4) June 5"}, {"name": "Class Materials (Required)", "value": "Clifford Geertz Islam Observed University of Chicago Press ISBN - 10: 0-226-28511-1 <br/>Talal Asad Genealogies of Religion John Hopkins University Press ISBN 0-8018-4632-3 <br/>Jean and John Comaroff Of Revelation and Revolution Volume 1 University of Chicago Press ISBN 0-226-11442-2 <br/>Webb Keane University of California Press Christian Moderns: Freedom and Fetish in the Mission Encounter Paper - ISBN: 9780520246522 <br/>Ayala Fader Mitzvah Girls Princeton University Press ISBN 9780691139173 <br/>Joel Robbins Becoming Sinners University of California Press ISBN 9780520238008 <br/>Peter Van der Veer The Modern Spirit of Asia Princeton University Press ISBN 978-0-691-12815-3 Mayanthi Pernando The Republic Unsettled Duke University Press ISBN 978-0-8223-5748-3"}], "lmod": "2/6/17 6:40 PM (CT)", "subject": "ANTHRO"}]