[{"class_mtg_info": [{"meet_t": "WeFr 3:00PM - 4:50PM", "meet_l": "Annie May Swift Hall 103"}], "school": "SoC", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Fall 2016", "name": "17511", "title": "SoC PERF_ST 318-2-20 Shakespeare Adaptations", "class_attributes": "", "section": "17511", "instructors": [{"instructor_phone": "847/491-3171", "instructor_name": "Paul C Edwards", "instructor_addr": "Annie May Swift Hall, Room G03"}], "topic": "", "course": "318-2", "descriptions": [{"name": "Overview of class", "value": "Adaptation as performance history: one way to approach an old play is to study its reshaping by artists in later ages. The course takes this approach to Shakespeare's tragedy King Lear. Offshoots of King Lear range from Nahum Tate's substantial &quot;re-modelling,&quot; first published in 1681, to Jean-Luc Godard's 1987 cinematic fantasy, developed in the immediate aftermath of the Chernobyl disaster. The course examines a wide range of adaptations, including: Grigori Kosintsev's 1971 film, which makes Lear into an allegorical reflection upon the horrors of life in the mid-twentieth century; Peter Brook's Beckett-inflected film adaptation from 1971; Samuel Beckett's drama Endgame; Akira Kurosawa's film Ran; and Jane Smiley's 1991 novel A Thousand Acres, which tells a Lear-like story about a family on an American farm. <br/><br/>THEATRE CREDIT. This course satisfies one unit of the &quot;History, Literature, and Criticism&quot; requirement in the Theatre Department."}, {"name": "Registration Requirements", "value": "Permission of instructor: Paul Edwards at edwdoyle@northwestern.edu. Numbers will be available during the week of SoC Pre-Registration."}, {"name": "Evaluation Method", "value": "One group performance, featuring an original adaptation of Shakespeare's King Lear into a twenty-first-century new work-possibly a mash-up of King Lear and other texts. Several short response papers throughout the quarter. Most of these will analyze King Lear adaptations that we will read and watch. The last of these will be a critique of a group performance in which you did not take part. Students are responsible for actively participating in all aspects of class activity. Attendance is mandatory."}, {"name": "Class Materials (Required)", "value": "REQUIRED READING.<br/>William Shakespeare, King Lear.<br/>Jane Smiley, A Thousand Acres.<br/>Samuel Beckett, Endgame.<br/>WTG/Elaine Feinstein, Lear's Daughters.<br/>Excerpts from the anonymous True Chronicle History of King Leir, Nahum Tate's The History of King Lear, and Christopher Moore's Fool (2009). <br/>Essays by Stephen Greenblatt, Jan Kott, David Wiles, Ruby Cohn, Susan Bennett, Grigori Kozintsev, Charles Marowitz, and Michael Worton.<br/><br/>REQUIRED VIEWING.<br/>King Lear, dir. Grigori Kozintsev (1971).<br/>King Lear, dir. Peter Brook (1971).<br/>The Dresser, dir. Peter Yates (1983).<br/>Ran, dir. Akira Kurosawa (1984).<br/>The King Is Alive, dir. Kristian Levring (2001).<br/>Excerpts from stage productions and screen adaptations of King Lear, from 1910 to the present."}], "lmod": "10/30/16 6:50 PM (CT)", "subject": "PERF_ST"}]