[{"class_mtg_info": [{"meet_t": "Mo 6:15PM - 8:15PM", "meet_l": "University Hall 218"}], "school": "SCS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "38077", "title": "SCS FRENCH 101-C-62 Elementary French III", "class_attributes": "", "section": "38077", "instructors": [{"instructor_phone": "847/497-3930", "instructor_name": "Dominique Mary Licops", "instructor_addr": "1860 S. Campus Drive, Crowe Hall #2-175"}], "topic": "", "course": "101-C", "descriptions": [{"name": "Overview of class", "value": "French 101-C is the third quarter of a three-quarter sequence of Elementary French. The aim of the course is to build skills in speaking, understanding, writing and reading French through class activities, practice, and study. A variety of class activities are designed to help students acquire knowledge of the basic French vocabulary and structures along with the ability to use what they have learned in situations of communication. It uses a multimedia approach that incorporates texts, songs, videos, and the internet and helps students acquire linguistic as well as cultural competence. Classes include a variety of activities designed to help students acquire knowledge of basic French vocabulary and structures along with the ability to use what they have learned in situations of communication. By the end of the three-quarter sequence, students will be able to create with the language to talk about familiar topics related to daily life and to express personal meaning.<br/><br/>Schedule note: this is a hybrid course, which meets once every week for two hours (6:15-8:15 pm) on campus, and requires a weekly one-hour online session that students can complete on their own time. An online workbook manual will be used for homework. Carries humanities credit (two-course limit for language courses)."}, {"name": "Registration Requirements", "value": "FRENCH 101-A, -B or equivalent. This course is for students with less than two years of high school French or with no previous study of French. If you have studied French for more than one year in High School in the last 3 years and please contact the course instructor to see if this course is right for you."}, {"name": "Learning Objectives", "value": "Classes will be conducted exclusively in French except when explanation of administrative information may necessitate the use of English. Students are expected to study and practice regularly throughout the week (between classes), prepare for the next week's lesson, to participate actively in class activities, to speak only French in class, and to work independently with the En Avant! Video and listening program and the En Avant! Internet activities. The instructor will not teach grammar explicitly, instead we will practice grammar in communicative class activities. Please note: any elaborate grammatical explanations in English will be saved for instructors' office hours."}, {"name": "Teaching Method", "value": "Class participation<br/>Discussion<br/>Films / videos<br/>Group work<br/>Listening exercises<br/>Online work <br/>Presentations<br/>Readings<br/>Simulation / role-play<br/>Writing assignments"}, {"name": "Evaluation Method", "value": "Participation <br/>Homework (WBLM)<br/>Online class + LearnSmart<br/>3 Unit tests<br/>Midterm Exam<br/>Final Written Exam<br/>Final Oral Exam<br/>Student Presentation"}, {"name": "Class Materials (Required)", "value": "Anderson, Golato and Blatty, En Avant!, second edition. Anderson, Golato and Blatty, En Avant! WorkBook and Laboratory Manual (WBLM) online version, second ed. The textbook with online access code are available in a bundle at the Norris Bookstore. The bundle includes access to online material. Course packet (distributed in first class). <br/><br/>All quarters-French 101-A, 101-B, and 101-C-will use the above texts."}, {"name": "Class Notes", "value": "Classes are conducted in French except when explanations of grammar or administrative matter required the use of English. Students are expected to prepare outside of class, to participate actively in class activities, and to work independently with the En Avant! online program and Workbook / Laboratory Manual throughout the week. This course is for students with less than two recent years of high school French."}], "lmod": "2/19/17 6:43 PM (CT)", "subject": "FRENCH"}]