[{"class_mtg_info": [{"meet_t": "MoWe 9:30AM - 10:50AM", "meet_l": "Harris Hall L06"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "25676", "title": "WCAS HISTORY 300-0-26 New Lectures in History", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "25676", "instructors": [{"instructor_phone": "847/467-3896", "instructor_name": "Elie   Rekhess", "instructor_addr": "Harris Hall - Room 223"}], "topic": "Historical Background to the est. of Israel", "course": "300-0", "descriptions": [{"name": "Overview of class", "value": "The course first traces the events and causes which led to the rise of Zionism, the Jewish national movement in Europe. It explores the ideological thought of the founding fathers and summarizes the political platforms of the main currents in the Zionist movement. It then proceeds to discuss the implementations of the Zionist ideology, namely, the immigration to Palestine and the development of a Jewish national community (Yishuv) there. The next part deals with Britain's promises to the Jews and the Arabs and the establishment of the British Mandate in Palestine. It then details the strategies of the Yishuv's nation-building process in the 1920's and the 1930's in the educational, cultural, economic, social and political spheres. Special emphasis is laid on the land question. Concurrently, the course focuses on the origins of the Israeli-Arab conflict since the 1920's, surveying its ideological roots and violent confrontational aspects. The latter part of the course discusses the impact of the Second World War and the Holocaust, the United Nation's attempts to resolve the dispute and the UN 1947 Resolution to partition Palestine."}, {"name": "Teaching Method", "value": "Lecture"}, {"name": "Evaluation Method", "value": "Exam, finalExam, mid-term"}, {"name": "Class Materials (Required)", "value": "***Tentative until posted to Norris website***<br/>Anita Shapira. Israel: A History (The Schusterman Series in Israel Studies). 9781611686180.<br/>Course Packet"}, {"name": "Class Notes", "value": "AREA OF CONCENTRATION: Asia/Middle"}], "lmod": "12/25/16 7:00 PM (CT)", "subject": "HISTORY"}]