[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "University Hall 412"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "34426", "title": "WCAS SOCIOL 376-0-21 Topics in Sociological Analysis", "class_attributes": "Attendance at 1st class mandatory<br/><br/>Only one unit towards major<br/><br/>", "section": "34426", "instructors": [{"instructor_phone": "", "instructor_name": "Christine Marie Percheski", "instructor_addr": "1812 Chicago Avenue, Rm. 208"}], "topic": "Families: A Global Approach", "course": "376-0", "descriptions": [{"name": "Overview of class", "value": "How does family life vary around the globe? This class will consider marriage, childrearing, intergenerational relationship, and household organization in a comparative perspective. These topics will be explored in a seminar format with the focus on discussion of recently published scholarly books and articles. Throughout the quarter, students will conduct independent research on family life in a country of their choice, and they will present their findings at the end of the term."}, {"name": "Registration Requirements", "value": "Open to sociology majors and minors during preregistration. All undergraduates may register during regular registration beginning February 22."}, {"name": "Learning Objectives", "value": "Upon successful completion of this course, students should be able to <br/>1) describe some of the ways that family life is changing across the globe; <br/>2) explain some of the hypothesized explanations for family change; <br/>3) critique social science research on families; <br/>4) conduct an independent research project using social science research methods and drawing on the scholarly research literature."}, {"name": "Teaching Method", "value": "class participation; presentations; readings; research project; seminar; writing assignments"}, {"name": "Evaluation Method", "value": "Attendance 10%; Class participation 15%; Final paper 40%; Presentation 5%; Writing assignments 30%"}, {"name": "Class Materials (Required)", "value": "Dreby, Joanna. 2010. Divided by Borders: Mexican Migrants and their Children. Berkeley: University of California Press. ISBN: 978-0-520-26090<br/><br/>There will also be a course pack available either through Quartet or electronically."}], "lmod": "4/3/16 8:22 PM (CT)", "subject": "SOCIOL"}]