[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "Technological Institute M164"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "24716", "title": "WCAS STAT 359-0-20 Topics in Statistics", "class_attributes": "Formal Studies Distro Area<br/><br/>Jrs, Srs, Grad Students Only<br/><br/>", "section": "24716", "instructors": [{"instructor_phone": "", "instructor_name": "Arend Matthew Kuyper", "instructor_addr": "IPR, 2040 Sheridan Road, Evanston"}], "topic": "", "course": "359-0", "descriptions": [{"name": "Overview of class", "value": "Visualizing data plays an important role in both data exploration and presenting analytic results. Quality data visualizations have the power to help analysts better understand and effectively communicate their work. Students taking this course will work to develop the skills required to produce such quality data visualizations. The course will address visualizing data of various forms (e.g. panel, spatial, temporal, etc...) and from various statistical domains such as inferential, descriptive, and predictive statistics. Some examples of visualizations that students should be able to produce after taking this course are provided below. In addition, we hope to cover how to produce interactive data visualizations using the R shiny package (examples: http://shiny.rstudio.com/gallery/).<br/><br/>Course Design: A typical class will devote 10-20 minutes to discussion/lecture with the remaining time devoted to activities where students will either work by themselves or in groups to produce visualizations. Students will be expected to present/share work from these activities either through canvas or during class. There will be a final project in place of a final exam."}, {"name": "Class Materials (Required)", "value": "Requirements: Each student should have a laptop during class, since class time will be devoted to activities where students will be programming. At least a basic understanding of statistics is necessary (i.e. STAT 202 or 210). Familiarity with R is desirable, but not entirely necessary as long as an effort is made to learn some basic R outside of class (materials and opportunities will be provided)."}], "lmod": "1/9/16 6:54 PM (CT)", "subject": "STAT"}]