[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "Harris Hall L05"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: REASON: Pre-registration is not allowed for this class. Please try again during regular registration.<br/><br/>Reserved for Freshmen and Sophomores", "qtr": "Spring 2017", "name": "33261", "title": "WCAS ENGLISH 101-6-21 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "33261", "instructors": [{"instructor_phone": "", "instructor_name": "Sarah Elizabeth Wilson", "instructor_addr": ""}], "topic": "Giving up the Ghost", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "For HP Lovecraft, the well-known writer of horror fiction, &quot;the oldest and strongest emotion of mankind is fear, and the oldest and strongest kind of fear is fear of the unknown.&quot; In this seminar, we will explore the Gothic fascination with things unseen and unknown: ghosts, ghouls, and demons who lurk in crumbling castles, haunt overgrown forests, slink beneath suburban beds and hide in damp basements or under creaky stairwells. Occupying the threshold between life and death, ghosts and other gothic creatures threaten to overturn our cherished assumptions about the world; they undo the notion that the dead should stay dead; they upend the boundaries between sanity and madness, the holy and the demonic, the familiar and the uncanny. The fear generated by Gothic texts stems from the realization that what once seemed safe, such as the domestic sphere or church sanctuary, is actually dangerously unstable, while what was once thought to be real, may instead be a figment of the imagination.<br/><br/>In looking beneath the surface of these spooky texts, we will discover that Gothic literature often conjures individual and collective anxieties about race, class, national identity, sexuality and desire. Readers and protagonists confront not only diabolical villains and vengeful spirits, but also the dark and repressed corners of their own psyches, and the ways in which past traumas haunt the historical present. Over the course of the quarter, we will consider classic examples of Gothic fiction by Edgar Allen Poe, Nathanial Hawthorne, Edith Wharton, Horace Walpole, and Flannery O'Connor, as well as critical studies on Gothic literature and the psychology of horror. Because the Gothic has never been solely a literary phenomenon, we will also examine gothic sensibilities in contemporary film, television series, music, fashion, architecture, and visual art, as well as the development of a gothic subculture from the late 1970s to the present day."}], "lmod": "2/12/17 6:52 PM (CT)", "subject": "ENGLISH"}]