[{"class_mtg_info": [{"meet_t": "Mo 3:00PM - 4:50PM", "meet_l": "University Library 5322"}, {"meet_t": "TuTh 2:00PM - 2:50PM", "meet_l": "University Library 4670"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-requisite: Students must have passed Japanese 211-2 with at least a C- or be placed in according to placement test results.<br/><br/>Pre-requisite: Students must have passed Japanese 211-2 with at least a C- or be placed in according to placement test results.", "qtr": "Spring 2016", "name": "32063", "title": "WCAS JAPANESE 211-3-20 Japanese III", "class_attributes": "Prerequisites apply, see description<br/><br/>Specific requirements in the language<br/><br/>", "section": "32063", "instructors": [{"instructor_phone": "8474912762", "instructor_name": "Junko   Sato", "instructor_addr": "1800 Sherman, 5th Floor, Suite 5400, Office 5415"}], "topic": "", "course": "211-3", "descriptions": [{"name": "Overview of class", "value": "Japanese III (JAPANESE 211-1, 2, 3) is a yearlong course, sequel to Japanese II (JAPANESE 121-1, 2, 3), that covers college-level intermediate Japanese. In Japanese III, students will continue developing the four skills (speaking, listening, reading, and writing) and learning various aspects of Japanese culture and society through class discussions, written assignments, and TV drama viewing. The casual speech and formal writing styles are introduced, and students will become familiarized with different language use for different settings. This course is conducted in Japanese."}, {"name": "Registration Requirements", "value": "Students must pass the preceding course with C- or above, or must be placed into the course by the departmental placement test."}, {"name": "Learning Objectives", "value": "The goal of Japanese III is to bring students' overall Japanese proficiency to the Intermediate High of the American Council on Teaching of Foreign Languages (ACTFL) proficiency guidelines. Upon the satisfactory completion of the course, the students will be able to 1) describe and narrate daily events and personal experiences in an organized manner, 2) summarize the main points of what is read, seen, or heard, 3) use approximately 500 basic kanji characters in context, 4) comfortably and appropriately handle daily situations (e.g., leaving a voice message or note for one's host family, sending emails to friends or professors, etc.), 5) distinguish various speech and written styles, and 6) communicate with native speakers on familiar topics in informal settings. The students are also expected to 7) deepen their understanding of customs, culture and social phenomena of contemporary Japan, and 8) learn to study independently."}, {"name": "Teaching Method", "value": "This course is conducted solely in Japanese. Class hours are spent mainly on oral development through discussions, and written assignments are given for reading and writing development. Careful and thorough review and preparation for each class session are expected."}, {"name": "Evaluation Method", "value": "Class participation and performance, assignments, quizzes, oral and written examinations, essays, and an interview project (211-2 and 211-3 only)."}, {"name": "Class Materials (Required)", "value": "TBA"}, {"name": "Class Materials (Suggested)", "value": "Kodansha. (2002). Kodansha Essential Kanji Dictionary. Tokyo: Kodansha International. ISBN: 978-4-7770-2891-4; Makino, S. &amp; Tsutsui, M. (1995). A Dictionary of Intermediate Japanese Grammar. Tokyo: The Japan Times. ISBN: 978-4-7890-0775-8."}], "lmod": "4/3/16 8:10 PM (CT)", "subject": "JAPANESE"}]