[{"class_mtg_info": [{"meet_t": "We 6:15PM - 9:15PM", "meet_l": "Parkes Hall 215"}], "school": "SCS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "18462", "title": "SCS POLI_SCI 221-CN-65 Urban Politics", "class_attributes": "", "section": "18462", "instructors": [{"instructor_phone": "", "instructor_name": "Brian Falb Harrison", "instructor_addr": ""}], "topic": "", "course": "221-CN", "descriptions": [{"name": "Overview of class", "value": "Cities appear to have decreasing control over their own affairs and seem to be at the mercy of economic change, in competition for citizens, industries, and resources. Sociocultural, ethnoracial, and demographic diversity also create a unique set of challenges. In recent decades, cities have relied on aggressive policy initiatives ranging from slum clearance to school reform to corporate welfare to stadium construction to attract and retain desired businesses and residents. This &quot;limited city&quot; as described here appears to play second fiddle in American politics while all the important decisions are made at the state and federal level. Somehow, though, cities manage to provide for densely settled populations even as they cope with their often deserved reputations for vice, dangerous streets, and public disorder. Cities have the biggest day-to-day influence on routine life, operating at the level of basic needs: making sure water runs, sewers flow, streets are clear, and people are safe from crime and life-threatening injury. This course will investigate how that power is used (and misused)-more specifically, how cities control their streets (and their citizens), maintain public order, shape buildings and infrastructure, and make themselves attractive to the residents that drive local economies."}, {"name": "Learning Objectives", "value": "As a result of this course, students will be able to: <br/><br/>Overall Course Objectives<br/>Think about social justice and social movements in the context of urban politics, policy, and governance. <br/>Critically evaluate arguments and/or counter-arguments to contemporary debates surrounding urban politics.<br/>Engage with different approaches to the study of public opinion, identity politics, and urban politics.<br/><br/>Specific Learning Objectives<br/>Read controversial and difficult material objectively and critically.<br/>Construct a narrative about identity, urbanity, public policy, and public opinion in the United States.<br/>Communicate important issues surrounding cities and urban areas in written and verbal assignments."}, {"name": "Teaching Method", "value": "Lecture, discussion, class participation, films/videos, group work, presentations, readings, research project"}, {"name": "Evaluation Method", "value": "Class participation, short papers, one longer final paper, presentation."}, {"name": "Class Materials (Required)", "value": "Texts or materials may include the following books:<br/><br/>Judd, Dennis R. &amp; Tod Swanstrom. 2015. City Politics, 9th edition. Upper Saddle River, NJ: Pearson Education. ISBN-13: 978-0205996391.<br/><br/>Kantor, Paul &amp; Dennis R. Judd. 2012. American Urban Polics in a Global Age, 7th edition. Upper Saddle River, NJ: Pearson Education. ISBN-13: 978-0205251759.<br/><br/>Additional book chapters and academic articles to-be-determined will be posted on Canvas."}], "lmod": "10/30/16 6:56 PM (CT)", "subject": "POLI_SCI"}]