[{"school": "WCAS", "overview_of_class": "If you wish to pursue some combination of gainful employment, political activism, or academic research, you will need three fundamental abilities: 1) the ability to understand how knowledge has been produced in the past, 2) the ability to develop methods for producing knowledge on your own and with others, and 3) the ability to communicate that knowledge to future audiences. This course offers an intensive training program in these three abilities, a program geared towards students in Asian and/or Asian American studies who are interested in moving beyond standard classwork towards developing their own research projects.<br/>At the most basic level, this is a classic research methods course, where you will strengthen the skills necessary to complete a full, ten-week research project. Through short weekly exercises, we will break down and workshop each component of the research process?e.g., how to convert an area of interest into a specific topic, how to apply for research funding, how to write an abstract, how to compile a bibliography, etc. These exercises will culminate in a research paper, or its equivalent in other forms. This \"classic\" approach will provide a basis for readings and discussion about how we can question and change the key terms of existing methods of knowledge production. Such questions include: How do problems of orientation provide the basis for making the Orient an object of knowledge and power? How have conflicts over language and community served as ways to divide Asian studies from Asian American studies? How do different media exert and distribute \"soft\" and \"hard\" power? What kinds of knowledge production have supported colonialism and totalitarianism? And what alternatives exist for decolonizing or democratizing knowledge?", "name": "Special Topics in Theory: Critical Theory", "section": "20", "location": "555 Clark B03", "topic": "Asia as Method", "course": "383-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4610/WCAS/COMP_LIT/383-0/23177", "instructor": ["Andrew Way Leong"], "class_attributes": "", "id": "23177", "subject": "COMP_LIT"}]