[{"school": "WCAS", "overview_of_class": "101-6-20 Spring 2017 First Year Seminar Prof. Ian Hurd \"Whales Bombs Genocide: Politics of International Law\" <br/>From whales to nuclear weapons to genocide and beyond, much of what people and governments do is defined, regulated, shaped, or otherwise influenced by international law. International law consists of binding commitments made between governments. This seminar examines the key concepts of international law and looks at its relationship to politics. The class will cross over the line between political science and legal scholarship, drawing cases, readings, and debates from both.", "name": "First-Year Seminar", "section": "20", "location": "Scott Hall 107 Burdick Room", "topic": "Whales, Bombs, Genocide", "course": "101-6", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4660/WCAS/POLI_SCI/101-6/35377", "instructor": ["Ian F Hurd"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "35377", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "101-6-21 First Year Seminar Sidra Hamidi \"Global Nuclear Politics\"<br/>Nuclear politics dominates headlines in contemporary international relations. From the growing threat of nuclear proliferation to controversies over the safety and security of nuclear weapons stockpiles to the growth of local anti-nuclear activism around the world, the conflict over nuclear energy and weaponry continues to be a major site of contestation in global politics. How can we understand the development of nuclear technology and its international and domestic consequences? What is the relationship between this technological development and politics, both local and interstate? This course will explore both the historical development of and contemporary conflicts surrounding the growth of nuclear technology. The seminar will take an interdisciplinary approach to the study of nuclear politics by combining perspectives from history, sociology, and political science. We will start with an examination of nuclear technology, highlighting some technical and scientific details about nuclear energy and its potential weaponization. We will then discuss the historical origins of the development of nuclear technology in the politics of the Cold War. Here we will discuss the logic of deterrence and address other logics of nuclear desire, including the military and symbolic value of nuclear weaponry. We will then move onto the global nuclear regime that governs the growth of nuclear proliferation including the Nuclear Non-Proliferation Treaty (NPT), the International Atomic Energy Agency (IAEA), the Strategic Arms Reduction Treaty (START), and the Comprehensive Test Ban Treaty (CTBT). From a discussion of international politics, we will then turn to the way that the growth of nuclear technology affects domestic politics through a discussion of nuclear safety and anti-nuclear activism around the world. The second half of the course will use the resources of the first half of the course explore nuclear proliferation in regional contexts including Latin America, South Asia, and the Middle East. And we will close with a discussion of contemporary crises in nuclear politics and discuss prospects for the future.", "name": "First-Year Seminar", "section": "21", "location": "University Library 4722", "topic": "Global Nuclear Politics", "course": "101-6", "meeting_time": ["TuTh 9:30AM - 10:50AM"], "path": "/class-descriptions/4660/WCAS/POLI_SCI/101-6/35378", "instructor": ["Sidra   Hamidi"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "35378", "subject": "POLI_SCI"}]