[{"class_mtg_info": [{"meet_t": "Tu 2:00PM - 4:50PM", "meet_l": "RCMA Lower Level 113"}], "school": "MUSIC", "overview_of_class": "<b>Description:</b><br/>Chicago is rich with arts programs that provide experiences, engagement, and voices for citizens who need expressive outlets related to social needs.<br/>In this seminar we will examine the ways in which the arts play a vibrant and important roll for social justice causes throughout the city of Chicago.  Activities in our class will include visits to various music, art, dance and media sites and meet with the leaders and participants that make these programs work. Discussions and readings will focus on questions related to starting and sustaining successful efforts in social justice arts causes as well as the philosophies behind such. Students will create final projects that are unique to their interests and talents in this subject.&nbsp;<br/><br/><b>Course Goals:</b><br/>1. To learn about the variety of arts projects related to social causes in Chicago.<br/>2. To learn about the logistical, practical, research-based and philosophical issues that relate to social justice causes. <br/>3. To imagine ways in which individuals can contribute in ways to help sustain and/or grow the efforts of social justice through arts education.", "qtr": "Winter 2016", "name": "Selected Topics", "title": "MUSIC MUSIC_ED 435-0-1 Selected Topics", "lmod": "1/9/16 6:31 PM (CT)", "section": "1", "instructors": [{"instructor_phone": "847/467-4726", "instructor_name": "Maud Mary Hickey", "instructor_addr": "mhickey@northwestern.edu"}], "topic": "Social Justice and Arts Education", "course": "435-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "<b>Description:</b><br/>Chicago is rich with arts programs that provide experiences, engagement, and voices for citizens who need expressive outlets related to social needs.<br/>In this seminar we will examine the ways in which the arts play a vibrant and important roll for social justice causes throughout the city of Chicago. Activities in our class will include visits to various music, art, dance and media sites and meet with the leaders and participants that make these programs work. Discussions and readings will focus on questions related to starting and sustaining successful efforts in social justice arts causes as well as the philosophies behind such. Students will create final projects that are unique to their interests and talents in this subject.&amp;nbsp;<br/><br/><b>Course Goals:</b><br/>1. To learn about the variety of arts projects related to social causes in Chicago.<br/>2. To learn about the logistical, practical, research-based and philosophical issues that relate to social justice causes. <br/>3. To imagine ways in which individuals can contribute in ways to help sustain and/or grow the efforts of social justice through arts education."}], "path": "/class-descriptions/4610/MUSIC/MUSIC_ED/435-0/27678", "instructor": ["Maud Mary Hickey"], "class_attributes": "", "id": "27678", "subject": "MUSIC_ED"}]