[{"class_mtg_info": [{"meet_t": "Th 5:00PM - 7:50PM", "meet_l": "Kresge Centennial Hall 2-410"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "34026", "title": "WCAS LATINO 392-0-20 Topics in Latina and Latino Social and Political Issues", "class_attributes": "Interdisciplinary Distro - See Rules<br/><br/>Social &amp; Behavioral Sciences Distro Area<br/><br/>Ethics &amp; Values Distro Area<br/><br/>", "section": "34026", "instructors": [{"instructor_phone": "847 491 5122", "instructor_name": "John David Marquez", "instructor_addr": "1860 Campus Dr Crowe 5-135"}], "topic": "Critical Latinx Studies", "course": "392-0", "descriptions": [{"name": "Overview of class", "value": "The growth and popularity of fields such as Afro-pessimism and settler colonial studies as of late has provided a serious challenge to the logics and protocols of liberal reform, multiculturalism, and social justice. Each, for example, forces us to respond to critical questions regarding slavery and its &quot;afterlife,&quot; to examine the conquest of indigenous peoples on this continent as more verb than noun, and to acknowledge limits of western modernity and its promises of universality. This course is designed around the question of, how do Latinxs or Latinx Studies fit into these critical and pessimistic paradigms? As this recent wave of critical pessimism is well centered within the interdisciplines of Black Studies and Native American Studies, this course will ask and attempt to facilitate responses to the question of what constitutes a critical Latinx Studies?"}, {"name": "Teaching Method", "value": "Class participationDiscussionFilms / videosGroup workReadingsWriting assignments"}, {"name": "Evaluation Method", "value": "AttendanceClass participationPaper, finalPaper, mid-termReadings"}, {"name": "Class Materials (Required)", "value": "Assigned Readings provided free of charge by instructor and NU library"}, {"name": "Class Notes", "value": "Pre-requisites: A general understanding of Latinx Studies, its genealogy, and purpose/central goals."}], "lmod": "2/8/17 6:44 PM (CT)", "subject": "LATINO"}]