[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Annenberg Hall 101"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "31117", "title": "WCAS GNDR_ST 372-0-21 Gender, Sexuality, and Performance", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "31117", "instructors": [{"instructor_phone": "", "instructor_name": "Megan Elizabeth Geigner", "instructor_addr": ""}], "topic": "Women &amp; Femininity in Theatrical Performance", "course": "372-0", "descriptions": [{"name": "Overview of class", "value": "Students in this course will read and analyze some of the most prominent feminist theorists of the 20th century, and apply their analyses to representations of women and/or femininity in performances such as plays, musicals, and dance. We will ask how women perform their gender, and explore the stakes of aligning with gender norms or disrupting them. We will also consider how performances of femininity change over time, and intersect with queerness and race."}, {"name": "Teaching Method", "value": "LectureSeminar"}, {"name": "Evaluation Method", "value": "Students will be assessed on Canvas reflection posts; a midterm paper; and a final project that will include a presentation and a paper."}, {"name": "Class Materials (Required)", "value": "Critical Scholarship:<br/>? Beauvoir, Simone de. The Second Sex. New York: Knopf, 1953.<br/>? Butler, Judith. Gender Trouble Feminism and the Subversion of Identity. New York: Routledge, 1999<br/>? Fuller, Margaret, and Arthur B. Fuller. Woman in the Nineteenth Century, and Kindred Papers Relating to the Sphere, Condition, and Duties of Woman. New York: Greenwood Press, 1968.<br/>? hooks, bell. Feminist Theory from Margin to Center. Boston, MA: South End Press, 1984.<br/>? Irigaray, Luce. This sex which is not one. Ithaca, N.Y.: Cornell University Press, 1985.<br/>? Sa?nchez, Mari?a Carla, and Linda Schlossberg. Passing: Identity and Interpretation in Sexuality, Race, and Religion. New York: New York University Press, 2001 <br/>? Sedgwick, Eve Kosofsky. Epistemology of the Closet. 1990.<br/>? Sedgwick, Eve Kosofsky. Between Men: English Literature and Male Homosocial Desire. New York: Columbia University Press, 1985.<br/><br/>Performance texts: <br/>? Ibsen, Henrik. A Doll's House (1879)<br/>? Glaspell, Susan. Trifles (1916)<br/>? Williams, Tennessee. A Streetcar Named Desire (1948)<br/>? Hwang, David Henry. M. Butterfly (1989)<br/>? Larson, Jonathan. Rent (1996)<br/>? Suzan-Lori, Parks. In the Blood (2000)<br/>? Dance pieces TBA"}], "lmod": "4/3/16 8:02 PM (CT)", "subject": "GNDR_ST"}]