[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "Locy Hall 213"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "37982", "title": "WCAS HISTORY 392-0-38 Topics In History", "class_attributes": "", "section": "37982", "instructors": [{"instructor_phone": "", "instructor_name": "Emily Dawn Vanburen", "instructor_addr": ""}], "topic": "Britain and the Two World Wars", "course": "392-0", "descriptions": [{"name": "Overview of class", "value": "This seminar examines Britain's entry into the twentieth century by way of its experience of the two world wars. We will ask how these two conflicts transformed the United Kingdom from a bastion of Victorian liberalism into a social democracy. The course will proceed chronologically in three parts: the Great War (1914 - 1918), the interwar era (1918 - 1939), and the Second World War (1939 - 1945). These three sections will be bookended by an expository week on British society and government at the dawn of the twentieth century on one side, and a concluding week on the rise of Labour after 1945 and the construction of Britain's welfare state on the other. Along the way, we will focus on historiographical debates about the era's key themes and social transformations, including the nation's gradual political democratization, class relations, the changing position of women in society and politics, the development of a mass commercial leisure culture, and the tensions between rearmament, appeasement, pacifism, and internationalism. We will think carefully about how the major social and political transformations of these thirty years unfolded within the lives of ordinary Britons, how major structural changes in government, economics, and international relations manifested in the texture of everyday life experiences."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Two primary source analyses, two rotations as a principal commenter on others' primary source analyses, midterm exam, and a fifteen to twenty page final paper"}, {"name": "Class Materials (Required)", "value": "Jay Winter, The Great War and the British People, 9781403906953<br/>Robert Graves and Alan Hodge, The Long Week-End: A Social History of Great Britain, 1918-1939, <br/>9780393311365<br/>Angus Calder, The People's War, 978-0712652841"}], "lmod": "2/21/17 6:47 PM (CT)", "subject": "HISTORY"}]