[{"school": "WCAS", "overview_of_class": "The fundamental purpose of this course is the expanding of our students' horizons -<br/>especially through movies. The students will be introduced to the Latin-American culture<br/>through this engaging media; and help the students in the class to learn about events in<br/>specific cultures which have contributed to the panorama of the Latin-American's world<br/>community - for instance, the Mexican revolution, life in Cuba during the dictatorship of<br/>Castro, Chile in the 1970's, and so on. In addition to these memorable and salient references<br/>to contemporary history, the films will also teach students about the daily life of their<br/>protagonists with respect to food and meals, family and community traditions, the raising and<br/>education of children, etc. Such information provides a means for the student to grow in<br/>mindfulness of the quotidian lives of other peoples, as well as offering enjoyment to the<br/>whole class through sharing the viewing of much that is beautiful, uplifting, and thought provoking.<br/>Participating in the course will enhance critical thinking because students will<br/>learn how to evaluate and compare real events as recorded and portrayed in different movies.", "name": "Residence-Linked Seminar - VI (Literature and Fine Arts)", "section": "20", "topic": "The Silver Mirror", "course": "280-6", "meeting_time": ["Tu 3:00PM - 5:50PM"], "path": "/class-descriptions/4650/WCAS/GEN_LA/280-6/26492", "instructor": ["Rifka   Cook"], "id": "26492", "subject": "GEN_LA"}, {"school": "WCAS", "overview_of_class": "In many ways, the subject of the environment is a focal point for any number of disciplines, both in the liberal arts and hard sciences, to come together in the great clearing house we call &quot;the humanities&quot;. This course will offer a balanced approach to the growth and change in literature devoted to the subject of the environment, touching briefly on 19th century foundations (the assigned writers in the reader discussing Muir, Ruskin, Emerson, Thoreau) and moving quickly to the explosion of what may be a genre of literature unto its own. We will consider contributions from poetry, drama, fiction, and nonfiction, documentary, advocacy journalism, polemic. We will consider science and philosophy, art and religion, history and politics, all in the way they come to this huge and pressing subject. In order to further focus a very rich area of literature and art, we will focus especially on the idea of &quot;Living in Nature&quot;: why we want to, what it means, and what are the consequences. We will consider specifically Into the Wild (Krakauer), Derzu the Trapper (Arseniev), Thoreau's Walden, Giono's The Man who Planted Trees, Janet Kauffman's Rot, Junichiro Tanizaki's In Praise of Shadows, and Werner Herzog's documentary &quot;Grizzly Man&quot;. We will take time to discuss, under this subtopic, hunting and literature (with works by Edward Abbey, Joy Williams, James Swan, and possibly Ted Nugent).", "name": "Residence-Linked Seminar - VI (Literature and Fine Arts)", "section": "22", "topic": "", "course": "280-6", "meeting_time": ["Th 6:15PM - 9:05PM"], "path": "/class-descriptions/4650/WCAS/GEN_LA/280-6/26494", "instructor": ["Brian D Bouldrey"], "id": "26494", "subject": "GEN_LA"}, {"school": "WCAS", "overview_of_class": "In this class, we will view and discuss contemporary German films<br/>since the fall of the Berlin Wall in 1989. Using the fascinating global<br/>city Berlin as a focal point and as a mirror for German history in the<br/>20th and 21st century, we will analyze films dealing with German<br/>Reunification (Goodbye Lenin, Lives of Others, Barbara) and Post-<br/>Reunification (Victoria, Kaddish for a Friend), while also discussing<br/>approaches to film analysis.<br/>As the Area VI requirement states, &quot;the course will help<br/>[students] understand how the attitudes, ideas, and values of<br/>individuals, groups, societies, or cultures are represented in their<br/>literature, arts, and other creative activities.&quot; In particular, we will<br/>trace how perspectives regarding East and West and regarding<br/>walls and borders are represented in German films and how these<br/>perspectives have changed in the last 25 years, both on a national<br/>as well as transnational level.<br/>In order to explore German-American connections on site,<br/>we will include an excursion to the Berlin Wall memorial in Lincoln<br/>Square at the Western El Stop along with a visit to additional sites in<br/>Lincoln Square's Germantown and including an ethnic culinary<br/>experience in a German restaurant. During the second part of the<br/>course, we plan another excursion to explore German-influenced<br/>architecture in Chicago with references to the films that we see<br/>and, depending on availability, we may plan a trip to the European<br/>film festival to watch a current German film.", "name": "Residence-Linked Seminar - VI (Literature and Fine Arts)", "section": "23", "topic": "Film Across Borders: The Berlin Connection", "course": "280-6", "meeting_time": ["Mo 6:00PM - 8:50PM"], "path": "/class-descriptions/4650/WCAS/GEN_LA/280-6/27806", "instructor": ["Ingrid   Zeller"], "id": "27806", "subject": "GEN_LA"}]