[{"class_mtg_info": [{"meet_t": "MoWe 12:30PM - 1:50PM", "meet_l": "Locy Hall 111"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-registration is reserved for Sociology Majors and Minors.", "qtr": "Spring 2017", "name": "35570", "title": "WCAS SOCIOL 376-0-22 Topics in Sociological Analysis", "class_attributes": "", "section": "35570", "instructors": [{"instructor_phone": "", "instructor_name": "Baris   Unlu", "instructor_addr": ""}], "topic": "State, Ethnicity, and Class", "course": "376-0", "descriptions": [{"name": "Overview of class", "value": "This class advances your understanding of power dynamics that underpin the ethnic and racialized identities within which we all live. Drawing on four different historical experiences and cases (the Armenian and Kurdish issues in Turkey, racism and white supremacy in the United States as well in as South Africa, and the colonial/post-colonial links between France and Algeria) this course examines the links among state structures, social class formation, and ethnic/racialized identity construction through a comparative lens. We begin by considering sociological conceptualizations of the state, boundary-making, ethnicity, and race. The cases of Turkey, France, Algeria, South Africa, and the United States -although crucially different from each other with respect to social, political, and economic structures- display remarkable similarities when analyzed through the concepts of power, privilege, violence, boundary-making, and modern governmentality. Having investigated concepts and ways of thinking about boundary-making and identities, we then turn to questioning the dynamics of power that operate at multiple and over-lapping levels: from the level of capitalist world-system to nation-state, from the state structures to local instances of ethnic/racial boundary making, from individual interests to individual strategies of ignorance and indifference."}, {"name": "Registration Requirements", "value": "During preregistration this course is only open to Sociology Majors &amp; Minors.<br/><br/>This course is open to all undergraduates during regular registration."}, {"name": "Learning Objectives", "value": "At the end of this course, the students will be able to:<br/>Gain a deeper understanding of the relation between the dominant/dominated as well as privileged/underprivileged identities.<br/>Develop a comparative perspective about how seemingly remote and incomparable cases can in fact be quite similar and comparable in content, if not in form.<br/>Cultivate a sociological imagination of the relationship between social/state structures and individuals' cognitive and emotional strategies.<br/>Cultivate an ability to identify, analyze and criticize social, political, and economic inequalities anchored in hierarchies of race, ethnicity, and class.<br/>Acquire a familiarity of prominent texts that helped shape both social movements and social science literature."}, {"name": "Evaluation Method", "value": "Participation/Discussion: 20%<br/>Response Papers: 40%<br/>Final Exam: 40%"}, {"name": "Class Materials (Required)", "value": "TBA"}, {"name": "Class Notes", "value": "Instructor: Visiting Assistant Professor Baris Unlu"}], "lmod": "2/7/17 6:47 PM (CT)", "subject": "SOCIOL"}]