[{"class_mtg_info": [{"meet_t": "We 3:00PM - 5:50PM", "meet_l": "Kresge 3438 Philosophy Sem. Rm"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "22785", "title": "WCAS PHIL 410-0-20 Seminar: Special Topics in Philosophy", "class_attributes": "Graduate Students Only<br/><br/>", "section": "22785", "instructors": [{"instructor_phone": "847/491-4452", "instructor_name": "Michael John Glanzberg", "instructor_addr": "Crowe 1-148"}], "topic": "Meaning and Mental Representation", "course": "410-0", "descriptions": [{"name": "Overview of class", "value": "This course will explore aspects of mental representation, with attention to connections between thought and language. It has been a long-standing idea that thought is somehow language-like. This idea has two aspects: first, that our thoughts are composed of units that are somehow like word meanings (called concepts); and second, that these are built up into thoughts in ways similar to how sentences are built up from words. We will examine both the foundations of this idea, and its implications. We will examine work on concepts both from philosophy and psychology, and how concepts are related to word meanings. We will also examine views about the language of thought, that is taken to structure concepts into sentence-like representations, as well as alternatives to the language of thought approach. Throughout, we will draw on both empirical and foundational work. Along the way, we will read some classic works in the philosophy of mind. Possible additional topics include how concepts combine, how results in acquisition and learning affect our views of concepts and word meanings, how the language of thought relates to logical form, and how connectionist models can account for semantic composition."}, {"name": "Registration Requirements", "value": "Professor consent for non-philosophy graduate students and undergraduates."}, {"name": "Learning Objectives", "value": "mastery of core ideas in philosophy of mind, and their current applications."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Paper, final"}, {"name": "Class Materials (Required)", "value": "classic and contemporary readings in philosophy of mind and cognitive science."}], "lmod": "12/29/16 7:03 PM (CT)", "subject": "PHIL"}]