[{"school": "WCAS", "overview_of_class": "*INFORMATION IS SUBJECT TO CHANGE*<br/><br/><br/>The instructor of \"Lessons in Non-Profit Management\" is: Seth Green.<br/><br/><br/>In this course, we will dive into the exciting world of non-profits and immerse ourselves in everything from how non-profits finance their efforts to how they measure their performance. We will also look at what makes a great consultant, as you serve as a consultant to a non-profit client.<br/><br/><br/>This course brings together students from a variety of academic disciplines and leverages their diverse talents in the field to consult nonprofits facing organizational challenges in addressing issues such as poverty, homelessness and education. Bridging the divide between academic experience and civic engagement, teams of five undergraduate students have the opportunity to work on ten-week engagements with nonprofits under the supervision of Kellogg MBA students.<br/><br/><br/>To inform and guide students` interaction with nonprofits, this course will provide an overview of the nonprofit sector and the growing trends towards greater accountability, transparency and performance management. Students will explore the changing roles and responsibilities of nonprofits, as shaped by both the public and private sector, and they will examine the implications of these trends. The first half of the course will be spent introducing students to the Third Sector and the present political and economic systems that influence how it serves the public good. The second half of the course will be spent examining business strategy and management and their applicability to nonprofits. The overarching goal of the course is to create a foundation of knowledge from which students can draw upon as they work together with community nonprofits. This course is an opportunity to innovate, collaborate, learn and apply a new set of skills and knowledge while impacting the community.", "name": "Professional Linkage Seminar", "section": "24", "location": "Annenberg Hall G32", "topic": "Lessons in Non-Profit Mgmt", "course": "394-0", "meeting_time": ["Tu 2:00PM - 4:50PM"], "path": "/class-descriptions/4640/WCAS/BUS_INST/394-0/10738", "instructor": ["Seth Jacob Green"], "class_attributes": "", "id": "10738", "subject": "BUS_INST"}, {"school": "WCAS", "overview_of_class": "*INFORMATION IS SUBJECT TO CHANGE*<br/><br/><br/>The instructor for \"Leadership and Ethics\" is: Verinder Syal.<br/><br/><br/>Who is a leader and what is leadership? Are leaders born or can leaders be made or make themselves? What does it take to become a leader? <br/><br/><br/>Some leaders have conquered vast lands; others have produced profound thought. Some assimilated all that they encountered; others destroyed everything they touched. Some were heroes; others despots. Even today, some build their people and institutions; others focus on their ego and their net worth. Some serve, some take. Why? <br/><br/><br/>We will search for answers by studying historical and current leaders, their character, traits, and methods. In our quest for clarity we will ask: Are there any Universal Principles of Leadership (\"UPL\")? We will examine the role ethics, integrity, and character play in leadership? Are these a handicap or are they the very essence of leadership, and perhaps even life? <br/><br/><br/>We will use real life case studies to think about situations that you are likely to encounter in the actual world that awaits you out there. We will think about ethical challenges, crucibles, and grappling with the purpose of leadership and life. We will discuss some of the necessary tools for leadership including Vision, Aligning, Motivating, and Execution (as in getting things done.) <br/><br/><br/>But the most important question that you will address will be about yourself: \"What kind of leader do I plan to be?\" Ultimately life is not about what others do, or what is done to you; it is about you, what you do, how you choose to lead, and how you choose to live your life. Yes, it is a choice. And you make the choice.", "name": "Professional Linkage Seminar", "section": "26", "location": "Harris Hall L06", "topic": "Leadership and Ethics", "course": "394-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4640/WCAS/BUS_INST/394-0/10739", "instructor": ["Verinder Kumar Syal"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>Juniors/Seniors Only<br/><br/>", "id": "10739", "subject": "BUS_INST"}, {"school": "WCAS", "overview_of_class": "*INFORMATION IS SUBJECT TO CHANGE*<br/>The instructor for \"Investment Banking\" is: David Stowell<br/><br/>This course focuses on investment banking organizational structure, products, risks, earnings, regulations, innovations and competition. The functions of the \"banking\" business (M&A and financings, including equity, bonds and convertibles), the \"sales and trading\" business (client-related sales and trading and proprietary trading) and other investment banking businesses will be analyzed. In addition, new, innovative Wall Street securities and advisory products will be reviewed. Finally, investment banking relationships with private equity funds, hedge funds and corporate and institutional clients will be explored.", "name": "Professional Linkage Seminar", "section": "27", "location": "Jacobs Center G44", "topic": "Investment Banking", "course": "394-0", "meeting_time": ["Tu 3:30PM - 6:15PM"], "path": "/class-descriptions/4640/WCAS/BUS_INST/394-0/10740", "instructor": ["David Paul   Stowell"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "id": "10740", "subject": "BUS_INST"}]