[{"class_mtg_info": [{"meet_t": "MoWe 12:30PM - 1:50PM", "meet_l": "Harris Hall L04"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "11966", "title": "WCAS ENGLISH 300-0-20 Seminar in Reading and Interpretation", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "11966", "instructors": [{"instructor_phone": "", "instructor_name": "Shaundra J Myers", "instructor_addr": ""}], "topic": "Contemporary Black Women's Writing", "course": "300-0", "descriptions": [{"name": "Overview of class", "value": "Whether described as a flourishing, an explosion, or a blossoming, the renaissance of African American women's writing that began in the 1970s is now commonly accepted as the starting point, if not the signature feature, of what we might consider the long era of contemporary African American literature. How did innovations in form and content push the publishing industry to suddenly open up to black women's literature in unprecedented ways? We will examine first editions and reprints of black women's writing published during the 1970s and 1980s to learn how to read and interpret a number of genres, including novels, short stories, poetry, drama, manifestos, anthologies, and essays. As we develop our skills of reading, interpretation, and revision, we will pay close attention to how literature works?that is, how writers tell stories and craft poems through manipulations of narration, point of view, character, plot, time, meter, voice, imagery, and language. We will explore a number of interpretive possibilities, applying various critical approaches?formalist, Marxist, historicist, poststructuralist, black feminist, critical race, queer, and postcolonial theory?across a wide range of groundbreaking texts."}, {"name": "Teaching Method", "value": "Seminar (close reading and discussion)."}, {"name": "Evaluation Method", "value": "Regular Canvas postings and close-reading assignments, a presentation, three formal essays, graded participation, midterm/final, and attendance."}, {"name": "Class Materials (Required)", "value": "Texts may include works by Nella Larsen, Zora Neale Hurston, Gwendolyn Brooks, Toni Morrison, Toni Cade Bambara, Alice Walker, Gayl Jones, Andrea Lee, Ntozake Shange, Rita Dove, and Audre Lorde as well as critical and theoretical readings."}, {"name": "Class Notes", "value": "English 300 is an English Literature major and minor requirement. First class mandatory. No P/N registration. This course does NOT fulfill the WCAS Area VI distribution requirement."}], "lmod": "10/30/16 7:04 PM (CT)", "subject": "ENGLISH"}]