[{"school": "SoC", "overview_of_class": "RTVF 369 Blocking and Staging<br/>Description: This course will be a workshop in techniques for developing drama and expressing themes, emotional shifts, ideas, and graphic design through the performers' movements in relationship to camera and each other onscreen. Through screenings of work by such fiction narrative directors as Ford, Kurasowa, Campion, and Cuaron, the class will introduce distinct strategies for covering action and blocking performers in relation to both camera movement and editorial design. Students will practice at staging for long-take and fast-cutting, for still and moving camera, tripod, dolly, and handheld work. If film school were Hogwarts, this course would be \"Defense Against the Dark Arts,\" emphasizing directorial and performance skills in production to control pacing and dramatic emphasis, as well as to guide audience attention through the scene work itself, in the tradition of classical studio direction and performance that determined editing \"in camera\" to most directly communicate with the audience and protect against post-production meddling by studio heads and marketing departments.<br/> <br/>Learning objectives: students will: demonstrate understanding and ability to execute a range of approaches to blocking, positioning camera, and planning editing; put scene analysis into practice through arrangement and movement of performers; engaging in practical critique of visual storytelling strategies, aesthetics, and emotional engagement<br/> <br/>Evaluation method: Class participation; in-class presentations on staging and editorial strategies of feature films shown for class; supervised in-class exercises; frequent group shooting projects outside class to practice strategies of staging, shooting, and editing drama; all students will act in these projects, and the course will count as an Acting for Screen module elective.<br/> <br/>Class Materials: Film Directing: Cinematic Motion 2nd Edition by Steven D. Katz. Michael Wiese Productions. 2004. Isbn?0941188906; Media production expendables necessary for completion of projects, should include hard drive for your media.<br/>?", "name": "Topics in Acting for the Screen", "section": "20", "location": "Louis Hall 105", "topic": "Blocking and Staging", "course": "369-0", "meeting_time": ["Mo 3:00PM - 5:50PM", "We 3:00PM - 4:50PM"], "path": "/class-descriptions/4660/SoC/RTVF/369-0/34742", "instructor": ["Spencer W Parsons"], "class_attributes": "Prerequisites apply, see description<br/><br/>", "id": "34742", "subject": "RTVF"}, {"school": "SoC", "overview_of_class": "RTVF 369-0 Sec. 21 Topics in Acting for the Screen: Devised Narrative - meets Th 12:00-2:50 in Louis 106<br/><br/>OVERVIEW: Intended for RTVF and Theatre students, this class will examine the process of performance and narrative-creation via the increasingly utilized mode of improvisation. Utilizing long-form class exercises, students will work towards creating devised short film projects, both scripted (finally) and improvised, culminating in a final ensemble mini-movie.<br/><br/>LEARNING OBJECTIVES: Students will develop a working knowledge of improvisation, narrative-creation and advanced film acting technique.<br/><br/>TEACHING METHOD: in-class workshops and scenes, out-of-class student-directed filmed projects<br/><br/>EVALUATION METHOD: Class participation, filmed projects.", "name": "Topics in Acting for the Screen", "section": "21", "location": "Louis Hall 106", "topic": "Devised Narrative", "course": "369-0", "meeting_time": ["Th 12:00PM - 2:50PM"], "path": "/class-descriptions/4660/SoC/RTVF/369-0/37901", "instructor": ["Stephen Daniel Cone"], "class_attributes": "", "id": "37901", "subject": "RTVF"}]