[{"class_mtg_info": [{"meet_t": "Mo 9:00AM - 11:50AM", "meet_l": "Scott Hall 107 Burdick Room"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Political Science students who are Juniors or Seniors", "qtr": "Spring 2017", "name": "35423", "title": "WCAS POLI_SCI 395-0-24 Political Research Seminar", "class_attributes": "Department Majors Only<br/><br/>Juniors/Seniors Only<br/><br/>", "section": "35423", "instructors": [{"instructor_phone": "847 491 2595", "instructor_name": "Richard A Joseph", "instructor_addr": "218 Chambers Hall"}], "topic": "Democracy, Autocracy, &amp; Disorder: The New Global E", "course": "395-0", "descriptions": [{"name": "Overview of class", "value": "POLI SCI 395-0-24 Spring 2017 &quot;Democacy, Autocracy, and Disorder: A New Global Era&quot; Prof. Richard Joseph <br/>This course will explore the evolution from the &quot;democratic euphoria&quot; of the early 1990s to critical analyses of democratization. It will examine debates on the &quot;democratic recession&quot; and upsurge of authoritarianism, and draw on analyses of various regions, especially Africa, Eastern Europe, and the Middle East.<br/>After the Cold War, the number of democracies in the world increased significantly. In recent years, that number has stagnated and, by some accounts, declined. The aim of the course is to achieve a deeper understanding of these dynamics and their implications. It will be achieved by reading and discussing the works of leading scholars of these processes. Students will write a research paper on a country or region of their choice, apply these frameworks of analysis, and probe further the questions raised in the readings and in class.<br/>The first course reading is a comprehensive article by Michael J. Boyle, &quot;Illiberalism Ascendant: Obama's Tragic Legacy.&quot; (Current History, Jan. 2017) It captures the travails of western democracy and the &quot;liberal international order&quot;. These commitments ebbed and flowed during the last century and are now more contested.<br/>The collapse of the Soviet Union led to several years of Western ideological hegemony. The spread of jihadist insurgencies, the 9/11 destruction of the World Trade Center, prolonged wars in Iraq, Afghanistan, and Syria, and violent conflicts in many areas have shifted global priorities. Counter-terrorism, and the strengthening of political order and security, are now ascendant. Nationalist authoritarianism in China and Russia, the rise and collapse of the &quot;Arab Spring&quot;, mass migrations, and religious sectarianism have contributed to a sense of &quot;global disarray&quot;.<br/>In recent years, scholars such as Christopher Walker debated the &quot;renewed struggle between democracy and authoritarianism worldwide&quot; (Journal of Democracy, 2016). They acknowledged the reversal of trends just decades old now reflected in the rise of Illiberal regimes. They explored if liberal democracy was being eclipsed by new forms of authoritarianism, and whether the liberal international order was losing ground to an illiberal global order.<br/>The upsurge of authoritarian &quot;populist&quot; nationalism in the West is apparent in a number of countries. Political parties based on such movements are altering the composition of governments, including in &quot;Old Europe&quot;. The Brexit vote in Britain, the election of Donald Trump as U.S. president, the defeat of a constitutional amendment and a reformist Prime Minister in Italy, and prospects of political upheavals in France and Germany signal the fracturing of the liberal democratic consensus.<br/>This course will also trace the commitment to &quot;democracy promotion&quot; from the presidency of George W. Bush to that of Barack Obama. It will examine how the dysfunction, and &quot;failure to deliver&quot;, of western democracies have contributed to the erosion of their popular support. Essentials of political thought and practice, regarding democracy and autocracy, are again contested. Students will deepen their knowledge of these developments and, in their individual research, examine the ramifications in specific countries."}, {"name": "Teaching Method", "value": "The course will be taught seminar-style with occasional brief lectures. Students will report on the readings in each class. After the submission of a short essay, they will follow a process leading to the completion of a research paper."}, {"name": "Evaluation Method", "value": "Course grades will be based on written work (75%) and class participation (25%)."}, {"name": "Class Materials (Required)", "value": "A course packet will be made available for purchase at Quartet Copies. Other readings are available online. Interested students can obtain a list of of the assigned readings by emailing r-joseph@northwestern.edu. They can also obtain details of a major forum on &quot;Democracy and Insecurity in Africa&quot; at Northwestern and in Chicago, on Tuesday, March 7, 2017."}], "lmod": "2/9/17 6:45 PM (CT)", "subject": "POLI_SCI"}]