[{"class_mtg_info": [{"meet_t": "MoTuWeFr 2:00PM - 2:50PM", "meet_l": "Technological Institute LG52"}], "school": "MEAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24277", "title": "MEAS MAT_SCI 315-0-20 Phase Equilibria &amp; Diffusion of Materials", "class_attributes": "", "section": "24277", "instructors": [{"instructor_phone": "847/467-0593", "instructor_name": "Christopher M Wolverton", "instructor_addr": "3013A Cook Hall"}], "associated_classes": [{"component": "LAB", "room": "TBA", "meeting_time": "TBA"}], "topic": "", "course": "315-0", "descriptions": [{"name": "Overview of class", "value": "Course Objectives: <br/>1.) The objectives of this course are to develop an understanding of free enery vs. temperature relationships in binary and ternary phase diagrams, including fundamental electrochemical understanding and 2.) to develop an understanding of point defects and their role in diffusion. <br/><br/>Course Outcomes:<br/>A student completing this course should be able to:<br/>1. Relate free energy vs. temperature and composition relationships to binary phase diagrams<br/>2. Solve basic electrochemistry problems<br/>3. Interpret ternary phase diagrams<br/>4. Use modern software programs to predict free energy functions and the related phase diagrams<br/>5. Describe the relationship between point defects and the role of diffusion in solids<br/>6. Describe the equilibrium thermodynamics of point defects in crystalline ionic and non-ionic solids<br/>7. Describe the Kirkendall effect, diffusion in ternary systems, and the importance of short-circuit diffusion <br/><br/>Relationship to Department Outcomes: <br/>Supports 2, 3, 4, 5"}, {"name": "Registration Requirements", "value": "MAT SCI 314 or equivalent"}, {"name": "Teaching Method", "value": "Three lectures, one hour of problem solving, and one two hour laboratory per week."}, {"name": "Evaluation Method", "value": "In addition to lab reports, there will be weekly homework assignments, two midterm exams, and a group project."}, {"name": "Class Materials (Required)", "value": "D. A. Porter, K. E. Easterling, and M.Y.Sherif, Phase Transformations in Metals and Alloys, 3rd edition, CRC Press. ISBN 1420062107"}, {"name": "Class Materials (Suggested)", "value": "P. G. Shewmon, Transformations in Metals; R. A. Swalin, Thermodynamics of Solids; Y. M. Chiang, D. Birnie, and W. D. Kingery, Physical Ceramics"}], "lmod": "12/25/16 6:43 PM (CT)", "subject": "MAT_SCI"}]