[{"class_mtg_info": [{"meet_t": "MoWeFr 11:00AM - 11:50AM", "meet_l": "University Hall 218"}], "school": "WCAS", "overview_of_class": "This course will be taught by Prof. Michael Wairungu.<br/><br/>This is the first part of a three-quarter sequence of Intermediate Swahili. The course builds on the foundation established in beginning Swahili. It is designed to enhance students' communicative skills and a deeper cultural awareness about Swahili and East Africa. To enroll in the course, a student is required to have satisfactorily completed the three levels of beginning Swahili or the equivalent.", "qtr": "Fall 2017", "name": "Swahili II", "title": "WCAS SWAHILI 121-1-20 Swahili II", "lmod": "5/11/17 7:44 PM (CT)", "section": "20", "topic": "", "course": "121-1", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "This course will be taught by Prof. Michael Wairungu.<br/><br/>This is the first part of a three-quarter sequence of Intermediate Swahili. The course builds on the foundation established in beginning Swahili. It is designed to enhance students' communicative skills and a deeper cultural awareness about Swahili and East Africa. To enroll in the course, a student is required to have satisfactorily completed the three levels of beginning Swahili or the equivalent."}, {"name": "Learning Objectives", "value": "The course will generally focus on polishing and enhancing student comprehension and communicative skills. Although the primary goal of the course is to strengthen the five skill areas of reading, writing, speaking, listening and culture, emphasis will be placed on the productive and receptive oral-aural skills of speaking and listening respectively. There will, therefore, be a deliberate tilt towards conversation practice as a means of strengthening student competence in communicative skills."}, {"name": "Teaching Method", "value": "The class employs a combination of lectures, lab sessions and group performances, and will be conducted almost exclusively in Swahili with a lot of conversation practice. Authentic texts will be introduced to supplement the primary textbook, covering various Swahili registers, including but not limited to literary excerpts, newspaper articles, radio broadcasts and other available Swahili material. Such materials are aimed at introducing the students to current and more specialized Swahili vocabulary. Students will engage in Swahili cultural activities and class presentations that will be conducted mainly in Swahili. By the end of the course, students are expected to be able to understand and express themselves orally and in writing at an intermediate level."}, {"name": "Evaluation Method", "value": "The final grade will be based on the following six major areas of language use: attendance and participation (10%), homework (15%), weekly vocab quizzes (15%), two sit-in quizzes (20%), Mid-term exam (20%) and final exam (20%). Each learner who attends at least three-language/conversation table meetings will be awarded an extra-credit of 3 points to be added to the final grade."}, {"name": "Class Materials (Required)", "value": "1. Sharifa Zawawi. 2001. Kiswahili Kwa Kitendo: An Introductory and Intermediate Course (2nd Edition). Africa World Press: New Jersey. <br/>2. Sharifa Zawawi. 1998. Jifunze Kiswahili Chetu: Workbook. Africa World Press: New Jersey. Africa World Press: New Jersey. <br/>3. Swahili - English, English - Swahili Practical Dictionary (Hippocrene Practical Dictionary) by Nicholas Awde."}], "instructor": ["Michael Gathonjia Wairungu"], "class_attributes": "One Addtl hour or more TBA<br/><br/>", "id": "10078", "subject": "SWAHILI"}]