[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "Parkes Hall 214"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "11981", "title": "WCAS ENGLISH 378-0-20 Studies in American Literature", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "11981", "instructors": [{"instructor_phone": "", "instructor_name": "Betsy J Erkkila", "instructor_addr": ""}], "topic": "Founding Terrors", "course": "378-0", "descriptions": [{"name": "Overview of class", "value": "This course will read against the accepted tradition of the American Revolution as an essentially rational, Lockean, and non-terroristic Revolution. We will examine American Revolutionary writing as a rhetorical battlefield in which a multiplicity of voices and a plurality of forms?history, letters, notes, autobiography, novel, lyric, pamphlet, and journalistic piece?struggled over the cultural and political constitution of America and the American. We shall focus in particular on sites of contest, contradiction, resistance, and taboo in Revolutionary writing: the representation of &quot;citizens&quot; and &quot;others&quot;; conflicts between reason and passion, liberty and slavery, civilization and savage, progress and apocalypse; anxieties about nature, the body, sex, human psychology, race, and madness; the terrors of democracy, mob violence, slave insurrection, and political faction; and debates about the excesses of language, print, and representation. We will also reflect on past and ongoing debates about the meaning of the American Revolution."}, {"name": "Teaching Method", "value": "Lecture and discussion."}, {"name": "Evaluation Method", "value": "Essay (3 pp.); essay (5-6 pages); participation; final examination."}, {"name": "Class Materials (Required)", "value": "Thomas Paine, Common Sense; Thomas Jefferson, Declaration of Independence and selections from Notes on the State of Virginia; Letters of John and Abigail Adams; Benjamin Franklin, Autobiography; Phillis Wheatley, Poems; Hector St. John de Crèvecoeur, Letters from an American Farmer; Alexander Hamilton, James Madison, John Jay, The Federalist Papers; Hannah Foster, The Coquette; or, the History of Eliza Wharton; Charles Brockden Brown, Edgar Huntly; or, Memoirs of a Sleep-Walker; Royal Tyler, The Algerine Captive."}], "lmod": "10/30/16 7:04 PM (CT)", "subject": "ENGLISH"}]