[{"class_mtg_info": [{"meet_t": "MoWe 12:30PM - 1:50PM", "meet_l": "Technological Institute M164"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "31111", "title": "WCAS GNDR_ST 341-0-20 Transnational Perspectives on Gender and Sexuality", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "31111", "instructors": [{"instructor_phone": "", "instructor_name": "Yael   Israel-Cohen", "instructor_addr": ""}], "topic": "Women in Trad'l ReligiousMvmts", "course": "341-0", "descriptions": [{"name": "Overview of class", "value": "IN THIS COURSE, STUDENTS WILL BE CHALLENGED TO THINK ABOUT FEMINISM THROUGH THE LENS OF WOMEN COMMITTED TO TRADITIONAL, AT TIMES EVEN FUNDAMENTALIST, RELIGIOUS VALUES. WE WILL INVESTIGATE THE WAYS IN WHICH SUCH WOMEN NEGOTIATE THEIR STATUS AND EXAMINE THE EVOLVING FEMINIST MOVEMENTS THAT HAVE ARISEN WITHIN TRADITIONAL RELIGIOUS LIFE. MORE SPECIFICALLY, WE WILL FOCUS ON A CASE STUDY OF FEMINIST ACTIVISM AMONG ORTHODOX JEWISH WOMEN IN ISRAEL, IN A COMPARATIVE PERSPECTIVE WITH EVANGELICAL WOMEN AND MUSLIM WOMEN IN THE USA. SOME OF THE CENTRAL QUESTIONS WE WILL ENGAGE ARE: HOW ARE THE FORMS OF FEMINIST IDENTITY AND ACTIVISM AMONG WOMEN IN TRADITIONAL RELIGIOUS TRADITIONS SIMILAR? IN WHAT WAYS CAN FEMINIST ACTIVISM WITHIN RELIGIOUS LIFE BE COMPARED WITH SECULAR FEMINIST ACTIVISM?"}, {"name": "Teaching Method", "value": "DiscussionLectureSeminar"}, {"name": "Evaluation Method", "value": "Papers"}, {"name": "Class Materials (Required)", "value": "TENTATIVE <br/><br/>1) &quot;The fundamentals of fundamentalism&quot; In. Marty, M. &amp; Appleby, S. (1992). The Glory and the Power: The Fundamentalist Challenge to the Modern World. Beacon Press. Pg. 7-35.<br/><br/><br/>2) Manning, J. (1999). God gave us the right: Conservative Catholic, Evangelical Protestant, and Orthodox Jewish women grapple with feminism. Rutgers. Chs. 1 and 2 (Pgs. 3-60). <br/><br/><br/>3) Kaufman, D. R. (1989). Patriarchal women: A case study of newly Orthodox Jewish women. Symbolic Interaction, 12(2), 299-314.<br/><br/>4) Bartkowski, J. P., &amp; Read, J. N. G. (2003). Veiled submission: Gender, power, and identity among evangelical and Muslim women in the United States. Qualitative Sociology, 26(1), 71-92.<br/><br/><br/>5) Gallagher, S. K., &amp; Smith, C. (1999). Symbolic traditionalism and pragmatic egalitarianism Contemporary evangelicals, families, and gender. Gender &amp; Society, 13(2), 211-233.<br/><br/><br/>6) Hartman. T. (2007). Feminism encounters traditional Judaism: Resistance and accommodation. Brandeis University Press. Preface (pgs. ix-xiv). <br/><br/>7) Ingersoll. (2003) Evangelical Christian Women: War Stories in the Gender Battles. New York University Press. Pg. 1-8, 16-26 and 33-69. <br/><br/><br/>8) Moghadam, V. M. (2014). Islamic feminism and its discontents: Toward a resolution of the debate. Signs, 40(1).<br/><br/><br/>9) Hartman, T. (2002). Appropriately Subversive: Modern Mothers in Traditional Religions. Harvard Press. Pgs. 154-164 (ch. 6). <br/><br/>10) Israel-Cohen, Y. (2012). Between Feminism and Orthodox Judaism: Resistance, Identity, and Religious Change in Israel. Brill. Pgs. 49-68 (ch. 4).<br/><br/><br/>11) Manning, J. (1999). God gave us the right: Conservative Catholic, Evangelical Protestant, and Orthodox Jewish women grapple with feminism. Rutgers. Pgs. 167-196 (ch.8)<br/><br/>12) Martin, P. Y. (1990). Rethinking feminist organizations. Gender &amp; Society, 4(2), 182-206.<br/><br/><br/>13) &quot;Go away and change&quot; in Hartman. T. (2007). Feminism encounters traditional Judaism: Resistance and accommodation. Brandeis University Press. Pg. 121-133, Ch. 7 <br/><br/>14) Stocks, Janet. 1997. &quot;To Stay or Leave? Organizational Legitimacy in the Struggle for Change among Evangelical Feminists.&quot; In Nancy L. Eiesland (ed.) Contemporary American Religion: An Ethnographic Reader, pp. 99-120. Walnut Creek: Alta Mira Press. <br/><br/>15) Ecklund, E. H. (2005). Different identity accounts for Catholic women. Review of Religious Research, 135-149.<br/><br/><br/>16) Chaves, M. (1996). Ordaining women: The diffusion of an organizational innovation. American Journal of Sociology, 840-873. (Skim though the reading)<br/><br/>17) Ingersoll. (2003) Evangelical Christian Women: War Stories in the Gender Battles. New York University Press. Ch. 2, Pgs. 47-59. <br/><br/><br/>18) Israel-Cohen, Y. (2012). Between Feminism and Orthodox Judaism: Resistance, Identity, and Religious Change in Israel. Brill. Pgs. 103- 119 (Ch. 8)."}], "lmod": "4/3/16 8:02 PM (CT)", "subject": "GNDR_ST"}]