[{"class_mtg_info": [{"meet_t": "MoWeFr 10:00AM - 10:50AM", "meet_l": "Technological Institute M177"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "13396", "title": "WCAS MATH 224-0-41 Integral Calculus of One Variable Functions", "class_attributes": "Formal Studies Distro Area<br/><br/>", "section": "13396", "instructors": [{"instructor_phone": "", "instructor_name": "Jian   Xiao", "instructor_addr": ""}], "topic": "", "course": "224-0", "descriptions": [{"name": "Overview of class", "value": "<br/>Integrals, techniques of integration, volumes, arc length, work, differential equations, sequences and series, Taylor polynomials. Students may not receive credit for both 224 and 213 or 214. Prerequisite: 220.<br/><br/>THIS COURSE HAS MANDATORY EVENING MIDTERM EXAMINATIONS. PLEASE CHECK THE REGISTRAR'S WEBPAGE FOR DETAILS: http://www.registrar.northwestern.edu/registration/midterms.html<br/><br/>This exam takes precedence over scheduled meetings of other classes, including labs and discussion sections, held at this time, and it is up to the student to make arrangements for handling conflicts arising from such meetings. In special circumstances, arrangements for dealing with other unavoidable conflicts can be made by alerting the course coordinator at least two weeks ahead of time; he/she will decide if your conflict can be accommodated."}, {"name": "Teaching Method", "value": "<br/>Lectures meet three times a week. Classes are accompanied by discussion sections, which meet one day a week for problem solving and discussion under the supervision of a teaching assistant."}, {"name": "Class Materials (Required)", "value": "<br/>ISBN: 978-1285126838 Custom Essential Calculus: Early Transcendentals Volume 1 <br/>Stewart James <br/>Cengage<br/><br/>ISBN: 978-1285184210 Custom Enhanced Web Assign Homework &amp; eBook LOE Instant Access for Multi Term Math &amp; Science, 1st Edition <br/>Stewart James <br/>Cengage"}], "lmod": "10/30/16 7:07 PM (CT)", "subject": "MATH"}]