[{"school": "WCAS", "overview_of_class": "This course will explore media, culture, and politics in Iran since 1979. We will focus on media (TV and Radio, Internet, music, cinema, cartons, Satire, and the press) to analyze the state and societal relations in Iran today. The main questions that we will answer during this course are: How has the political regime used the media to propagate its ideology, control the society, and shape the &quot;ideal citizen&quot;? To what extent has the state been successful in their efforts? How have the people used the media, especially social media, to ignore, undermine, and challenge the state authority?", "name": "Advanced Topics in Middle East &amp; North African Studies", "section": "20", "topic": "Media and Politics in Iran", "course": "390-3", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4610/WCAS/MENA/390-3/23662", "instructor": ["Saeid   Golkar"], "id": "23662", "subject": "MENA"}, {"school": "WCAS", "overview_of_class": "Recent headlines give the impression that religion has always been central in the Middle Eastern upheavals.  This course takes a long-term view of social movements, rebellions, and revolutions in the Middle East to contextualize the religious turn.  Sociological concepts and comparison help us in evaluating their changing form in the past century up to the present.  Events in Turkey, Iran, and Arab states provide the basis for exploration.", "name": "Advanced Topics in Middle East &amp; North African Studies", "section": "21", "topic": "Rebellions&amp;RevolutionsinMidEst", "course": "390-3", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4610/WCAS/MENA/390-3/23663", "instructor": ["Nader   Sohrabi"], "id": "23663", "subject": "MENA"}, {"school": "WCAS", "overview_of_class": "This course explores the construction of gender in the Middle East. Drawing on the historical, sociological and anthropological research in the region, the course aims to question stereotypes about the subordination of Muslim women and to offer a systematic reading and an analytical discussion of the political, economic and cultural structures that inform gender relations and sexuality. The course starts with an examination of early Islam and religious sources with regard to women's status, then moves on to nationalist and modernization movements in the 19th and 20th centuries, and finally focuses on women and men's lives in contemporary Egypt, Turkey and Iran. In this framework, special attention is given to Islamist mobilizations, the family, sexuality, neoliberalism, women's labor and LGBT.", "name": "Advanced Topics in Middle East &amp; North African Studies", "section": "22", "topic": "Gendr&amp;SexualityinMidEst", "course": "390-3", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4610/WCAS/MENA/390-3/23664", "instructor": ["Ayca   Alemdaroglu"], "id": "23664", "subject": "MENA"}]