[{"school": "WCAS", "overview_of_class": "This course examines how and why the dynamic, all-embracing and sometimes destructive socioeconomic forces of capitalism reordered Europe and the world, integrating different regions of the globe in surprising new ways, culminating in the unprecedented period of economic expansion and social change often called the Industrial Revolution. <br/><br/>Historical questions to be considered include the ultimate sources of wealth, the causes of economic growth, the formation of social classes, the cultural consequences of market relations, and the differential impact of the expansion of capitalism throughout the world.", "name": "New Lectures in History", "section": "22", "location": "University Hall 121", "topic": "Emergence of Capitalism, 1500-1850", "course": "300-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4660/WCAS/HISTORY/300-0/34379", "instructor": [""], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "34379", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "This course addresses the history of Southeast Asia from the end of World War II to the Present, a period of rapid and sometimes bewildering change in the region. The course will explore such themes as decolonization; the establishment of authoritarian states; the participation of the region in the Global Cold War; the effects of Import Substitution Industrialization and Export Oriented Industrialization on domestic populations; the management of ethnic and religious diversity; growing social stratification; and the rise of popular democratic movements, among others. We will seek to understand commonalities of experience across Southeast Asia that might warrant it being called a ?region.'", "name": "New Lectures in History", "section": "24", "location": "University Hall 121", "topic": "Contemporary Southeast Asia", "course": "300-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4660/WCAS/HISTORY/300-0/34380", "instructor": ["Haydon Leslie Cherry"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "34380", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "This course looks at the three central questions of modern Mexican history: Why was there a major social revolution? How did that revolution mutate into a very successful authoritarian state? Moreover, how did Mexicans with profound experience of mass mobilization live with that authoritarianism, and with the extremely unequal economy it permitted? In debating these questions, the course will not just introduce students to modern Mexican social, cultural and political history, but also consider a more general problem: Why people rebel, and why they do not rebel.", "name": "New Lectures in History", "section": "26", "location": "University Hall 121", "topic": "People & Power in Mod. Mexico", "course": "300-0", "meeting_time": ["TuTh 9:30AM - 10:50AM"], "path": "/class-descriptions/4660/WCAS/HISTORY/300-0/34381", "instructor": ["Paul James Gillingham"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "34381", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "There is a standard story of the African-American civil rights movement. The story began on a December evening in 1955, when Mrs. Rosa Parks refused to give her up a seat on a Montgomery, Alabama bus. From that single act of defiance surged a social movement that raced across the South of the 1950s and 1960s: through Little Rock and Greensboro, to Birmingham and Selma, into the Mississippi Delta and up to Memphis, where it came to a brutal, bloody end with the murder of Dr. Martin Luther King in the spring of 1968. <br/><br/>In this course, we will expand the movement's history, tracing it across the twentieth century, extending it from the Deep South to the urban north and out to the West Coast, following a wide variety of political perspectives. Out of that process, the course will develop a more complex - and hopefully convincing - interpretation of one of the most important social movements in the American experience.", "name": "New Lectures in History", "section": "30", "location": "Fisk Hall 217", "topic": "Civil Rights", "course": "300-0", "meeting_time": ["TuTh 9:30AM - 10:50AM"], "path": "/class-descriptions/4660/WCAS/HISTORY/300-0/34383", "instructor": ["Kevin Gerard Boyle"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "34383", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "There are few international relationships more important than the one forged between the United States and China over the course of two centuries. Sino-American relations have oscillated dramatically between profound hostility and warm friendship. This course will explore the historical evolution of that relationship from the rise of the American opium trade off the China coast in the nineteenth century, through the fraught relationship of the two allies during both World Wars, through the Cold War era of rivalry and rapprochement, to the present-day tensions roiling the South China Sea region. We will consider the bilateral Sino-American relationship in its larger global context and in connection to the issues of war, diplomacy, race, gender, religion, and material and popular culture. We also will pay particular attention to the ways that the international arena became integral to the domestic politics of both countries.", "name": "New Lectures in History", "section": "32", "location": "University Hall 121", "topic": "Sino-American Relations in the Modern World", "course": "300-0", "meeting_time": ["MoWe 11:00AM - 12:20PM"], "path": "/class-descriptions/4660/WCAS/HISTORY/300-0/34384", "instructor": ["Melissa A Macauley"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "34384", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "Over the last few months, the complex politics of race, gender, and sexuality in the U.S. have been thrown to the forefront of national attention. Many of the issues that have marked the new presidential administration, however?like immigration, crime, sexual assault, and Islamophobia?have been intensifying in popular discourse for the last several years. Since 2013, Black Lives Matter has demanded redress for the ongoing state violence faced by African Americans. In the same years, high profile Supreme Court rulings established same-sex marriage as the law of the land while eroding reproductive rights and rolling back legislative gains of the Civil Rights Movement. Additionally, public backlash against transgender issues has thrown new light on the uneven successes of mainstream LGBT activism.<br/><br/>This course takes up two questions that have grown increasingly urgent in many of our minds: How did we get here? And what do we do now? We will do this by way of historicizing the politics of race, sexuality, and social movements in the U.S. since the post-Civil Rights period. Major topics include Black Power, women's, and gay liberation movements of the 1960s - 70s; women of color feminism of the 1970s - 80s; the emergence of the prison industrial complex; AIDS activism; and the cultural politics of neoliberalism. By highlighting traditions of resistance against racism, sexism, and heterosexism, we will work to better understand and formulate possible responses to our contemporary political moment.", "name": "New Lectures in History", "section": "34", "location": "University Hall 122", "topic": "", "course": "300-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4660/WCAS/HISTORY/300-0/34385", "instructor": ["Abram J Lewis"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "34385", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "This course explores the history of the British Empire, from its origins in the early modern world through its Victorian heights and decline in the twentieth century. We will consider how and why a tiny island managed to control a quarter of the earth's population. In addition, we will discuss how colonized people negotiated, resisted, and ended British rule. This course will focus on both the political and economic histories of the British Empire and the histories of ordinary people around the British world.", "name": "New Lectures in History", "section": "36", "location": "Locy Hall 318", "topic": "British Empire", "course": "300-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4660/WCAS/HISTORY/300-0/34386", "instructor": ["Alexandra Simone Lindgren-Gibson"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "34386", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "In this course, we will conceptualize Native peoples as nations, not merely racial/ethnic minorities. Students will learn about the unique legal landscape in Indian Country by charting the historical development of tribal governments and the ever-changing body of U.S. law and policy that regulates Indian affairs. We begin by studying Indigenous legal traditions, the European doctrine of discovery, and diplomatic relations between Native nations and European empires. We then shift our focus to treaty making, the constitutional foundations of federal Indian law, 19th century U.S. Supreme Court decisions, and the growth of the federal bureaucracy in Indian Country. The course devotes considerable attention to the expansion of tribal governmental authority during the 20th century, the contemporary relationship between Indian tribes and the federal/state governments, and the role of federal Indian law as both a tool of U.S. colonial domination and a mechanism for protecting the interests of Indigenous communities.", "name": "New Lectures in History", "section": "38", "location": "Annenberg Hall G32", "topic": "Development of American Indian Law and Policy", "course": "300-0", "meeting_time": ["MoWe 9:30AM - 10:50AM"], "path": "/class-descriptions/4660/WCAS/HISTORY/300-0/34387", "instructor": ["Douglas   Kiel"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "34387", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "", "name": "New Lectures in History", "section": "40", "location": "Harris Hall L06", "topic": "Science and Religion", "course": "300-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4660/WCAS/HISTORY/300-0/34388", "instructor": ["Daniel A Stolz"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "34388", "subject": "HISTORY"}]