[{"class_mtg_info": [{"meet_t": "Tu 3:30PM - 6:20PM", "meet_l": "University Hall 101"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "21887", "title": "WCAS ASIAN_AM 320-0-1 Advanced Topics in History", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "21887", "instructors": [{"instructor_phone": "847/467-6538", "instructor_name": "Ji-Yeon   Yuh", "instructor_addr": "Harris Hall - Room 306"}], "topic": "Memories of War", "course": "320-0", "descriptions": [{"name": "Overview of class", "value": "Vietnamese refugees and Korean immigrants came to the United States with experiences of war that are passed to younger generations as both silence and memory. How can we understand and represent the experiences of both the older and younger generations? How do their experiences transform the history of Asian Americans as well as the broader history of the United States? What does war mean in the American experience? This research seminar focuses on Vietnamese American and Korean American communities in the Chicago area in an attempt to answer these and other questions through focused oral history research and public presentations."}, {"name": "Registration Requirements", "value": "None."}, {"name": "Learning Objectives", "value": "Students will be expected to know: 1) how to conduct oral history interview research; 2) ways of presenting oral history research for the public; 3) an overview of the history of the Vietnam and Korean wars; 4) the significance of memories about the wars for Vietnamese refugee and Korean immigrant communities; 5) ways of interpreting refugee and immigrant experiences within the differing contexts of U.S.-Asia relations, U.S. immigration history, and Asian diaspora history. 6) ways of interpreting historical memory as expressed in oral history interviews."}, {"name": "Teaching Method", "value": "DiscussionOther: In-class workshops<br/>Research projectSeminar"}, {"name": "Evaluation Method", "value": "Attendance: 10%<br/>Class participation: 10%<br/>Paper, final: 30%<br/>Research project: 50%<br/>"}, {"name": "Class Materials (Required)", "value": "Tentative list of required materials:<br/><br/>The Korean War: A History, by Bruce Cumings ISBN-10: 081297896X ISBN-13: 978-0812978964<br/>The Vietnam War: A Concise International History, by Mark Atwood Lawrence Full text online at Main Library ISBN-10: 0199753938 ISBN-13: 978-0199753932 <br/>Haunting the Korean Diaspora, by Grace Cho Univ Of Minnesota Press (November 11, 2008) Available online via Main Library ISBN-10: 0816652759 ISBN-13: 978-0816652754<br/>War, Genocide, and Justice: Cambodian American Memory Work by Cathy J. Schlund-Vials Univ Of Minnesota Press (November 11, 2012) ISBN-10: 0816670978 ISBN-13: 978-0816670970"}], "lmod": "12/24/16 6:54 PM (CT)", "subject": "ASIAN_AM"}]