[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Locy Hall 314"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "13714", "title": "WCAS ARABIC 211-1-20 Arabic III", "class_attributes": "Specific requirements in the language<br/><br/>", "section": "13714", "instructors": [{"instructor_phone": "8474670927", "instructor_name": "Ragy H Ibrahim Mikhaeel", "instructor_addr": ""}], "topic": "", "course": "211-1", "descriptions": [{"name": "Overview of class", "value": "This is a high intermediate level course in Modern Standard Arabic. Our goal is to enhance the student's ability to read, understand and discuss Arabic writings utilizing a variety of newspaper, magazine and journal articles, documents, short stories and other materials of interest to the students and relevant to their field of study. In addition to focusing on developing reading and writing skills, a special emphasis is placed on listening and speaking:<br/>Listening:<br/>Improve your listening comprehension of: authentic audio/video texts both in Ammiya and MSA. By the end of this quarter I expect you to comprehend main points / ideas. By the end of the school year ( the three class sequence of 211), I expect you to understand thoroughly the more familiar topics and recognize main ideas of news bulletins.<br/>Speaking:<br/>have enough spoken and MSA Arabic vocab and idioms that make you able to hold conversations with native Arabic speakers on basic topics and some cultural topics. By the end of the course you will have improved your pronunciation ( clarity and intonation ) as well. You will also be more familiar with the differences between the few formal settings of using MSA as spoken Arabic and everyday spoken Arabic dialects."}, {"name": "Registration Requirements", "value": "Arabic 121-3 (with a grade of C- or above) or permission of instructor"}, {"name": "Teaching Method", "value": "Lectures, presentations and discussions.<br/>The class will meet twice a week to discuss assigned and new materials. Students will work outside of class independently and in groups, so that class time can be used efficiently. Instruction is entirely in Arabic. Students will be introduced to the sociolinguistic reality of speaking an Arab mesolect in the Arab world. Arabs have developed a mesolect that combines and refines the dialect and FuSHa in a way that made this mesolect a new medium of communication at least through satellite channels. During in-class discussions and out of class practice, feel free to shift to any dialect you feel comfortable with."}, {"name": "Evaluation Method", "value": "Grades will be based on class participation, compositions, quizzes &amp; exams, individual progress in comprehending textual material and acquired degree of fluency in the language."}, {"name": "Class Materials (Required)", "value": "1) Kristen Brustad, Mahmoud Al-Batal and Abbas al-Tonsi, Al-Kitaab fii Ta?allum al-?Arabiyya with DVDs: Part Two. 3rd edition. [ISBN: 9781589019669]<br/><br/>2) Companion website for 1.) ?students will be able to purchase access after the course starts and they have their books. <br/>Both the book and the website are published by Georgetown University Press. Year of print/publication may vary, but please verify that you are purchasing the 3rd edition.<br/><br/>3) Hans Wehr, A Dictionary of Modern Written Arabic.<br/><br/>Other resources covering media news or short stories will be provided by the instructor prior to class."}], "lmod": "10/30/16 6:58 PM (CT)", "subject": "ARABIC"}]