[{"class_mtg_info": [{"meet_t": "MoWe 9:30AM - 10:50AM", "meet_l": "Scott Hall 212"}], "school": "WCAS", "overview_of_class": "Prof. Jaime Dominguez Latino Politics, Winter 2016<br/>This course will explore these implications and the histories including the more contemporary social and political developments of Latino communities in the United States from a comparative urban framework. We will focus on the diverse experiences of America's three largest groups of Latino-origin: Mexican Americans, Puerto Ricans, and<br/>Cuban Americans.<br/>The first part of the course will examine the social construction of Latino identities and trace the historical experiences of all three groups, comparing the elements behind each group's migration and how those processes affect their incorporation in mainstream<br/>society. We also examine demographic resources and the impact of social capital on the political behavior of the Latino collectivity. Next, we turn to the development of a Latino politics, placing special emphasis on political attitudes, mobilization strategies and electoral participation. Lastly, we tackle public policy issues such as voting rights and language<br/>policy. The question that we will return to throughout the course is the degree to which and under what circumstances is it appropriate to speak of a Latino community.", "qtr": "Winter 2016", "name": "Special Topics in Political Science", "title": "WCAS POLI_SCI 390-0-20 Special Topics in Political Science", "lmod": "1/9/16 6:52 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Jaime   Dominguez", "instructor_addr": ""}], "topic": "Latino Politics", "course": "390-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Prof. Jaime Dominguez Latino Politics, Winter 2016<br/>This course will explore these implications and the histories including the more contemporary social and political developments of Latino communities in the United States from a comparative urban framework. We will focus on the diverse experiences of America's three largest groups of Latino-origin: Mexican Americans, Puerto Ricans, and<br/>Cuban Americans.<br/>The first part of the course will examine the social construction of Latino identities and trace the historical experiences of all three groups, comparing the elements behind each group's migration and how those processes affect their incorporation in mainstream<br/>society. We also examine demographic resources and the impact of social capital on the political behavior of the Latino collectivity. Next, we turn to the development of a Latino politics, placing special emphasis on political attitudes, mobilization strategies and electoral participation. Lastly, we tackle public policy issues such as voting rights and language<br/>policy. The question that we will return to throughout the course is the degree to which and under what circumstances is it appropriate to speak of a Latino community."}, {"name": "Registration Requirements", "value": "Major or minor"}, {"name": "Learning Objectives", "value": "1. To introduce students to the notion of Hispanic versus Latino. <br/>2. To learn to distinguish under what conditions the above notion's take form in the political arena<br/>3. To learn to differentiate between a racial group and an ethnic group and why it matters in the case of Latinos/Hispanics. <br/>4. To better understand why some Latino groups compared to other have different levels of political power <br/>5. How the immigration experiences of each Latino group impact identity formation in political, economic and social circles. <br/>6. The better understand the structural and institutional mechanisms that give rise to Latino political agency. <br/>7. To assess how regional variation, i.e., the Southwest versus the Midwest region, affects the politics of these communities. <br/>8. To better assess whether Latino politics is a national, state or local phenomenon."}, {"name": "Teaching Method", "value": "Lecture &amp; Discussion"}, {"name": "Evaluation Method", "value": "Class Participation-15%<br/>Book Analysis-20%<br/>Midterm-25%<br/>Final Exam-40%"}, {"name": "Class Materials (Required)", "value": "David Gutierrez. 1995. Walls and Mirrors: Mexican Americans, Mexican<br/>Immigrants and the Politics of Ethnicity. Berkeley: University of California<br/>Press.<br/>Maria de los Angeles Torres. 1999. In the Land of Mirrors: Cuban Exile<br/>Politics in the United States. Ann Arbor: University of Michigan Press.<br/>Marcelo Suarez-Orozco &amp; Mariela Paez. 2009. Latinos: Remaking<br/>America. Berkeley: University of California Press.<br/>Lisa Garcia-Bedolla. 2005. Fluid Borders: Berkeley University of<br/>California Press<br/>Amalia Pallares and Nilda Flores-Gonzalez. 2010. Marcha: Latino<br/>Chicago and the Immigrant Rights Movement"}], "path": "/class-descriptions/4610/WCAS/POLI_SCI/390-0/24420", "instructor": ["Jaime   Dominguez"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "id": "24420", "subject": "POLI_SCI"}, {"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "University Hall 102"}], "school": "WCAS", "overview_of_class": "Prof. James Mahoney, Global Development, Winter 2016<br/>This course explores the economic and social changes that have constituted \"development,\" and that have radically transformed human society.  The course focuses on both the historical experience of Europe and the contemporary experience of countries in Africa, Asia, and Latin America.  In the historical discussion, we explore the birth of the \"nation state\" as the basic organizing unit of the international system; the transition from agrarian to industrial economic systems; and the expansion of European colonialism across the globe.  In our discussion of Africa, Asia, and Latin America, we consider the legacies of colonialism for development; the ways in which countries have attempted to promote economic development and industrialization; and issues of inequality and human welfare in an increasingly globally connected world.", "qtr": "Winter 2016", "name": "Special Topics in Political Science", "title": "WCAS POLI_SCI 390-0-21 Special Topics in Political Science", "lmod": "1/9/16 6:52 PM (CT)", "section": "21", "instructors": [{"instructor_phone": "847/491-2626", "instructor_name": "James L Mahoney", "instructor_addr": "Scott Hall, Room 402, Evanston Campus"}], "topic": "Global Development", "course": "390-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Prof. James Mahoney, Global Development, Winter 2016<br/>This course explores the economic and social changes that have constituted &quot;development,&quot; and that have radically transformed human society. The course focuses on both the historical experience of Europe and the contemporary experience of countries in Africa, Asia, and Latin America. In the historical discussion, we explore the birth of the &quot;nation state&quot; as the basic organizing unit of the international system; the transition from agrarian to industrial economic systems; and the expansion of European colonialism across the globe. In our discussion of Africa, Asia, and Latin America, we consider the legacies of colonialism for development; the ways in which countries have attempted to promote economic development and industrialization; and issues of inequality and human welfare in an increasingly globally connected world."}, {"name": "Teaching Method", "value": "Lecture"}, {"name": "Class Materials (Required)", "value": "Yuval Noah Harrari, Sapiens: A Brief History of Humankind (New York: Harper Collins, 2015).<br/><br/>Robert H. Bates, Markets and States in Tropical Africa: The Political Basis of Agricultural Policies (Berkeley: University of California Press, 1981).<br/><br/>A course packet at Quartet will also be required reading."}], "path": "/class-descriptions/4610/WCAS/POLI_SCI/390-0/24421", "instructor": ["James L Mahoney"], "class_attributes": "Juniors/Seniors Only<br/><br/>", "id": "24421", "subject": "POLI_SCI"}, {"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "2122 Sheridan Rd Classroom 232"}], "school": "WCAS", "overview_of_class": "Prof. Brian Harrison \"LGBTQ Politics & Identity\" Winter 2016<br/>In the past 20 years, there has been a meteoric and unprecedented shift in attitudes in the United States toward lesbian, gay, bisexual, and transgender (LGBT) individuals and their rights, yet many obstacles to LGBT equality remain. This course will include a broad discussion of identity, public opinion, its formation, and how it is affected by the news media; contemporary attitudes toward LGBT individuals in the U.S. context; a history of the LGBT movement; and a focus on institutional constraints on issues like marriage equality, adoption rights, employment non-discrimination, and transgender equality.", "qtr": "Winter 2016", "name": "Special Topics in Political Science", "title": "WCAS POLI_SCI 390-0-22 Special Topics in Political Science", "lmod": "1/9/16 6:52 PM (CT)", "section": "22", "instructors": [{"instructor_phone": "", "instructor_name": "Brian Falb Harrison", "instructor_addr": ""}], "topic": "LGBTQ Politics & Identity", "course": "390-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Prof. Brian Harrison &quot;LGBTQ Politics &amp; Identity&quot; Winter 2016<br/>In the past 20 years, there has been a meteoric and unprecedented shift in attitudes in the United States toward lesbian, gay, bisexual, and transgender (LGBT) individuals and their rights, yet many obstacles to LGBT equality remain. This course will include a broad discussion of identity, public opinion, its formation, and how it is affected by the news media; contemporary attitudes toward LGBT individuals in the U.S. context; a history of the LGBT movement; and a focus on institutional constraints on issues like marriage equality, adoption rights, employment non-discrimination, and transgender equality."}, {"name": "Registration Requirements", "value": "Attendance at first class required; no p/n option; abc grading only"}, {"name": "Learning Objectives", "value": "As a result of this course, students will be able to: <br/><br/>Overall Course Objectives<br/>1. Analyze the progression of LGBT rights in the context of public opinion and U.S. institutions<br/>2. Think about social justice and social movements in the context of LGBT identities and politics<br/>3. Critically evaluate arguments and/or counter-arguments to contemporary debates surrounding LGBT rights<br/><br/>Specific Learning Objectives<br/>1. Read controversial and difficult material objectively and critically.<br/>2. Communicate how the LGBT movement changed over time and the social and cultural significance of those changes<br/>3. Engage with different approaches to the study of public opinion, identity politics, and LGBT politics <br/>4. Construct a narrative about identity, sexual orientation, and public opinion in the United States over the past several decades"}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "(Evaluation plan subject to change).<br/><br/>1. Class Leadership (5%)<br/>2. Short Memo Paper (10%)<br/>3. 2 medium-length papers (10% each; 20% total)<br/>4. Final Presentation and Research outline (20%)<br/>5. Final Exam/paper (35%)<br/>6. Participation: (10%)"}, {"name": "Class Materials (Required)", "value": "Students should purchase at Norris:<br/>- Blasius and Phelan, eds. 1997. We Are Everywhere. New York: Routledge. ISBN-10: 0415908590. ISBN-13: 978-0415908597<br/><br/>These are required readings but do not need to be purchased from Norris<br/>1. Mucciaroni, Gary. 2008. Same Sex, Different Politics: Successes and Failures in the Struggle Over Gay Rights. Chicago: University of Chicago Press. <br/>2. David Eisenbach, 2006. Gay Power: An American Revolution. New York: Carroll &amp; Graf. <br/>3. The Politics of Same-Sex Marriage, Craig A. Rimmerman and Clyde Wilcox, eds. Chicago: University of Chicago Press.<br/>4. LeVay, Simon. 2011. Gay, Straight, and the Reason Why. Oxford: Oxford University Press.<br/>5. Chauncey, George. 2004. Why Marriage? The History Shaping Today's Debate over Gay Equality. New York: Basic Books."}, {"name": "Class Materials (Suggested)", "value": "SUGGESTED/ reading list for semester<br/>1. LeVay, Simon. 2011. Gay, Straight, and the Reason Why. Oxford: Oxford University Press. Chapters 1-3. <br/>2. Nagoshi, Julie L., Stephan/ie Brzuzy, &amp; Heather K. Terrell. 2012. &quot;Deconstructing the Complex Perceptions of Gender Roles, Gender Identity, and Sexual Orientation among Transgender Individuals.&quot; Feminism &amp; Psychology, 22(4), 405-422. <br/>3. LeVay, Simon. 2011. Gay, Straight, and the Reason Why. Oxford: Oxford"}], "path": "/class-descriptions/4610/WCAS/POLI_SCI/390-0/24422", "instructor": ["Brian Falb Harrison"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "id": "24422", "subject": "POLI_SCI"}, {"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "555 Clark B03"}], "school": "WCAS", "overview_of_class": "Nader Sohrabi, Winter 2016, \"Rebellions and Revolutions in the Middle East\"<br/>Recent headlines give the impression that religion has always been central in the Middle Eastern upheavals.  This course takes a long-term view of social movements, rebellions, and revolutions in the Middle East to contextualize the religious turn.  Sociological concepts and comparison help us in evaluating their changing form in the past century up to the present.  Events in Turkey, Iran, and Arab states provide the basis for exploration.", "qtr": "Winter 2016", "name": "Special Topics in Political Science", "title": "WCAS POLI_SCI 390-0-23 Special Topics in Political Science", "lmod": "1/9/16 6:52 PM (CT)", "section": "23", "instructors": [{"instructor_phone": "", "instructor_name": "Nader   Sohrabi", "instructor_addr": ""}], "topic": "Rebellions and Revolutions in the Middle East", "course": "390-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Nader Sohrabi, Winter 2016, &quot;Rebellions and Revolutions in the Middle East&quot;<br/>Recent headlines give the impression that religion has always been central in the Middle Eastern upheavals. This course takes a long-term view of social movements, rebellions, and revolutions in the Middle East to contextualize the religious turn. Sociological concepts and comparison help us in evaluating their changing form in the past century up to the present. Events in Turkey, Iran, and Arab states provide the basis for exploration."}], "path": "/class-descriptions/4610/WCAS/POLI_SCI/390-0/27489", "instructor": ["Nader   Sohrabi"], "class_attributes": "", "id": "27489", "subject": "POLI_SCI"}, {"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "Annenberg Hall G15"}], "school": "WCAS", "overview_of_class": "Sociology 215-0-20/POLI SCI 390-0-25 \"Economy and Society\" Professor Nader Sohrabi, Winter 2016<br/>Introduction to sociological approaches to economic life. Topics include property rights, illegal markets, money, economic inequalities, direct sales, and boycotts.", "qtr": "Winter 2016", "name": "Special Topics in Political Science", "title": "WCAS POLI_SCI 390-0-25 Special Topics in Political Science", "lmod": "1/9/16 6:52 PM (CT)", "section": "25", "instructors": [{"instructor_phone": "", "instructor_name": "Nader   Sohrabi", "instructor_addr": ""}], "topic": "", "course": "390-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Sociology 215-0-20/POLI SCI 390-0-25 &quot;Economy and Society&quot; Professor Nader Sohrabi, Winter 2016<br/>Introduction to sociological approaches to economic life. Topics include property rights, illegal markets, money, economic inequalities, direct sales, and boycotts."}, {"name": "Class Materials (Required)", "value": "Booklist TBA. Contact Professor directly."}], "path": "/class-descriptions/4610/WCAS/POLI_SCI/390-0/27956", "instructor": ["Nader   Sohrabi"], "class_attributes": "", "id": "27956", "subject": "POLI_SCI"}]