[{"school": "WCAS", "overview_of_class": "Prof. Jaime Dominguez Latino Politics, Winter 2016<br/>This course will explore these implications and the histories including the more contemporary social and political developments of Latino communities in the United States from a comparative urban framework. We will focus on the diverse experiences of America's three largest groups of Latino-origin: Mexican Americans, Puerto Ricans, and<br/>Cuban Americans.<br/>The first part of the course will examine the social construction of Latino identities and trace the historical experiences of all three groups, comparing the elements behind each group's migration and how those processes affect their incorporation in mainstream<br/>society. We also examine demographic resources and the impact of social capital on the political behavior of the Latino collectivity. Next, we turn to the development of a Latino politics, placing special emphasis on political attitudes, mobilization strategies and electoral participation. Lastly, we tackle public policy issues such as voting rights and language<br/>policy. The question that we will return to throughout the course is the degree to which and under what circumstances is it appropriate to speak of a Latino community.", "name": "Special Topics in Political Science", "section": "20", "topic": "Latino Politics", "course": "390-0", "meeting_time": ["MoWe 9:30AM - 10:50AM"], "path": "/class-descriptions/4610/WCAS/POLI_SCI/390-0/24420", "instructor": ["Jaime   Dominguez"], "id": "24420", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "Prof. James Mahoney, Global Development, Winter 2016<br/>This course explores the economic and social changes that have constituted &quot;development,&quot; and that have radically transformed human society.  The course focuses on both the historical experience of Europe and the contemporary experience of countries in Africa, Asia, and Latin America.  In the historical discussion, we explore the birth of the &quot;nation state&quot; as the basic organizing unit of the international system; the transition from agrarian to industrial economic systems; and the expansion of European colonialism across the globe.  In our discussion of Africa, Asia, and Latin America, we consider the legacies of colonialism for development; the ways in which countries have attempted to promote economic development and industrialization; and issues of inequality and human welfare in an increasingly globally connected world.", "name": "Special Topics in Political Science", "section": "21", "topic": "Global Development", "course": "390-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4610/WCAS/POLI_SCI/390-0/24421", "instructor": ["James L Mahoney"], "id": "24421", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "Prof. Brian Harrison &quot;LGBTQ Politics &amp; Identity&quot; Winter 2016<br/>In the past 20 years, there has been a meteoric and unprecedented shift in attitudes in the United States toward lesbian, gay, bisexual, and transgender (LGBT) individuals and their rights, yet many obstacles to LGBT equality remain. This course will include a broad discussion of identity, public opinion, its formation, and how it is affected by the news media; contemporary attitudes toward LGBT individuals in the U.S. context; a history of the LGBT movement; and a focus on institutional constraints on issues like marriage equality, adoption rights, employment non-discrimination, and transgender equality.", "name": "Special Topics in Political Science", "section": "22", "topic": "LGBTQ Politics &amp; Identity", "course": "390-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4610/WCAS/POLI_SCI/390-0/24422", "instructor": ["Brian Falb Harrison"], "id": "24422", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "Nader Sohrabi, Winter 2016, &quot;Rebellions and Revolutions in the Middle East&quot;<br/>Recent headlines give the impression that religion has always been central in the Middle Eastern upheavals.  This course takes a long-term view of social movements, rebellions, and revolutions in the Middle East to contextualize the religious turn.  Sociological concepts and comparison help us in evaluating their changing form in the past century up to the present.  Events in Turkey, Iran, and Arab states provide the basis for exploration.", "name": "Special Topics in Political Science", "section": "23", "topic": "Rebellions and Revolutions in the Middle East", "course": "390-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4610/WCAS/POLI_SCI/390-0/27489", "instructor": ["Nader   Sohrabi"], "id": "27489", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "Professor Mary DIetz, Feminist Theory, Winter 2016<br/>Ever since Simone de Beauvoir declared &quot;One is not born a woman but becomes one&quot; (The Second Sex, 1949)Sex, 1949) feminist theory has been a political and scholarly endeavor in tension with its key concepts (e.g. female, gender, sex, sexuality, slavery, woman, women, lesbian, queer, feminine/masculine, patriarchy, embodiment, &quot;feminism&quot;), and even in struggle with the identity of its very own subject. Imagine &quot;woman&quot;: Is this a shared, coherent, and stable category born of female bodies marked as inferior and subordinate to men ? Or is it a fictitious unity that disintegrates once confronted with the manifold diversities of race, ethnicity, (trans)nationality, age, and class? Perhaps not all women have the same gender. Consider &quot;sex&quot;: does the binary notion of sexual difference (male/female; man/woman) paradoxically undercut feminist goals by reaffirming the very heterosexual matrix they otherwise seeks to disrupt? If so, and &quot;woman&quot; has meaning only in heterosexual systems of thought, then should we conclude that when it comes to female sexuality lesbians are not women? Let's say they're not: Does that mean that all lesbians therefore have the same sexuality, passions, and modes of desire? If so, how &quot;queer&quot; is that? And what about &quot;gender&quot;? Is it the cultural construction of a foundational already &quot;sexed&quot; body? Or are sex and the sexed body only the props of an artificially &quot;natural&quot; duality (m/f) that legitimates the subjugation of female to male and women to men? In that case, if &quot;gender&quot; is only a harsh imposition that robs many persons (called &quot;women&quot;) of what belongs to them by right, then must gender be destroyed? Or might we think &quot;gender&quot; not as a fixed relation of subordination but as the creation of &quot;performative possibilities&quot; that potentially subvert the representations and restrictions of compulsory heterosexuality? Yet if feminism risks &quot;gender&quot; as purely performative and up for grabs, what happens to the identity of the feminist subject? Imagine there's no such thing as &quot;women&quot;. Is there anything left for feminism to liberate (or dominate)? If not, then what's the point of feminist politics? These are some of the theoretical, conceptual, and political questions with which feminist theories and theorists contend (in mighty turbulence!) after Beauvoir. The aim of this course is to clarify and assess these contestations through the reading and interpretation of a wide array of feminist thinkers and texts from the 1970s to the present. Without striving for any final settlements or total resolutions to these questions (much less &quot;right answers&quot;) we'll make an effort to draw from each of our thinkers and texts insights, perspectives, and points of view that challenge, or at least encourage us to consider more deeply, our own assumptions, presuppositions, and worldviews (feminist and otherwise).", "name": "Special Topics in Political Science", "section": "24", "topic": "Feminist Theory", "course": "390-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4610/WCAS/POLI_SCI/390-0/27857", "instructor": ["Mary Golden Dietz"], "id": "27857", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "Sociology 215-0-20/POLI SCI 390-0-25 &quot;Economy and Society&quot; Professor Nader Sohrabi, Winter 2016<br/>Introduction to sociological approaches to economic life. Topics include property rights, illegal markets, money, economic inequalities, direct sales, and boycotts.", "name": "Special Topics in Political Science", "section": "25", "topic": "", "course": "390-0", "meeting_time": ["MoWe 11:00AM - 12:20PM"], "path": "/class-descriptions/4610/WCAS/POLI_SCI/390-0/27956", "instructor": ["Nader   Sohrabi"], "id": "27956", "subject": "POLI_SCI"}]