[{"class_mtg_info": [{"meet_t": "We 2:00PM - 4:50PM", "meet_l": "COMM_ST Sem Rm 207 - 1815 CH"}], "school": "SoC", "enrl_requirement": "", "qtr": "Fall 2016", "name": "16267", "title": "SoC COMM_ST 475-0-1 Seminar in the Rhetoric of Contemp Cult", "class_attributes": "", "section": "16267", "instructors": [{"instructor_phone": "847/491-5853", "instructor_name": "Dilip P Gaonkar", "instructor_addr": "2240 Campus Dr. Rm 2-148 Frances Searle Building"}], "topic": "Rhetoric and Political Theory", "course": "475-0", "descriptions": [{"name": "Overview of class", "value": "The seminar will focus on the revival ofinterest in rhetoric in contemporary political theory in the last decade. This revival is part of a larger intellectual movement known as the &quot;rhetoric of Inquiry&quot; or the &quot;rhetorical turn in the human sciences&quot; that has been underway since the early 1980s. The initial excitement about the &quot;rhetorical turn&quot; was most noticeable in disciples such as anthropology, history and the science studies, but now that excitement appears to have dissipated considerably in those disciplines. By contrast, while the &quot;rhetorical turn&quot; in political theory/studies was rather slow in emerging in the early phase, it has become highly visible in recent years and continues to gather momentum in terms scholarly publications by historians of political thought and political theorists.<br/> <br/>A significant number of recently published books, monographs and essays explore how Renaissance and early modern political thinkers such as Machiavelli, Hobbes, Rousseau and Vico (as opposed to the usual suspects from the classical period, such as Plato, Aristotle and Cicero) were deeply concerned and engaged with the rhetorical tradition. The place of rhetoric in the evolution of Western political thought, starting from its very beginnings in the Greco-Roman period and moving, after a series of interruptions, through the Renaissance and early modern period into the age of revolutions, is now fully recognized and acknowledged, even if not adequately understood and interpreted. Further, rhetorical considerations are increasingly prominent in scholarly reflections and writings on arguably the most dominant and vexing political issue in the contemporary world, the saga of democracy, as it traverses the globe, generating copious discourses-theoretical as well the ideological-about its promises, perils and possibilities.<br/> <br/>This seminar will focus on a set of issues that have surfaced regarding the pivotal function of rhetoric in the history of political thought and also contemporary political theory. These include, but are not limited to, questions about the performative/constitutive dimensions of political language, the role of affect and emotion in political life, the relationship between logic and style in political argument, the play of contingency, experience and prudence in political judgment, and the rhetorical structure of political texts as evinced in the unavoidable gap between what they say and what they do.<br/> <br/>Finally, we will read and discuss, among other texts, a number of unpublished essays from Oxford Handbook on Rhetoric and Political Theory I am currently editing with Keith Topper (University of California, Irvine). This volume of 35 essays by a series of distinguished scholars in political theory, philosophy, history of ideas, and literary studies has been in preparation for the last 7 years. These essays cover a wide range of political thinkers and their explicit and implicit engagement with rhetoric and the Western rhetorical tradition?Plato, Aristotle, Cicero, St. Augustine, Machiavelli, Hobbes, Locke, Rousseau, Hegel, Marx, Vico, Spinoza, Tocqueville, Arendt, Strauss, Derrida, Fannon and so on."}], "lmod": "10/30/16 6:48 PM (CT)", "subject": "COMM_ST"}]