[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Annenberg Hall G15"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "22881", "title": "WCAS POLI_SCI 341-0-20 International Political Economy", "class_attributes": "", "section": "22881", "instructors": [{"instructor_phone": "847 4912589", "instructor_name": "Stephen C Nelson", "instructor_addr": "601 University Place # 240"}], "associated_classes": [{"component": "DIS", "room": "Fisk Hall 114", "meeting_time": "Th 5:00PM - 5:50PM"}, {"component": "DIS", "room": "University Hall 118", "meeting_time": "Th 5:00PM - 5:50PM"}, {"component": "DIS", "room": "Locy Hall 106", "meeting_time": "Th 6:00PM - 6:50PM"}, {"component": "DIS", "room": "Parkes Hall 213", "meeting_time": "Th 6:00PM - 6:50PM"}, {"component": "DIS", "room": "University Hall 318", "meeting_time": "Fr 10:00AM - 10:50AM"}, {"component": "DIS", "room": "University Hall 418", "meeting_time": "Fr 11:00AM - 11:50AM"}], "topic": "", "course": "341-0", "descriptions": [{"name": "Overview of class", "value": "This course focuses on the factors that shape foreign economic policies. Why do governments choose to protect some industries behind high tariff walls while leaving others exposed to the vagaries of international competition? Why is the dollar the world's reserve currency - and will it continue to serve that function? How do firms evaluate the benefits and risks of overseas investments? Are multinational corporations usurping the power of the state? Have the series of crises over the past half decade - the subprime meltdown, global credit crunch, and the Eurozone sovereign debt crisis - shifted the distribution of global economic and political power? Does international trade and investment make military conflict less or more likely? <br/><br/>In this course we will develop an analytical toolkit to provide some insight into these and other questions, paying particular attention to evaluating the theoretical arguments with two types of evidence: qualitative and historical and quantitative and cross-national."}, {"name": "Registration Requirements", "value": "Prerequisite: Political Science 240 (International Relations)"}, {"name": "Learning Objectives", "value": "There are two main purposes in this course: (1) students will be able to demonstrate a solid grasp on different theoretical approaches to the study of IPE, the degree of international economic integration in three core issue areas (trade, finance, and foreign direct investment), and the major political factors that shaped international economic relations since the 1840s; (2) over the course of the quarter students will hone their ability to evaluate different explanations in light of evidence."}, {"name": "Teaching Method", "value": "Lecture with teaching assistant-led discussion sections"}, {"name": "Evaluation Method", "value": "Section participation: 15%; response papers: 10% Midterm exam: 35%; Final Exam: 40%"}, {"name": "Class Materials (Required)", "value": "Jeffry A. Frieden, Global Capitalism: Its Fall and Rise in the Twentieth Century (New York: Norton, 2006)<br/>John Ravenhill ed., Global Political Economy (Fourth Edition) (Oxford University Press, 2014)"}], "lmod": "12/29/16 7:04 PM (CT)", "subject": "POLI_SCI"}]