[{"class_mtg_info": [{"meet_t": "Mo 6:15PM - 9:15PM", "meet_l": "Tech Institute Lecture Room 4"}], "school": "SCS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "27533", "title": "SCS BIOL_SCI 219-CN-62 Cell Biology", "class_attributes": "", "section": "27533", "instructors": [{"instructor_phone": "847/491-5061", "instructor_name": "Michele M McDonough", "instructor_addr": "Hogan Hall, Room - 2-100"}], "topic": "", "course": "219-CN", "descriptions": [{"name": "Overview of class", "value": "This course is the third course in a four-course sequence that is completed by BIOL SCI 308 in the spring. The cell biology course covers mechanisms that cells use to compartmentalize and transport proteins, to move, to regulate growth and death, and to communicate with their environments. <br/><br/>This course was formerly BIOL SCI 216. Students who have previously taken BIOL SCI 216 should not register for this course. A lab course, BIOL SCI 221 Cellular Processes Laboratory, may be taken concurrently with this course."}, {"name": "Registration Requirements", "value": "Prerequisite: CHEM 103"}, {"name": "Learning Objectives", "value": "By the end of the class, a student is expected to be able to:<br/>Explain the importance of membrane function as well as the role of membrane lipids, protein components and membrane organization in eukaryotic cells <br/>Explain how cellular components are targeted and distributed to different regions and compartments of a cell<br/>Explain how the different components of the cytoskeleton support a variety of cell functions, such as cell shape, division, movement, sensing the environment, and cell-cell communication<br/>Explain how cells send, receive, and respond to signals from their environment, including other cells<br/>Explain how cells coordinate and regulate cell division<br/>Explain how an inbalance or mutation in normal cell processes can lead to cancer and other disease states"}, {"name": "Teaching Method", "value": "Class participation <br/>Lecture <br/>Online work"}, {"name": "Evaluation Method", "value": "Multiple quizzes<br/>2 exams<br/>Class participation<br/>Short homework questions"}, {"name": "Class Materials (Required)", "value": "Texts may include the following. Visit the campus bookstore or its website to confirm materials for the course. <br/><br/>Essential Cell Biology by Alberts et al., 4th edition 2013 Edition, Garland Publishers, ISBN# 9780815344544"}], "lmod": "12/25/16 6:50 PM (CT)", "subject": "BIOL_SCI"}]