[{"class_mtg_info": [{"meet_t": "MoWeFr 11:00AM - 12:20PM", "meet_l": "Annenberg Hall G15"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "21021", "title": "WCAS ECON 325-0-20 Economic Growth &amp; Development", "class_attributes": "", "section": "21021", "instructors": [{"instructor_phone": "", "instructor_name": "Marti   Mestieri Ferrer", "instructor_addr": ""}], "topic": "", "course": "325-0", "descriptions": [{"name": "Overview of class", "value": "How can economies grow rich? And how may economies fail to grow rich? These are fundamental questions in economics. Even Adam Smith alluded to them in the title of his book, &quot;The Wealth of Nations.&quot; These broad questions are the main focus of this course. No one can claim to have the answer to these difficult questions. However, economic theories can inform us on some important determinants of long-run growth patterns and development performances. In this course, we will cover some of the leading theories proposed to understand different aspects of long-run growth and development: Saving and capital accumulation, technological change, structural change, demographic transition, income distribution, imperfect credit markets, etc. <br/><br/>Detailed Contents of the Class: 1. Facts and Measurement 2. Traditional Theories of Economic Growth (Harrod-Domar, Solow) 3. New Growth Theories (Human Capital, Endogenous Technological Progress) 4. History, Expectations and Development (Complementarities, Increasing Returns and Poverty traps) 5. Credit Markets (Alternative micro underpinnings and related theories) 6. Inequality and Growth (Measurement, Kuznets Hypothesis, Interaction with Credit Markets) 7. Population Growth and Economic Development (Demographic Transition, Unified Growth Theory) 8. International Linkages: Trade and Financial Markets (time permitting) 9. Political Economy of Growth (time permitting)"}, {"name": "Registration Requirements", "value": "Economics 310-1, 310-2, 311-1, and 281 (or my permission). This course is designed for economics majors. I assume that you are familiar with the basic concepts and tools in economics. The class will be focused on the study of a series of facts through the lens of different economic models."}, {"name": "Teaching Method", "value": "Lectures and discussion section."}, {"name": "Evaluation Method", "value": "Based on two in-class quizzes, scheduled to be done in-class. There can be a final exam for students with a lower grade than a C in the average of the two quizzes. Quiz-I covers the materials in the first half (eight lectures) and Quiz-II covers those in the second half (eight lectures). These quizzes count equally. Your performance is judged based on the distribution of the simple sum of the numerical scores of the two quizzes. The students who obtain a C or better are exempt from the final exam. Those who do not perform well enough in these two quizzes are given the opportunity to improve their final grade to a C by taking the final exam."}, {"name": "Class Materials (Required)", "value": "Class notes posted online."}, {"name": "Class Materials (Suggested)", "value": "Development Economics by Debraj Ray; Princeton University Press, 1998. ISBN-13: 978-0691017068<br/>The Mystery of Economic Growth by Elhanan Helpman, 2004. ISBN-13: 9780674015722."}, {"name": "Class Notes", "value": "In this course, we will not discuss much on the microeconomic institutions and market structures that are specific of developing countries. These questions are analyzed in Econ 326."}], "lmod": "12/25/16 6:58 PM (CT)", "subject": "ECON"}]