[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "SOCIOL Sem Rm 107 - 1812 Chi"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "17487", "title": "WCAS POLI_SCI 390-0-22 Special Topics in Political Science", "class_attributes": "", "section": "17487", "instructors": [{"instructor_phone": "847/491-3719", "instructor_name": "Ann Shola   Orloff", "instructor_addr": "1808 Chicago Ave. Rm. 201"}], "topic": "Gender, Social Movements, Poli Particip &amp; Policy", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "Prof. Orloff &quot;Gender, Social Movements, Political Participation and Policy&quot; Fall 2016<br/>In this class, we will investigate how gender - as a set of relations, identities and cultural schemas - shapes politics, including political participation and representation, the formation of social movements (e.g., the feminist and anti-ERA movements), and social policy, as well as how, in turn, political institutions and policy shape gender. We aim to understand gendered politics and policy from both &quot;top down&quot; and &quot;bottom up&quot; perspectives. And we will take advantage of the fact that we are in the middle of a Presidential election to examine gendered politics in the contemporary United States."}, {"name": "Teaching Method", "value": "The class will be a mix of lectures and discussion."}, {"name": "Evaluation Method", "value": "Exams, short final paper, class participation."}, {"name": "Class Materials (Required)", "value": "This is a tentative list of books; please confirm before purchase.<br/><br/>Dorothy Sue Cobble, Linda Gordon and Astrid Henry, Feminism Unfinished: A Short, Surprising History of American Women's Movements (Liveright, 2014).<br/>ISBN-13: 978-1631490545<br/><br/>R.W. Connell, Masculinities (Berkeley: University of California Press, second edition, 2005).<br/>ISBN-13: 978-0520246980<br/><br/>We will also read several articles; these readings will be available online on Canvas."}, {"name": "Class Materials (Suggested)", "value": "As a supplemental (not required) text for those who would like some background in gender studies, Raewyn Connell's Gender in World Perspective (second edition) Malden, MA: Polity, 2009) is a good, short introduction. ISBN-13: 9780745645674"}], "lmod": "10/30/16 7:08 PM (CT)", "subject": "POLI_SCI"}]