[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Harris Hall L06"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-registration is reserved for students majoring or minoring in Asian Languages &amp; Cultures, Asian Studies, or International Studies.", "qtr": "Spring 2017", "name": "32521", "title": "WCAS ASIAN_LC 290-0-21 Introductory Topics in Asian Languages and Cultures", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "32521", "instructors": [{"instructor_phone": "847/467-5829", "instructor_name": "Daniel Joseph Majchrowicz", "instructor_addr": "1880 Campus Drive, Kresge Hall, Office 4-423"}], "topic": "Burning Embers and Burka Avengers: Society, the Ar", "course": "290-0", "descriptions": [{"name": "Overview of class", "value": "This class will an offer an introduction to the literature, arts and popular culture of Pakistan with a focus on the productive - if often fraught- relationship between artistic creation, social reform and political change. Looking beyond the confines of the modern nation-state, our examination will stretch from the leftist modernism of the 1930s to contemporary trends, including the recent appearance of hip-hop, &quot;Sufi rock,&quot; and animated programs such as Burka Avenger. The course will examine major movements and figures, reading them with reference to the historical context in which they were produced. While our primary focus will be on the written word - novels, short stories, and poetry - we will also devote significant attention to the place of music, television and film. By the end of the course, students will have a strong knowledge of Pakistan's political, cultural and artistic history, as well as its contemporary relevance. They will also gain a critical understanding of the relationship between the arts, politics and social reform."}, {"name": "Learning Objectives", "value": "- Critical engagement with the socio-political history of Pakistan<br/>- A familiarity with major movements and trends in the arts in Pakistan<br/>- A theoretical understanding of the relationship between art, criticism, censorship and the state"}, {"name": "Teaching Method", "value": "Lecture/discussion"}, {"name": "Evaluation Method", "value": "Paper submissions, short response"}, {"name": "Class Materials (Required)", "value": "Materials will be available on Canvas."}], "lmod": "2/8/17 6:40 PM (CT)", "subject": "ASIAN_LC"}]