[{"class_mtg_info": [{"meet_t": "MoWe 12:30PM - 1:50PM", "meet_l": "Kresge 4438 Asian LC Sem Rm"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Prerequisite: Students must have passed Japanese 211-3 with at least a C- or  be placed in according to placement test results.<br/><br/>Prerequisite: Students must have passed Japanese 211-3 with at least a C- or  be placed in according to placement test results.", "qtr": "Winter 2017", "name": "22465", "title": "WCAS JAPANESE 310-0-20 Special Topics in Reading Japanese Literature in Japanese", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "22465", "instructors": [{"instructor_phone": "8474912762", "instructor_name": "Junko   Sato", "instructor_addr": "1880 Campus Drive, Kresge Hall, Office 4-347"}, {"instructor_phone": "847/467-0283", "instructor_name": "Patrick James Noonan", "instructor_addr": "Kresge Hall - Office 4-550"}], "topic": "Responses to the Pacific War: Trauma, Memory, and", "course": "310-0", "descriptions": [{"name": "Overview of class", "value": "Topic: Japanese Responses to the Pacific War: Trauma, Memory, and Accountability<br/>This is an advanced Japanese language course that considers how Japanese writers responded to the Pacific War and its aftermath.  We will study works representing the atomic bombings of Hiroshima and Nagasaki, experiences on the frontline, and attempts to account for both personal and collective involvement in the abuses of war.  We will pay particular attention to how the form of literature reflects experiences of trauma and serves to accept or defer responsibility.  Primary readings will be in Japanese and discussion will be in English. Particular attention will be given to developing students' reading and translation skills."}, {"name": "Registration Requirements", "value": "Prerequisites: grade of at least C- in 211-3 or equivalent, or by placement test"}, {"name": "Learning Objectives", "value": "? Develop the Japanese vocabulary and understanding of grammatical structures to analyze and discuss works of literature, film, criticism and other advanced material<br/>? Develop strategies for translating works of Japanese into English<br/>? Enhance understanding of diverse literary styles in Japanese in order to grasp aesthetic and communicative nuances<br/>? Gain familiarity with the ways in which Japanese literature reflected and intervened in issues facing Japan, Asia, and the world in the aftermath of WWII"}, {"name": "Teaching Method", "value": "Discussion: Discussion and Lecture<br/>In-class discussion and lecture"}, {"name": "Evaluation Method", "value": "Attendance and Participation: 25%<br/>Weekly Assignments: 20%<br/>Midterm Exam: 25% <br/>Final Project (undergrad)/ Final Paper (grad): 30%"}, {"name": "Class Materials (Required)", "value": "Reader<br/>Rubin, Jay. Making Sense of Japanese. (New York: Kodansha, 2012). <br/>Tomomatsu Etsuko and Miyamoto Jun. Donna toki, dô tsukau nihongo hyôgen bunkei <br/>500 (Tokyo: Aruku, 1996)."}], "lmod": "12/25/16 7:02 PM (CT)", "subject": "JAPANESE"}]