[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "Frances Searle Building 1421"}], "school": "SoC", "overview_of_class": "Exploration of the fundamentals of clinical methods, including the concepts of behavior change, session design, and functional, client-focused treatment. Discussion of data collection and documentation methods. Introduction to the assessment process.", "qtr": "Fall 2017", "name": "Introduction to Clinical Methods", "title": "SoC CSD 472-0-20 Introduction to Clinical Methods", "lmod": "5/9/17 7:00 PM (CT)", "section": "20", "topic": "", "course": "472-0", "enrl_requirement": "Enrollment Requirements: REASON: Pre-registration is not allowed for this class. Please try again during regular registration.<br/><br/>Registration is reserved for SLL Speech &amp; Language Pathology students", "descriptions": [{"name": "Overview of class", "value": "Exploration of the fundamentals of clinical methods, including the concepts of behavior change, session design, and functional, client-focused treatment. Discussion of data collection and documentation methods. Introduction to the assessment process."}, {"name": "Learning Objectives", "value": "Upon successful completion of this course, the student should be able to do the following:<br/><br/>1. Explain and apply the concept of treatment and apply to SLP service provision <br/>2. Differentiate between treatment targets and treatment procedures <br/>3. Explain the components of behavior modification and identify components during observation <br/>4. Describe and differentiate among the concepts of reinforcement (positive and negative), feedback, and punishment and identify instances of use during observation <br/>5. Describe different methods and schedules of reinforcement and identify instances of use during observation <br/>6. Describe relevant information needed from client medical history, diagnostic information, and prior treatment <br/>7. Identify and differentiate between long-term and short-term goals <br/>8. Identify and create the components of behavioral objectives <br/>9. Describe the concepts of functionality and client-centeredness when planning treatment <br/>10. Describe the rationale and method for obtaining baselines and/or initial treatment data <br/>11. Describe the concept of modeling, including immediate modeling, delayed modeling, and fading and identify instances of use during observation <br/>12. Describe the concept of shaping behaviors and identify instances of use during observation <br/>13. Describe the concepts of verbal and nonverbal prompting or cueing and identify instances of use during observation <br/>14. Describe the concept of hierarchy as it relates to goal complexity <br/>15. Explain proxemics as they relate to session design and identify instances of use during observation <br/>16. Describe the concepts of discrimination, generalization, and maintenance <br/>17. Describe the principles of adult learning as they apply to supporting the primary communication partner to implement intervention strategies during everyday settings and interactions <br/>18. Compare and contrast efficacy of a variety of activities and materials in eliciting target behaviors and identify instances of use during observation <br/>19. List and describe methods for accurate and reliable data recording during treatment sessions and identify instances of use during observation <br/>20. Describe elements of a SOAP note and create a SOAP note based on observation experience <br/>21. Describe elements of a Session Plan and create a sample Session Plan based on observation experience <br/>22. Explain the importance of and practice self-assessment skills and goals setting behaviors for personal professional development <br/>23. Describe and differentiate among the concepts of screening, assessment, and diagnosis <br/>24. Describe and differentiate among the concepts of diagnosis, prognosis, and eligibility <br/>25. Explain the purpose and goals of assessment <br/>26. Describe the utility of various types of assessment data, including standardized and non-standardized assessments, communication sampling, parental/caregiver report, observation, and interview <br/>27. Describe components of and methods for comprehensive oral peripheral examinations <br/>28. Describe documentation requirements for an assessment and differentiate report needs based on service setting <br/>29. Identify cultural considerations necessary when providing services to diverse populations"}, {"name": "Class Materials (Required)", "value": "Required Texts:<br/><br/>Hegde, M. N., & Davis, D. (2010). Clinical Methods and Practicum in Speech-Language Pathology, 5th Edition. Clifton Park, NY: Cengage Learning. ($153.99)<br/><br/>Roth, F., & Worthington, C. (2015). Treatment Resource Manual for Speech Language Pathology, 5th Edition. Clifton Park, NY: Cengage Learning. ($158.48)<br/><br/>Shankman, M. et al (2015). Emotionally Intelligent Leadership for Students: Deluxe Student Set, 2nd Edition. SanFrancisco, CA: Jossey-Bass. ($51.00)"}], "instructor": ["Leigh   Cohen"], "class_attributes": "", "id": "11046", "subject": "CSD"}, {"class_mtg_info": [{"meet_t": "MoTh 8:00AM - 9:20AM", "meet_l": "Frances Searle Building 1421"}], "school": "SoC", "overview_of_class": "", "qtr": "Fall 2017", "name": "Introduction to Clinical Methods", "title": "SoC CSD 472-0-21 Introduction to Clinical Methods", "lmod": "5/9/17 7:00 PM (CT)", "section": "21", "topic": "", "course": "472-0", "enrl_requirement": "Enrollment Requirements: REASON: Pre-registration is not allowed for this class. Please try again during regular registration.<br/><br/>Registration is reserved for SLL Speech &amp; Language Pathology students", "descriptions": [{"name": "Overview of Class", "value": "Contact the department for further information"}], "instructor": ["Leigh   Cohen"], "class_attributes": "", "id": "11047", "subject": "CSD"}]