[{"school": "WCAS", "overview_of_class": "Examining the remarkable career of Diego Velázquez (1599-1660) in Madrid as a case study, this undergraduate seminar argues the importance of place in the formation of an artist. Velázquez's technique as a painter developed first in Seville, where he attained youthful renown as a painter of remarkably crisp, naturalistic pictures. After arriving in Madrid in 1623, the court of the Spanish Habsburg monarchy then taking on the appearance of a monumental city, his technique became more spontaneous and painterly and it would continue to evolve over nearly four decades of work as royal painter and curator of the royal art collection. The seminar and research projects by its participants will consider the significance of the court?as both a historical place and a period concept?in the production of art and other cultural undertakings by Velázquez and his contemporaries in seventeenth-century Madrid. Research papers might explore portraiture, art installation and display, printmaking and book design, or artistic exchange among other topics. Reading knowledge of Spanish is strongly recommended. Enrollment is open to graduate students in the humanities and others interested in court studies.", "name": "Undergraduate Seminar", "section": "20", "topic": "", "course": "390-0", "meeting_time": ["Fr 10:00AM - 12:50PM"], "path": "/class-descriptions/4620/WCAS/ART_HIST/390-0/36697", "instructor": ["Jesus R Escobar"], "id": "36697", "subject": "ART_HIST"}, {"school": "WCAS", "overview_of_class": "In this course we will address the role of scientific examination in investigating production and use of art across time and space. The basics of art production out of ceramic, stone, metal, glass, pigments and their binding media will be detailed with the general aim of providing insights into the process of making art; charting the chaîne opératoire from the procurement and processing of raw materials, their trade, and finally how they are formed into a finished object.", "name": "Undergraduate Seminar", "section": "21", "topic": "", "course": "390-0", "meeting_time": ["MoWe 9:30AM - 10:50AM"], "path": "/class-descriptions/4620/WCAS/ART_HIST/390-0/36698", "instructor": ["Marc Sebastian Walton"], "id": "36698", "subject": "ART_HIST"}]