[{"school": "WCAS", "overview_of_class": "Much recent fiction, film and theory are concerned with representing the Internet and the World Wide Web. Sometimes cyberspace is depicted as a continuation of previous media such as television, cinema or telephone, but often it is envisioned as a new frontier. This course will examine the ways in which virtual media appears in cultural discourses. With a focus on gender, race and sexuality, we will read authors such as William Gibson, Neal Stephenson and Nalo Hopkinson, see films including Ghost in the Shell and The Matrix, and read media theory that considers the what dominant US perceptions of the internet are reflected in its construction and in the circulation of popular media images. Our guiding questions will include the following: In what ways are these narratives shaping collective perceptions of the Internet? How have virtual technologies challenged experiences of language, gender, community and identity?", "name": "Gender, Sexuality, and Digital Technologies", "section": "20", "topic": "Imagining the Internet: GNDR, Sex, Race, Ethnicity", "course": "374-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4650/WCAS/GNDR_ST/374-0/24161", "instructor": ["Jillana B Enteen"], "id": "24161", "subject": "GNDR_ST"}, {"school": "WCAS", "overview_of_class": "How do sexuality, race, gender, and class shape new media? This course explores the role of intersectional identity in technological transformations in media, focusing on the transition from analog to digital. Students will read historical case studies and theoretical essays on such topics as how social media affect how queer users interact and self-identify, how race influences cable TV distribution, and how gender shaped early radio. The course is organized into three key areas of inquiry - culture, organization, and technology - with the goal of understanding the complex ways they interrelate.", "name": "Gender, Sexuality, and Digital Technologies", "section": "21", "topic": "Queer New Media", "course": "374-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4650/WCAS/GNDR_ST/374-0/24162", "instructor": ["Aymar Christian Jean"], "id": "24162", "subject": "GNDR_ST"}]