[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Kresge Centennial Hall 2-425"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "32525", "title": "WCAS ASIAN_LC 390-0-21 Advanced Topics in Asian Languages and Cultures", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "32525", "instructors": [{"instructor_phone": "847/467-7419", "instructor_name": "Mi-Ryong   Shim", "instructor_addr": "1880 Campus Drive, Kresge Hall, Office 4-415"}], "topic": "Imagining Asia", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "Since Edward Said's seminal work Orientalism, a large body of scholarship has persuasively demonstrated how the &quot;Orient&quot; emerged as an imagined construct of Euro-American texts. But how did the so-called natives of the &quot;Orient&quot; write about this entity? This course explores how 20th century writers across East and South Asia envisioned &quot;Asia&quot; in response to Western imperial discourse and also in relation to their own diverse aesthetic and political aims. We will read essays written by major poets, essayists, and political figures such as Rabindranath Tagore, Sun Yat Sen, Okakura Kakuz?, and Yi T'ae-jun. We will examine themes including multiple visions for constructing an international community, Western and Japanese imperialisms, and the aesthetics of Asian traditions."}, {"name": "Learning Objectives", "value": "Students will gain a nuanced understanding of how thinkers in East and South Asia responded to experiences of colonialism and other forms of cultural encounter. Students will hone critical thinking skills by analyzing, evaluating, and synthesizing information from diverse historical and literary sources."}, {"name": "Teaching Method", "value": "Discussion with limited lecture on context"}, {"name": "Evaluation Method", "value": "Participation, attendance, preparation for class.<br/>Response papers.<br/>Midterm and final analytical papers."}, {"name": "Class Materials (Required)", "value": "Required books available through the campus bookstore<br/>PDFs of other readings accessible through Canvas course"}], "lmod": "2/20/17 6:43 PM (CT)", "subject": "ASIAN_LC"}]