[{"class_mtg_info": [{"meet_t": "Tu 2:00PM - 4:50PM", "meet_l": "Fisk Hall 307"}], "school": "JOUR", "enrl_requirement": "Enrollment Requirements: REASON: Pre-registration is not allowed for this class. Please try again during regular registration.<br/>Add Consent: Department Consent Required<br/>", "qtr": "Spring 2017", "name": "33220", "title": "JOUR JOUR 490-0-24 Special Topics", "class_attributes": "Registration is By Application Only<br/><br/>", "section": "33220", "instructors": [{"instructor_phone": "", "instructor_name": "Alec M Klein", "instructor_addr": ""}], "topic": "Medill Justice Project", "course": "490-0", "descriptions": [{"name": "Overview of class", "value": "In this course, you will focus on an important facet of journalism: investigating potentially wrongful convictions. This class isn't about theory; it's about pursuing the truth about real murder cases, interviewing skittish sources in often tough neighborhoods and prisoners serving time?sometimes decades?for crimes they say they didn't commit. You will be introduced to a variety of investigative techniques, interviewing skills, approaches to developing sources and employing public records and databases. Of paramount importance in this class: your safety and adhering to the highest ethical<br/><br/>standards in journalism. You are expected to devote a tremendous amount of time in the field?weekdays and weekends?doing real shoe-leather journalism, knocking on doors, digging for information and determining whether there has been a miscarriage of justice. Keep in mind: Investigative reporting is hard. Expect to confront roadblocks. Anticipate spinning your wheels. There will be frustrations and setbacks. And along the way, hopefully, you will learn to think like an investigative reporter, you will learn by doing and you will do it by the most honorable methods and, so, come closer to discovering the truth?whatever that truth is. Prof. Klein is assisted in class by a licensed private detective and a research associate who works for The Medill Justice Project. Please see www.medilljusticeproject.org for more information."}], "lmod": "2/12/17 6:46 PM (CT)", "subject": "JOUR"}]