[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Kresge Centennial Hall 2-440"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "34879", "title": "WCAS PORT 396-0-1 Topics in Lusophone Cultures", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "34879", "instructors": [{"instructor_phone": "", "instructor_name": "Dierdra Joy Reber", "instructor_addr": ""}], "topic": "", "course": "396-0", "descriptions": [{"name": "Overview of class", "value": "Business Politics and Authoritarian Nostalgia in Twenty-First-Century Latin America <br/><br/>In the wave of mid-late twentieth century military dictatorships that dominated Latin American politics, it was believed that leftism was dead. To everyone's surprise, the so-called &quot;marea rosa&quot; (&quot;pink tide&quot;) rolled through the continent in the first years of democracy, largely in response to Argentina's 2001 international debt default and spectacular economic collapse. Yet this negative judgment of economic neoliberalism seems not to have held, either; in most recent years, there has been an emergence of outsider politicians hailing from backgrounds in business and economics that have brought to bear a pendular swing back to conservative politics, and even, some argue, an &quot;authoritarian nostalgia&quot; (Vanessa Barbera, New York Times, May 1, 2016, writing about Brazil). This course will attempt to trace the most recent cultural production that helps us to understand this pattern in a comparative analysis focused on Brazil, Argentina, Chile, and Mexico. We may also reference other countries/territories such as Paraguay, Perú, Guatemala, Honduras, Panamá, the Dominican Republic, Puerto Rico, and the Phillipines. Equally possible, depending on student interest, would be the consideration of Spain, Portugal, and the United States. We will conduct background study of the cultural production surrounding dictatorship and post-dictatorship (ie, transition to democracy) as context for delving into the twenty-first century. Students will participate actively in the construction of course content by working together to assemble a critical portrait of our cultural present. We will aim for diversity of literary genre (ie, short story, poetry, essay, novel), media sources (ie, film, television, journalism), and politico-economic discourse. Course requirements will include active course participation, frequent informal but critical writing, presentations, and a formal final research paper on a specific topic chosen in consultation with the professor."}], "lmod": "2/19/17 6:51 PM (CT)", "subject": "PORT"}]