[{"class_mtg_info": [{"meet_t": "TuTh 1:00PM - 3:30PM", "meet_l": "University Hall 312"}], "school": "WCAS", "overview_of_class": "Course Description:<br/><br/>What does it mean to be alone? How does our being together in the world shape us? In this course students will explore the ways in which our intuitive manner of perceiving, feeling, occupying, and understanding our world is determined in advance by the presence of others. We will reexamine the concepts of the self and of community through a consideration of the telling, retellings and adaptations of Robinson Crusoe from countries including Mexico, France, Korea, and South Africa. The isolation of Robinson Crusoe has repeatedly served as a lens through which to consider the nature and functions of human sociality. We will consider these questions from different cultural and historical perspectives, taking up issues of race, violence, gender, economics, and temporality.<br/><br/>This course will challenge students to intelligently and creatively analyze works of art, ground their arguments in relevant theoretical contexts, and to become effective writers capable of structuring and supporting compelling interpretations of artistic texts.", "qtr": "Summer 2016", "name": "Studies in Theme", "title": "WCAS COMP_LIT 304-0-26 Studies in Theme", "lmod": "5/1/16 6:31 PM (CT)", "section": "26", "topic": "A World Without Others: The Telling, Retellings an", "course": "304-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Course Description:<br/><br/>What does it mean to be alone? How does our being together in the world shape us? In this course students will explore the ways in which our intuitive manner of perceiving, feeling, occupying, and understanding our world is determined in advance by the presence of others. We will reexamine the concepts of the self and of community through a consideration of the telling, retellings and adaptations of Robinson Crusoe from countries including Mexico, France, Korea, and South Africa. The isolation of Robinson Crusoe has repeatedly served as a lens through which to consider the nature and functions of human sociality. We will consider these questions from different cultural and historical perspectives, taking up issues of race, violence, gender, economics, and temporality.<br/><br/>This course will challenge students to intelligently and creatively analyze works of art, ground their arguments in relevant theoretical contexts, and to become effective writers capable of structuring and supporting compelling interpretations of artistic texts."}, {"name": "Evaluation Method", "value": "3 Short Response Papers 30% : Students will be expected to write three one page response papers over the course of the summer session. For each paper students will provide an argument regarding the course theme and chose at least one passage from the text to analyze in detail in order to support their claim.<br/><br/>In class ?debate' 20% : In the second week of class students will be given a debate topic relating to the course theme and assigned a side. In preparation for the debate, which will take place on the last day of class, students on each side will prepare three arguments in support of their position and three counter arguments. Students may argue only through citation and interpretation. This assignment is designed to foster in-­?depth engagement with the texts under consideration, so read and re-­?read carefully, but also interpret creatively and have fun!<br/><br/>Final Paper (6-­?10 pages) 35% : Due Friday July 29th (by email)<br/><br/>Participation and Attendance 15%<br/><br/>Plagiarism is strictly forbidden. Northwestern University defines plagiarism as ?submitting a material that in part or whole is not entirely one's own work without attribution those same portions to their correct source.&quot; Please see Northwestern University's webpage for more information: http://www.northwestern.edu/provost/policies/academic-integrity/index.html"}], "path": "/class-descriptions/4630/WCAS/COMP_LIT/304-0/40251", "instructor": [""], "class_attributes": "", "id": "40251", "subject": "COMP_LIT"}]