[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Locy Hall 111"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-registration - Reserved for English students.", "qtr": "Spring 2017", "name": "33296", "title": "WCAS ENGLISH 378-0-21 Studies in American Literature", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "33296", "instructors": [{"instructor_phone": "847/491-8916", "instructor_name": "William J Savage", "instructor_addr": "1908 Sheridan Road, OUSA"}], "topic": "The Chicago Way: &quot;Urban Spaces &amp; American Values", "course": "378-0", "descriptions": [{"name": "Overview of class", "value": "Urbanologist Yi Fu Tuan writes, &quot;What begins as undifferentiated space becomes place when we get to know it better and endow it with values.&quot; In The Untouchables, Sean Connery tells Kevin Costner, &quot;You want to get Capone? Here's how you get Capone. He pulls a knife, you pull a gun. He puts one of yours in the hospital, you put one of his in the morgue. That's the Chicago way.&quot; In this class, we will examine &quot;the Chicago way&quot; from many different angles in order to interrogate the values with which various artists have endowed Chicago. We will read in a broad range of media: journalism, poetry, song, fiction, film, and sequential art to see how a sense of Chicago as a place works over time. We will pay close attention to depictions of the construction of American identity, and to the role of the artist and intellectual in the city."}, {"name": "Teaching Method", "value": "Discussion, brief lectures, guest speakers, and an optional urban tour."}, {"name": "Evaluation Method", "value": "Class participation; brief written responses to each text; several options for papers of various lengths."}, {"name": "Class Materials (Required)", "value": "Nelson Algren's Chicago: City on the Make and The Neon Wilderness; Richard Wright's Native Son; Stuart Dybek's The Coast of Chicago; journalism by Ben Hecht, Mike Royko and others; short fiction by Sandra Cisneros, James T. Farrell and others; poetry by Carl Sandburg, Gwendolyn Brooks, Tony Fitzpatrick and others; the films The Untouchables, The Blues Brothers, Call Northside 777, and Barbershop; the graphic novel 100 Bullets: First Shot, Last Call."}, {"name": "Class Notes", "value": "Texts will be available at Comix Revolution, 606 Davis Street."}], "lmod": "2/9/17 6:42 PM (CT)", "subject": "ENGLISH"}]