[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "University Library 5746"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Winter 2017", "name": "24582", "title": "WCAS RELIGION 101-6-20 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "24582", "instructors": [{"instructor_phone": "847/467-1746", "instructor_name": "Mira   Balberg", "instructor_addr": "Crowe Hall 4-137"}], "topic": "The Seven Deadly Sins", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "The notion of sin is one of the most central facets of religion in the Western world. Thinking of religion as a system that orients human beings to certain beliefs and actions, we naturally assume that a critical part of these beliefs and actions has to do with questions of right and wrong, and that the &quot;wrong&quot; in religious systems is often classified as &quot;sin.&quot; But what is &quot;sin,&quot; exactly? What constitutes a sinful act and what makes one a sinner? In this seminar, we will approach these questions from a critical point of view and delve into the very rich and complex concept of sin so as to understand how it has evolved through time and how it shaped and continues to shape our own world. <br/>At the center of the course will stand &quot;the seven deadly sins,&quot; an idea that started to develop around the fourth century C.E., according to which there are seven major sins that essentially generate all possible sins: gluttony, lust, anger, envy, greed, sloth, and pride. We will see how the &quot;seven deadly sins&quot; have emerged against the background of earlier notions of sin (Greek, Jewish, and Christian) and we will look closely into each one of those &quot;deadly sins,&quot; considering why and how it came to be viewed as a sin and how it resonates in the world in which we live."}, {"name": "Learning Objectives", "value": "The main objective of the course is to develop a critical perspective, the essence of which can be summarized as follows: ideas and concepts have a history. Even concepts that we consider to be innate to society such as &quot;sin&quot; did not always exist, and they developed and changed through time. In addition, the purpose of the class is to nurture your analytical skills and to allow you to become more perceptive and sensitive readers of texts, watchers of movies, and citizens of the world. Finally, the course is geared to hone your writing abilities and to give you tools to become more eloquent and more skilled academic writers."}, {"name": "Teaching Method", "value": "Class participationDiscussionFilms / videosReadingsSeminarWriting assignments<ln/>"}, {"name": "Evaluation Method", "value": "AttendanceClass participation: 20%<br/>Readings: Talking points on readings are 10% of final grade<br/>Writing assignments: 70%<br/>"}, {"name": "Class Materials (Required)", "value": "The Bible (NRSV version; other versions are acceptable)<br/>ISBN 978-0310902386<br/><br/>Albert Camus, The Stranger<br/>ISBN 978-0679720201<br/><br/>Plato, Symposium<br/>978-0199540198"}], "lmod": "12/25/16 7:06 PM (CT)", "subject": "RELIGION"}]