[{"class_mtg_info": [{"meet_t": "Sa 1:00PM - 4:00PM", "meet_l": "Wieboldt Hall 512"}], "school": "SCS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "27595", "title": "SCS ORG_BEH 311-CN-19 Conflict Resolution", "class_attributes": "", "section": "27595", "instructors": [{"instructor_phone": "", "instructor_name": "Marina R Davis", "instructor_addr": ""}], "topic": "Topics in Workplace Relations: Conflict Resolution", "course": "311-CN", "descriptions": [{"name": "Overview of class", "value": "In this course, students achieve a working knowledge of conflict theory and its application to negotiations; learn about their own conflict resolution style, understand how group membership can impact conflict. This course combines classroom lecture and discussion with an online component. For the lecture and discussion components, this course is paired with a morning session of BLP / ORG BEH 301-CN taught by Robert Ernest, and the in-class meetings are on alternate Saturdays: 1/7, 1/21, 2/4, 2/18, 3/4. For the online component, students must have reliable access to the Internet. This course is part of the Business Leadership year one cohort. First class attendance is mandatory."}, {"name": "Learning Objectives", "value": "-Identify the process of &quot;how&quot; emotional conflict occurs within organizational relationships<br/>-Describe strategies to resolve conflict<br/>Apply conflict resolution techniques and concepts to a variety of organizational situations<br/>-Assess conflict situations and generate possible response options<br/>-Utilize a variety of conflict resolution styles to address conflict situations appropriately and as effectively as possible<br/>-Classify his/her own: conflict management style and personality preference. The student will then learn how to appraise how these styles affect conflict both from his/her perspective and others.<br/>-Define types of conflict and responses to each<br/>-Discuss negotiation techniques and application<br/>-Describe the role and responsibilities of the leader within an organizational conflict."}, {"name": "Class Materials (Required)", "value": "Materials may include the following. Visit the campus bookstore or its website to confirm materials for the course. <br/><br/>Difficult Conversations ISBN-13: 978-0143118442.<br/>Getting to Yes ISBN - 13: 978-0143118756.<br/>MBTI assessment and Introduction to Type."}], "lmod": "12/25/16 6:51 PM (CT)", "subject": "ORG_BEH"}]