[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Parkes Hall 215"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "23145", "title": "WCAS ASIAN_AM 360-0-1 Studies in Race, Gender, and Sexuality", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "23145", "instructors": [{"instructor_phone": "847/491-4337", "instructor_name": "Jillana B Enteen", "instructor_addr": "1800 Sherman Ave. 4th floor"}], "topic": "Med Tourism &amp; Transn'l Sex'lty", "course": "360-0", "descriptions": [{"name": "Overview of class", "value": "This course is situated at the intersection of theoretical, cultural, and medical, and commercial online discourses concerning the burgeoning Sexual Reassignment Surgery (SRS) medical surgeries presented on the world wide web and practiced in Thailand. Using &quot;Trans&quot; theories: transgender, transnational, translation, spatio/temporal, we will discuss the intersections, dialogues, refusals and adoptions when thinking about medical tourism to Thailand. We will examine Thai cultural/historical conceptions of sex and genders, debates concerning bodies and diagnosis that took place during the drafting of the Diagnostic and Statistical Manual of Mental Disorders (DSM-V), International SRS Standards of Care (to be drafted in BKK during the WPATH meeting in February 2014), and changes in presentations of sex/gender related surgeries offered online. Comparative cultural studies, medical discourses, and an archive of web images offering SRS surgeries to Thailand produced by Thais for western clientele will serve as axes for investigating this topic."}, {"name": "Registration Requirements", "value": "None"}, {"name": "Learning Objectives", "value": "We will be studying this topic using Three Axes:<br/>1 Comparative Culture<br/>How sex gender system in Thailand is/was historically different than what we take as normal. How queer and trans theory have positioned trans bodies. Issues of SRS medical tourism in Thailand.<br/>2 Data and Digital Imaging<br/>Using visualization and websites/webcrawls to understand how we see digital images and texts and how that informs both our understanding of the process, its surrounding medical and legal issues and the interplay of cultures.<br/>3 Medical-Juridical<br/>Medical, legal and policy issues at the US and transnational level concerning transnational tourism, transgender positionings, Standards of Care (WPATH) and different legal forces."}, {"name": "Evaluation Method", "value": "AttendanceGroup projectPaper, mid-term: and Presentation<br/>"}, {"name": "Class Materials (Required)", "value": "Book: Import/Export: Thai English as Transnational Sexuality Studies (Onyx, 2015), Enteen, Jillana"}, {"name": "Class Materials (Suggested)", "value": "All materials available from class wordpress site. Readings must be printed for class discussion"}, {"name": "Class Notes", "value": "Attendance at first class is mandatory."}], "lmod": "1/9/16 6:43 PM (CT)", "subject": "ASIAN_AM"}]