[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "Allison Residential Comm 1021"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "25313", "title": "WCAS CLASSICS 397-0-1 Exhibiting Antiquity: The Culture and Politics of Display", "class_attributes": "Historical Studies Distro Area<br/><br/>Interdisciplinary Distro - See Rules<br/><br/>Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "25313", "instructors": [{"instructor_phone": "847 467 0873", "instructor_name": "Ann C Gunter", "instructor_addr": "1800 Sherman Ave., Suite 4400"}], "topic": "", "course": "397-0", "descriptions": [{"name": "Overview of class", "value": "How do institutions such as museums, websites and archaeological sites developed as tourist destinations shape and construct our notions of the past? How are these institutions enmeshed with broader cultural and political agendas regarding identity and otherness, the formation of artistic canons, and even the concept of ancient art? This course explores modern strategies of collecting, classifying, and displaying material culture from ancient Egypt, the Middle East, Greece, and Rome, both in Europe and the United States and in their present-day homelands.<br/> <br/>The course approaches the construction of ancient Mediterranean, Egyptian, and Near Eastern art through modes of reception over the past two centuries. By analyzing collection and display practices, it seeks to understand both the development of modern scholarship in ancient art and the intersection of institutional and scholarly programs. Topics examined include the historical development of modern displays devoted to ancient civilizations in public and private museums, notions of authenticity and identity, issues of cultural heritage and patrimony, temporary and &quot;blockbuster&quot; shows, virtual exhibitions and museums, and the archaeological site as a locus of display. This course will include field trips to Chicago-area museums."}, {"name": "Learning Objectives", "value": "1. Develop skills in critically evaluating historical evidence and argument<br/>2. Develop skills in interpreting primary sources in their historical context<br/>3. Recognize and articulate current methodologies for analyzing museum displays and virtual reconstructions<br/>4. Gain hands-on experience in analyzing museum displays by developing an exhibition proposal and writing sample exhibition texts"}, {"name": "Evaluation Method", "value": "In class assignments: participate in discussion of assigned readings; rotate responsibility for leading discussion of assigned readings; short class presentation (10-15 minutes) on a virtual museum or collection. Attendance and participation assessed at 30% of grade.<br/> <br/>Written assignments: Two short papers (4-5 pages each), each assessed at 20% of grade; a detailed exhibition proposal (about 12 pages), 30% of grade."}, {"name": "Class Materials (Required)", "value": "There is no textbook (course materials will be made available through Canvas)."}], "lmod": "1/9/16 6:45 PM (CT)", "subject": "CLASSICS"}]