[{"class_mtg_info": [{"meet_t": "Tu 6:00PM - 8:00PM", "meet_l": "McMillen Crowe Hall 4-130"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "27409", "title": "WCAS JWSH_ST 210-1-1 Jewish Studies: An Overview", "class_attributes": "", "section": "27409", "instructors": [{"instructor_phone": "", "instructor_name": "Claire E Sufrin", "instructor_addr": "Crowe 4-148"}], "topic": "", "course": "210-1", "descriptions": [{"name": "Overview of class", "value": "Jewish Studies encompasses the study of Judaism, Jewish history, Jewish culture and the lives of contemporary Jews. This course offers an introduction to the field through seminar-style discussions with members of NU's Jewish Studies faculty. Students will become familiar with the methodologies scholars use to research, understand, and analyze Jewish culture while gaining knowledge of specific topics in Jewish Studies. Open to students of all backgrounds interested in a better understanding of the academic study of the humanities. The course meets for one 90-minute seminar session per week, and students must enroll in the course for both winter and spring quarters."}, {"name": "Learning Objectives", "value": "? Articulate the difference between Jewish identity, Judaism and Jewish Studies<br/>? Think critically about Judaism, Jewish history, and Jewish literature<br/>? Engage with particular issues and topics in Jewish Studies<br/>? Identify the range of disciplines and methodologies in Jewish Studies"}, {"name": "Evaluation Method", "value": "2-3 paragraph responses to the assigned reading each week. <br/><br/>There will be an oral midterm exam and a final paper both quarters. <br/><br/>The winter paper will require students to evaluate two Jewish Studies articles they have not read previously. For the spring paper, students will undertake a research project in an area of Jewish Studies of their choosing.<br/><br/>Each quarer, student grades will be calculated as follows:<br/>25% Participation, including weekly reading responses<br/>35% Midterm oral exam<br/>40% Final paper (8-10 pp)"}, {"name": "Class Materials (Required)", "value": "The Bloomsbury Companion to Jewish Studies edited by Dean Phillip Bell (will be available at the Campus Bookstore and on reserve at the Library)<br/>All other class materials we be on Canvas"}], "lmod": "1/9/16 6:50 PM (CT)", "subject": "JWSH_ST"}]