[{"class_mtg_info": [{"meet_t": "Mo 3:00PM - 5:50PM", "meet_l": "Scott Hall 201 Ripton Room"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "22955", "title": "WCAS POLI_SCI 490-0-21 Special Topics in Political Science", "class_attributes": "", "section": "22955", "instructors": [{"instructor_phone": "", "instructor_name": "William James Hurst", "instructor_addr": ""}], "topic": "Chinese Politics", "course": "490-0", "descriptions": [{"name": "Overview of class", "value": "For more information about this course, please contact the instructor directly via email."}, {"name": "Registration Requirements", "value": "Graduate Students only"}, {"name": "Learning Objectives", "value": "Be familiar with the core debates in the Chinese politics field, be able to assess critically advantages and disadvantages of specific analytical perspectives, research and complete a small paper on some issue in the study of Chinese politics."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Seminar Participation: 40%; Presentation: 5%; Research Paper: 55%"}, {"name": "Class Materials (Required)", "value": "Eli Friedman Insurgency Trap: Labor Politics in Postsocialist China Ithaca: Cornell University ILR Press, 2014. ISBN: 9780801479311<br/>Lily L. Tsai Accountability without Democracy: Solidarity Groups and Public Goods Provision in Rural China Cambridge: Cambridge University Press, 2007. ISBN: 9780521692809<br/>Rachel E. Stern Environmental Litigation in China: A Study in Policy Ambivalence Cambridge: Cambridge University Press, 2013. ISBN: 9781107460027<br/><br/>Carlson, Gallagher, Lieberthal, and Manion (eds) Contemporary Chinese Politics: New Sources, Methods, and Field Strategies Cambridge: Cambridge University Press, 2010. ISBN: 9780521155762<br/><br/>Barry Naughton Growing out of the Plan: Chinese Economic Reform, 1978-1993 Cambridge: Cambridge University Press, 1996 - at least introduction, chapters 2, 6, &amp; 8; remainder recommended. ISBN: 9780521574624<br/><br/>Susan L. Shirk The Political Logic of Economic Reform in China Berkeley: University of California Press, 1994. ISBN: 9780520077072<br/><br/>Kevin O'Brien and Lianjiang Li Rightful Resistance in Rural China Cambridge: Cambridge University Press, 2006. ISBN: 9780521678520<br/><br/>Dali Yang Remaking the Chinese Leviathan: Market Transition and the Politics of Governance in China Stanford: Stanford University Press, 2004. ISBN: 9780804754934<br/><br/>Andrew Mertha China's Water Warriors: Citizen Action and Policy Change Ithaca: Cornell University Press, 2008. ISBN: 9780801476686<br/><br/>Kevin O'Brien ed. Popular Contention in China Cambridge MA: Harvard University Press, 2008. ISBN: 9780674030619<br/><br/>Yongshun Cai Collective Resistance in China: Why Popular Protests Succeed or Fail Stanford: Stanford University Press, 2010. ISBN: 9780804763400<br/><br/>William Hurst The Chinese Worker After Socialism Cambridge: Cambridge University Press, 2009. ISBN: 9781107404625<br/><br/>Mary E. Gallagher Contagious Capitalism: Globalization and the Politics of Labor in China Princeton: Princeton University Press, 2005. ISBN: 9780691130361<br/><br/>Victor C. Shih Factions and Finance in China: Elite Conflict and Inflation Cambridge: Cambridge University Press, 2007. ISBN: 9780521106474<br/><br/>One of the Following 3 Required (students' choice):<br/><br/>Edward S. Steinfeld Playing our Game: Why China;s Rise Doesn't Threaten the West New York: Oxford University Press, 2010. ISBN: 9780195390650<br/><br/>Yasheng Huang Selling China: Foreign Direct Investment During the Reform Era Cambridge: Cambridge University Press, 2003. ISBN: 9780521608862<br/><br/>Thomas G. Moore China in the World Market: Chinese Industry and International Sources of Reform in the Post-Mao Era Cambridge: Cambridge University Press, 2002. ISBN: 9780521664424<br/><br/><br/>One of the Following 3 Required (students' choice):<br/><br/>Avery Goldstein Rising to the Challenge: China's Grand Strategy and International Security Stanford: Stanford University Press, 2005. ISBN: 9780804752183<br/><br/>M. Taylor Fravel Strong Borders, Secure Nation: Cooperation and Conflict in China's Territorial Disputes Princeton: Princeton University Press, 2008. ISBN: 9780691136097<br/><br/>Alistair Iain Johnston Social States: China in International Institutions, 1980-2000 Princeton: Princeton University Press, 2007. ISBN: 9780691134536"}, {"name": "Class Materials (Suggested)", "value": "Following are recommended, but not strictly required:<br/><br/># Yi-min Lin Between Politics and Markets: Firms, Competition, and Institutional Change in Post-Mao China Cambridge: Cambridge University Press, 2001. ISBN: 9780521604048<br/><br/># David Zweig Freeing China's Farmers: Rural Restructuring in the Reform Era Armonk: M.E. Sharpe, 1997. ISBN: 9781563248382<br/><br/># Kenneth Lieberthal Governing China: from Revolution through Reform New York: Norton, 2004 - chapters 2-7.<br/><br/># Dali L. Yang Calamity and Reform in China: State, Rural Society, and Institutional Change since the Great Leap Famine Stanford: Stanford University Press, 1996.<br/><br/># Mark W. Frazier The Making of the Chinese Industrial Workplace: State, Revolution, and Labor Management Cambridge: Cambridge University Press, 2002.<br/><br/># Andrew G. Walder Communist Neo-Traditionalism: Work and Authority in Chinese Industry Berkeley: UC Press, 1986"}], "lmod": "12/25/16 7:05 PM (CT)", "subject": "POLI_SCI"}]