[{"school": "SoC", "overview_of_class": "This graduate seminar course provides a broad and comprehensive introduction to human-computer interaction theory and research. The primary objective of the course is to provide students with an understanding of seminal work in the area through a combination of readings, videos, interactive demos, and discussion. The course begins with a history of both applied and theoretical work in the area of human-computer interaction, and then transitions to cover the rapidly changing technological landscape and explore current and future research areas. Topics will include social computing and the social web, interaction techniques, context-aware computing, mobile interfaces, information visualization, and evaluation methods. The course is run as a seminar and students will be responsible for weekly readings, leading weekly discussions, and written assignments.", "name": "Special Topics Research Seminar", "section": "20", "location": "Frances Searle Building 3220", "topic": "Theories & Practice of Human Computer Interaction", "course": "525-0", "meeting_time": ["We 3:00PM - 5:50PM"], "path": "/class-descriptions/4650/SoC/MTS/525-0/23546", "instructor": ["Darren Robert Gergle"], "class_attributes": "Graduate Students Only<br/><br/>", "id": "23546", "subject": "MTS"}, {"school": "SoC", "overview_of_class": "This course explores various trajectories and developments that shape research, scholarship, and literature in Media, Technology, and Society. In part, this course takes an historical approach and selectively examines past research in the field. Another component of this course includes selectively examining various topics, themes, issues, and concerns that have attracted attention from scholars in the past, and continue to attract attention today. Yet another component of this course selectively examines changes over time in scholarship related to Media, Technology, and Society: how ideas and interests of scholars can rise, can fade, and can be transformed. Students will produce a research project relevant to their own research interests, in consultation with the instructor.", "name": "Special Topics Research Seminar", "section": "21", "location": "Frances Searle Building 2370", "topic": "The Shaping of Scholarship", "course": "525-0", "meeting_time": ["Mo 2:00PM - 4:50PM"], "path": "/class-descriptions/4650/SoC/MTS/525-0/23547", "instructor": ["James J Schwoch"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>Graduate Students Only<br/><br/>", "id": "23547", "subject": "MTS"}, {"school": "SoC", "overview_of_class": "As worldwide interdependencies have been growing, social-scientists increasingly engage with the \"global economy,\" \"global governance,\" or even \"global civil society.\" But what about culture? Does it make sense to speak of \"global culture\"? And if so, what role do the media and arts play in it, and how should we study related processes? Specifically, the goals of this course are three-fold: First, to provide an overview of theoretical key positions in the evolution of the \"global culture\" debate since its origins in international communication. Second, to acquaint with important current frontiers of research on media and the arts in global context. And third, by dissecting exemplary case studies, students also learn strategies to construct and pursue research problems that go beyond national borders. The course will involve brief lectures, student presentations, and discussions.", "name": "Special Topics Research Seminar", "section": "22", "location": "Frances Searle Building 2370", "topic": "Global Culture?", "course": "525-0", "meeting_time": ["Fr 2:00PM - 4:50PM"], "path": "/class-descriptions/4650/SoC/MTS/525-0/23548", "instructor": ["Larissa   Buchholz"], "class_attributes": "Graduate Students Only<br/><br/>", "id": "23548", "subject": "MTS"}, {"school": "SoC", "overview_of_class": "Big data is currency, to those initiated in the nuts and bolts of data science. This graduate lab introduces cutting edge research on networks, crowds and cultural markets, and provides you with algorithmic and programming tools to apply this research. You will learn about a selection of techniques for exploratory visualization, modelling, simulation, text mining and machine learning. The studied methods are useful across a variety of fields in which aggregate behavior and network effects play a crucial role.<br/>Prerequisite for the class is a level of comfort with basic mathematical definitions and the statistical software R. Taking Noshir Contractor's \"Social Network Analysis\" class beforehand is highly encouraged.", "name": "Special Topics Research Seminar", "section": "23", "location": "Annenberg Hall G31", "topic": "Complex Network Analysis", "course": "525-0", "meeting_time": ["Mo 1:00PM - 3:50PM"], "path": "/class-descriptions/4650/SoC/MTS/525-0/23549", "instructor": ["Emoke-Agnes   Horvat"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>Graduate Students Only<br/><br/>", "id": "23549", "subject": "MTS"}]