[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "555 Clark B03"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "30902", "title": "WCAS GERMAN 334-0-20 Writers and their Critics", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "30902", "instructors": [{"instructor_phone": "847/491-8295", "instructor_name": "Saein   Park", "instructor_addr": "1880 Campus Drive, Kresge Hall, Rm 3327"}], "topic": "", "course": "334-0", "descriptions": [{"name": "Overview of class", "value": "This course invites students to navigate an intriguing cross-cultural trajectory of German-language Literature and World Literature: Franz Kafka and contemporary Kafkaesque writers from around the world. Writing during the demise of the Austro-Hungarian Empire, the Jewish writer Kafka writing in German uniquely elaborated on the thematic of the empire, the center, and the periphery and presented distinct wounded, distorted, and deformed figures. This course explores the afterlife of Kafka`s literary thoughts in the works of global ?Kafkaesque` writers. This course begins with an examination of Kafka`s selected short stories. It then investigates the works of contemporary Kafkaesque writers including J. M. Coetzee`s Foe, Haruki Murakami`s Kafka on the Shore and the 2016 Man Booker Award winning novel Han Kang`s The Vegetarian. We will look into how the authors, writing from different cultural and literary-historical contexts, inherit Kafka`s legacy in their own creative and socio-critical ways. Students are invited to explore various cross-cultural intersections. We will examine, for instance, how Murakami, with a character named Kafka, `writes back` from modern Japanese literary history in regard to the reception of Western culture and modernist and realist literature, initiating a new form of contemporary popular literature."}, {"name": "Learning Objectives", "value": "Students will develop their reading, discussion, research, and writing skills in the humanities. In particular, students are expected to attain the ability to both understand and critically interpret literary texts from different cultural contexts and develop cross-cultural perspectives."}, {"name": "Teaching Method", "value": "DiscussionLecturePresentationsReadingsWriting assignments"}, {"name": "Evaluation Method", "value": "AttendanceClass participationPapersPresentations"}, {"name": "Class Materials (Required)", "value": "1. List<br/>Kafka, Selected Stories.<br/>Coetzee, Foe.<br/>Murakami, Kafka on the Shore.<br/>Han, The Vegetarian<br/>Kim, Your Republic Is Calling You.<br/> <br/>2. Full list with ISBN numbers<br/>Kafka, Franz. Selected Stories. Ed. and Trans. Stanley Corngold. New York: W. W. Norton &amp; Company, 2006. Print. ISBN: 9780393924794<br/>Han, Kang. The Vegetarian: A Novel. Trans. Deborah Smith. Hogarth, 2016. Print. ISBN-10: 1101906111 ISBN-13: 978-1101906118<br/>Murakami, Haruki. Kafka on the Shore. Trans. Philip Gabriel. New York: Alfred A. Knopf?: Distributed by Random House, 2005. Print. ISBN: 1400043662 9781400043668<br/>Coetzee, J. M. Foe. Reprint edition. Madrid: Penguin Books, 1988. Print. ISBN: 9780140074482<br/>Kim, Young-ha. Your Republic Is Calling You. Trans. Chi-Young Kim. Boston: Mariner Books, 2010. Print. ISBN: 9780151015450 0151015457"}], "lmod": "2/20/17 6:46 PM (CT)", "subject": "GERMAN"}]