[{"school": "WCAS", "overview_of_class": "What counts as food? Recent debates over the social and environmental consequences of Genetically Modified Organisms (sometimes called ?Frankenfoods'), media buzz over alternative proteins like crickets, and the mainstream popularity of veganism have provoked a critical return to questions of edibility, the agency of our food, and ecological responsibility - all of which challenge normative, Western orientations towards consumption practices. This course examines cultural constructions of appetite and nourishment by asking: What are the processes through which humans have come to view plants and animals as food? How is edibility either celebrated or refused across time, space, and bodies? And most importantly, how are specific worldviews mobilized in understanding human encounters with the things that we eat? Taking Donna Haraway's landmark work \"A Cyborg Manifesto\" as a point of departure, cultural constructions of edibility will be explored by theorizing the food system as a vital, material force.", "name": "Special Topics in the Humanities", "section": "20", "location": "Locy Hall 301", "topic": "Intro to Critical Food Studies", "course": "370-5", "meeting_time": ["TuTh 9:30AM - 10:50AM"], "path": "/class-descriptions/4660/WCAS/HUM/370-5/33950", "instructor": ["Hiilei Julia Hobart"], "class_attributes": "Ethics &amp; Values Distro Area<br/><br/>", "id": "33950", "subject": "HUM"}, {"school": "WCAS", "overview_of_class": "What does it mean to be in the world? This advanced seminar focuses on the philosophical idea of cosmopolitanism, or world citizenship, as it has appeared in literature from the eighteenth century to today, and proposes that we see the \"world\" itself as an imaginative category. Reading from the tradition of literary texts that have asked readers to picture not just a locality or a nation but a world, we will ask: who exists within the circle of sympathy that these works create, and what are the terms of inclusion/exclusion? Is being a citizen of the world the privilege of the few, or the burden of many? What is the relationship between understanding \"the whole world\" as one's home, and other historical forms of global imagining that are less utopian, like empire, neoliberalism, and \"the global war on terrorism?\" Our study will begin with the formation of the European concept of cosmopolitanism in the eighteenth century and proceed through various counter-perspectives from non-Western literatures. When we are asked to imagine \"the world,\" what?or whose?world is it?", "name": "Special Topics in the Humanities", "section": "21", "location": "Kresge 2351 Kaplan Seminar Rm.", "topic": "Reading Cosmopolitanism", "course": "370-5", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4660/WCAS/HUM/370-5/33951", "instructor": ["Rebecca Carol Johnson"], "class_attributes": "Ethics &amp; Values Distro Area<br/><br/>", "id": "33951", "subject": "HUM"}]