[{"class_mtg_info": [{"meet_t": "Th 6:15PM - 9:15PM", "meet_l": "Parkes Hall 214"}], "school": "SCS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "27779", "title": "SCS FINANCE 202-CN-66 Introduction to Finance", "class_attributes": "", "section": "27779", "instructors": [{"instructor_phone": "", "instructor_name": "William J Arndt", "instructor_addr": ""}], "topic": "", "course": "202-CN", "descriptions": [{"name": "Overview of class", "value": "The focus of this course will be on those quantitative tools that are primarily used in the field of finance. In particular, we will put heavy emphasis on the mathematics of interest rates, including the tools used to value common stock and fixed rate bonds. We will discuss how rates of return for these instruments are measured. We will then look at the capital budgeting process and learn how managers determine in which projects to invest a firm's limited resources. We will also study the probabilistic and statistical tools necessary to understand how investors and financial economists evaluate risk. Primary emphasis will be on understanding expected value, variance/covariance and standard deviation, correlation analysis, portfolio theory and linear regression analysis as they apply to finance. Finally, we will discuss current issues regarding the world of finance, such as the 2008-9 financial crisis and the current European debt crisis."}, {"name": "Registration Requirements", "value": "Prereq: Math 101 (Algebra), Statistics 202 (Introduction to Statistics) and Accounting 201 (Introduction to Financial Accounting I) or their equivalents. Feeling comfortable with college level algebra, especially with the manipulation of exponents, is a must. We will quickly review the statistics needed for this course. You should have a clear understanding of accrual accounting. We will not review this material in class. If you have questions regarding material that you are reviewing, feel free to approach the instructor outside of class. We will also use M.S. Excel in this class. You should be comfortable with basic spreadsheet operations. Functions and operations that are frequently employed by financial analysts will be covered in class."}, {"name": "Teaching Method", "value": "Case studies<br/>Discussion<br/>Lecture<br/>Problem sets<br/>Readings"}, {"name": "Evaluation Method", "value": "Attendance<br/>Case studies<br/>Participation<br/>Exams<br/>Homework<br/>Papers"}, {"name": "Class Materials (Required)", "value": "Fundamentals of Corporate Finance by Richard A. Brealey, Stwart C. Myers and Alan J. Marcus. 7th Edition. McGraw-Hill. ISBN: 0-07-803464-7. It is not absolutely necessary that you use this particular text. You may use any introduction to finance textbook - they basically cover the same material. However, each student must be registered with Connect Plus. Homework and quizzes/exams will be assigned through this website. There is a charge of about $60 per term to be registered at this website, unless you buy the assigned text that has an access code to the website. <br/><br/>Students also will be required to read Fragile by Design, by Calomiris and Haber."}], "lmod": "1/9/16 6:41 PM (CT)", "subject": "FINANCE"}]