[{"class_mtg_info": [{"meet_t": "Mo 6:15PM - 9:15PM", "meet_l": "Tech Institute Lecture Room 4"}], "school": "SCS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "27841", "title": "SCS BIOL_SCI 219-CN-62 Cell Biology", "class_attributes": "", "section": "27841", "instructors": [{"instructor_phone": "847/491-5061", "instructor_name": "Michele M McDonough", "instructor_addr": "Hogan Hall, Room - 2-100"}], "topic": "", "course": "219-CN", "descriptions": [{"name": "Overview of class", "value": "This course is part of the four-course introductory biology sequence. The cell biology course covers mechanisms that cells use to compartmentalize and transport proteins, to move, to regulate growth and death, and to communicate with their environments."}, {"name": "Registration Requirements", "value": "Prerequisite: The Molecular Biology and Genetics class (Biol Sci 215) is recommended but not required."}, {"name": "Learning Objectives", "value": "By the end of the class, a student is expected to be able to:<br/>Explain the importance of membrane function as well as the role of membrane lipids, protein components and membrane organization in eukaryotic cells <br/>Explain how cellular components are targeted and distributed to different regions and compartments of a cell<br/>Explain how the different components of the cytoskeleton support a variety of cell functions, such as cell shape, division, movement, sensing the environment, and cell-cell communication<br/>Explain how cells send, receive, and respond to signals from their environment, including other cells<br/>Explain how cells coordinate and regulate cell division<br/>Explain how an inbalance or mutation in normal cell processes can lead to cancer and other disease states"}, {"name": "Teaching Method", "value": "Class participation, Lecture, online work"}, {"name": "Evaluation Method", "value": "Multiple quizzes, 2 exams, class participation, short homework questions"}, {"name": "Class Materials (Required)", "value": "Essential Cell Biology by Alberts et al., 4th edition 2013 Edition, Garland Publishers, ISBN# 9780815344544"}, {"name": "Class Notes", "value": "May be taken concurrently with BIOLSCI 221-CN (lab)"}], "lmod": "1/9/16 6:41 PM (CT)", "subject": "BIOL_SCI"}]