[{"class_mtg_info": [{"meet_t": "Su 05:00PM - 07:50PM (AST)", "meet_l": "Carnegie Mellon Room 3044"}], "school": "DOHA", "enrl_requirement": "Enrollment Requirements: Registration is reserved for NU Qatar Juniors and Seniors Only<br/>Add Consent: Department Consent Required<br/>", "qtr": "Fall 2016", "name": "10041", "title": "DOHA INTERDIS 301-0-70 Doha Seminar", "class_attributes": "", "section": "10041", "instructors": [{"instructor_phone": "", "instructor_name": "Abraham Naseem Abusharif", "instructor_addr": ""}, {"instructor_phone": "", "instructor_name": "Zachary Valentine Wright", "instructor_addr": ""}], "topic": "Context &amp; Meaning of Qatar on the World Stage", "course": "301-0", "descriptions": [{"name": "Overview of class", "value": "<p>This honors course seeks to locate historical contexts and ideological meanings that underpin Qatar's complex and varied approaches to nation building, development, and international influence. Qatar's process of identity making, as with all nations and individuals, is internally contested, subject to cultural hybridities, and often is not received as intended by outsiders. Such continually reworked portraits both respond to immediate concerns and try to strike a chord with deeper cultural memories, traditions of the Gulf and the wider Muslim world whose relationship to Western modernity are still being worked out. This course will examine Qatari and regional debates on religious doctrine, race, class, gender roles, educational change, sports, public art, and media. Guest discussants that are recognized authorities in particular fields will often join classroom exchanges.</p>"}, {"name": "Registration Requirements", "value": "<ul><br/><li> Prerequisites: None </li><br/><li>Open to juniors and above </li><br/><li>Open for cross-registration </li><br/><li> Permission of the home Academic Dean is required </li><br/><li>Registration for the course is by nomination of the program/school director </li><br/><li>Satisfying Middle East Studies certificate</li><br/></ul>"}], "lmod": "10/30/16 6:47 PM (CT)", "subject": "INTERDIS"}]