[{"class_mtg_info": [{"meet_t": "Mo 2:00PM - 2:50PM", "meet_l": "University Lib B182 - Comp Cla"}, {"meet_t": "We 2:00PM - 4:50PM", "meet_l": "University Lib B182 - Comp Cla"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-requisite: Students must have completed either BIOL_SCI 215 or ENVR_SCI 202 and one course in Statistics to enroll in this course.", "qtr": "Winter 2016", "name": "20692", "title": "WCAS BIOL_SCI 337-0-1 Quantitative Methods for Ecology and Conservation", "class_attributes": "Prerequisites apply, see description<br/><br/>", "section": "20692", "instructors": [{"instructor_phone": "847/835-6978", "instructor_name": "Stuart   Wagenius", "instructor_addr": "156 PCSC Chicago Botanic Garden, Glencoe"}], "topic": "", "course": "337-0", "descriptions": [{"name": "Overview of class", "value": "This is a statistics class geared toward students interested in biology, ecology, or environmental science. The course is applied statistics with the goal of students being able to use the skills, experience, information, and software learned in class after class. We will use the software R for all quantitative methods practiced in class. R is a very flexible and powerful program that you can use for any statistical problem you encounter. The program is free, well-supported, well-documented, and is constantly getting better and more powerful."}, {"name": "Registration Requirements", "value": "Prerequisites: 210-1, 215 OR ENVR SCI 202; Course in statistics"}, {"name": "Learning Objectives", "value": "1. Students will gain hands-on experience managing and visualizing datasets, conducting exploratory and formal statistical analyses, and presenting results.<br/> <br/>2. Students will use R for all quantitative methods practiced in class and be confident in their ability to use R for their future statistical needs. Students will be able to access and interpret appropriate R-specific help resources freely available online.<br/> <br/>3. Students will be familiar with a variety of modern statistical approaches, methods, and techniques useful for analyses in ecology and conservation applications.<br/> <br/>4. Students will apply their knowledge of statistical methods and use their skills with R to conduct an analysis of their own dataset, they will develop a documented, reproducible analysis, and present results to class."}, {"name": "Teaching Method", "value": "Lecture, Group work, Discussion<br/><br/>Projects: An individual research project will be a main aspect of this class. In consultation with the instructor, you will pick a research question that can be addressed with an original or publicly-available dataset (consider your thesis or research!). During the course, you will conduct an analysis that answers your questions. You will develop a documented, reproducible analysis, and present results to the class. The instructor will facilitate all steps in this process and some homework assignments will be centered on your individual or group dataset."}, {"name": "Evaluation Method", "value": "1. Class participation, 15%-group work, discussion contributions to class web resources, and attendance.<br/><br/>2. Homework 25%-R exercises with class and individual datasets.<br/><br/>3. Mid-term exam, during class, 20%-demonstrate your ability to manage and visualize datasets and conduct appropriate statistical analyses using R.<br/><br/>4. Individual or group project and presentation 40%."}, {"name": "Class Materials (Required)", "value": "Michael J. Crawley. 2014. Statistics: An Introduction using R. 2nd Ed, ISBN: 978-1-118-94109-6 Wiley. Paperback.<br/><br/>Required Software: R; 2 Free downloads available for Mac, PC, Unix, or Linux computers. <br/>R - http://www.r-project.org/ and RStudio - http://www.rstudio.com/products/rstudio/download/"}, {"name": "Class Notes", "value": "There is a steep learning curve for R. It pays to keep up with class from the beginning; you will reap benefits later in the class. At the end of this class you will appreciate R, you may even love it."}], "lmod": "1/9/16 6:44 PM (CT)", "subject": "BIOL_SCI"}]