[{"class_mtg_info": [{"meet_t": "Mo 2:00PM - 4:50PM", "meet_l": "Kresge 5531 Comp Lit. Sem. Rm."}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "22281", "title": "WCAS AMER_ST 301-2-20 Seminar for Majors", "class_attributes": "Department Majors Only<br/><br/>", "section": "22281", "instructors": [{"instructor_phone": "", "instructor_name": "Kate A Baldwin", "instructor_addr": ""}], "topic": "The Cold War and The Color Line", "course": "301-2", "descriptions": [{"name": "Overview of class", "value": "SEMINAR FOR MAJORS: The Cold War and The Color Line<br/><br/>This seminar looks at the era in which many of our contemporary ideas about American national identity took root: the Cold War. Alongside literature, film, and advertisements we will examine historical texts that document the debates surrounding the creation of Cold War Americanness. By looking at how cultural texts contribute to, reflect, and transform the ideas and beliefs of an era, we will consider the relationship between texts and the formation of an era's &quot;common sense.&quot; And we will investigate the relationship between those considered un-American and what might be considered counter-texts. In addition, this course will investigate the communicative practices that both divided and linked the U.S. and the U.S.S.R. during the early part of the cold war period. Close attention will be paid to the forms of engagement between the nations?visual, textual, diplomatic?in order to better read race through such concepts as containment, the Red Scare, and the nuclear family. We will investigate the racial, sexual, and class implications of U.S. Cold War nation building, and the resonances of those ideas today. Finally, this course will ask students to use their own research and writing to scrutinize the ideas and motives behind the categorization of Americanness and to reflect upon the ubiquity of the 1950s and 1960s in contemporary pubic culture, from TV shows such as Mad Men to the popularity of mid-century modern design, fashion, and architecture."}], "lmod": "12/25/16 6:54 PM (CT)", "subject": "AMER_ST"}]