[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Technological Institute LG66"}], "school": "MEAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "31232", "title": "MEAS CIV_ENV 414-2-20 Mechanics of Composite Materials II", "class_attributes": "", "section": "31232", "instructors": [{"instructor_phone": "847/491-5649", "instructor_name": "Isaac M Daniel", "instructor_addr": "Catalysis Bldg, Rm 326, 2137 Tech Drive, EV CAMPUS"}], "topic": "", "course": "414-2", "descriptions": [{"name": "Overview of class", "value": "COURSE DESCRIPTION / Continuation of Mechanics of Composite Materials I; review of composite micromechancs and lamina mechanics, experimental methods for characterization of composite materials, elastic behavior of multidirectional laminates (lamination theory), hygrothermal effects, stress and failure analysis of multidrectional laminates, interlaminar stresses, stress concentrations, structural design and optimization, comuptational methods for composites. <br/><br/>COURSE OBJECTIVES / Apply mechanics of composites principles to structural configurations (laminates), learn and apply experimental methods for testing composites, introduce and apply computational methods for design and optimization foo composite structures."}, {"name": "Registration Requirements", "value": "CIV_ENV 414-I, CIV_ENV 415 or consent of instructor."}, {"name": "Teaching Method", "value": "CLASS SCHEDULE / Two 2-hour lectures per week; Laboratory Sessions and Report Writing, regular Homework Assignments. A mid-term written exam (open-book, open notes) is given. The final exam is a take-hom design project utilizing the ICAN computer program supplied to the students."}, {"name": "Evaluation Method", "value": "BASIS OF GRADE / The final grade is based on the homework and lab reports (1 unit), a mid-term exam (2 units) and final project (3 units)."}, {"name": "Class Materials (Required)", "value": "Engineering Mechnics of Composite Materials II, I.M. Daniel and O. Ishai, Oxford University Press, 1994, 1st ed, 0-19-507506-4"}, {"name": "Class Materials (Suggested)", "value": "Supplementary class hand-outs to support specific design projects."}], "lmod": "2/7/17 6:34 PM (CT)", "subject": "CIV_ENV"}]