[{"class_mtg_info": [{"meet_t": "MoWeFr 10:00AM - 10:50AM", "meet_l": "Kresge Centennial Hall 3-410"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24135", "title": "WCAS FRENCH 211-0-20 Reading Cultures in French", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>Attendance at 1st class mandatory<br/><br/>Prerequisites apply, see description<br/><br/>Reading, writing, speaking proficiency<br/><br/>", "section": "24135", "instructors": [{"instructor_phone": "847/497-5631", "instructor_name": "Joseph P Derosier", "instructor_addr": "1860 Campus Drive Crowe Hall #2-155"}], "topic": "", "course": "211-0", "descriptions": [{"name": "Overview of class", "value": "This course is an introduction to French culture through an exploration of the facts and fictions behind French nationalism, unity, and identity. How did a nearly-forgotten eleventh-century poem, rediscovered in the nineteenth century, become a standard for French literary, cultural, and ethno-racial identities? This quarter we will explore how medieval literature gets repurposed and reread with the rise of modern nationalism and colonialism. The &quot;medieval,&quot; we will see, is not only far more present than we imagine, it is perhaps even a product of modernity. If the very framing of the Middle Ages has always been a product of imagined rupture between the past and present, paired with a constant re-writing of the very idea of the Middle Ages, how can we read contemporary depictions of medieval life as a reflection on our national, ethnic, and racial identities? If we approach the Middle Ages less as a space of difference, can that help us analyze our present? Conducted entirely in French, the course is designed to increase students' ability to speak, read, and write in French, and improve their aural comprehension. `"}, {"name": "Registration Requirements", "value": "French 202, AP score of 5, or consent of instructor."}, {"name": "Learning Objectives", "value": "French 211 is designed to build fluency in speaking, writing and reading in French as well as introduce students to one specific aspect of francophone culture. Emphasis will be placed on increasing linguistic accuracy and expanding vocabulary, as well as close readings of texts, both literature and film. Classes will consist of discussions organized around communicative strategies needed to carry on a meaningful conversation."}, {"name": "Teaching Method", "value": "Class discussion, oral reports, short lectures."}, {"name": "Evaluation Method", "value": "Active participation in class discussion, oral presentation, written responses, and two papers."}, {"name": "Class Materials (Required)", "value": "Course packet, Goscinny &amp; Uderzo's Astérix le Gaulois and Astérix et les Normands."}], "lmod": "12/29/16 6:58 PM (CT)", "subject": "FRENCH"}]