[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "Locy Hall 111"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "23880", "title": "WCAS SOCIOL 329-0-20 Field Research and Methods of Data Collection", "class_attributes": "", "section": "23880", "instructors": [{"instructor_phone": "847/467-0517", "instructor_name": "Karrie A Snyder", "instructor_addr": "1808 Chicago, Room 106"}], "topic": "", "course": "329-0", "descriptions": [{"name": "Overview of class", "value": "The goal of this course is to give students experience in qualitative research methodologies. Qualitative methods are a primary way that sociologists learn about the larger social world, test and develop theories and hypotheses, and make sense of complex situations and interactions. Qualitative methods allow sociologists to understand the world from the perspective of the individual and gain a better understanding of how the social world operates."}, {"name": "Registration Requirements", "value": "During preregistration this course is only open to Sociology Majors &amp; Minors. <br/>This course is open to all students during regular registration starting November 16, 2015."}, {"name": "Learning Objectives", "value": "1) To understand the distinction between qualitative and quantitative analyses and to learn when a particular method is appropriate.<br/><br/><br/>2) To examine the various qualitative methods that sociologists use to study the social world including the strengths and weaknesses of each approach. <br/><br/><br/>3) To conduct hands-on research using qualitative methods: ethnography, interviewing and content analysis. <br/><br/><br/>4) To develop an independent research plan including a proposal, data instruments, analysis, data collection procedures, and dissemination of results."}, {"name": "Teaching Method", "value": "Lecture, discussion, online work, written work, group work"}, {"name": "Evaluation Method", "value": "Final Project 50%, Participation 20%, Presentation 10%, Midterm 20%"}, {"name": "Class Materials (Required)", "value": "This is a tentative book list. Confirm all books before purchase.<br/><br/><br/>Sharlene Nagy Hesse-Biber and Patricia Levy. <em>The Practice of Qualitative Research</em>, 2nd edition (1412974577)<br/><br/>Course packet available on Blackboard."}], "lmod": "1/9/16 6:54 PM (CT)", "subject": "SOCIOL"}]