[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Parkes Hall 224"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "12430", "title": "WCAS HISTORY 393-0-22 Approaches to History", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "12430", "instructors": [{"instructor_phone": "847/467-3879", "instructor_name": "Michael J Kramer", "instructor_addr": "Harris Hall 212"}], "topic": "Cultural Criticism and the Contemp Museum", "course": "393-0", "descriptions": [{"name": "Overview of class", "value": "What is the history of cultural and arts criticism in the United States? Where is it headed today? This methods course combines historical examination with fieldwork in the setting of a contemporary art museum. Students read extensively in the history of cultural criticism while experimenting with new, digital modes of this kind of writing. The course convenes in seminar format once a week on the Evanston campus (Thursdays) and once a week at the Museum of Contemporary Art, conveniently located across the street from the Chicago campus's stop for the free Intercampus bus (Tuesdays, when the museum is open late and free to the public; other trips to the MCA will be required to complete assignments as well). Over the course of the quarter, we will meet with staff of the MCA to learn more about working in a museum; Northwestern faculty whose work examines some aspect of cultural criticism will join us as well. Expect extensive discussion of readings, films, artworks, digital projects, performances, and more. Assessment in the course revolves around multimedia modes of digital cultural criticism written about the MCA Chicago's exhibitions, performance series, educational events, and more (no extensive computer experience required, just a willingness to spend time at the MCA and dive in and experiment with digital approaches to cultural criticism). Selections of student work will potentially appear on the MCA's official blog, MCA DNA. The course concludes with one final, scholarly, multimedia essay on a topic related to the contemporary museum, cultural and arts criticism, and a student's particular interests."}, {"name": "Registration Requirements", "value": "GRADING BASIS: P/N allowed"}, {"name": "Teaching Method", "value": "TEACHING METHOD: Discussion, digital work, field study"}, {"name": "Evaluation Method", "value": "EVALUATION METHOD: Class and discussion section attendance and participation: 40%; weekly assignments: 60%; final: 20%"}, {"name": "Class Materials (Required)", "value": "***Tentative until order posted to Norris website<br/>Matti Bunzl, In Search of a Lost Avant-Garde: An Anthropologist Investigates the Contemporary Art <br/>Museum (Chicago: University of Chicago Press, 2014), ISBN-13: 9780226418124. <br/>A. O. Scott, Better Living Through Criticism: How to Think About Art, Pleasure, Beauty and Truth (New <br/>York: Penguin, 2016), ISBN-13: 978-1910702550.<br/>Susan Sontag, On Photography (NY: Farrar, Straus, and Giroux, 1977), ISBN-13: 978-0312420093.<br/>Claire Bishop, Radical Museology: Or What's Contemporary in Museums of Contemporary Art? (London: <br/>Koenig Books, 2013), ISBN-13: 978-3863353643.<br/>Lane Relyea, Your Everyday Art World (Cambridge, MA: MIT Press, 2013), ISBN-13: 978-0262019231.<br/>David Murray, ed., American Cultural Criticism (Exeter, UK: University of Exeter Press, 1995), ISBN-13: 978-<br/>0859894043.<br/>Ben Davis, 9.5 Theses on Art and Class (Chicago: Haymarket Books, 2013), ISBN-13: 978-1608462681.<br/>Additional articles, films, and websites on course website and/or on reserve at NU Library, see our <br/>Canvas course page."}], "lmod": "10/30/16 7:06 PM (CT)", "subject": "HISTORY"}]