[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Kresge 4531 MENA Seminar Rm"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "34441", "title": "WCAS MENA 390-3-21 Advanced Topics in Middle East &amp; North African Studies", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "34441", "instructors": [{"instructor_phone": "", "instructor_name": "Emrah   Yildiz", "instructor_addr": "Kresge Hall 4540"}], "topic": "Producing Territory: People, Commodities and Value", "course": "390-3", "descriptions": [{"name": "Overview of class", "value": "What is territory? Is it simply the physical space (land, air or sea) over which a state exercises sovereignty? How does this presumed alignment of territory and sovereignty come about and get maintained in modern nation-states and internationally? Is territory a given and static contract or the terrain of constant contestation or negotiation in global and international affairs? This course examines these questions by proposing that territories are as much products of mobile social actors, contraband commodities and fluctuating values as they are of state policies aimed at managing these movements. Through reading anthropological and historical monographs as well as theoretical essays drawn from geography and social theory more broadly, in this course we explore the spatial production of social worlds and trace how this process has come to unfold at local, national and regional scales. By the end of the course students are expected to be well-versed in diverse theories of space and able to articulate what an attention to space and the relations of power inscribed in particular processes of territorial production can contribute to ethnographic and historical inquiry across the MENA region."}, {"name": "Class Materials (Required)", "value": "? Amitav Ghosh, 1993. In an Antique Land: History in the Guise of a Traveler's Tale. New York, NY: Knopf. | ISBN-13: 978-0679727835<br/><br/><br/>? Mostafa Minawi, 2016. The Ottoman Scramble for Africa: Empire and Diplomacy in the Sahara and the Hijaz. Stanford, CA: Stanford University Press. | ISBN-13: 978-0804799270<br/><br/><br/>? Kristin Monroe, 2016. The Insecure City: Space, Power and Mobility in Beirut. Rutgers, NJ: Rutgers University Press. | ISBN-13: 978-0813574622<br/><br/><br/>? Eric Tagliacozzo, 2005. Secret Trades, Porous Borders: Smuggling and States along a Southeast Asian Frontier, 1865-1915. New Haven, CT: Yale University Press. | ISBN-13: 978-0300089684"}], "lmod": "2/16/17 6:48 PM (CT)", "subject": "MENA"}]