[{"school": "SoC", "overview_of_class": "RTVF 321: RTVF Authorship<br/>Topic: Meet David Lynch<br/> <br/>We know very well that media texts are collaborative projects: when we see the credits roll at the end of a major film for example, we see hundreds of names and numerous specialized tasks. And yet the idea of an individual creator still has a powerful hold over the way most of us think about and experience the media. What does it mean to be an &quot;author&quot; in the creative industries? What is the nature of creative work? How are artistic reputations constructed and understood? What role do critics and audiences play in that process? Why so some media texts have authors and others don't? How does collaboration work in the creative industries? In this course we will investigate these and other questions through the analysis of the transmedia career of David Lynch.<br/> <br/>Lynch's output covers a remarkably wide range of production contexts and media forms, encompassing visual art, film, television, photography, furniture design, popular music, short online films and the digital cinematography seen in his latest feature, Inland Empire. Lynch can be seen as the ultimate crossover artist: a cult filmmaker who went on to have a hit network television show (&quot;Twin Peaks&quot;) the same year as winning the Golden Palm at the Cannes Film Festival. Starting his career as a painter, he emerged as an avant-garde filmmaker in the early 1970s. After his first feature Eraserhead achieved the status of a cult classic on the &quot;midnight movie&quot; circuit, Lynch jumped into mainstream filmmaking, and has become one of the rare directors to find success with general audiences, cult fans, and academics. Films such as Blue Velvet became touchstones for film theorists during the 1980s, and are still discussed in academic circles today. Lynch has never been without his critics, and his work has come under fire for its depiction of women, sexual violence, race, and class. Lynch has often had a considerable amount of creative control over his projects, and yet his distinctive &quot;Lynchian&quot; signature was forged through long-standing collaborative relationships with a cohort of actors, composers, editors, and sound designers. Lynch is thus a remarkably fertile case study for a consideration of media authorship, modes of collaboration in the creative industries, the history of film culture since the 1970s, the various logics of film, television, and digital media, the importance of sound design in audio-visual media, the representation of race, class, and gender, and a range of other issues.<br/> <br/>By the end of the course students should be able to:<br/> <br/>- Think critically and comparatively about the production practices of various media industries;<br/> <br/>- Analyze the relationship between media authors and their social, cultural, and historical context;<br/> <br/>- Work with primary and secondary research materials to develop an original argument about a prominent media creator;<br/> <br/>- Better understand the nature of creative collaboration in the media industries.<br/> <br/>Assessment:<br/> <br/>Students will be assessed through: 1) a portfolio of short (2-3 page) response papers; 2) a take-home exam on the key themes of the course; 4) the creation of a game kit and short essay that work to spark creativity, stimulate discussion, and illuminate Lynch's work.<br/> <br/>The required texts:<br/> <br/>Chris Rodley ed., Lynch on Lynch<br/>Bernard Pomerance, The Elephant Man: A Play<br/>Justus Nieland, David Lynch<br/> <br/>RTVF 321 Course Reader", "name": "Radio/Tv/Film Authorship", "section": "20", "topic": "Meet David Lynch", "course": "321-0", "meeting_time": ["MoWe 10:30AM - 11:50AM", "Mo 6:00PM - 8:50PM"], "path": "/class-descriptions/4640/SoC/RTVF/321-0/14256", "instructor": ["Jacob Arnaud Smith"], "id": "14256", "subject": "RTVF"}]