[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Tech Institute Lecture Room 5"}], "school": "WCAS", "overview_of_class": "This course will deal with the economic history of China from a comparative perspective. It mainly tackles Chinese economic history from the late imperial period to the modern period, but also aims to provide a historical perspective for understanding the strength and limitation of the contemporary Chinese economy.", "qtr": "Fall 2017", "name": "Topics in Economic History", "title": "WCAS ECON 315-0-20 Topics in Economic History", "lmod": "5/2/17 7:46 PM (CT)", "section": "20", "topic": "", "course": "315-0", "enrl_requirement": "Enrollment Requirements: Reserved for Economics Majors &amp; Minors.", "descriptions": [{"name": "Overview of class", "value": "This course will deal with the economic history of China from a comparative perspective. It mainly tackles Chinese economic history from the late imperial period to the modern period, but also aims to provide a historical perspective for understanding the strength and limitation of the contemporary Chinese economy."}, {"name": "Registration Requirements", "value": "310-1 and 311 are required"}, {"name": "Teaching Method", "value": "There will be two lectures a week. The lecture materials and readings should be viewed as largely complementary, since the lectures will explain and often dispute the readings, hence both lecture materials and readings will be necessary to pass the course with a good grade because they are complements, not substitutes. Note: all lecture slides, graphs and tables shown in class will be made available on the Canvas site for this course following the lectures."}, {"name": "Evaluation Method", "value": "There will one mandatory midterm exam and an inclusive final exam. The midterm will cover all reading materials and lecture material of weeks 1-4. Students who score in the top 50% in the midterm will have the option of writing a paper in lieu of the exam. The topic and methodology have to be approved and the paper has to be submitted by the day of the final."}, {"name": "Class Materials (Suggested)", "value": "Richard von Glahn, The Economic History of China: From Antiquity to the Nineteenth Century, Cambridge University Press (ISBN: 978-1107615700)"}], "instructor": [""], "class_attributes": "", "id": "12743", "subject": "ECON"}]