[{"class_mtg_info": [{"meet_t": "TuTh 5:00PM - 6:20PM", "meet_l": "Kresge 3438 Philosophy Sem. Rm"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Winter 2017", "name": "22725", "title": "WCAS PHIL 109-6-21 First-Year Seminar in Philosophy", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "22725", "instructors": [{"instructor_phone": "", "instructor_name": "Guy   Elgat", "instructor_addr": ""}], "topic": "Nietzsche", "course": "109-6", "descriptions": [{"name": "Overview of class", "value": "This course will be taught by Prof. Guy Elgat, a visiting scholar and NU PhD Philosophy graduate. We will debate the original ideas of the nineteenth century German philosopher Friedrich Nietzsche. According to Nietzsche, morality, justice, divinity, even the self are deceptive human inventions. His diagnosis of humanity was partly pessimistic: humans, he thought, are cunning creatures that love their idols and ideals too well, seethe with a resentment of which they may be unaware, and follow the herd. But he was also an optimistic philosopher, encouraging humans to cultivate a ?great health' and to become otherwise. We'll look at some of the ideas, and even mention the forms of music and drama that Nietzsche thought were positive stimulants to life, and other, depressant forms he thought should be avoided. After considering Nietzsche's bracing evaluation of us, we will turn the tables and evaluate Nietzsche- what are the advantages and disadvantages of his ideas?"}, {"name": "Teaching Method", "value": "Discussion (in class and on line), peer group work, discussion of draft papers."}, {"name": "Evaluation Method", "value": "Written assignments (80%), oral assignments and class participation (20%). The grade may take into account postings on electronic discussion boards and class discussion. Vigorous debate is encouraged, as is willingness to reflect, problematize, consider objections, argue, and think imaginatively in papers. Because ll of your papers will involve the critical assessment of this one writers, students are highly advised to read a little Nietzsche before selecting the class. Go to: http://www.thenietzschechannel.com/"}, {"name": "Class Materials (Required)", "value": "Selections from &quot;The Nietzsche Reader&quot; ed. Keith Ansell-Pearson and Duncan Large (Blackwell, 2006) ISBN-13: 9780631226543."}], "lmod": "12/29/16 7:03 PM (CT)", "subject": "PHIL"}]