[{"class_mtg_info": [{"meet_t": "Tu 5:00PM - 7:50PM", "meet_l": "Technological Institute MG51"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "33840", "title": "WCAS ENVR_SCI 390-0-20 Special Topics in Environmental Sciences", "class_attributes": "", "section": "33840", "instructors": [{"instructor_phone": "", "instructor_name": "Michael William Ribant", "instructor_addr": ""}], "topic": "GIS II", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "Applied Geographic Information Systems II is a follow-up to Applied Geographic Information Systems and assumes a beginning level of proficiency in using the professional standard in GIS software: ArcGIS. This course builds on Applied GIS by introducing students to more sophisticated methods in raster processing, multi-dimensional data analysis and geostatistics. By working with LiDAR, remote sensing datasets, and Species Distribution Models, students will learn how to optimize visualization and analysis of large geospatial datasets. Students will also learn how to automate their geospatial analysis workflow using Model Builder and Python scripting. These skills will be introduced in the context of exemplar problems in climate science, hydrology, geochemistry, and ecology. Data is primarily analyzed using the professional standard in GIS software?ArcGIS?, though students swill often be using R Studio for statistical analyses and large data downloads. Instruction will assume some prior experience using ArcGIS?, however, no proficiency in the R language is expected of incoming students."}, {"name": "Registration Requirements", "value": "ENVR SCI 201 or EARTH 201 or instructor permission"}, {"name": "Learning Objectives", "value": "Identify environmental problems suited to geospatial analysis; Analyze environmental data using a Geographical Information System (GIS); Integrate GIS analysis with other quantitative methods; Effectively communicate the results of geospatial analysis; Quantify geospatial statistics; Build customized toolboxes and scripts to automate a GIS workflow"}, {"name": "Teaching Method", "value": "THE CORE TEACHING METHODS ARE LECTURES, SUPERVISED LABORATORY SESSIONS, AND MENTORED INDEPENDENT RESEARCH. CLASS SESSIONS LAST TWO AND HALF HOURS AND CONVENE TWICE A WEEK (~0:45 LECTURE; ~1:45 LAB). HOWEVER, STUDENTS ARE EXPECTED TO COMMIT SUBSTANTIAL TIME OUTSIDE OF CLASS (&gt;5 HOURS PER WEEK) TO COMPLETE GIS PROJECTS AND SHOULD PLAN ACCORDINGLY. CLASSES STRONGLY BUILD OFF OF EACH OTHER. AS SUCH, COMPLETION OF WORK DURING ONE WEEK IS CONTINGENT ON COMPLETION OF WORK FROM PRIOR WEEKS."}, {"name": "Evaluation Method", "value": "In-class lab exercises; homework exercises; GIS reading responses, student-designed final project"}, {"name": "Class Materials (Required)", "value": "No Textbook Required"}, {"name": "Class Materials (Suggested)", "value": "Mastering ArcGIS, Seventh Edition (Spiral Bound) / Maribeth Price / ISBN: 9780078095146 / McGraw Hill"}], "lmod": "2/16/17 6:46 PM (CT)", "subject": "ENVR_SCI"}]