[{"school": "WCAS", "overview_of_class": "While those going in to the field of mental health typically think about it as a &quot;helping profession&quot;, there is much more than meets the eye when it comes to the economics and politics that have defined the development of the field. The purpose of this course is to explore some of the historical and economic forces that have shaped the field as it exists today. The course will begin with an exploration of the role of state mental hospitals in the U.S. in the early to mid-20th century, and examine the political forces that drove the de-institutionalization movement of the 1970s and 1980s. The course will also focus on the evolution of the Diagnostic and Statistical Manual of Mental Disorders (now in its 5th edition), and some of the problems that have emerged from the disease-based framework utilized in the manual. The aggressive way in which the DSM has been marketed internationally will be discussed. Finally, the course will explore critiques of the pharmaceutical industry and modern psychiatry. Some of these themes will also be explored through analysis of popular films and other media.", "name": "First-Year Seminar", "section": "20", "topic": "The Economics and Politics of Mental Health Diagno", "course": "101-6", "meeting_time": ["MoWeFr 11:00AM - 11:50AM"], "path": "/class-descriptions/4640/WCAS/PSYCH/101-6/10175", "instructor": ["Benjamin J Gorvine"], "id": "10175", "subject": "PSYCH"}, {"school": "WCAS", "overview_of_class": "Lots of people have beliefs that other people think are just plain weird. Why do people have these beliefs? We'll look at &quot;weird&quot; beliefs within our culture as well as some cross-cultural examples, and try to understand what leads people to develop and maintain these beliefs. Another issue is that one person's &quot;weird&quot; belief may be another person's firmly held conviction. From this perspective, we'll also try to understand which beliefs are rational. Among the topics we may cover are: witchcraft, alien abduction, superstition, parapsychology, ghosts, evolution vs. creationism, repressed memories of abuse, multiple personality disorder, and spirit possession. Students will learn to use a wide variety of academic and not-so-academic resources (including empirical research articles, ethnographic descriptions, philosophical arguments, popular press books, and documentary films) to explore the bases for these beliefs and practices.", "name": "First-Year Seminar", "section": "21", "topic": "Psychology and &quot;Weird&quot; Beliefs", "course": "101-6", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4640/WCAS/PSYCH/101-6/10176", "instructor": ["Sara Cantonia Broaders"], "id": "10176", "subject": "PSYCH"}, {"school": "WCAS", "overview_of_class": "For many, music serves a valuable function in everyday life. Music can serve as a mode of artistic expression, a method of relaxation, a means of influencing mood, and an avenue toward transcendence. This course will focus on the human experience of music by integrating research and theory from cognitive, social, and developmental psychology. Special attention will be given to topics such as the perception of music, the development of musical expertise and creativity, the effect of music on cognition, the emotional impact of music, and effective musical instruction.", "name": "First-Year Seminar", "section": "22", "topic": "Music and the Mind", "course": "101-6", "meeting_time": ["MoWe 9:30AM - 10:50AM"], "path": "/class-descriptions/4640/WCAS/PSYCH/101-6/10177", "instructor": ["Harry David   Smith"], "id": "10177", "subject": "PSYCH"}, {"school": "WCAS", "overview_of_class": "In this seminar we will examine the nature of the mind from both Buddhist and traditional Western psychological perspectives. We will employ Buddhist techniques for investigating mental activity by incorporating a brief meditation period into class and homework activities. We will also examine written materials from both traditions, and these will form the primary basis for class discussion and written assignments.", "name": "First-Year Seminar", "section": "23", "topic": "Buddhist Psychology", "course": "101-6", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4640/WCAS/PSYCH/101-6/10178", "instructor": ["Marcia F Grabowecky"], "id": "10178", "subject": "PSYCH"}]