[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "Harris Hall L28"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "25456", "title": "WCAS ENGLISH 339-0-20 Special Topics in Shakespeare", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "25456", "instructors": [{"instructor_phone": "", "instructor_name": "Jeffrey A Masten", "instructor_addr": ""}], "topic": "Hamlet: That is the Question", "course": "339-0", "descriptions": [{"name": "Overview of class", "value": "We will spend the term delving deeply into the meaning and significance of a play often said to be at the heart of Shakespeare's canon and of modern Western culture more generally. Devoting a full course to one play will allow us to read this enduringly important, exceptionally enigmatic tragedy intensively, scene by scene, sometimes line by line. At the same time, it will allow us to see the many and sometimes conflicting Hamlets that have existed since about 1600, when it was first written and performed. We will read the three early (and different) printed versions of the play from Shakespeare's time. We will also encounter the play through the lenses and tools of several modern critical approaches that have sought to address the mystery of the play and its central character: psychoanalytic Hamlet, post-structuralist Hamlet, Marxist Hamlet, new historicist Hamlet, feminist and queer Hamlets, alongside the critical perspectives of some film versions and Tom Stoppard's ingenious revision. &quot;To be or not to be,&quot; as we will see, is not the only question."}, {"name": "Teaching Method", "value": "Seminar with some mini-lectures."}, {"name": "Evaluation Method", "value": "Thorough preparation and participation in our discussions; essays."}, {"name": "Class Materials (Required)", "value": "Shakespeare, Hamlet (specific, required edition TBA); Stoppard, Rosencrantz and Guildenstern are Dead; critical, theoretical, and historical articles."}], "lmod": "1/9/16 6:47 PM (CT)", "subject": "ENGLISH"}]