[{"class_mtg_info": [{"meet_t": "Th 12:30PM - 3:20PM", "meet_l": "Kresge Centennial Hall 2-325"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: No freshmen allowed. Pre-registration is for Global Health Studies Minor only. Registration is open to other students after pre-registration.", "qtr": "Spring 2017", "name": "33938", "title": "WCAS GBL_HLTH 320-0-2 Qualitative Research Methods in Global Health", "class_attributes": "No Freshmen<br/><br/>", "section": "33938", "instructors": [{"instructor_phone": "", "instructor_name": "Peter Andrew Locke", "instructor_addr": "1812 Hinman Avenue"}], "topic": "", "course": "320-0", "descriptions": [{"name": "Overview of class", "value": "This course introduces students to the theoretical underpinnings of qualitative research methods and develops the practical skills necessary to conduct rigorous qualitative field research on global health topics. Through seminar-style discussions, small-group workshops, and out-of-class research exercises, students will become familiar with how qualitative methods are applied at each stage of the research process, including design, data collection, analysis, and write-up. Throughout the class, we will consider the ethical dilemmas and methodological challenges that confront qualitative researchers working in global health. Students should note that this course demands significant time and attention: not only in regards to reading assigned selections, participating actively in class discussions, and providing meaningful and constructive feedback to peers, but also in planning, conducting, analyzing, and writing up out-of-class research exercises."}, {"name": "Class Materials (Required)", "value": "Emerson, R. M. et al (2011). Writing Ethnographic Fieldnotes. Second Edition. Chicago: University of Chicago Press. ISBN 0226206831<br/><br/>Weiss, Robert S. (1995) Learning from Strangers: The Art and Method of Qualitative Interview Studies. Free Press. ISBN 0684823128<br/><br/>Course pack will be available or students can download the additional readings from Canvas"}], "lmod": "2/13/17 6:44 PM (CT)", "subject": "GBL_HLTH"}]