[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Kresge Centennial Hall 2-430"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24840", "title": "WCAS SPANISH 361-0-1 Latin America: Studies in Culture and Society", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "24840", "instructors": [{"instructor_phone": "", "instructor_name": "Dierdra Joy Reber", "instructor_addr": ""}], "topic": "", "course": "361-0", "descriptions": [{"name": "Overview of class", "value": "Mexican Culture through Cinema: Revolution and Its Aftermath<br/> <br/>Mexico has one of the richest filmographies of the broader Latin American cinematic industry, one that allows for the study of the complex history of the nation through its onscreen representation over the course of the twentieth century and into the twenty-first. In the first half of the course, we will trace social/political/cultural crisis, change, and status quo in three units on Revolution, the status of the indigenous from post-revolution to the 2014 disappearance of forty-three students in Ayotzinapa, and, finally, the middle class, modernity, and Tlatelolco (the famous residential complex and the infamous 1968 massacre that took place therein). In the second half of the course, students will take charge of the syllabus in small groups, each group selecting a film (or relevant cultural text) for study by the class and then teaching that text in a class session dedicated to its study. Throughout the semester, we will focus on creating a composite portrait of Mexico through the cultural content we study, and we will focus on strengthening our skills of critical analysis. Although narrative film will be our principal medium of study, we will also see documentary film, read short stories (of relevant content and/or the original texts of filmic adaptations), analyze art (muralism and canvas painting), consider architecture as a cultural text (the Nonoalco-Tlatelolco residential complex in Mexico City), follow journalistic coverage of Ayotzinapa (The New Yorker and Mexican press), learn about the political movement known as the &quot;Mexican Spring,&quot; and see music videos. As we move through our diverse topics and media, we will focus on identifying and maintaining the critical through lines of unifying themes and symbols within Mexican cultural production and discourse.<br/><br/><br/>Films/texts/topics may include:<br/>Fernando de Fuentes, Vámonos con Pancho Villa (1936)<br/>Muralism of Diego Rivera (c. 1930)<br/>Emilio Fernández, María Candelaria (1944)<br/>Alejandro Galindo, Una familia de tantas (1948)<br/>Juan Rulfo, &quot;Nos han dado la tierra&quot; (El llano en llamas, 1953)<br/>Luis Buñuel, El ángel exterminador (1962)<br/>Jorge Ibargüengoitia, &quot;La ley de Herodes&quot; (1967)<br/>Raymundo Gleyzer, México: la revolución congelada (1970)<br/>Jorge Fons, Rojo amanecer (1990)<br/>EZLN (1994)<br/>Luis Estrada, La ley de Herodes (1999)<br/>Fernando Eimbcke, Temporada de patos (2004)<br/>Rigoberto Pérezcano, Norteado (2009)<br/>Carlos Reygadas, &quot;Este es mi reino&quot; (2010)<br/>#yosoy132 (2012)<br/>Michel Franco, Después de Lucía (2012)<br/>Shaul Schwarz, Narco Cultura (2013)<br/>Ayotzinapa (2014)<br/>&quot;Todos somos mexicanos&quot; (2015)"}], "lmod": "12/25/16 7:08 PM (CT)", "subject": "SPANISH"}]