[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Meets in Non-General PurposeRm"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Spring 2016", "name": "37791", "title": "WCAS GEN_LA 280-1-20 Residence-Linked Seminar - I (Natural Sciences)", "class_attributes": "Permission of Instructor<br/><br/>", "section": "37791", "instructors": [{"instructor_phone": "847/467-7100", "instructor_name": "Andrew J Rivers", "instructor_addr": "1918 Sheridan"}], "topic": "Light, Atoms and the Void", "course": "280-1", "descriptions": [{"name": "Overview of class", "value": "A few key ideas took root in the last 200 years that grew and branched to frame our current understanding of the world we live in. For insight into these changes, we will examine three key ideas: light, atoms and the void. Each of these have specific scientific turning points: Maxwell's unified electricity and magnetism into a theory of light; theorists explored atoms from the philosophical very small, to the probabilistic world of quantum mechanics; and Einstein connected the darkness of space with the passage of time. These historical models entwined and shifted, gathering evidence to underpin the models for modern quantum fields and particles like the Higgs boson. At the same time, those same ideas drove a wave of technological revolutions, connecting people through a sea of electromagnetic radiation. Further, those technological changes spurred changes in societies and the relationships between nations?such an arms race that enveloped the world, but traced its roots to a calculation of energy in the tiny nucleus of an atom. In this course, we will chart a path through history, through discovery, through changes that will illuminate another generation of people, and explain the story of &quot;how we got to now.&quot;"}, {"name": "Learning Objectives", "value": "At the end of this course students will <br/><ul> Understand the conceptual frameworks of light, atoms and space-time and their applications to technology. <br/><li> Critically evaluate the scientific evidence for each of these theories compared to historical alternative ideas.</li><br/><li> Discover &quot;hidden&quot; connections between the three scientific theories and modern technology. Critically evaluate and defend these narratives of &quot;how we got to now&quot;.</li><br/><li> Present and defend narratives building from the scientific ideas to the impacts on society.</li><br/></ul>"}, {"name": "Evaluation Method", "value": "<ul> Three exams will be given over the quarter. Each covering one of the three subtopics. These exams will have a 30 minute in-class component and a take- home portion testing knowledge of scientific ideas. <br/><li> Each class will be split into a lecture with demonstrations and an in-class presentation and discussion led by student pairs.</li><br/><li> The student team will also be in charge of a parallel on-line discussion using the Canvas add-on &quot;Yellowdig&quot; which enables students to pin and comment on news articles. One posted article with a paragraph narrative would be expected each week from each student. A substantive comment on articles posted by other students would be required.</li><br/><li> Three shorter writing assignments will be given over the quarter, for each of the three topics. The assignments will be in the form of blog posts equivalent to 3-4 written pages and students will be expected to ask questions and discuss.</li><br/></ul>"}], "lmod": "4/3/16 8:01 PM (CT)", "subject": "GEN_LA"}]