[{"school": "WCAS", "overview_of_class": "This writing-intensive course focuses on a number of classics by cinema's \"master of suspense,\" Alfred Hitchcock. Films will likely include Vertigo, Psycho and North by Northwest. The last third of the class will focus on Hitchcock's legacy and influence, e.g. Chris Marker's La Jetée and John Carpenter's Halloween. Our primary focus, however, will always lie with attending to the ways film style affects the treatment of key themes across Hitchcock's filmography: from mistaken identity and sexual politics to horror and voyeurism. Assignments will include short essays and several digital editing projects including making animated .gifs and supercuts. No prior technical experience will be presumed.", "name": "First-Year Seminar", "section": "20", "location": "Harris Hall L04", "topic": "Hitchcock and Beyond", "course": "101-6", "meeting_time": ["MoWe 9:30AM - 10:50AM"], "path": "/class-descriptions/4650/WCAS/ENGLISH/101-6/23887", "instructor": ["James Joseph Hodge"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "23887", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "In the modern era, audiences can immerse themselves in their favorite fictions in many ways outside of simply watching the film or reading the book. Audiences may inhabit a story through trading fan theories online, dressing up for comic-book conventions, or buying branded products. This course examines the history of such strategies of audience participation, beginning with the rise of a mass reading public in nineteenth century and tracing such collective reception today. In the Victorian era, sensation and detective fiction pioneered new relationships with audiences through such strategies as the suspense of serialized episodes, the pacing of shocking cliffhangers, and the consumption of spin-off merchandise. We will examine how texts manipulate mass audiences through formal structures in order to surprise readers or subvert their expectations. Conversely, we will also study how mass audiences help produce the texts they read?for example, when famous characters like Sherlock Holmes take on a life outside their original texts. By theorizing a dynamic relationship between audiences and texts, this course will prepare you for your own role as a thoughtful participant of popular culture, one who can craft close-readings, amass evidence, and interact with diverse interpretations.", "name": "First-Year Seminar", "section": "21", "location": "Harris Hall L04", "topic": "No Spoilers!", "course": "101-6", "meeting_time": ["MoWe 12:30PM - 1:50PM"], "path": "/class-descriptions/4650/WCAS/ENGLISH/101-6/23888", "instructor": ["Hosanna Grace Krienke"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "23888", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "Recently, an abundance of heroines has emerged in young adult literature and, in turn, cinema. In contradistinction to the earlier (and slightly concurrent) popularity of the more passive female protagonist of Twilight, the image of a strong female lead, shooting arrows, jumping off of trains, and generally kicking ass, has captured the attention of readers, movie-goers, and the mainstream media. This class asks why the strong heroine is popular in this cultural moment both by analyzing the primary texts that feature them and by reading them in conjunction with analysis of the phenomena from the perspective of cultural studies. Representations of these heroines in the media will also be treated as texts for unpacking the significance of the trend. Does the introduction of these young women in young adult fiction change the way popular culture represents the role of women and girls in society more generally? As a foundation for our investigation, the course will begin by historicizing the notion of what it means to be a \"heroine\" in the popular imagination and specifically in the narratives offered by literature and film. Traditionally, is the heroine's journey distinct from the hero's? How might the heroine destabilize constructs of gender and sexuality? How does the role of the heroine relate to genre? (Are the genres of fantasy and dystopian fiction, for instance, especially conducive to the emergence of a Katniss-like heroine?) To answer these questions, our readings will engage with gender and feminist theory and masculinity studies. In doing so, we will dissect the traits characterizing recent popular heroines and examine how they might undermine hierarchies and norms of gender and sexuality. At the same time, our inquiry will trouble whether the current era of heroines is actually as subversive as it might seem by investigating what gender roles and stereotypes these characters and their stories might be reinforcing.", "name": "First-Year Seminar", "section": "22", "location": "Harris Hall L05", "topic": "Action Heroines", "course": "101-6", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4650/WCAS/ENGLISH/101-6/23889", "instructor": ["Whitney Blair Taylor"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "23889", "subject": "ENGLISH"}]