[{"school": "JOUR", "overview_of_class": "Taught by Bill Healy? <br/>&quot;Serial&quot; captured millions of people's imaginations this past winter. This course will use that program as a jumping off point for discussing the conventions of storytelling podcasts. The goal of the course is to use audio and text to create compelling original content rooted in Chicago. The class will include significant fieldwork in the city, with an emphasis on recording audio and writing for the ear.", "name": "Journalism in Practice", "section": "20", "topic": "&quot;Serial&quot; in the Golden Age of Podcasting", "course": "301-0", "meeting_time": ["Fr 9:00AM - 1:50PM"], "path": "/class-descriptions/4640/JOUR/JOUR/301-0/11833", "instructor": ["William R. Healy"], "id": "11833", "subject": "JOUR"}, {"school": "JOUR", "overview_of_class": "Taught by Prof. Brent Huffman <br/>In this class students will use photography, audio, and video to tell the unique and complex story one of the most diverse neighborhoods in Chicago. Bridgeport evolved from a troubling past of segregation to become a modern community with no ethnic majority. The unique neighborhood is home of the White Sox, &quot;the hipster triangle&quot;, the Zhou Brothers Art Gallery, Bubbly Creek, the home of five Chicago mayors and much more. This class will explore this history and use multimedia to tell the story of the diverse people who call Bridgeport home.", "name": "Journalism in Practice", "section": "21", "topic": "Multimedia Storytelling from Bridgeport - &quot;The Com", "course": "301-0", "meeting_time": ["Mo 9:00AM - 9:50AM", "We 9:00AM - 12:50PM"], "path": "/class-descriptions/4640/JOUR/JOUR/301-0/11834", "instructor": ["Brent E Huffman"], "id": "11834", "subject": "JOUR"}, {"school": "JOUR", "overview_of_class": "Taught by Prof. Ava Greenwell <br/>Journalism in Practice: Social Change and Urban Dynamics - From the regal homes of the Kenwood neighborhood where the Obamas own a home to the blighted Roseland neighborhood where President Obama worked as a community activist, Chicago is a tale of two cities. The re-gentrifying Hyde Park neighborhood is well known as the place where The Obamas worked, relaxed and went to school before their move to the White House. The neighboring communities, however, struggle to achieve the same positive notoriety. With the next presidential library to be built near the Obamas' old neighborhood, what will the global attention mean for nearby residents? The class will focus on reporting on social inequities impacting Chicago's South Side communities.?", "name": "Journalism in Practice", "section": "22", "topic": "The Obama's Chicago, A Tale of Two Cities", "course": "301-0", "meeting_time": ["Mo 1:00PM - 1:50PM", "Fr 1:00PM - 4:50PM"], "path": "/class-descriptions/4640/JOUR/JOUR/301-0/11837", "instructor": ["Ava Thompson Greenwell"], "id": "11837", "subject": "JOUR"}, {"school": "JOUR", "overview_of_class": "Since the first days of the Internet, Chicago has been home to fascinating startup businesses at the intersection of media and technology. In this course, students will study the pros and cons of locating an innovative new business in the Chicago area; examine products and services that are being built and tested here today; analyze the choices that are being made by media companies, tech entrepreneurs, and investors; and observe how the general public learns about these businesses. Course work includes readings, lectures by faculty and guest speakers, several field trips with associated reporting, and a final team project.", "name": "Journalism in Practice", "section": "23", "topic": "Media Innovation and Chicago's Startup Culture", "course": "301-0", "meeting_time": ["TuTh 2:00PM - 4:20PM"], "path": "/class-descriptions/4640/JOUR/JOUR/301-0/17449", "instructor": ["Owen R Youngman", "William David Swislow", "Carol Fowler Klobucar"], "id": "17449", "subject": "JOUR"}]