[{"class_mtg_info": [{"meet_t": "MoWe 12:30PM - 1:50PM", "meet_l": "ANTHRO Sem Rm 104 - 1810 Hinmn"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Fall 2016", "name": "10174", "title": "WCAS ANTHRO 324-0-1 Archaeological Survey Methods", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "10174", "instructors": [{"instructor_phone": "847/467-1648", "instructor_name": "Mark William Hauser", "instructor_addr": "1812 Hinman Ave., Room #205, EV Campus"}], "topic": "", "course": "324-0", "descriptions": [{"name": "Overview of class", "value": "This course will focus on how archaeologists conduct an archaeological survey and interpreting its results using the Evanston Campus of Northwestern as its field site. We will focus on how to collect on the ground data and to make maps using the newest GIS technologies. Students will receive practical training in archeological survey methods and techniques, landscape survey methodologies, mapping techniques and analysis. Specifically it will provide methods used in locating, recording, and mapping archaeological features, artifacts and sites. It will also provide a framework for modeling spatial relationships through computer-aided technologies such as GIS. Hands-on Archaeological Survey. This course will utilize a combination of seminar discussion and field and lab based practical training. Seminars will be organized around reading, class presentations, and critical discussions. We will engage in hands-on training with field surveying equipment and discuss strategies for conducting fieldwork tasks as efficiently and effectively as possible. Training sessions will be followed by hands-on research sessions that will put to use techniques students have learned."}, {"name": "Class Materials (Required)", "value": "Wilkie, Laurie The Lost Boys of Zeta Psi: A Historical Archæology of Masculinity at a University Fraternity (Berkeley: University of California Press, 2010) All other readings are in a course pack"}], "lmod": "10/30/16 6:58 PM (CT)", "subject": "ANTHRO"}]