[{"class_mtg_info": [{"meet_t": "Mo 6:00PM - 8:50PM", "meet_l": "Meets in Non-General PurposeRm"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Winter 2016", "name": "27714", "title": "WCAS GEN_LA 280-3-20 Residence-Linked Seminar - III (Social &amp; Behavioral Sciences)", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>Permission of Instructor<br/><br/>", "section": "27714", "instructors": [{"instructor_phone": "", "instructor_name": "Ana C Thome Williams", "instructor_addr": ""}], "topic": "About Rio: Culture, Contradiction, and Competitio", "course": "280-3", "descriptions": [{"name": "Overview of class", "value": "The main purpose of this course is to offer the students an overview of Brazilian culture, and analyze socio cultural and economic characteristics of Rio de Janeiro, as the hosting city of the 2016 Summer Olympics."}, {"name": "Learning Objectives", "value": "At the end of this course the students will be able to:<br/><ul><br/><li>Identify the influences of Amerindians, African slaves and the European colonizer in sociocultural aspects of Brazil. </li><br/><li>Recognize the importance of Rio de Janeiro in Brazilian socio-political scenario. </li><br/><li>Recognize the significance of popular music, festivities and sporting events that characterize the profile of the city and the country. </li><br/><li>Describe and analyze social contrasts and contradictions in the daily life of the Cariocas. </li><br/><li>Observe the possible impacts of the Summer Olympics on the city and on the country. </li><br/></ul>"}, {"name": "Teaching Method", "value": "Lecture, class discussions and presentations."}, {"name": "Evaluation Method", "value": "<p>Homework and Class participation: 20%. This course will be based primarily on discussion, and all students are expected to be prepared for it, by reading from book chapters, selected articles, and other materials.</p><br/><p>8 short essays: 40%. Each week, students should present a short essay (1 page: 200 to 300 words) about the topic in discussion, making connections, presenting insights and perspectives about the theme. Essay questions will be proposed. </p>"}], "lmod": "1/9/16 6:47 PM (CT)", "subject": "GEN_LA"}]