[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "Parkes Hall 223"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "34918", "title": "WCAS ENGLISH 339-0-20 Special Topics in Shakespeare", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "34918", "instructors": [{"instructor_phone": "", "instructor_name": "Christopher Daniel Shirley", "instructor_addr": ""}], "topic": "Material Shakespeares", "course": "339-0", "descriptions": [{"name": "Overview of class", "value": "Contemporary audiences and readers now most commonly encounter Shakespeare's works in modern theatres and in annotated scholarly texts, but Shakespeare's contemporaries consumed his works in considerably different material circumstances, whether standing among the &quot;groundlings&quot; in open-air theatres or reading unadorned and inexpensive printed texts. In this course, we'll consider several of Shakespeare's plays and his poem Venus and Adonis as they appeared on the early modern stage and page, consulting scholarly reconstructions of Renaissance theatrical techniques, printing procedures, and overall cultural contexts to aid our inquiry. We may also make trips to the Newberry Library to view sixteenth- and seventeenth-century printings of Shakespeare's texts and the Chicago Shakespeare Theater to experience &quot;material Shakespeares&quot; in person. Ultimately, this course will allow us to consider how the material conditions of theatrical and literary practice influenced Shakespeare's work and how, in turn, he helped shaped the material conditions of his culture."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Class participation and essays."}, {"name": "Class Materials (Required)", "value": "Shakespeare, The Merry Wives of Windsor, Hamlet, Venus and Adonis, Twelfth Night, Othello;<br/>viewings of Globe Theater productions;<br/>selections from: Leah Marcus, Unediting the Renaissance;<br/>Bruce Smith, The Acoustic World of Early Modern England;<br/>David Crystal, Pronouncing Shakespeare;<br/>scholarly articles."}, {"name": "Class Notes", "value": "Pre 1830"}], "lmod": "4/3/16 7:58 PM (CT)", "subject": "ENGLISH"}]