[{"class_mtg_info": [{"meet_t": "We 3:00PM - 5:50PM", "meet_l": "Louis Hall 118"}], "school": "SoC", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Fall 2016", "name": "14287", "title": "SoC RTVF 464-0-20 Advanced Media Writing", "class_attributes": "", "section": "14287", "instructors": [{"instructor_phone": "", "instructor_name": "Zina Adrienne Camblin", "instructor_addr": ""}], "topic": "Advanced Sitcom Writing", "course": "464-0", "descriptions": [{"name": "Overview of class", "value": "COURSE GOAL: It is important for all aspiring filmmakers to learn how they can actively create and control the dramatic aspects of storytelling, whatever the content or mode of presentation. This course offers the opportunity to explore dramatic storytelling from the documentary perspective. The course will examine the elements of story structure- narrative voice, point of view, theme, perspective, the temporal and spatial arrangements of events (condensing space and time) and the reciprocal influences between plot, theme, premise, sub-plot and character. Once fundamental principles are established, the focus shifts specifically to documentary film. By studying excerpts from existing works students develop an understanding of narrative approaches to documentary and apply that knowledge to a personal project they wish to develop. <br/><br/>READING MATERIALS: <br/> <br/>Title: Documentary Storytelling <br/>(3rd Edition)<br/>Author: Sheila Curran Bernard<br/>Publisher: Focal Press, Boston 2011<br/>ISBN: 0-240-80875-4<br/>Title: Avant-Doc, Intersections of Documentary and Avant-Garde Cinema<br/><br/>Author: Scott MacDonald<br/>Publisher: Oxford University Press<br/>ISBN: 9780199388714<br/><br/> <br/>ASSIGNMENTS &amp; (FINAL GRADE POINTS)<br/><br/><br/>STRUCTURE ANALYSIS (30)<br/>Students will write 3 papers that analyze the structure of a feature length documentary that has been viewed by the class. Included in their 3-page analysis is a discussion of how the structure works to advance the narrative of the story and it if so, why it does not work, and how you would have fixed the structural problems in the film. Papers will be graded on content as well as professionalism (spelling, punctuation, grammar, overall presentation). <br/> <br/>WRITING WITH TRANSCRIPTS (10)<br/>Students will be given 4 sets of interview transcripts from which they will build a narrative using only the words from your subjects. <br/> <br/>FINAL PROJECT &amp; PRESENTATION (40) <br/>Students will write a written proposal for a documentary film they wish to make on a topic they have researched, identifying possible subjects for the film, the approach, and possible storylines. They will follow the formula outlined by the Sundance Documentary Fund. <br/> <br/>The final class will be PITCH day. All students will present their documentary proposal in a verbal pitch to the class. They will have a total of 7 minutes, which will be broken up into the verbal pitch followed by questions from their fellow classmates. The presentation must include the story, approach, possible structure and potential audience for the film. <br/> <br/>QUIZZES (10) <br/>2 in class quizzes from the assigned readings and topics. Quizzes may be made up within one week due to an excused absence at the discretion of the instructor. <br/> <br/>PARTICIPATION (10) <br/>Watching weekly films, Attendance- (including punctuality) and engagement in classroom discussions."}], "lmod": "10/30/16 6:50 PM (CT)", "subject": "RTVF"}]