[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Annenberg Hall G32"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "33431", "title": "WCAS HISTORY 300-0-40 New Lectures in History", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "33431", "instructors": [{"instructor_phone": "847/467-2670", "instructor_name": "Daniel A Stolz", "instructor_addr": "Harris Hall 235"}], "topic": "Islam, Science, and Modernity", "course": "300-0", "descriptions": [{"name": "Overview of class", "value": "What is, or was, &quot;Islamic science&quot;? This course begins a thousand years ago with the flourishing of mathematics, astronomy, medicine, and optics in the imperial capitals of Baghdad and Cairo. But we will focus on the seldom-told history of science in more recent Islamic societies, investigating the role that science has come to play in Muslim debates about modernity. How has the place of science in Islamic society changed over the last two hundred years, and what historical factors continue to shape the relationship of Islam and science today? Each week of the course will examine a specific debate in its historical context, from arguments about disease transmission amidst the plagues of the 14th century, to the recent controversy over organ transplants in Egypt. Themes will include: science and the interpretation of scripture; technology, communication, and community; gender, sexuality, and the body; and medical ethics."}, {"name": "Teaching Method", "value": "Lecture and discussion sections"}, {"name": "Evaluation Method", "value": "Short writing assignments, participation, and final exam"}, {"name": "Class Materials (Required)", "value": "READING LIST: <br/>Sherine Hamdy. Our Bodies Belong to God: Organ Transplants, Islam, and the Struggle for Human Dignity in Egypt. Berkeley: University of California Press, 2012. ISBN 9780520271760."}, {"name": "Class Notes", "value": "HISTORY AREA OF CONCENTRATION: Global History"}], "lmod": "4/3/16 8:03 PM (CT)", "subject": "HISTORY"}]