[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "Annenberg Hall G15"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-registration is reserved for Sociology, SHC, or Global Health students.", "qtr": "Spring 2017", "name": "35558", "title": "WCAS SOCIOL 216-0-20 Gender and Society", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "35558", "instructors": [{"instructor_phone": "", "instructor_name": "Savina Jewel   Balasubramanian", "instructor_addr": ""}], "associated_classes": [{"component": "DIS", "room": "Parkes Hall 224", "meeting_time": "Mo 9:00AM - 9:50AM"}, {"component": "DIS", "room": "Annenberg Hall 101", "meeting_time": "Tu 9:00AM - 9:50AM"}, {"component": "DIS", "room": "Annenberg Hall G32", "meeting_time": "We 4:00PM - 4:50PM"}], "topic": "", "course": "216-0", "descriptions": [{"name": "Overview of class", "value": "Gender and Society introduces students to three pivotal concepts in the sociological study of gender: the social construction of gender, gender socialization, and gender as an institution. Students will learn about the social construction of gender by examining the creation of gender norms, which are defined as prevailing ideas about sex, gender, masculinities, femininities, and gender non-conformity. We will challenge the binary conceptualization of gender (men/women, masculinity/femininity) by discussing gender non-conformity and transgender experiences. Next, students will learn about the social and political sources of gender norms, including the media, family, schools, sports, and the government. We will examine how these entities actively contribute to gender socialization, defined as the process by which people come to learn about and perform gender in their own lives?otherwise known as &quot;doing gender.&quot; Students will then learn about the consequences of gender norms?specifically, gender inequality in the United States?to understand how gender operates as an institution. Gender inequality is defined as systematic social, economic, and political disparities among differently gendered people that take shape in the workplace, the household, educational settings, and political institutions. These inequalities stand to affect all of us as we build our own careers, families, and personal lives. Finally, students will evaluate ways to address gender inequality, including public policy, law, education, social change, and political participation and representation. Throughout the course we will employ the optic of intersectionality, which shows how gender does not operate in the same way for everyone but intersects with other social identities like race, class, sexuality, nationality, etc."}, {"name": "Registration Requirements", "value": "During preregistration this course is only open to Sociology, Global Health, &amp; SHC Majors &amp; Minors.<br/><br/>This course is open to all undergraduates during regular registration."}, {"name": "Learning Objectives", "value": "By the end of the course students should be able to:<br/><br/>1. Define the social construction of gender, gender socialization, and gender as an institution<br/>2. Explain how norms about men, women, masculinities, femininities, and gender non-conformity are socially constructed and reproduced<br/>3. Identify common sources of gender norms and explain how they socialize people into &quot;doing gender&quot;<br/>4. Explain theories of gender inequality in the workplace, household, educational settings, and political institutions &amp; how gender inequality is shaped by other factors like race, class, sexuality, nationality, etc.<br/>5. Evaluate ways to address gender inequality, including public policy, law, education, cultural and social change, and political participation and representation"}, {"name": "Teaching Method", "value": "Lecture and Discussion Sections"}, {"name": "Evaluation Method", "value": "Short essay paper (20%), Midterm Exam (30%), Final Exam (30%), Attendance and Participation in Discussion (20%)"}, {"name": "Class Materials (Required)", "value": "All materials for this course will be made available on Canvas - no purchase necessary."}], "lmod": "2/8/17 6:46 PM (CT)", "subject": "SOCIOL"}]