[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Kresge Centennial Hall 4-410"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "10553", "title": "WCAS ART_HIST 330-3-1 Renaissance Art", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "10553", "instructors": [{"instructor_phone": "", "instructor_name": "Claudia E Swan", "instructor_addr": ""}], "topic": "", "course": "330-3", "descriptions": [{"name": "Overview of class", "value": "Etymologically, the term &quot;baroque&quot; is derived from the Portuguese for an &quot;irregularly shaped pearl.&quot; &quot;Global Baroque&quot; offers an innovative view of northern European (primarily Dutch &amp; Flemish) artistic production over the course of the 17th century. The focus of the course is on the global dimensions of northern European art and material culture, and we will explore the making and meaning of works of art produced and traded in global capitals from Amsterdam to Constantinople and Isfahan, and London to Macao and Cuzco. We will study how European encounters with cultures spanning the globe conditioned art and the roles representation played in those encounters. In addition to analyzing the ways in which canonical artists such as Rembrandt van Rijn and Peter Paul Rubens responded to the newly global dimensions of artistic encounter and exchange, we will also explore non-European production with regard to transcultural exchange and as export product. Some of the themes and subjects we will touch on are: Baroque collecting and its global dimensions; early modern ethnography and representations of the &quot;other&quot;; Jesuits and religious encounters of the artistic kind; &quot;exoticism&quot; in early modern trade, art, and natural history; Orientalism and curiosity. By tracing the role of art in international politics of the early modern world, students will be introduced to one of the most exciting, important eras in the history of global relations and to new methods for historical analysis of art."}, {"name": "Evaluation Method", "value": "Midterm; take home final (paper); two short writing assignments; participation in class discussion"}, {"name": "Class Materials (Required)", "value": "A course reader will be available for purchase"}], "lmod": "10/30/16 6:58 PM (CT)", "subject": "ART_HIST"}]