[{"school": "WCAS", "overview_of_class": "This course examines the histories of Latin American dances and their relationship to developing notions of race and nation in the region. It studies the historical emergence and transformation of categories such as &quot;indigeneity,&quot; &quot;blackness,&quot; and &quot;whiteness,&quot; and considers how dance practices became associated with these identifications. It also traces dance developments in relation to nation-state formation and social stratification. In short, it explores a paradox: How did dance serve as a source of local cohesion and division by underscoring shared culture as well as racial, gender, and class hierarchies? Weekly readings move forward chronologically from the fifteenth century to present day.", "name": "Special Topics in the Humanities", "section": "21", "topic": "Dance, Race &amp; Nation in Latin America", "course": "370-4", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4640/WCAS/HUM/370-4/12938", "instructor": ["Elizabeth Bowlsby Schwall"], "id": "12938", "subject": "HUM"}, {"school": "WCAS", "overview_of_class": "This course will consider the causes and consequences of the end of the Cold War consensus in American life between the defeat of Lyndon Johnson in 1968 and the election of Ronald Reagan in 1980. We will focus on ways that this era of the &quot;long 1970s&quot; saw the end of political consensus and the emergence of a newly hyper-partisan politics that has defined U.S. politics ever since.", "name": "Special Topics in the Humanities", "section": "22", "topic": "Extreme Makeover: End of Consensus 1970s", "course": "370-4", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4640/WCAS/HUM/370-4/12939", "instructor": ["Michael J. Allen"], "id": "12939", "subject": "HUM"}, {"school": "WCAS", "overview_of_class": "Introduction to Native American History<br/><br/>Long ignored and romanticized, Native American history has become a vibrant area of study rich with new scholarship. This course will grapple with the most important issues currently driving inquiry within the field. We will investigate pivotal developments in Native American history and build a foundation for future coursework. Course topics will include: the new worlds that Natives and various newcomers created, competing visions for what is now known as the United States, tribal sovereignty, federal Indian policy, notions of authenticity, structures of settler colonialism, resistance movements, Indigenous governance, cultural revitalization, conflict over natural resources, and urban experiences. We will also examine how stories about the Indigenous past have been politicized, and how Indigenous histories can reshape our broader understandings of American history and culture.", "name": "Special Topics in the Humanities", "section": "23", "topic": "Introduction to Native American History", "course": "370-4", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4640/WCAS/HUM/370-4/17765", "instructor": ["Douglas   Kiel"], "id": "17765", "subject": "HUM"}]