[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "Fisk Hall 217"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "33361", "title": "WCAS HISTORY 214-0-1 Asian American History", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "33361", "instructors": [{"instructor_phone": "847/467-7114", "instructor_name": "Laura Sachiko Fugikawa", "instructor_addr": "1819 Hinman Avenue, Room 207"}], "associated_classes": [{"component": "DIS", "room": "TBA", "meeting_time": "TBA"}, {"component": "DIS", "room": "TBA", "meeting_time": "TBA"}, {"component": "DIS", "room": "TBA", "meeting_time": "TBA"}], "topic": "", "course": "214-0", "descriptions": [{"name": "Overview of class", "value": "Asian American History is American History. This course is an introductory survey of historical experiences of Asian Immigrants and Asian Americans, Native Hawaiians and Pacific Islanders. Using interdisciplinary and multi-ethnic lenses, we will consider the roles colonization, global politics and American Expansionism play in Asian and Pacific Islanders experiences of emigration and immigration to the United States. Throughout, we ask how did Asian Americans actors wield political influence and circumscribe exclusionary and racist policies to build their lives in America. Questions guiding this course are: How does looking at Asian American history change the way we understand the broader themes in American History? How have global and local wars, disasters and political strife had an impact on our Asian American ancestors and our community in the contemporary moment? How do we define what it means to identify as Asian American over time and place? How do understandings Asian American gender and sexuality identity impact the Asian American experience of over time? What role did Asian Americans play in the construction of contemporary understandings of race and ethnicity in the U.S.? How have Asian Americans organized and created communities to meet these challenges? What American histories are made visible through the study of Asian American historical and cultural sites throughout Chicago?"}, {"name": "Teaching Method", "value": "Class participation, discussion, field trips, films/videos, guest speakers, lecture"}, {"name": "Evaluation Method", "value": "Attendance, demonstrations, final exam, mid-term exam, field trips, papers, peer assessment, quizzes, writing assignments"}, {"name": "Class Materials (Required)", "value": "Gary Y. Okihiro American History Unbound Asians and Pacific Islands 9780520274358<br/>Erika Lee At America's Gates 978-0-8078-5448-8 <br/>Eric Tang Unsettled Cambodian Refugees in the NYC Hyperghetto 978-1439911648<br/><br/>Additional readings on CANVAS."}, {"name": "Class Notes", "value": "Additional readings on CANVAS. <br/>Unannounced quizzes.<br/><br/>HISTORY AREA OF CONCENTRATION: Americas"}], "lmod": "4/3/16 8:03 PM (CT)", "subject": "HISTORY"}]