[{"class_mtg_info": [{"meet_t": "MoWe 10:00AM - 11:50AM", "meet_l": "Fisk Hall B11"}], "school": "JOUR", "enrl_requirement": "Enrollment Requirements: Reserved for Medill Sophomores, Juniors &amp; Seniors", "qtr": "Spring 2016", "name": "32487", "title": "JOUR JOUR 332-0-20 Coverage of Gender and Sexual Minorities", "class_attributes": "", "section": "32487", "instructors": [{"instructor_phone": "", "instructor_name": "Douglas M Foster", "instructor_addr": ""}], "topic": "", "course": "332-0", "descriptions": [{"name": "Overview of class", "value": "This course, for journalism and non-journalism students alike, will survey recent social science research on LGBT communities, engage students in the best ways of translating social science for specialized and general audiences, and discuss mass media coverage. Topics include the aims and limitations of the research; reporting on minority communities with sensitivity and empathy; using appropriate vocabulary and terminology; identifying credible sources; identifying fresh angles; amplifying the voices of under-represented individuals and groups; and contextualizing stories of local, national and international significance.<br/><br/>For non-journalism students the aim is to provide a framework for evaluating coverage based on standards of fairness, accuracy, and newsworthiness. It would allow these students to sharpen evaluation of media coverage based on greater understanding of how newsrooms actually work, including how assignments are made, pursued, framed and presented. Students will read and view coverage, and ask questions directly of visiting reporters, producers, and editorial decision-makers about how stories are framed. They will have an opportunity to pose alternatives, and discuss and debate options for coverage, taking into account the constraints on real world journalism outlets.<br/><br/>For Medill students, the course provides a foundation for thinking generally about how to cover minority communities and, in particular, how to approach reporting across lines of sexual orientation, gender expression, and new family structure. The course would be reading and research heavy. It would include local regional, national and international coverage as well as criticism of that coverage. It would allow journalism students to engage with the advocates for improved coverage of sexual and gender minorities and debate the merits of their critiques.<br/><br/>Each student will pursue depth of understanding in a particular aspect of LGBT life, monitor the unfolding coverage, develop relationships with key scholarly researchers, and bring those two aspects of analysis - from scholars and media practitioners - into the room. Students will pursue a major project involving mastery of the contents of at least two major research studies, assess the quality of journalism in that area, and identify ways in which journalism could be more effective, fairer, and more comprehensive."}], "lmod": "4/3/16 7:12 PM (CT)", "subject": "JOUR"}]