[{"class_mtg_info": [{"meet_t": "Mo 6:15PM - 9:15PM", "meet_l": "University Hall 101"}], "school": "SCS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "27602", "title": "SCS PSYCH 205-CN-62 Research Methods in Psychology", "class_attributes": "", "section": "27602", "instructors": [{"instructor_phone": "847/467-1839", "instructor_name": "Benjamin J Gorvine", "instructor_addr": "Swift 306"}], "topic": "", "course": "205-CN", "descriptions": [{"name": "Overview of class", "value": "This course provides an introduction to designing, conducting, evaluating, and presenting psychological research. Among the topics to be covered are: experimental and non-experimental research; statistical analyses; writing psychological reports; ethics in research; and utilizing library resources. Students will collect and analyze data for three research projects during the quarter, and write a report on each in the style used by research psychologists. Carries social science credit."}, {"name": "Registration Requirements", "value": "PSYCH 201. May not be audited."}, {"name": "Learning Objectives", "value": "At the end of the course you should be able to:<br/>-Demonstrate proficiency with regard to the terminology and concepts involved in psychological research, especially with regard to experimentation<br/>-Obtain research articles relevant to a psychological topic via the online databases (PsycINFO, PsycARTICLES), and synthesize this research<br/>-Formulate hypotheses and design research to test these hypotheses<br/>-Effectively communicate the results of your own psychological research by writing clear, persuasive, appropriately formatted APA-style research reports<br/>-Critically evaluate research results reported by others"}, {"name": "Teaching Method", "value": "Class participation, discussion, group work, lecture, readings, research projects, writing assignments, essay exams"}, {"name": "Evaluation Method", "value": "Midterm and final (essay exams), three research reports in APA style, short papers, class participation and attendance"}, {"name": "Class Materials (Required)", "value": "Cozby, P.C., &amp; Bates, S.C. (2012). Methods in behavioral research (11th ed.). New York: McGraw Hill. <br/>ISBN: 978-0-07-803515-9.<br/><br/>Stanovich, K.E. (2013). How to think straight about psychology (10th ed.). New York: Pearson. ISBN: 978-0-205-91412-8."}], "lmod": "12/25/16 6:52 PM (CT)", "subject": "PSYCH"}]