[{"class_mtg_info": [{"meet_t": "MoWe 9:30AM - 10:50AM", "meet_l": "University Library 4670"}], "school": "WCAS", "overview_of_class": "The aim of this seminar is to introduce students to the history and historiography of race and gender during the Holocaust. As in many historical contexts, race and gender interacted dynamically and created the particular context of Nazi-occupied Europe, which was a place where Jewish men and women suffered in particular ways, German men and women participated in particular ways, and other racial groups - men and women alike - were targeted, collaborated, resisted and rescued. We will read a variety of texts that explore the influences that shaped the behavior and response of an array of people during the Holocaust. Racism sat directly in the center of the Nazi world view. Once the Nazis got into power, they sought to translate ideology into policy. Still, their racial policies evolved over time, spurred by opportunism, innovation, and war. And too, Jewish men and women responded in ways similar and divergent to the Nazi onslaught. Sexism was also seemingly an important aspect of the Nazi perspective. While they indeed embraced an anti-feminist stance, the Nazis nevertheless sought to incorporate \"German\" women into the national community and women participated actively in the implementation of Nazi racism.", "qtr": "Fall 2017", "name": "Race, Gender, and Sexuality", "title": "WCAS GNDR_ST 382-0-20 Race, Gender, and Sexuality", "lmod": "5/8/17 2:10 AM (CT)", "section": "20", "topic": "Gender, Race, & the Holocaust", "course": "382-0", "enrl_requirement": "Enrollment Requirements: Reserved for Gender Studies students.", "descriptions": [{"name": "Overview of class", "value": "The aim of this seminar is to introduce students to the history and historiography of race and gender during the Holocaust. As in many historical contexts, race and gender interacted dynamically and created the particular context of Nazi-occupied Europe, which was a place where Jewish men and women suffered in particular ways, German men and women participated in particular ways, and other racial groups - men and women alike - were targeted, collaborated, resisted and rescued. We will read a variety of texts that explore the influences that shaped the behavior and response of an array of people during the Holocaust. Racism sat directly in the center of the Nazi world view. Once the Nazis got into power, they sought to translate ideology into policy. Still, their racial policies evolved over time, spurred by opportunism, innovation, and war. And too, Jewish men and women responded in ways similar and divergent to the Nazi onslaught. Sexism was also seemingly an important aspect of the Nazi perspective. While they indeed embraced an anti-feminist stance, the Nazis nevertheless sought to incorporate \"German\" women into the national community and women participated actively in the implementation of Nazi racism."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Class participationGroup workPapers"}, {"name": "Class Materials (Required)", "value": "Between Dignity and Despair by Marian Kaplan<br/>Genocide and Belonging by Thomas Kühne<br/>Hitler's Furies by Wendy Lower<br/>Women in the Third Reich by Matthew Stibbe<br/>Sexuality and German Fascism, edited by Dagmar Herzog <br/>Class Packet"}], "instructor": ["Sarah Marshall Cushman"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "10543", "subject": "GNDR_ST"}, {"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "Fisk Hall 114"}], "school": "WCAS", "overview_of_class": "Is beauty a site of political struggle? Applying the critical frameworks developed by writers and theorists as different as Naomi Wolf, Kathy Davis, bell hooks, Michele Wallace, and Judith Butler, this course asks why has there been such heated disputes among feminists over whether beauty culture is oppressive or liberatory? Is beauty the source of delusion and false values or the source of self-expression and empowerment? Could it be a site of critical destabilizing practices? To better understand the deeper stakes in this debate, the class sets these questions historically, tracing them from 17th and 18th century moral philosophy and aesthetics to 19th century physiognomics, anthropology, medicine, phrenology, and comparative anatomy. A crucial component of this project is to uncover how elites as spectators, philosophers, connoisseurs, and scientists have constituted racial and sexual hierarchies through their aesthetic judgments of others. <br/> Through case studies on beauty pageants, cosmetic surgeries, bar and club cultures, as well as sports and modern/postmodern concert dance, we will study the counter-discourses and self-fashioning strategies of groups and individuals. Focusing on the performative and bodies in motion, we will ask whether corporeal meaning can be remade from within and by \"marked\" bodies. Instead of developing simple resistance models of opposition, we will focus on how communities establish their aesthetics to communicate their goals, hopes, and pain.", "qtr": "Fall 2017", "name": "Race, Gender, and Sexuality", "title": "WCAS GNDR_ST 382-0-21 Race, Gender, and Sexuality", "lmod": "5/8/17 2:10 AM (CT)", "section": "21", "topic": "Politics of Beauty", "course": "382-0", "enrl_requirement": "Enrollment Requirements: Reserved for Gender Studies students.", "descriptions": [{"name": "Overview of class", "value": "Is beauty a site of political struggle? Applying the critical frameworks developed by writers and theorists as different as Naomi Wolf, Kathy Davis, bell hooks, Michele Wallace, and Judith Butler, this course asks why has there been such heated disputes among feminists over whether beauty culture is oppressive or liberatory? Is beauty the source of delusion and false values or the source of self-expression and empowerment? Could it be a site of critical destabilizing practices? To better understand the deeper stakes in this debate, the class sets these questions historically, tracing them from 17th and 18th century moral philosophy and aesthetics to 19th century physiognomics, anthropology, medicine, phrenology, and comparative anatomy. A crucial component of this project is to uncover how elites as spectators, philosophers, connoisseurs, and scientists have constituted racial and sexual hierarchies through their aesthetic judgments of others. <br/> Through case studies on beauty pageants, cosmetic surgeries, bar and club cultures, as well as sports and modern/postmodern concert dance, we will study the counter-discourses and self-fashioning strategies of groups and individuals. Focusing on the performative and bodies in motion, we will ask whether corporeal meaning can be remade from within and by \"marked\" bodies. Instead of developing simple resistance models of opposition, we will focus on how communities establish their aesthetics to communicate their goals, hopes, and pain."}, {"name": "Teaching Method", "value": "This class has a hybrid between a lecture class and a seminar. Mondays will be devoted to background presentations and outlining crucial issues. The seminar style discussions on Wednesdays will be the heart of the class dedicated to sharing and analyzing readings, films, lectures and other materials such as photographs and paintings. Students will rotate responsibility for starting discussions as a team (each student volunteers twice over the quarter). Between 100 to 150 pp of reading a week. Three to four films viewed outside of class meetings. One short essay (5 pp) with an assigned topic. Two additional short essays (2 to 3 pp.) due after leading the discussion. One final paper (5 to 7 pp) due during exam week. Final essays may be either a short research paper or a book and/or articles review based on student interest and developed in consultation with instructor. Students enrolled under GSS 350 will write a research analysis paper based on a monograph or article on the reading list and write a research proposal (7 to 10 pp)."}, {"name": "Evaluation Method", "value": "Attendance and participation (30 percent); 3 short papers (50 percent), final essay (20 percent). Students have two (excused and un-excused) absences per quarter. Further absences can be made up by writing short papers (3 pp) on the day's lecture readings or discussion material. First day of class mandatory; no p/n"}], "instructor": ["Tessie P Liu"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "10553", "subject": "GNDR_ST"}]