[{"school": "WCAS", "overview_of_class": "A few key ideas took root in the last 200 years that grew and branched to frame our current understanding of the world we live in. For insight into these changes, we will examine three key ideas: light, atoms and the void. Each of these have specific scientific turning points: Maxwell's unified electricity and magnetism into a theory of light; theorists explored atoms from the philosophical very small, to the probabilistic world of quantum mechanics; and Einstein connected the darkness of space with the passage of time. These historical models entwined and shifted, gathering evidence to underpin the models for modern quantum fields and particles like the Higgs boson. At the same time, those same ideas drove a wave of technological revolutions, connecting people through a sea of electromagnetic radiation. Further, those technological changes spurred changes in societies and the relationships between nations?such an arms race that enveloped the world, but traced its roots to a calculation of energy in the tiny nucleus of an atom. In this course, we will chart a path through history, through discovery, through changes that will illuminate another generation of people, and explain the story of &quot;how we got to now.&quot;", "name": "Residence-Linked Seminar - I (Natural Sciences)", "section": "20", "topic": "Light, Atoms and the Void", "course": "280-1", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4620/WCAS/GEN_LA/280-1/37791", "instructor": ["Andrew J Rivers"], "id": "37791", "subject": "GEN_LA"}, {"school": "WCAS", "overview_of_class": "This is a general science course where the students will learn to appreciate the extent to which chemistry is important in every part of their lives. Specifically, the students will learn the chemistry of starches, carbohydrates &amp; sugars, fat, and protein and then learn how they are manipulated in cooking and by the food industry.", "name": "Residence-Linked Seminar - I (Natural Sciences)", "section": "21", "topic": "The Chemistry of Food", "course": "280-1", "meeting_time": ["Tu 3:00PM - 5:50PM"], "path": "/class-descriptions/4620/WCAS/GEN_LA/280-1/37792", "instructor": ["Owen P Priest"], "id": "37792", "subject": "GEN_LA"}]