[{"class_mtg_info": [{"meet_t": "Fr 2:00PM - 4:00PM", "meet_l": "Frances Searle Building 3417"}], "school": "SoC", "enrl_requirement": "", "qtr": "Spring 2017", "name": "32754", "title": "SoC CSD 207-0-1 Seminar in Communication Sciences &amp; Disorders", "class_attributes": "", "section": "32754", "instructors": [{"instructor_phone": "847/491-3066", "instructor_name": "Charles   Larson", "instructor_addr": "Room 3-247, 2240 Campus Drive, Evanston campus"}], "topic": "", "course": "207-0", "descriptions": [{"name": "Overview of class", "value": "Seminar in Communication Sciences and Disorders: Bilingualism <br/> <br/>Overview of class/Course Description:<br/><br/>The majority of the world population is bilingual or multilingual. Experiencing the world through more than one language impacts not only communication with others, but also how one perceives and processes the surrounding environment. Converging evidence from the growing field of bilingual research reveals that learning, using, and managing two languages has profound consequences for linguistic, cognitive and neural function. Throughout this course, students will consider what it means to be &quot;bilingual&quot;, and explore how bilingualism shapes human communication, including language development and learning, the production and perception of speech, cognitive function, and neural activity, as well as the perceived benefits and pitfalls of bilingualism from a cognitive and educational perspective."}, {"name": "Registration Requirements", "value": "Registration Requirements: Freshmen only."}, {"name": "Teaching Method", "value": "Teaching Method:<br/>Faculty-led lectures and discussion, student-led presentations and discussion."}, {"name": "Evaluation Method", "value": "Evaluation Method:<br/>Attendance, in-class participation, weekly discussion questions, paper presentation, response essays."}, {"name": "Class Materials (Required)", "value": "Class Materials (Required):<br/>There is no required textbook - all readings will consist of research articles and theoretical papers selected by the professor to represent cutting-edge knowledge in the field of bilingualism. You should complete the readings prior to each class."}], "lmod": "2/6/17 8:35 AM (CT)", "subject": "CSD"}]