[{"school": "WCAS", "overview_of_class": "Money talks, but what does it tell us about social relationships? Does \"mo' money\" only bring \"mo' problems,\" as the Notorious B.I.G. counseled in 1997? Or is it true, as Beyoncé recently asserted, that \"the best revenge is your paper\"? Biggie's and Beyoncé's songs are separated by only twenty years, but represent two distinct attitudes toward money. In order to understand how the ethics of finance have changed across history, this course will examine representations of money and commerce in Renaissance (\"early modern\") English literature. Through texts such as Shakespeare's Merchant of Venice and Hobbes's Leviathan, we will consider how Renaissance writers represented financial ethics. Did they think money was good or bad for society? How did it affect social relationships? How have these texts influenced the ways we conceive of the ethics of finance today? While our primary objective will be to explore Renaissance perspectives on money, we will regularly engage in cross-historical comparative analysis in order to consider how attitudes have changed (or not) today. Each week, students will take turns choosing from a selection of contemporary texts, and prepare a blog post or presentation examining how a modern text about money relates to the Renaissance text we are discussing in class. For example, how does Hobbes' representation of money as the lifeblood of the political body in Leviathan square with the pessimistic view of corporate capital in The LEGO Movie? Can we find similarities between Shakespeare's financially-tinged love sonnets and present-day pop songs?and if so, what might those similarities teach us about the \"erotics of money\"?", "name": "Studies in Literature and Commerce", "section": "20", "location": "Parkes Hall 223", "topic": "Money Talks", "course": "387-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4650/WCAS/ENGLISH/387-0/24079", "instructor": ["Rebecca Lynn Fall"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "24079", "subject": "ENGLISH"}]