[{"school": "WCAS", "overview_of_class": "This class will read and discuss selected works of modern Jewish literature in the context of their historical background. We will focus on certain themes and stories in the Bible and in Jewish folklore as well as on particular events and movements in European, American, and Israeli history as a way of better understanding this literature. Though most of this literature dates from the later nineteenth and twentieth centuries up until the present, a study of eighteenth and nineteenth century intellectual and religious currents such as the Enlightenment, Jewish Mysticism, Zionism, and Socialism will help us to understand the literature in its changing historical and social context. Thus while some writers saw modern Jewish literature as a means of educating the masses to modern secular needs, others saw it as a means of reshaping older forms and religious values, while still others saw it as a means of reflecting timeless humanistic concerns. Among the writers we will read are Sholom Aleichem, I. B. Singer, Anzia Yezierska, Primo Levi, Ida Fink, Ava Schieber, Philip Roth, Amos Oz and Shani Boianjiu.", "name": "Modern Jewish Literature in Translation: An Introduction", "section": "20", "topic": "", "course": "279-0", "meeting_time": ["MoWeFr 10:00AM - 10:50AM"], "path": "/class-descriptions/4640/WCAS/COMP_LIT/279-0/14222", "instructor": ["Marcia B Gealy"], "id": "14222", "subject": "COMP_LIT"}, {"school": "WCAS", "overview_of_class": "No prior knowledge of Jewish culture or history is required for this class (though if students have such that is great!) and the course is of equal interest to Jews and non-Jews.<br/><br/>The first three decades of the twentieth century witnessed an unprecedented renaissance in secular modern Jewish culture. One of the hallmarks of this renaissance was the dynamic artistic and intellectual interaction between young German and German-speaking Jews with their counterparts in Eastern Europe. Kafka discovered the Hasidic tales of Nahman of Bratslav. Martin Buber drew the world's attention to the vibrant mystical culture of Eastern European Jews. Golems (man-made men) and Dibbuks (demonic possessors) began to appear in the leading theatres of Europe. Marc Chagall stormed the art worlds of Berlin and Paris with his bizarre avant-garde representations of Eastern European Jewish life on canvas. Gustav Mahler incorporated Jewish folksong into his symphonies.<br/><br/>We examine all of these figures and others in this course. Thus students will be introduced both to key Jewish writers in German?Franz Kafka, Gershom Scholem, Walter Benjamin and others?and the leading writers of modern Yiddish literature?Mendele the Bookseller, Sholem Aleichem, Y.L. Peretz and others.<br/><br/>Guest speakers, all leading scholars in their fields at this university, may provide us with presentations.<br/><br/>Great emphasis is placed on student participation in all class discussions. Two students will be assigned to provide an informal class presentation together for one session a quarter.", "name": "Modern Jewish Literature in Translation: An Introduction", "section": "21", "topic": "", "course": "279-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4640/WCAS/COMP_LIT/279-0/14223", "instructor": ["Marcus G Moseley"], "id": "14223", "subject": "COMP_LIT"}]