[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Harris Hall L05"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "12429", "title": "WCAS HISTORY 393-0-20 Approaches to History", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "12429", "instructors": [{"instructor_phone": "", "instructor_name": "Lauren K Stokes", "instructor_addr": ""}], "topic": "Unsettled Europe? Migration and the Making of Mode", "course": "393-0", "descriptions": [{"name": "Overview of class", "value": "News headlines about Europe's ongoing &quot;migrant crisis&quot; portray the present as exceptional, but in fact population displacement and migration have been the norm in 19th and 20th century Europe. This historiographical seminar explores war and population displacement, humanitarianism and relief efforts, refugees, labor migration, and colonial and post-colonial migrations. We will explore changing domestic and international responses to migration; the emergence of new ideals of human rights in response to wartime and postwar displacement; the way that race, gender, and national belonging are redefined in the process of migration; and attempts to write the history of migration from a &quot;transnational&quot; or international perspective."}, {"name": "Registration Requirements", "value": "GRADING BASIS: ANC"}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "EVALUATION METHOD: Attendance, participation, response papers, and final paper"}, {"name": "Class Materials (Required)", "value": "***Tentative until order posted to Norris website<br/>Mark Choate, Emigrant Nation. The Making of Italy Abroad (Harvard University Press: 2008). <br/>9780674027848.<br/>Atina Grossman, Jews, Germans, and Allies: Close Enoounters in Occupied Germany (Princeton, 2006). <br/>9780691143170.<br/>Clifford Rosenberg, Policing Paris: The Origins of Modern Immigration Control Between the Wars (Cornell, <br/>2006). 9780801473159.<br/>Naomi Davidson Only Muslim: Embodying Islam in Twentieth-Century France (Cornell, 2012). <br/>9780801450914.<br/>Peter Gatrell, The Making of the Modern Refugee (Oxford University Press: 2013). 0000199674167."}], "lmod": "10/30/16 7:06 PM (CT)", "subject": "HISTORY"}]