[{"school": "WCAS", "overview_of_class": "Longer Course Description<br/>FRAMING THE WORLD, and the Book<br/><br/>Since the beginnings of architecture, and later entrenched by the development first of the codex, and finally the camera, the rectangle has been the most powerful and pervasive device for the visual representation of the world and our multiple relationships within it. The rectangle frames what we see from our windows, on TV and movie screens, on our computers, our printed pages, our books, and our cell phones. It separates and unites us - across a table - from those with whom we communicate. It shapes long traditions of painting, it creates composition. Even when we are in rectangle-free environments: camping in the desert, walking through the mountains, gazing at the ocean from the beach, the photographs we take translate the things we have seen and determine, at least in part, our relationships with them. <br/><br/>This all-pervasive framing of the world is, in terms of human creativity, a relatively recent phenomenon. For twenty thousand years (and right up to the 1800s) the Bushmen of southern African engraved dolerite boulders and made paintings on rock surfaces unconstrained by the framing devices with which we are now so accustomed. In the Upper Palaeolithic in Europe, paintings appear to follow no conventions of composition familiar to us, and even where protruding rocks or the surfaces of the caves' interiors provide an outer limit of the paintings made on them, there is no certainty that these also limit conceptions of composition. Our frames create distance, separating us from things outside of our own construction, determining our relationship to the spaces we inhabit.<br/><br/>There is also an argument to be made that the codex (and its rectangular format), the early conveyer of religious and scientific knowledge to the world, helped define the nature of the modern museum. Here cabinets and displays follow the sequence of reading, reinforcing hierarchical and sequential forms of understanding science, history and art.<br/><br/>This course will look at the legacy of the rectangle as a tool to distance ourselves from, and to shape understanding of, the world around us. It will ask how the rectangle has created conceptions of composition, and will look at the book as both a part of this legacy, and as a means to disrupt it.<br/><br/>In this course you will be asked to address your immediate environment and your daily movement through it, and to compose a creative response to it -outside of the frame. As part of this we will look at the nature of the book, at artists' books, at the ?exploded' book, and produce work that takes these into account while also accommodating other earlier, pre-architectural ways of seeing and representing.<br/><br/>There will be a mix of talks, discussions and project responses. You will all be asked to make an artist's book that both engages with these ideas and disrupts them, calling into question the nature of the book itself. As part of this we will discuss the ways in which a book can be conceptualised and realized. Part of this will be a visit to the Field Museum, as a way of understanding a book as an act of curatorship.<br/><br/><br/>Some of the discussion topics:<br/><br/>Pre-architecture<br/>? Lascaux: composition and disorientation (SW France +- 15000 BCE)<br/>? The cave of Tuc d'Audoubert as a book (SW France +- 13000 BCE<br/>? Composing hilltop and sky: Springbokoog (undated central South Africa)<br/>? Composition of territory: Bushmanskloof (3500BCE Cederberg, South Africa<br/><br/>Post-architecture<br/>? Composing fragmentary remains: Buddhist Cave of the Ring Bearing Doves 5th century BCE (remains in Dahlem, Berlin)<br/>? The Roman mosaics of Ravenna and Piazza Armerina, The Long Passage as book 4th century (Sicily)<br/>? Composition from the knees, San Marco, cell paintings of Fra Angelico 15th century<br/><br/>Contemporary composing territory<br/>? The stolpersteine of Gunter Demnig: composing memorialization in post cold-war Germany 1996-present<br/>? Michael Heizer holes (1967-77)<br/>? Christo and Jeanne-Claude Running Fence 1976<br/>? Artists' books<br/><br/><br/><br/>Projects<br/><br/>The course will include two projects.<br/><br/>1. All students will make an artist's book that interrogates or disrupts both the nature of the book and the ways in which such a ?disrupted' book can address issues of composition and the relationships composition describes.<br/><br/>2. There will be a site visit to the Field Museum. All students will create a ?composition' within the museum. This could take the form of guided route, a site-specific sound track, a pamphlet or series of smaller works that encourage alternative engagements with the collections to those presented in the displays.<br/><br/>These may form separate projects or be a part of one larger project.", "name": "Special Topics in Art", "section": "20", "location": "640 Lincoln St Room 135", "topic": "Framing the World", "course": "390-0", "meeting_time": ["MoWe 9:00AM - 11:50AM"], "path": "/class-descriptions/4660/WCAS/ART/390-0/35769", "instructor": ["Philippa Ann Skotnes"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "id": "35769", "subject": "ART"}, {"school": "WCAS", "overview_of_class": "This studio course examines the increasingly hybrid nature of the art object. We will consider the historic precedents an contemporary trajectory of objects that blur the line between painting and sculpture. Beginning with Donald Judd's Specific Objects essay from 1965, the class will attempt to trace a lineage of artworks that embody this hybrid nature. Lectures, readings and materials demonstrations will frame each project. The course will consist of five projects that explore a range of contemporary concerns through formal approaches like casting, weaving, dyeing, digital printing, and traditional painting processes. This course will not only attempt to decode the current strategies of object making but expand on a field that is continually forcing collisions between increasingly disparate materials and styles. <br/><br/>Pre-requisite: A minimum of one Art Theory & Practice course and undergraduate standing.", "name": "Special Topics in Art", "section": "22", "location": "640 Lincoln St Room 217", "topic": "Between Painting and Sculpture", "course": "390-0", "meeting_time": ["MoWe 5:00PM - 7:50PM"], "path": "/class-descriptions/4660/WCAS/ART/390-0/35770", "instructor": ["Zachary Jack Buchner"], "class_attributes": "", "id": "35770", "subject": "ART"}, {"school": "WCAS", "overview_of_class": "Students engage in collaborative or self-directed projects in animation or an animation-like area (comic book, machinima, gaming, puppet theater, etc.). Students will be introduced to a variety of techniques including stop motion, hand drawn and AfterEffects.", "name": "Special Topics in Art", "section": "23", "location": "Kresge 1425 Multipurpose Room", "topic": "", "course": "390-0", "meeting_time": ["TuTh 4:00PM - 6:50PM"], "path": "/class-descriptions/4660/WCAS/ART/390-0/35771", "instructor": ["Stephen P Reinke"], "class_attributes": "", "id": "35771", "subject": "ART"}, {"school": "WCAS", "overview_of_class": "The aim of this course is to introduce students to printmaking techniques as processes through which students will learn to think, visualize and communicate ideas. Many contemporary artists use the medium of printmaking in interdisciplinary ways to form and conceptualize ideas. Students will be introduced to a brief history of printmaking and how contemporary artists use print techniques towards creative expression. The course will provide an introduction to a variety of traditional and and non-traditional print techniques including: chine colle, digital printing, monoprinting, relief, photocopying and silkscreen. <br/><br/>Through course readings and assigned studio projects, student will develop the skills to analyze both theoretical arguments and works of art. We will create original works of art that exist as multiples in editioned sets, and will also make singular prints. By the end of the course students will be able to produce images through a variety of print techniques with the hope that this will influence and affect their greater studio practice. This process will be explored through hands-on practice, wherein students will learn the practice and technical skills involved in making various kinds of print.", "name": "Special Topics in Art", "section": "24", "location": "Kresge Cent Hall 1-330 Studio", "topic": "Printmaking-In Multiplicity", "course": "390-0", "meeting_time": ["MoWe 1:00PM - 3:50PM"], "path": "/class-descriptions/4660/WCAS/ART/390-0/35772", "instructor": ["Rudolf Brendan Fernandes"], "class_attributes": "", "id": "35772", "subject": "ART"}, {"school": "WCAS", "overview_of_class": "This course borrows its title from the text by James C. Scott that explores forms of daily resistance against authority in agrarian societies. Together, we will examine how weakness and power are constructed and the potential roles of creative production in complicating those hierarchies. Performance techniques of Image and Forum Theater will serve as frequent departure points for personal and collective exploration. Image-making and time-based practices are highly encouraged and students will have access to the digital lab and printing facilities, though interdisciplinary and cross-disciplinary practices are welcome.<br/><br/>Readings include texts from Kimberlé Crenshaw, Paolo Freire, Hito Steyerl, Gloria Anzaldua, Mimi Thi Nguyen, James C. Scott, and Sylvia Federici among others. Artists discussed will include: Walid Raad, Simone Leigh, Emily Jacir, Theresa Hak Kyung Cha, Erica Lord, Coco Fusco, Danh Vo, and Trinh T. Minh-Ha amongst others.", "name": "Special Topics in Art", "section": "25", "location": "640 Lincoln St Room B35", "topic": "Weapons of the Weak: Image-making as Resistance", "course": "390-0", "meeting_time": ["TuTh 9:00AM - 11:50AM"], "path": "/class-descriptions/4660/WCAS/ART/390-0/35773", "instructor": ["Huong Ngoc Ngo"], "class_attributes": "", "id": "35773", "subject": "ART"}]