[{"class_mtg_info": [{"meet_t": "MoWe 4:00PM - 5:20PM", "meet_l": "Annenberg Hall G30"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Winter 2016", "name": "23585", "title": "WCAS LING 380-0-23 Spoken English for Non-Native Speakers", "class_attributes": "", "section": "23585", "instructors": [{"instructor_phone": "", "instructor_name": "Kathleen A.D. Geraghty", "instructor_addr": ""}, {"instructor_phone": "", "instructor_name": "Julia Margaret Moore", "instructor_addr": ""}], "topic": "Integrated Academic Skills", "course": "380-0", "descriptions": [{"name": "Overview of class", "value": "The primary goal of this course is to improve students' ability to effectively communicate in American English both inside and outside of the classroom. Our focus will be on intelligibility (pronunciation and fluency), and the linguistic and practical skills that underlie successful communication. In order to attain this goal, we will devote class time to practicing the skills required for English proficiency tests like the Versant test, such as effective listening, reading aloud, answering short questions, and paraphrasing stories. We will also devote class time to developing the skills students use in academic environments, such as making presentations, reporting on written information, leading and participating in discussions, and agreeing/disagreeing. Students will be encouraged to put these skills to use in their other classes, as well as interactions outside of the classroom."}, {"name": "Learning Objectives", "value": "The skills that students will learn in this class are applicable in a variety of situations, including conferences, class presentations, reports at lab meetings, and job interviews."}, {"name": "Evaluation Method", "value": "You are expected to complete regular readings and assignments each week. The concepts introduced in these readings and assignments will form the basis for classroom work, so it is important that you complete them in advance of the class for which they are assigned. Attendance and participation are also a primary part of the evaluation. There is no final exam for this course, but a final project may be assigned. Undergraduates are required to use NativeAccent online software for a minimum of two hours per week during the quarter to obtain a passing grade in the course. <br/>."}, {"name": "Class Materials (Required)", "value": "Well Said, 3rd Edition by Linda Grant for each class (ISBN: 978-1-4240-0625-0).<br/><br/>The text is available at the Norris University Center Bookstore. You MUST purchase it and have it with you by the second class. <br/><br/>Sharing, illegally downloading, and photocopying the text is strictly prohibited. Be sure to obtain the newest edition."}], "lmod": "1/9/16 6:50 PM (CT)", "subject": "LING"}]