[{"class_mtg_info": [{"meet_t": "We 2:00PM - 4:50PM", "meet_l": "Frances Searle Building 1483"}], "school": "SoC", "overview_of_class": "Over the course of the quarter, students learn foundational knowledge about the history and impact of popular culture and new media, distinct ways that new media forms impact us socially and culturally, how to study new media environments  as popular culture forms, and how to derive insights from qualitative, ethnographic data.", "qtr": "Winter 2016", "name": "Topics in Communication Studies", "title": "SoC COMM_ST 395-0-20 Topics in Communication Studies", "lmod": "1/9/16 6:38 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Maria A Mastronardi", "instructor_addr": ""}], "topic": "Fan Fiction & New Media Cult.", "course": "395-0", "enrl_requirement": "Enrollment Requirements: Reserved for Juniors &amp; Seniors", "descriptions": [{"name": "Overview of class", "value": "Over the course of the quarter, students learn foundational knowledge about the history and impact of popular culture and new media, distinct ways that new media forms impact us socially and culturally, how to study new media environments as popular culture forms, and how to derive insights from qualitative, ethnographic data."}, {"name": "Class Materials (Required)", "value": "Boellstorff, Tom. Coming of Age in Second Life: An Anthropologist Explores the Virtually Human"}], "path": "/class-descriptions/4610/SoC/COMM_ST/395-0/26385", "instructor": ["Maria A Mastronardi"], "class_attributes": "Prerequisites apply, see description<br/><br/>Juniors/Seniors Only<br/><br/>", "id": "26385", "subject": "COMM_ST"}, {"class_mtg_info": [{"meet_t": "We 2:00PM - 4:50PM", "meet_l": "Norris Center Big Ten Room 104"}], "school": "SoC", "overview_of_class": "OVER a decade ago the New York Times magazine featured an article, the \"Opt -Out Revolution.\"  This revolution was made up of women with Ivy-League MBAs, JDs, and PhDs, women who decided to call it quits when they became mothers.  Expressing no regret over their decision to forsake career for motherhood, these women stuck to their guns about the \"feminist\" aspect of their decisions. Around the same time, another article proclaimed that 60% of polled Yale female undergraduates expected to pursue a career until age of 30 and then become full time parents.  Many claimed that they had witnessed the failure of a generation of feminist women (ie their mothers) to \"have it all.\"  Considering the cottage industry of \"back to the home\" and \"DIY\" books?novels, nonfiction, manuals, cookbooks, how-to kits, blogs, websites, etc.?notions of motherhood have changed in the wake of neo-liberalism. How can we understand these changes? Positioning the current debate about women, caregiving, parenthood, and career alongside its earlier waves, this course will examine what some have called the crisis in care work.  Paying close attention to the rhetoric of \"choice\" as it has informed feminist work engaged with this debate, our course will trace the genealogy of motherhood debates from its 1950s instantiation to the present.  Reading such classic second-wave authors as Betty Friedan, Gloria Steinem, Susan Brownmiller, Germaine Greer, Sylvia Plath, and Kate Millet, our course will offer an historical, sociological, literary, and economic background for the resurfacing of \"motherhood\" as an unmediated ideal. Key to our discussions will be the peripheralization of race and sexuality in these debates, and the correctives offered to this by the intervening years of 1970s black feminist scholarship. Our examination will of necessity include an investigation of masculinity and its corresponding invisibility in early discussions of parenting.", "qtr": "Winter 2016", "name": "Topics in Communication Studies", "title": "SoC COMM_ST 395-0-21 Topics in Communication Studies", "lmod": "1/9/16 6:38 PM (CT)", "section": "21", "instructors": [{"instructor_phone": "", "instructor_name": "Kate A Baldwin", "instructor_addr": ""}], "topic": "Motherhood and its Discontents", "course": "395-0", "enrl_requirement": "Enrollment Requirements: Reserved for Sophomores, Juniors, and Seniors from every undergraduate school only.", "descriptions": [{"name": "Overview of class", "value": "OVER a decade ago the New York Times magazine featured an article, the &quot;Opt -Out Revolution.&quot; This revolution was made up of women with Ivy-League MBAs, JDs, and PhDs, women who decided to call it quits when they became mothers. Expressing no regret over their decision to forsake career for motherhood, these women stuck to their guns about the &quot;feminist&quot; aspect of their decisions. Around the same time, another article proclaimed that 60% of polled Yale female undergraduates expected to pursue a career until age of 30 and then become full time parents. Many claimed that they had witnessed the failure of a generation of feminist women (ie their mothers) to &quot;have it all.&quot; Considering the cottage industry of &quot;back to the home&quot; and &quot;DIY&quot; books?novels, nonfiction, manuals, cookbooks, how-to kits, blogs, websites, etc.?notions of motherhood have changed in the wake of neo-liberalism. How can we understand these changes? Positioning the current debate about women, caregiving, parenthood, and career alongside its earlier waves, this course will examine what some have called the crisis in care work. Paying close attention to the rhetoric of &quot;choice&quot; as it has informed feminist work engaged with this debate, our course will trace the genealogy of motherhood debates from its 1950s instantiation to the present. Reading such classic second-wave authors as Betty Friedan, Gloria Steinem, Susan Brownmiller, Germaine Greer, Sylvia Plath, and Kate Millet, our course will offer an historical, sociological, literary, and economic background for the resurfacing of &quot;motherhood&quot; as an unmediated ideal. Key to our discussions will be the peripheralization of race and sexuality in these debates, and the correctives offered to this by the intervening years of 1970s black feminist scholarship. Our examination will of necessity include an investigation of masculinity and its corresponding invisibility in early discussions of parenting."}], "path": "/class-descriptions/4610/SoC/COMM_ST/395-0/26386", "instructor": ["Kate A Baldwin"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "id": "26386", "subject": "COMM_ST"}, {"class_mtg_info": [{"meet_t": "MoWe 9:30AM - 10:50AM", "meet_l": "Technological Institute M128"}], "school": "SoC", "overview_of_class": "The full course title is \"Outside the Classroom: Popular Education in the 19th Century United States.\" We will ask: How did nineteenth-century Americans create intellectual culture? What counted as desirable knowledge? Who could possess such knowledge, and how was knowledge obtained and shared? In this course we will study the theoretical dynamics and practical parameters of education in the nineteenth-century United States, with a special focus on how people who lacked access to formal educational institutions found ways to learn. We will read scholarship from communication, history, and American studies and will analyze many primary source materials, such as widely circulated textbooks, posters advertising public lectures, and the unpublished minutes of debating clubs and literary societies. Students who complete the course successfully can expect to have a deeper understanding of alternative modes of learning, nineteenth-century U.S. culture, and analytic approaches to the study of communication in history", "qtr": "Winter 2016", "name": "Topics in Communication Studies", "title": "SoC COMM_ST 395-0-22 Topics in Communication Studies", "lmod": "1/9/16 6:38 PM (CT)", "section": "22", "instructors": [{"instructor_phone": "", "instructor_name": "Angela   Ray", "instructor_addr": ""}], "topic": "Popular Education in 19c US", "course": "395-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "The full course title is &quot;Outside the Classroom: Popular Education in the 19th Century United States.&quot; We will ask: How did nineteenth-century Americans create intellectual culture? What counted as desirable knowledge? Who could possess such knowledge, and how was knowledge obtained and shared? In this course we will study the theoretical dynamics and practical parameters of education in the nineteenth-century United States, with a special focus on how people who lacked access to formal educational institutions found ways to learn. We will read scholarship from communication, history, and American studies and will analyze many primary source materials, such as widely circulated textbooks, posters advertising public lectures, and the unpublished minutes of debating clubs and literary societies. Students who complete the course successfully can expect to have a deeper understanding of alternative modes of learning, nineteenth-century U.S. culture, and analytic approaches to the study of communication in history"}, {"name": "Class Materials (Required)", "value": "Jensen, Robin E. Dirty Words: The Rhetoric of Public Sex Education, 1870-1924. Urbana: University of Illinois Press, 2010.<br/><br/>Ray, Angela G. The Lyceum and Public Culture in the Nineteenth-Century United States. East Lansing: Michigan State University Press, 2005."}], "path": "/class-descriptions/4610/SoC/COMM_ST/395-0/26387", "instructor": ["Angela   Ray"], "class_attributes": "", "id": "26387", "subject": "COMM_ST"}, {"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "Frances Searle Building 2407"}], "school": "SoC", "overview_of_class": "The objective of this course is to understand the intersection of health communication and the new precision medicine initiative. Precision medicine is a tailored approach to healthcare promoting prevention behaviors and the treatment of patients based on individual genetics, environments, and lifestyles with the goal of improving outcomes. This course will focus on each of the aforementioned areas and explore ways in which current health communication theory in areas such as: patient-provider interactions, social disparities, risk communication, and health campaigns may facilitate the provision of precision medicine.", "qtr": "Winter 2016", "name": "Topics in Communication Studies", "title": "SoC COMM_ST 395-0-23 Topics in Communication Studies", "lmod": "1/9/16 6:38 PM (CT)", "section": "23", "instructors": [{"instructor_phone": "", "instructor_name": "Courtney Elizabeth Lynam Scherr", "instructor_addr": ""}], "topic": "Health Comm. and Precision Med", "course": "395-0", "enrl_requirement": "Enrollment Requirements: Reserved for Sophomores, Juniors, and Seniors from every undergraduate school only.", "descriptions": [{"name": "Overview of class", "value": "The objective of this course is to understand the intersection of health communication and the new precision medicine initiative. Precision medicine is a tailored approach to healthcare promoting prevention behaviors and the treatment of patients based on individual genetics, environments, and lifestyles with the goal of improving outcomes. This course will focus on each of the aforementioned areas and explore ways in which current health communication theory in areas such as: patient-provider interactions, social disparities, risk communication, and health campaigns may facilitate the provision of precision medicine."}, {"name": "Class Materials (Required)", "value": "None"}], "path": "/class-descriptions/4610/SoC/COMM_ST/395-0/26388", "instructor": ["Courtney Elizabeth Lynam Scherr"], "class_attributes": "", "id": "26388", "subject": "COMM_ST"}]