[{"school": "DOHA", "overview_of_class": "<p>This course is an introduction to the study and structure of film and other moving-image media. We will define and examine the expressive and aesthetic power of the basic elements of the moving image. Specifically, the course will investigate?across a variety of different media, modes and genres, and historical periods? the fundamentals of set design and acting styles; cinematography, especially the shot and its composition; editing; sound; and narrative structure. The goals of the course are (1) to acquaint students with a vocabulary specific to film and other moving-image media; (2) to provide students with the critical tools required for analysis of the moving image; and (3) to develop student skills in writing and argument for humanistic inquiry. By the end of the course, students will be able to: (1) identify the elements of the moving image (e.g., kinds of camera movement) and of the soundtrack according to a standard glossary of technical terms; (2) recognize patterns of similarity, repetition, difference, and variation in the image and sound tracks and describe them in brief screening reports and essays; (3) relate those patterns to narrative structure, character psychology, or larger themes and ideas, and describe these relationships in a report or essay; (4) and choose the most salient elements in a film in order to craft a written argument about how their patterns function within the meaning-making process of the film.</p>", "name": "Analyzing Media Texts", "section": "70", "location": "Carnegie Mellon Room 3035", "topic": "", "course": "220-0", "meeting_time": ["TuSu 01:30PM - 03:20PM (AST)", "Th 01:30PM - 03:50PM (AST)"], "path": "/class-descriptions/4640/DOHA/MIT/220-0/10016", "instructor": ["Michael Scott   Curtis"], "class_attributes": "", "id": "10016", "subject": "MIT"}, {"school": "DOHA", "overview_of_class": "", "name": "Analyzing Media Texts", "section": "71", "location": "Carnegie Mellon Room 3069", "topic": "", "course": "220-0", "meeting_time": ["TuSu 01:30PM - 03:20PM (AST)", "Th 01:30PM - 03:50PM (AST)"], "path": "/class-descriptions/4640/DOHA/MIT/220-0/10017", "instructor": ["Kaveh Travis Askari"], "class_attributes": "", "id": "10017", "subject": "MIT"}]