[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "Locy Hall 314"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: REASON: Pre-registration is not allowed for this class. Please try again during regular registration.<br/>Add Consent: Department Consent Required<br/>", "qtr": "Spring 2017", "name": "33440", "title": "WCAS ENGLISH 393-3-20 Theory and Practice of Poetry", "class_attributes": "", "section": "33440", "instructors": [{"instructor_phone": "", "instructor_name": "Rachel J Webster", "instructor_addr": ""}], "topic": "", "course": "393-3", "descriptions": [{"name": "Overview of class", "value": "This selective-enrollment, yearlong &quot;Sequence&quot; is designed to make students increasingly informed readers and self-sustaining apprentices of poetry. The Fall portion of the course begins with summer reading and intensive study in which poets learn to identify operative modes in poetry?including description, rhetoric, story and song?and begin connecting contemporary participants with root systems in the tradition. We support our studies with reading exercises and &quot;imitation&quot; assignments, in which students convert close reading into fodder for original writing. Students will write at least four papers and will write, workshop and revise four poems during the Fall term. They also will lead presentations on one chosen poet and one classmate during workshop. In the Winter term, students will continue to read and complete close reading assignments and will stretch their skills as they complete a week of &quot;Daily Poems,&quot; thereby drawing on original energy and stamina to bring their work to the next level of accomplishment. Finally, in the Spring term, students will focus entirely on their own work, drafting, revising, workshopping and completing one long poem of at least 120 lines that combines autobiographical material with writing from research. Throughout the year, our close reading assignments hone skills in sensitive and critical thinking; our imitation poems challenge existing habits as they introduce new strategies; our Daily Poems exercise agility and confidence; and our workshops cultivate the openness and humility necessary to serious writing and lifelong learning. Through this intensive and nurturing Sequence, students become careful readers of each others' work and complete a polished portfolio of original writing."}, {"name": "Class Notes", "value": "Admission by application only."}], "lmod": "2/12/17 6:53 PM (CT)", "subject": "ENGLISH"}]