[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "Kresge Centennial Hall 2-425"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "10666", "title": "WCAS ASIAN_LC 390-0-20 Advanced Topics in Asian Languages and Cultures", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "10666", "instructors": [{"instructor_phone": "847/491-2766", "instructor_name": "Thomas Martin Gaubatz", "instructor_addr": "1880 Campus Drive, Kresge Hall, Office 4-345"}], "topic": "Reading and Writing Desire: Love, Courtship, and G", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "Topic: Reading and Writing Desire: Love, Courtship, and Gender in Premodern Japanese Literature. Early Japanese literature is often associated with the themes of love and amorous longing, but what do we talk about when we talk about love? What kinds of desires?emotional, sexual, social, political?are set into play by narratives of courtship, and how are these marked by gender? And what roles can literature play in mediating and articulating those desires? With these questions in mind, this course offers a topical survey of the major works, genres, and authors of premodern Japanese literature, from the earliest times through the medieval period: early mythohistory, classical poetry, poetic diaries and poem tales, narrative tales of the Heian court (including the classic Tale of Genji), Buddhist folklore, the n? theater, and more. Topics addressed include: court politics and the politics of courtship; tensions between public obligation and private feeling; gendered gazes and the optics of desire; the social functions of poetic exchange in courtship practices; the role of nature imagery in lyrical expression; the gendering of genre and language, and the performative use of both to invert those constructions; Buddhist conceptions of desire, gender, and love as both damnation and salvation; social status, class, mobility, and the erotics of inter-class romance. All readings are in English; no knowledge of Japanese is required or expected."}, {"name": "Learning Objectives", "value": "? To introduce the major works and authors of the Japanese literary canon from the earliest writings through the medieval period, including poetic, narrative, and dramatic genres.<br/>? To develop skills of textual analysis, interpretation, and comparison through close reading of primary texts, and to refine skills of analytical writing and scholarly argumentation using literary sources.<br/>? To learn how to approach cultural categories such as gender and love in historical and comparative perspectives, and to both construct and question narratives of cultural history in relation to such themes."}, {"name": "Teaching Method", "value": "Lecture and discussion"}, {"name": "Evaluation Method", "value": "Attendance and participation: 20%<br/>Weekly response essays (250-300 words): 20%<br/>Longer writing assignments: 30%<br/>Final paper (8-10 pages): 30%"}, {"name": "Class Materials (Required)", "value": "Haruo Shirane, ed., Traditional Japanese Literature: An Anthology, Beginnings to 1600 (Columbia University Press, 2007)<br/>Murasaki Shikibu, The Tale of Genji, translated by Royall Tyler (Penguin Classics, 2002)<br/>Edward Seidensticker, trans., The Gossamer Years: The Diary of a Noblewoman of Heian Japan (Tuttle Classics, 1989).<br/>Other materials will be made available by PDF or course reader."}, {"name": "Class Materials (Suggested)", "value": "H. Paul Varley, Japanese Culture, 4th Edition (University of Hawai'i Press, 2000)."}], "lmod": "10/30/16 6:58 PM (CT)", "subject": "ASIAN_LC"}]