[{"class_mtg_info": [{"meet_t": "MoTuWeTh 10:00AM - 10:50AM", "meet_l": "Kresge Centennial Hall 2-343"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "22466", "title": "WCAS LATIN 101-2-20 Elementary Latin", "class_attributes": "Prerequisites apply, see description<br/><br/>", "section": "22466", "instructors": [{"instructor_phone": "847/491-8043", "instructor_name": "Graziela Marieta Byros", "instructor_addr": "Kresge Hall 4357"}], "topic": "", "course": "101-2", "descriptions": [{"name": "Overview of class", "value": "Elementary Latin is a year-long course designed to introduce students to the<br/>basic principles of classical Latin grammar and syntax. In addition to the<br/>mastering of these basic tools, the course will focus on vocabulary acquisition<br/>and the development of sight translation skills and reading competency<br/>necessary to continue successfully in the second year.<br/><br/>Elementary Latin provides a basic introduction to the language, literature, and<br/>culture of the Roman world and helps lay the foundation for further study of<br/>western culture as well as Medieval and Renaissance Latin."}, {"name": "Registration Requirements", "value": "Latin 101-1 or by placement exam. Students who have studied Latin prior to Northwestern must take a Latin placement exam. For further information, contact the Director of Latin Instruction Francesca Tataranni (f-tataranni@northwestern.edu)"}, {"name": "Teaching Method", "value": "Students will prepare exercises and reading selections in advance of class and will be called on regularly to present results and to answer questions regarding grammar, syntax and vocabulary. Tuesdays, Wednesdays and Thursdays will usually be devoted to grammar explanations, syntax and translation exercises, Mondays to the weekly quiz and a review of the previous week's work."}, {"name": "Evaluation Method", "value": "Daily assignments, attendance and participation in class, weekly quizzes, mandatory midterm and final exams."}, {"name": "Class Materials (Required)", "value": "(Available at Norris Center Bookstore):<br/>LaFleur, Richard A., ed., Wheelock's Latin, 7th ed. (Harper Collins, 2011) - ISBN-13: 978-0061997228<br/>Brad Tillery, Richard A. LaFleur, Cumulative Chapter Vocabulary Lists for Wheelock's Latin, 6th ed.) (Bolchazy-Carducci, 2011) - ISBN-13: 978-0865167704<br/>Groton, Anne H. &amp; James M. May, 38 Latin Stories (Bolchazy-Carducci, 1995) - ISBN-13: 978-0865162891"}, {"name": "Class Notes", "value": "No P/N<br/><br/>IMPORTANT: For all students beginning the study of Latin at the 200-level or lower at Northwestern in September, 2002 or later, the WCAS foreign language requirement must be satisfied with a grade of C- or better in Latin 201-3."}], "lmod": "12/24/16 7:03 PM (CT)", "subject": "LATIN"}]