[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Kresge Centennial Hall 3-410"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for French Majors &amp; Minors.", "qtr": "Winter 2017", "name": "24112", "title": "WCAS FRENCH 397-0-20 Studies in Literature and Culture", "class_attributes": "Prerequisites apply, see description<br/><br/>Reading, writing, speaking proficiency<br/><br/>Seniors Only<br/><br/>", "section": "24112", "instructors": [{"instructor_phone": "847/491-8262", "instructor_name": "Jane Bradley   Winston", "instructor_addr": "1860 S. Campus Drive, Crowe Hall #2-101"}], "topic": "Debord &amp; the International Situationists", "course": "397-0", "descriptions": [{"name": "Overview of class", "value": "This is a course on Guy Debord's analysis of and response to the modern consumer society he saw struggling, already in the 50s and 60s, to extend its culture globally. Debord was deeply concerned with the relations he believed society was installing within human beings, between human beings, and between human beings and things. He was as deeply concerned by the transformations taking place in the cultural sphere, where he believed culture itself, the period's emotional and aesthetic response to the conditions and relations of everyday life, was being appropriated in the service of the emerging consumer society. Debord considered himself at war with society and saw his entire life as a strategy in that war. With others in the group he helped found in 1957, the International Situationists, he developed a radical understanding of the relation between art and culture and of the role intellectuals and artists might play in the cultural revolution he aimed to provoke. Debord was a prolific composer of tracts, articles, reviews, books, memoirs, and films. We focus on him but also read pieces by others in the IS, including Raoul Vaneigem, and René Viénet."}, {"name": "Registration Requirements", "value": "Each student is expected to read the assigned works, and to do so in a responsible and rigorous fashion, and in a spirit of good faith and intellectual camaraderie. I hope we will all give ourselves fully to this class so as to make it as productive and stimulating as possible. (1) You will each write a tightly organized and intellectually serious 2 pg response to every day's readings (one paper, even when we read multiple articles) and viewings (film) on our syllabus. The point of these papers is to ensure comprehension and begin to think about each particular reading as a possible focus for your final paper. (2) Since I conceive of every aspect of this course as a collective project, I will ask students to work in groups of 3 (or 4, if necessary) on daily presentations of the reading materials. Each group will present multiple times during the quarter. These presentations will situate the readings and/or viewings in relation to what has come before them, outline some of their central arguments, and/or determine which problems or issues might productively begin our general discussion. Presentations must not exceed 7 minutes in length and must be well and tightly organized serious intellectual engagements with the materials. (3) I ask all of you to come to class with questions a given reading has raised for you, to put those questions to the 'experts' first and then, if desired or as needed, to the broader class. (4) Students will write a 10-12 page final paper. No late work will be accepted."}, {"name": "Teaching Method", "value": "Short lectures, class discussions, video viewing. All work in French."}, {"name": "Evaluation Method", "value": "Final grades: 25% participation, 25% daily response papers, 25% midterm paper, 25% final paper."}, {"name": "Class Materials (Required)", "value": "Guy Debord, Oeuvres, ed. Jean-Louis Rançon et Alice Debord (Gallimard, 2006)"}], "lmod": "12/24/16 6:58 PM (CT)", "subject": "FRENCH"}]