[{"class_mtg_info": [{"meet_t": "MoWe 9:30AM - 10:50AM", "meet_l": "Technological Institute F491"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Prerequisite: Students must have completed DATA_SCI 421 to register for this course.", "qtr": "Winter 2017", "name": "23806", "title": "WCAS EARTH 329-0-01 Mathematical Inverse Methods in Earth and Environmental Sciences", "class_attributes": "", "section": "23806", "instructors": [{"instructor_phone": "847/491-8183", "instructor_name": "Suzan   van der Lee", "instructor_addr": "Tech F494"}], "topic": "", "course": "329-0", "descriptions": [{"name": "Overview of class", "value": "The course is about model parameter estimation and inverse problems, that is: the application of linear algebra to the modeling of series of geophysical, geochemical, and environmental data. Model parameters will be extracted from large amounts of imperfect data. Students learn to model data using linear algebra, optimization techniques, and common physical sense. In the past, lab exercises have included locating and characterizing 1) earthquakes from seismographic data, 2) caves from gravity data, 3) the electrical conductivity of different subsurface layers from magneto-telluric data, 4) the consistency of Earth's mantle &amp; crust from seismographic data, 5) the sources of chemical weathering recorded by riverine isotope ratios, and 6) fitting curves to data points, such as hockey-stick curves of global temperature data. Students may bring their own data set to class, to model in a final project."}, {"name": "Registration Requirements", "value": "Prerequisite: DATA_SCI 421 or MATH 230 (Differential Calculus of Multivariable Functions) or STAT 232 (Applied Statistics) or equivalent; Recommended: MATH 240 (Linear Algebra) or STAT 320-1,2."}, {"name": "Teaching Method", "value": "Lectures and Lab, two 80-minute instructor-guided sessions per week, one 80-minute self-guided Lab-only session, and access to the computer lab at other times. A computer lab will be available for student use on Fridays between 9:30am and 11:00am."}, {"name": "Class Materials (Required)", "value": "The following textbook is required for the course. Title and Author: Discrete inverse problems: Insight and Algorithms (fundamentals of Algorithms) by Per Christian Hansen. Publisher: SIAM-Society for Industrial and Applied Mathematics. ISBN: 978-0-898716-96-2.<br/><br/>This text can be purchased online and costs approximately $70."}], "lmod": "12/25/16 6:57 PM (CT)", "subject": "EARTH"}]