[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Locy Hall 301"}], "school": "WCAS", "overview_of_class": "What does it mean to be a ?modern’ Muslim? How might this be different from merely being a Muslim in the ?modern world’? Are there ways in which Muslims have attempted to make modernity their own, as it were, by articulating an ?Islamic’ modernity or modernities? This course attempts to answer these questions by exploring how Muslims have variously engaged, adapted and resisted ?modernity’ in various contexts and locales. After surveying some major scholarly theories of modernity, we will focus on three broad domains of ?the modern’ in Islam: gender, law and the state.", "qtr": "Winter 2016", "name": "Topics in Islam", "title": "WCAS RELIGION 359-0-1 Topics in Islam", "lmod": "1/9/16 6:53 PM (CT)", "section": "1", "instructors": [{"instructor_phone": "", "instructor_name": "Brannon Dobbs Ingram", "instructor_addr": ""}], "topic": "Islamic Modernities", "course": "359-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "What does it mean to be a ?modern&#8217; Muslim? How might this be different from merely being a Muslim in the ?modern world&#8217;? Are there ways in which Muslims have attempted to make modernity their own, as it were, by articulating an ?Islamic&#8217; modernity or modernities? This course attempts to answer these questions by exploring how Muslims have variously engaged, adapted and resisted ?modernity&#8217; in various contexts and locales. After surveying some major scholarly theories of modernity, we will focus on three broad domains of ?the modern&#8217; in Islam: gender, law and the state."}, {"name": "Teaching Method", "value": "Class participationDiscussionFilms / videosGuest speakersIndependent studyLectureReadingsWriting assignments"}, {"name": "Evaluation Method", "value": "Exam, final"}], "path": "/class-descriptions/4610/WCAS/RELIGION/359-0/26839", "instructor": ["Brannon Dobbs Ingram"], "class_attributes": "", "id": "26839", "subject": "RELIGION"}]