[{"school": "SoC", "overview_of_class": "When we consider the subject of children's media culture, we quickly discern a host of contradictory behaviors and attitudes: childhood is seen as a period of timeless wonder, but children are bombarded with all the latest fads and newest gadgets; we try to insulate children from the adult world, but provide them with media technologies that allow them unprecedented access to it; we want kids to be kids, but are thrilled to introduce them to the consumer marketplace through toys, advertisements, and media franchises. This class will explore contradictions such as these by placing discourses about childhood and children's media within their broader cultural, social, and historical contexts. We will encounter a sample of media texts ranging from film adaptations of classic children's literature to contemporary children's television and online digital games. These case studies will allow us to engage with debates about contemporary media culture and interrogate differing perspectives on the nature of childhood. Children are often understood to be a particularly vulnerable part of the media audience, and the investigation of children's media has much to tell us about regimes of media censorship, theories about media influence on behavior and identity, and debates about the media's role in education and marketing. Our goal will be to gain insight into children's media culture and the social institutions and practices that shape it, while also empowering us to speak back to that culture through critical analysis.", "name": "Symposium: Issues in RTVF", "section": "20", "topic": "Children's Media Culture", "course": "398-0", "meeting_time": ["TuTh 1:00PM - 2:50PM", "Tu 6:00PM - 8:50PM"], "path": "/class-descriptions/4620/SoC/RTVF/398-0/31678", "instructor": ["Jacob Arnaud Smith"], "id": "31678", "subject": "RTVF"}, {"school": "SoC", "overview_of_class": "This course will introduce students to masterpieces of an art form that's long been forgotten, but is in the midst of a sparkling rebirth: radio drama. In the middle decades of the 20th century, radio plays were among the most popular forms of fiction in many parts of the world. Legends have come down about thrillers of the 1930s, but these remain poorly understood, and are not representative of the broad work of experimental writers in the medium. In this class you will learn how radio dramas were made in three historical periods: classic American (1937-54); mid-century British (1954-1974) and contemporary global traditions. We will explore the cultural and political background of each of these contexts, practice how to &quot;read&quot; a radio play, and even do some dramatic radio writing. Some radio dramatists we will consider include: Samuel Beckett, Neil Gaiman, Dylan Thomas, Langston Hughes, Orson Welles, Lucille Fletcher, Anna Friz, Tom Stoppard, Gregory Whitehead, Ray Bradbury, and Harold Pinter. There are no pre-requisites. Students with a background or interest in media history, podcasts, creative writing, theatre history, performance, voice studies or literature are especially welcome.", "name": "Symposium: Issues in RTVF", "section": "21", "topic": "Radio Drama, Classic to Contemporary", "course": "398-0", "meeting_time": ["MoWe 10:30AM - 11:50AM"], "path": "/class-descriptions/4620/SoC/RTVF/398-0/31679", "instructor": ["Neil Kanwar Harish Verma"], "id": "31679", "subject": "RTVF"}, {"school": "SoC", "overview_of_class": "", "name": "Symposium: Issues in RTVF", "section": "22", "topic": "Contemporary Television", "course": "398-0", "meeting_time": ["We 3:00PM - 5:50PM"], "path": "/class-descriptions/4620/SoC/RTVF/398-0/37788", "instructor": ["Aymar Christian Jean"], "id": "37788", "subject": "RTVF"}]