[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Annenberg Hall G30"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Spring 2017", "name": "35338", "title": "WCAS ECON 398-2-20 Senior Seminar", "class_attributes": "", "section": "35338", "instructors": [{"instructor_phone": "", "instructor_name": "Mark P Witte", "instructor_addr": ""}], "topic": "", "course": "398-2", "descriptions": [{"name": "Overview of class", "value": "During the two quarters, students will be expected to write a substantial and original research paper. Most weeks students will meet individually or in small groups with Prof Witte to discuss progress on their research. Occasionally the class will meet as a whole during regular scheduled hours. The emphasis of the course will be on work done independently by students on topics of their choice in consultation with their advisers, the TA for the class, and Prof Witte. Ideally, a thesis topic (and adviser) will be found before the start of winter quarter."}, {"name": "Registration Requirements", "value": "By invitation only, extended to economics seniors with at least a 3.5 GPA in their economics classes. Economics 281 or 381-1, 310-1,2, 311, Math 220-1,2 and the completion of most of the 300-level electives. 381-1,2 are strongly recommended."}, {"name": "Teaching Method", "value": "Individual/Small Group Meetings with occasional lectures during the scheduled time slot."}, {"name": "Evaluation Method", "value": "A grade of K (course in progress) is given in the Winter for 398-1, while a letter grade for both quarters is given at the end of the 398-2. Final grades will be based on the final version of the research paper."}, {"name": "Class Materials (Required)", "value": "None."}, {"name": "Class Notes", "value": "Participation by invitation only. Participants are encouraged to communicate with Prof. Witte during Fall quarter and to start thinking of a topic before the course starts."}], "lmod": "2/7/17 6:42 PM (CT)", "subject": "ECON"}]