[{"class_mtg_info": [{"meet_t": "We 6:00PM - 9:00PM", "meet_l": "Meets in Non-General PurposeRm"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Spring 2016", "name": "37797", "title": "WCAS GEN_LA 280-6-27 Residence-Linked Seminar - VI (Literature and Fine Arts)", "class_attributes": "Permission of Instructor<br/><br/>", "section": "37797", "instructors": [{"instructor_phone": "", "instructor_name": "William Grant Bleich", "instructor_addr": ""}], "topic": "Popcorn Buddhism: How to Watch Great Movies and At", "course": "280-6", "descriptions": [{"name": "Overview of class", "value": "To introduce students to the analysis of great movies through the lens of Taoism, Buddhism and Zen. In particular, assigned readings and critical viewing of film classics will illustrate how principles of these three ancient wisdom traditions can be applied to construct a unique theoretical framework for the study of great movies. This analysis will help students to understand how ethical and moral problems arise, the extent to which related decisions are a matter of choice, and the consequences that evolve from interaction of values and choices of individuals, societies and cultures."}, {"name": "Learning Objectives", "value": "After taking this course, students should be able to show they can:<br/><ul><br/><li> Define the tenets of the ancient wisdom traditions of Taoism, Buddhism and Zen.</li><br/><li> Define the key elements of movie narrative: Character, Plot, Structure, Tone, Theme and Scenework. Understand and be able to communicate how the elements of narrative enter the text of a movie with specific emphasis on character and theme.</li><br/><li> Critically evaluate what makes a movie &quot;great&quot; within the context of course content. Compare and contrast these great movies with each other and with ordinary movies.</li><br/><li> Identify and analyze how the tenets of ancient wisdom traditions are expressed in the narrative of great movies. </li><br/><li> Design a theoretical practice to aid and develop a personal system of ethical decision making based on ancient wisdom traditions and great movies. </li><br/><ul>"}, {"name": "Teaching Method", "value": "The teaching method will include lecture, guided in-class discussions, reading assignments, viewing of movie clips and contemplative exercises in the wisdom traditions. Homework will include viewing and assessing streamed films made available through Canvas Library Media and posting on Canvas discussion and assignment boards. <br/><br/>Guided in-class discussion of films and course material will play a key role in teaching and evaluation. Students will work in small group panels and/or two-person teams throughout the quarter. Teams will periodically lead discussions of the assigned reading material and/or the assigned films. Active class participation in these group activities is paramount to student success and there will be written self and peer evaluation of that participation. Above all else, the classroom environment will be a supportive one and students will be encouraged to participate in a community marked by an atmosphere of collaboration."}, {"name": "Evaluation Method", "value": "Students will complete a mid-term paper with essay prompts and a final paper on an approved topic of their choice."}], "lmod": "4/3/16 8:01 PM (CT)", "subject": "GEN_LA"}]