[{"school": "SoC", "overview_of_class": "A doctoral-level seminar on current trend and future prospects of scholarship on news and journalism", "name": "Seminar-Problems in Comm Studies", "section": "20", "topic": "Media Meets Technology", "course": "525-0", "meeting_time": ["Fr 3:00PM - 5:50PM"], "path": "/class-descriptions/4640/SoC/COMM_ST/525-0/16298", "instructor": ["Pablo J Boczkowski"], "id": "16298", "subject": "COMM_ST"}, {"school": "SoC", "overview_of_class": "&quot;Networks have come to play an increasingly important role in our understanding of a wide array of human behavior. In communication and the organizational sciences, extraordinary developments in computing and telecommunications have engendered new organizational forms based on fluid, dynamic networks. These new network forms of self-organizing are constantly evolving in dynamic communities as new network links are created, and dysfunctional ones dissolved. While many writers assert that the capability to nurture networks will differentiate dominant 21st century organizations, little is known about how this important new organizational form emerges and evolves. <br/><br/>This seminar is intended to review theoretical, conceptual, and analytic issues associated with network perspectives on communicating and organizing. The course will review scholarship on the science of networks in communication, computer science, economics, engineering, organizational science, life sciences, physical sciences, political science, psychology, and sociology, in order to take an in-depth look at theories, methods, and tools to examine the structure and dynamics of networks. <br/><br/>As with most graduate seminars, the majority of class time will be spent discussing the assigned readings. A series of laboratory exercises will provide experience with computer-based network analysis, modeling and visualization tools. Students will write a term paper advancing some theoretical, methodological or computational aspect of network science.&quot;", "name": "Seminar-Problems in Comm Studies", "section": "21", "topic": "Social Network Analysis", "course": "525-0", "meeting_time": ["Mo 6:00PM - 8:50PM"], "path": "/class-descriptions/4640/SoC/COMM_ST/525-0/16299", "instructor": ["Noshir   Contractor"], "id": "16299", "subject": "COMM_ST"}]