[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Technological Institute AUD"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: At this time, registration is reserved for neuroscience majors only.<br/><br/>Pre-requisite: Students must have completed BIOL_SCI 217 to enroll in this course.", "qtr": "Winter 2017", "name": "21785", "title": "WCAS NEUROSCI 202-0-1 Cellular &amp; Molecular Neuroscience", "class_attributes": "Natural Sciences Distro Area<br/><br/>", "section": "21785", "instructors": [{"instructor_phone": "847/467-1696", "instructor_name": "David   McLean", "instructor_addr": "2135  Cook Hall"}], "topic": "", "course": "202-0", "descriptions": [{"name": "Overview of class", "value": "This course introduces students to the cellular and molecular processes that allow neurons to operate properly, and how these processes lead to basic sensory and motor functions, the storage of information, and the manifestation of neurological disease. Each lecture tackles a fundamental question best answered by studying the nervous system at the cellular and molecular level, including but not limited to: What constitutes the ?nervous system'? What gives neurons the potential to generate electrical activity? What determines whether a neuron is ?active' or not? How do neurons relay signals? Can communication between neurons be modified? How is the external world transformed into neural activity? How is neural activity transformed into actions? How do neurons make appropriate connections with one another? How is information retained by the nervous system? What happens when neurons fail to communicate normally? The content is designed to provide a strong foundation for students to pursue any specialty within neuroscience."}, {"name": "Registration Requirements", "value": "Prerequisite: BIOL SCI 217."}, {"name": "Learning Objectives", "value": "Students will acquire a deep understanding of:<br/>1) Fundamental neurobiological principles arising from studies of the nervous system at the cellular and molecular level.<br/>2) History and recent developments in neuroscience research.<br/>3) Methods used to study the nervous system, including specific experimental techniques relevant to cellular and molecular neuroscience, the design, analysis and interpretation of experiments using specific techniques, and the strengths and limitations of those techniques.<br/>4) Ethical issues raised by the growing body of information generated by neuroscience research, including the use of animals."}, {"name": "Teaching Method", "value": "The format of the course will be that of a semi-flipped classroom. Instead of hearing information for the first time in lecture, students will read and assimilate the basic material from the textbook prior to class. Lectures will assume a working knowledge of the general concepts covered in the assigned chapters, and then expand upon them, principally by focusing on the techniques and recent advances in the field. Class time will also be used to solve problems and to answer questions. The idea is that the lectures will not only provide new information, but also allow students to discover and remedy misconceptions prior to the exams."}, {"name": "Evaluation Method", "value": "The final grade is not curved and will be broken down as follows:<br/> Participation 10%<br/> Midterm 1 30%<br/> Midterm 2 30%<br/> Final exam 30%<br/><br/>Participation will be evaluated by a combination of class discussion and interactions on Canvas. Exams will use true-false, fill-in-the-blank and/or multiple choice questions to assess comprehension, and are not strictly cumulative since they will focus on specific lectures. However, the questions in later exams will by necessity assume an accumulation of basic facts and concepts raised earlier on."}, {"name": "Class Materials (Required)", "value": "Neuroscience: Exploring the Brain (4th Ed.), ISBN: 9780781778176, List Price: $129.99."}, {"name": "Class Notes", "value": "WCAS Distro Area I - Natural Sciences"}], "lmod": "12/24/16 7:05 PM (CT)", "subject": "NEUROSCI"}]