[{"class_mtg_info": [{"meet_t": "MoWe 12:30PM - 1:50PM", "meet_l": "2122 Sheridan Rd Classroom 231"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "36696", "title": "WCAS ART_HIST 366-0-1 Contemporary Art", "class_attributes": "", "section": "36696", "instructors": [{"instructor_phone": "", "instructor_name": "Rebecca Elizabeth Zorach", "instructor_addr": ""}], "topic": "", "course": "366-0", "descriptions": [{"name": "Overview of class", "value": "This course considers recent issues at the intersection of art and activism, considering what happens?what is lost and what is gained?when artists and activists combine art and politics. Looking particularly at artists and projects in the US and even more specifically in Chicago, we begin with historical antecedents and theoretical background and move quickly to very contemporary issues and interventions. We will consider how art and artists produce, define and critique notions of community, and map, occupy, and creatively intervene in urban space; what it means for artists to develop expertise outside &quot;art&quot; per se; tactical media, whether new (digital), old (silk screen, stencil, puppets), or other (film, broadcast, bicycles); performance and collaborative process; and the art and visual culture of social movements from the Black Panthers to ACT-UP, from radical ecology to Black Lives Matter. We will have several guest speakers and off-campus site visits, and assignments include exhibition visits and participation in artist projects. Students will create an archive of materials and events, and may choose to write a research paper or to design, execute, and document an activist art project, or to create a hybrid form involving both research and practice."}, {"name": "Evaluation Method", "value": "Presentations and participation, artist interview, critical essay, activist art project, research paper"}, {"name": "Class Materials (Required)", "value": "? Nicolas Lampert, A People's Art History of the United States (The New Press, 2013)<br/>? Laurie Palmer, 3 Acres on the Lake: DuSable Park Proposal Project (University of Chicago Press, 2003)<br/>? Rebecca Zorach, ed., Art Against the Law (School of the Art Institute of Chicago, 2014)"}], "lmod": "4/3/16 7:44 PM (CT)", "subject": "ART_HIST"}]