[{"class_mtg_info": [{"meet_t": "Tu 5:00PM - 7:50PM", "meet_l": "ANTHRO Sem Rm 104 - 1810 Hinmn"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "32248", "title": "WCAS ANTHRO 390-0-21 Topics In Anthropology", "class_attributes": "Jrs, Srs, Grad Students Only<br/><br/>", "section": "32248", "instructors": [{"instructor_phone": "847/491-4821", "instructor_name": "Micaela   di Leonardo", "instructor_addr": "1810 Hinman Ave., Room #210, EV Campus"}], "topic": "American Inequalities, the Public Sphere, Counterp", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "How do we come to understand ourselves as Americans? How do some visions of American lives deny full citizenship to other Americans? What is the connection between that denial and both enduring domestic political, economic, and social inequalities, and the history and contemporary realities of US foreign policy? <br/> <br/>This seminar will focus on shifts in the US public sphere over the last half-century, and in particular on its variegated role in the present, and on a range of lively minority counterpublics. In an anthropological rather than journalistic vein, we will read the foundational theorizations of the public sphere and counterpublics; investigate the material and ideological effects of neoliberal globalization and widening inequalities globally on American self-understandings of their lives within a world of nations; the roles of corporations and wealthy individuals in the construction of publicly recognized &quot;common sense&quot; understandings; the devastating financial effect on investigative journalism of the rise of the online world; and recent upsurges of misogyny/homophobia, racism, and xenophobia. What roles do various kinds of media play in these processes? What is the history of &quot;fake news&quot;? How have individuals and groups attempted to counter it?<br/> <br/>We will devote the first half of the quarter to readings and discussions. During the second half, students will embark on individual mini-research projects arising from seminar concerns with the American public sphere and counterpublics. These projects should include an interviewing/ethnographic component. Students will present their findings in the last two seminar meetings, and turn in papers describing that research and those findings at the end of the quarter. Grading will be based on seminar participation (45%), research presentation (15%) and final papers (40%)."}, {"name": "Class Materials (Required)", "value": "Readings will include John Nichols' and Robert McChesney's Dollarocracy: How the Money-and-Media Election Complex is Destroying America (2013) ISBN-13: 978-1568589534 <br/><br/>A coursepack, available at Quartet Copies."}], "lmod": "2/6/17 6:40 PM (CT)", "subject": "ANTHRO"}]