[{"school": "WCAS", "overview_of_class": "Prof. Mahoney's 490 Spring 2015 \"Methods of Comparative Analysis\"<br/><br/>This seminar offers a broad introduction to the field of comparative methodology. The emphasis is on what are conventionally regarded in political science as \"qualitative\" methods for the analysis of a relatively small number of cases. In sociology, this field is generally known as comparative-historical methodology. The course focuses on recent methodological writings, though a few classical pieces are also included. The readings are not specific to any substantive sub-field in political science or sociology. The course assumes no prior background in qualitative methodology.", "name": "Special Topics in Political Science", "section": "20", "location": "Scott Hall 212", "topic": "Methods on Comparative Analysis", "course": "490-0", "meeting_time": ["Fr 9:00AM - 11:50AM"], "path": "/class-descriptions/4660/WCAS/POLI_SCI/490-0/35455", "instructor": ["James L Mahoney"], "class_attributes": "", "id": "35455", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "Spring 2017 GSS 405 /POLISCI 490 \"ADVANCED FEMINIST THEORY\" Prof. Mary Dietz<br/>If the generative moment of contemporary feminist theory can be traced to Simone de Beauvoir's The Second Sex (1949), then the past sixty-five plus years to the present constitute a truly turbulent epoch for feminist theorizing and feminist political discourse, given the contestations that have engulfed the academic field ever since Beauvoir declared \"One is not born a woman but becomes one.\" Under the sway of what R Wiegman calls \"the progress narrative of gender\" some of feminism's core concepts, perhaps particularly its subject, \"women,\" are seemingly up for grabs, theoretically, politically, and disciplinarily. Working under the weight of the ruptures and crises of identification that constitute contemporary feminist theory, this seminar has two overlapping aims. The first is explanatory/investigative: Geared toward gaining knowledge of the complexity of central categories of feminist analysis and understanding (e.g. \"gender,\" \"sex,\" \"sexuality,\" \"women,\" \"woman,\" \"m/f,\" \"the feminine,\" \"patriarchy,\" \"family,\" \"lesbian,\" \"race,\" \"class,\" \"identity,\" \"kinship,\" \"oppression,\" \"desire,\" \"nation,\" \"power,\" \"freedom,\" \"politics\") through the interpretation of texts. Without organizing things strictly chronologically, much less seeking any sort of linear narrative of \"development,\" we'll consider transformations, changes, and tensions that mark (mostly western) feminist theoretical perspectives and discourses from roughly the 1970s to the present. Although we'll be considering general theoretical approaches (e.g. Marxist; lesbian materialist; feminist standpoint; critical theoretic; black feminist/oppositional consciousness; intersectional; postcolonial/subaltern; poststructuralist; psychoanalytic; linguistic; deconstructive; genderqueer; transnational) the focus will be on reading texts and writers in ways that disrupt the standard theoretical positions they are presumed to represent. The second aim of the seminar is critical/diagnostic/programmatic: Concerned to bring the texts and thinkers we're reading into constant comparative and productive tension with each other, not only with a view toward exposing the limitations, misrepresentations, and exclusions that shadow all modalities of feminist thought post-Beauvoir and under the watchful eye of \"the progress narrative of gender,\" but also with a view toward imagining new beginnings that generate fruitful possibilities for feminist theory and politics in late modernity. Authors include: N Alarcón; L Alcoff; S Ahmed; E Barkley Brown; R Braidotti; W Brown; J Butler; N Chodorow; K Crenshaw; E Grosz; N Hartsock; J Kristeva; L Irigaray; A Lorde; C Sandoval; H Spillers; G Spivak; C MacKinnon; B Martin; G Rubin; R Wiegman; L Zerilli.", "name": "Special Topics in Political Science", "section": "22", "location": "Scott Hall 201 Ripton Room", "topic": "Advanced Feminist Theory", "course": "490-0", "meeting_time": ["Th 3:00PM - 5:50PM"], "path": "/class-descriptions/4660/WCAS/POLI_SCI/490-0/35457", "instructor": ["Mary Golden Dietz"], "class_attributes": "", "id": "35457", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "This seminar will conduct a critical reading of the literature on elite theory stretching from the late 1890s to the present. In addition to attending seminar sessions, students will write a paper that analyzes this literature - emphasizing the state of the art on elite theory, what the approach asks or fails to ask, and who elite theorists are debating in their work.", "name": "Special Topics in Political Science", "section": "23", "location": "Scott Hall 201 Ripton Room", "topic": "Elite Theory", "course": "490-0", "meeting_time": ["Mo 8:30AM - 11:20AM"], "path": "/class-descriptions/4660/WCAS/POLI_SCI/490-0/35458", "instructor": ["Jeffrey A Winters"], "class_attributes": "", "id": "35458", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "POLI SCI 490-0-24 Spring 2017 \"Plato and Aristotle in the Islamic Tradition\", Makram ABBES<br/>This course covers the reception of the philosophy of Plato and Aristotle in the Islamic world. It aims to show how these two authors were part of the cultural and political fabric from al-Kindi (Ninth century) to Averroes (Twelfth century). Although Aristotle curriculum was best known to the Muslim philosophers than the texts of Plato, these two authors were considered as an example of human wisdom, moral excellence and the basis of a solid scientific methodology. Plato was referred to as the « Divine » and the « Sublime » while Aristotle was the « Sage » or the « First Master ». After giving an account of the work translated and commented on in Arabic, the course deals with the major topics of moral and political philosophy in which the influence of Plato and Aristotle was quite visible in Râzî (d. 925), Fârâbî (d. 950) or Averroes's works (d. 1198). A special attention will be paid to the central role played by Plato's Republic and Aristotles's Nicomachean Ethics in shaping political aspects of Islamic philosophy, and in creating new issues related to the place of the philosopher in society, the theological-political problem, and the model of the virtuous City.", "name": "Special Topics in Political Science", "section": "24", "location": "Locy Hall 106", "topic": "Plato & Aristotle in the Islamic Tradition", "course": "490-0", "meeting_time": ["MoWe 12:30PM - 1:50PM"], "path": "/class-descriptions/4660/WCAS/POLI_SCI/490-0/35459", "instructor": ["Makram   Abbes"], "class_attributes": "", "id": "35459", "subject": "POLI_SCI"}]