[{"class_mtg_info": [{"meet_t": "Th 6:15PM - 9:15PM", "meet_l": "Technological Institute L211"}], "school": "SCS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "27854", "title": "SCS PHYSICS 130-B-66 College Physics II", "class_attributes": "", "section": "27854", "instructors": [{"instructor_phone": "847/491-7477", "instructor_name": "Arthur Gerard   Schmidt", "instructor_addr": "Technological Institute (2145 Sheridan Road), Room F-226, Evanston"}], "topic": "", "course": "130-B", "descriptions": [{"name": "Overview of class", "value": "This non-calculus based course covers topics in Electricity and Magnetism: charges, electric and magnetic forces, electrical [potentials, batteries, circuits with both D.C. and A.C. currents, capacitance, induction and inductance, and finally electromagnetic radiation. Actual demonstrations of many physical principles will be shown in the lecture when ever possible. Weekly homework assignments emphasize problem solving."}, {"name": "Registration Requirements", "value": "Prerequisites: 130-a Intro Physics, Basic knowledge of High School algebra and trigonometry."}, {"name": "Learning Objectives", "value": "The goal of the course is for the student to gain an understanding of the nature of the physical principles which govern the world around us and the universe beyond, through models which draw on our everyday experiences."}, {"name": "Teaching Method", "value": "Lecture with demonstration. The instructor will draw on the large assortment of lecture demonstrations from the Lecture Demonstration Collection of the Department of Physics and Astronomy at Northwestern University Evanston Campus. Class participation is encouraged through use of personal response polling system, and questions are always welcome. Each class begins with a question and answer session for the problem set assigned the previous class."}, {"name": "Evaluation Method", "value": "Grades for this course are based on a two one hour in-class midterms, three hour final exam, and completion of homework assignments."}, {"name": "Class Materials (Required)", "value": "Course materials: Text: Physics, 7th ed. , Giancoli, Prentice Hall, Personal Response &quot;Clickers&quot; will be required. We use the TurningPoint brand."}, {"name": "Class Notes", "value": "Requires enrollment in PHYSICS 131-B (lab course)"}], "lmod": "1/9/16 6:42 PM (CT)", "subject": "PHYSICS"}]