[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "1801 Hinman Ave 2225"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Freshmen may not register for this course.", "qtr": "Winter 2016", "name": "24973", "title": "WCAS HISTORY 395-0-33 Research Seminar", "class_attributes": "", "section": "24973", "instructors": [{"instructor_phone": "847/467-3879", "instructor_name": "Michael J Kramer", "instructor_addr": "Harris Hall 212"}], "topic": "Digitizing Folk Music History", "course": "395-0", "descriptions": [{"name": "Overview of class", "value": "The United States folk music revival is typically thought of as an antimodern, even a Luddite, movement. To study it through digital means, however, reveals important connections between the history of the revival and issues of technology, culture, and poltiics in the modern world. In this research seminar, we examine the history of the US folk music revival through readings, audio listening, documentary films, seminar discussions, and extensive digital analysis to investigate these connections. Working in platforms such as Omeka and WordPress, we use the archives of the Berkeley Folk Music Festival, the Old Town School of Folk Music (in Chicago and online), and the Alan Lomax Collection (online) to probe what was at stake in the folk revival in relation to American culture and politics; questions of race, class, gender, age, and region; and the strange workings of music-making, memory, and power. As we do so, we ask how digital technologies might help us to interpret history more meaningfully; simultaneously, we explore how both the folk revival itself and the methods of historical study might be crucial to understanding our contemporary digital moment more effectively. Each student will be evaluated based on class participation, weekly digital mini-project experiments, presentations, and a final multimedia interpretive digital history podcast project that is the multimedia equivalent of a 15-20 page analytic essay based on original research. For students with advanced digital media/programming skills or musical training, the course presents an opportunity to connect that background to deep historical study; for students interested in acquiring digital or musical skills, the seminar offers an excellent introductory pathway to these areas of knowledge."}, {"name": "Teaching Method", "value": "SeminarSeminar and digital work."}, {"name": "Evaluation Method", "value": "Class discussion, weekly digital history assignments, final interpretive digital history podcast project."}, {"name": "Class Materials (Required)", "value": "? Ronald D. Cohen, Rainbow Quest: The Folk Music Revival and American Society, 1940-1970 (Amherst: University of Massachusetts Press, 2002) ISBN: 978-1-55849-348-3<br/><br/><br/>? Benjamin Filene, Romancing the Folk: Public Memory and American Roots Music (Chapel Hill: University of North Carolina Press, 1999) ISBN: 978-0807848623<br/><br/><br/>? Bob Dylan, Chronicles, Volume One (New York: Simon and Schuster, 2005) ISBN: 978-0743244589<br/><br/><br/>? Robert Cantwell, When We Were Good: The Folk Revival (Cambridge, MA: Harvard University Press, 1996), ISBN: 978-0674951334"}, {"name": "Class Notes", "value": "No previous digital or musical training is required for the course.<br/><br/>HISTORY AREA OF CONCENTRATION: Americas"}], "lmod": "1/9/16 6:48 PM (CT)", "subject": "HISTORY"}]