[{"school": "WCAS", "overview_of_class": "This seminar focuses on the anatomy of articles in professional journals of sociology. In doing so, the seminar examines the different ways of \"framing\" a research question, the art of organizing a review of the literature, and the mechanics of good academic writing. The seminar is designed primarily as a forum for the advanced graduate student who has written a paper that s/he seeks to develop into a manuscript appropriate for submission to a referred sociology journal. During the quarter, seminar participants will revise their papers into article-form on the basis of a series of assignments and exercises structured not only to assist in the revision of the papers on hand, but also to provide preparation for article writing in sociology more generally.", "name": "Topics in Sociological Analysis", "section": "20", "location": "SOCIOL Sem Rm 107 - 1812 Chi", "topic": "Professional Writing Seminar", "course": "476-0", "meeting_time": ["Th 2:00PM - 4:50PM"], "path": "/class-descriptions/4620/WCAS/SOCIOL/476-0/34458", "instructor": ["Charles M Camic"], "class_attributes": "", "id": "34458", "subject": "SOCIOL"}, {"school": "WCAS", "overview_of_class": "Historical institutionalism is a broad approach (or set of approaches) to research at the intersection of two literatures. The first is institutional analysis, which focuses on the emergence, operation, reproduction, change, and consequences of institutions. Historical institutionalism is often identified with macro institutional approaches that call attention to the role of power, collective actors, and conflict. The second literature focuses on temporal processes and modes of historical analysis. Historical institutionalism is associated with works that emphasize critical junctures, path dependence, and the temporal sequencing of macro processes.", "name": "Topics in Sociological Analysis", "section": "21", "location": "Scott Hall 212", "topic": "Political Sociol:Comp&Hist Approaches to Pol Analy", "course": "476-0", "meeting_time": ["Fr 9:00AM - 11:50AM"], "path": "/class-descriptions/4620/WCAS/SOCIOL/476-0/34459", "instructor": ["James L Mahoney"], "class_attributes": "", "id": "34459", "subject": "SOCIOL"}, {"school": "WCAS", "overview_of_class": "This course is motivated by the assumption that questions of knowledge and technology have become central to the political and cultural organization of modern societies. The fundamental goal of the course is to develop tools to understand both the social organization of science and the technoscientific dimensions of social life. Although much of the actual course content concerns science and technology, the theoretical and analytical frameworks developed in this course are intended to apply to any domain involving knowledge, expertise, or technical tools. We will ask: What have been the dominant approaches to the sociological study of science and technology? How do these various approaches help us understand such topics as the organization of intellectual work, the politics of knowledge production, the design and dissemination of technologies, the standardization of knowledge products, the character of \"knowledge societies,\" the resolution of conflicts around knowledge and technology, the relations between laypeople and experts, the tensions between expertise and democracy, the measurement and management of technological risk, the technological mediation of identity formation, and the nature of governance in technologically sophisticated societies? Finally, in which ways are present-day studies of science and technology consistent with, and in which ways are they in tension with, other approaches to understanding knowledge, culture, politics, etc., that are employed within sociology today? The course focuses largely (but not completely) on the United States, though we will try whenever possible to place developments in a global context. While much of the scholarship we will consider is broadly sociological, some of it is drawn from other fields. Students from other disciplines are welcome.", "name": "Topics in Sociological Analysis", "section": "22", "location": "Allison Residential Comm 1021", "topic": "Politics of Knowledge", "course": "476-0", "meeting_time": ["Mo 10:00AM - 12:50PM"], "path": "/class-descriptions/4620/WCAS/SOCIOL/476-0/34460", "instructor": ["Steven G Epstein"], "class_attributes": "", "id": "34460", "subject": "SOCIOL"}, {"school": "WCAS", "overview_of_class": "In this course, students will develop the necessary skills to conceptualize, plan, and execute interview-based research projects. We will cover topics such as fine-tuning a research idea, formulating research questions, designing a rigorous research plan, navigating the IRB process, recruiting respondents, creating the interview guide, conducting interviews, and analyzing and writing up data. We will also consider reflexivity, ethics, and the complexities of interviewing various populations. Students at all levels of the graduate student process are welcome, but most students find it most helpful to be at or near the proposal stage (for a second-year paper/masters thesis or dissertation project). Each week, participants will spend the first portion of the allotted time discussing course readings and receiving practical instruction from the professor on some aspect of the research process. During the last hour of the class each week, students will gather into work groups to discuss current concerns and receive peer feedback for their individual interview-based research projects.", "name": "Topics in Sociological Analysis", "section": "23", "location": "Allison Residential Comm 1021", "topic": "Interviewing Methods", "course": "476-0", "meeting_time": ["We 9:30AM - 12:20PM"], "path": "/class-descriptions/4620/WCAS/SOCIOL/476-0/34457", "instructor": ["Celeste Michele Watkins-Hayes"], "class_attributes": "", "id": "34457", "subject": "SOCIOL"}]