[{"school": "WCAS", "overview_of_class": "Contact Professor Ben Page directly for more information.", "name": "Political Research Seminar", "section": "20", "topic": "Wealth and Power in America", "course": "395-0", "meeting_time": ["Th 2:00PM - 4:50PM"], "path": "/class-descriptions/4620/WCAS/POLI_SCI/395-0/34139", "instructor": ["Benjamin I Page"], "id": "34139", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "Prof. Riedl &quot;Religion &amp; Politics&quot; Spring 2016<br/>What is the relationship between religion and politics? This course examines the meanings of, and interactions between, religion and politics from a comparative perspective. We will begin by examining alternative theoretical understandings of the appropriate relationship between religion and state. Armed with these perspectives, we will investigate the implications of the various ways in which the religion-state relationship have been constructed for the nature of political conflict. <br/>Building on the approaches developed in the first part of the course, we will then turn our attention to several of the current issues in religion and politics: Why is religion apparently more important than ever despite an increasingly secular world? What is religious nationalism? What is fundamentalism? How can we explain the similarities and differences between religious fundamentalist movements across the globe? How should democratic states cope with the emergence of fundamentalist movements? In order to begin answering these questions, we will integrate the theoretical frameworks we develop with explorations of the historical and local context of relevant case-studies from around the world.", "name": "Political Research Seminar", "section": "21", "topic": "Religion &amp; Politics", "course": "395-0", "meeting_time": ["Mo 10:00AM - 12:50PM"], "path": "/class-descriptions/4620/WCAS/POLI_SCI/395-0/34140", "instructor": ["Rachel Beatty Riedl"], "id": "34140", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "Prof. Julie Merseth &quot;Immigration Politics and Policy&quot; Spring 2016<br/>This course provides an introduction to immigration politics and policy in the United States with a focus on the contemporary incorporation of post-1965 immigrants. We begin by foregrounding the role of the state and the history of U.S. immigration policies that continue to shape social and political experiences among the foreign-born. We then examine public opinion toward immigrants and immigration issues, highlighting the ways in which they are ideologically contested. Building from this, we turn our attention to how immigrants are incorporated in the U.S., with an emphasis on the significance of race and ethnicity in immigrant communities. Finally, drawing on empirical studies in the field of American politics, we focus on questions and explanations of immigrant participation and mobilization in the twenty-first century.", "name": "Political Research Seminar", "section": "22", "topic": "Immigration Politics and Policy", "course": "395-0", "meeting_time": ["Tu 2:00PM - 4:50PM"], "path": "/class-descriptions/4620/WCAS/POLI_SCI/395-0/34141", "instructor": ["Julianne Lee Merseth Cook"], "id": "34141", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "&quot;Military Interventions&quot;, Prof. Marina Henke Spring 2016<br/>Military interventions are the most costly foreign policy tool extent. The purpose of this research seminar is to examine systematically and comparatively why military interventions are launched and what results they produce on the ground. The seminar, in particular, tries to find answers to the following questions: (1) What were the broad policy arguments in favor of or opposed to a particular intervention? (2) Who were the principal players arguing for intervention? (3) What role did international institutions play in the set-up of the intervention? (4) What specific kinds of military force proved particularly useful in the actual intervention? (6) In each case, do we judge the intervention a success or failure, and how do we explain the success or failure?", "name": "Political Research Seminar", "section": "24", "topic": "Military Intervention", "course": "395-0", "meeting_time": ["Mo 2:00PM - 4:50PM"], "path": "/class-descriptions/4620/WCAS/POLI_SCI/395-0/34142", "instructor": ["Marina Elisabeth Philippina Henke"], "id": "34142", "subject": "POLI_SCI"}]