[{"school": "WCAS", "overview_of_class": "In August 1947, as the sun set on Britain's Indian empire, the subcontinent was partitioned into two newly-created, independent nations: India and Pakistan. The division into two territories -one Hindu-majority, the other Muslim-majority - was accompanied by perhaps the largest migration in human history. Millions moved from one territory to the other, often against their will, as hundreds of thousands were killed in the ensuing chaos. The unprecedented violence of Partition - physical, emotional, social - profoundly shaped the national identities of India and Pakistan, permanently restructured the texture of everyday life and altered the global political order. From border disputes in Kashmir to ongoing cross-border migration to unresolved conflicts over identity and belonging, the conflicts engendered by Partition continue to shape the region today.<br/><br/>Unsurprisingly, then, Partition and its legacy have been the subject of extensive engagement in literature, film, popular culture and even TV advertisements. This class will examine how Partition has been engaged in literature and popular culture, moving from contemporary depictions from the late 1940s to its continued invocation in India, Pakistan and Bangladesh today. We will read these texts alongside the extensive body of scholarship on Partition from History, Anthropology and Gender Studies with particular attention to the historiography of Partition and South Asian nationalisms. Throughout, we will engage with the idea of Partition as an \"event\" and ask how Partition continues to inflect life in South Asia and beyond today. ", "name": "Advanced Topics in Asian Languages and Cultures", "section": "20", "location": "Harris Hall L06", "topic": "This is not that dawn??: The Partition of India an", "course": "390-0", "meeting_time": ["TuTh 9:30AM - 10:50AM"], "path": "/class-descriptions/4660/WCAS/ASIAN_LC/390-0/32524", "instructor": ["Daniel Joseph Majchrowicz"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "32524", "subject": "ASIAN_LC"}, {"school": "WCAS", "overview_of_class": "Since Edward Said's seminal work Orientalism, a large body of scholarship has persuasively demonstrated how the \"Orient\" emerged as an imagined construct of Euro-American texts. But how did the so-called natives of the \"Orient\" write about this entity? This course explores how 20th century writers across East and South Asia envisioned \"Asia\" in response to Western imperial discourse and also in relation to their own diverse aesthetic and political aims. We will read essays written by major poets, essayists, and political figures such as Rabindranath Tagore, Sun Yat Sen, Okakura Kakuz?, and Yi T'ae-jun. We will examine themes including multiple visions for constructing an international community, Western and Japanese imperialisms, and the aesthetics of Asian traditions.", "name": "Advanced Topics in Asian Languages and Cultures", "section": "21", "location": "Kresge Centennial Hall 2-425", "topic": "Imagining Asia", "course": "390-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4660/WCAS/ASIAN_LC/390-0/32525", "instructor": ["Mi-Ryong   Shim"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "32525", "subject": "ASIAN_LC"}, {"school": "WCAS", "overview_of_class": "Socialist zombies. Underground literature. Queer porn. Dancing grannies. The vernacular is so much more than ?the common language.' But what does it do to invoke the vernacular as a mode of practice? If the ?vernacular' invokes the everyday, the common and the low, it also is an avenue to the edges of standardization, places that are commonly suppressed, overlooked, or marginalized?places that offer the potential for resistance. But resistance to what exactly? And how does a resistant vernacular practice keep from becoming another voice in cosmopolitan mainstream? What exactly is meant when the vernacular is politicized, moralized, or intellectualized? This course will consider how and to what extent the vernacular offers new perspectives and possibilities to our understanding of everyday systems of power through its modes as language, aesthetic, and literary, cultural and political practice. In addition to the topics above, we will examine vernacular practices throughout the twentieth century to the present day, from the vernacular literature movement in the beginning of the Republican era, to cabaret culture, to street theater, to independent film, to craftivism, to internet literature today.", "name": "Advanced Topics in Asian Languages and Cultures", "section": "22", "location": "Harris Hall L28", "topic": "Vernacular Practice in Modern China", "course": "390-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4660/WCAS/ASIAN_LC/390-0/32526", "instructor": ["Anne Elizabeth Rebull"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "32526", "subject": "ASIAN_LC"}]