[{"school": "WCAS", "overview_of_class": "Michel Foucault famously introduced the nineteenth century (late modernity) as the constitution of a new arrangement of knowledge in the West which simultaneously accommodated \"the historicity of economics,\" \"the finitude of human existence\" and the \"fulfillment of an end to History,\" with all of the tensions and ambiguities each of these formulations implies. This seminar picks up where that thought leaves off, aiming to investigate the dynamics of late modernity politically and theoretically in selected works of Alexis de Tocqueville, John Stuart Mill, and Friedrich Nietzsche each of whom, we might say, writes as an \"outsider within\" the new arrangement. The terms of modernity to which we'll be attentive in reading Tocqueville, Mill, and Nietzsche intersect with Foucault's identifications in the forms of: (1) the problem of history (modernity's consciousness of time, new beginnings, and the constellation of the present in relation to the past and the future); (2) the problem of the (gendered and sexed) subject and subjectivity (modernity's sensitivity to the individual self, autonomy of action, and mutual recognition); and (3) the problem of democracy (modernity's struggle with popular sovereignty, political freedom, and the contending principles of liberty and social equality). Insofar as these problems intersect in a way that defines one of the major dimensions of nineteenth century political theory, they constitute a matrix of sorts for our critical engagement with the texts. The seminar will therefore be less interested in reading presupposed ideological constructs or labels off Tocqueville, Mill, and Nietzsche (e.g. liberal/conservative; democratic/aristocratic; modern/postmodern) than in problematizing their texts politically and rhetorically in light of the themes of history, subjectivity, and democracy.", "name": "Late Modern Political Thought", "section": "20", "location": "Scott Hall 107 Burdick Room", "topic": "", "course": "463-0", "meeting_time": ["Tu 5:15PM - 8:05PM"], "path": "/class-descriptions/4620/WCAS/POLI_SCI/463-0/34192", "instructor": ["Mary Golden Dietz"], "class_attributes": "", "id": "34192", "subject": "POLI_SCI"}]