[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "Kresge Centennial Hall 4-410"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Winter 2017", "name": "22726", "title": "WCAS PHIL 109-6-22 First-Year Seminar in Philosophy", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "22726", "instructors": [{"instructor_phone": "8474912556", "instructor_name": "Rachel E Zuckert", "instructor_addr": "Crowe 1-167"}], "topic": "Idealism and Realism", "course": "109-6", "descriptions": [{"name": "Overview of class", "value": "We will discuss a range of classic philosophical texts, presenting different kinds of realism or idealism (in metaphysics, politics, ethics). We will consider questions such as: what does it mean to be an &quot;idealist&quot; or a &quot;realist&quot;? is mind or matter, both or neither the truly real? What would it mean to claim that the world does not (really) exist? Why would it be an insult - or not - to be called a political &quot;idealist&quot;? Or: if you are a criminal in virtual reality, are your crimes real, or not?"}, {"name": "Learning Objectives", "value": "* To gain a sense of the wide range of meaning of central philosophical terms, in this case &quot;ideal&quot; and &quot;real,&quot; <br/>* To understand some foundational philosophical debates<br/>* To gain familiarity with some classic philosophical texts<br/>* To be introduced to practices of philosophical interpretation and argument"}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Course evaluation will be based on participation in class discussion; short writing assignments; two papers."}, {"name": "Class Materials (Required)", "value": "George Berkeley, Three Dialogues Between Hylas and Philonous, Hackett 978-0915144617<br/>Jennifer Haley, The Nether, Northwestern UP 9780810130630<br/>Immanuel Kant, To Perpetual Peace, Hackett 978-0-87220-691-5<br/>Thucydides, On Justice, Power, and Human Nature: Selections from the History of the Peloponnesian War, Hackett 978-0-87220-168-2<br/><br/>There will also be a course pack including selections from Raymond Geuss, Thomas More and others."}], "lmod": "12/24/16 7:05 PM (CT)", "subject": "PHIL"}]