[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Locy Hall 111"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "23664", "title": "WCAS MENA 390-3-22 Advanced Topics in Middle East &amp; North African Studies", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "23664", "instructors": [{"instructor_phone": "", "instructor_name": "Ayca   Alemdaroglu", "instructor_addr": ""}], "topic": "Gendr&amp;SexualityinMidEst", "course": "390-3", "descriptions": [{"name": "Overview of class", "value": "This course explores the construction of gender in the Middle East. Drawing on the historical, sociological and anthropological research in the region, the course aims to question stereotypes about the subordination of Muslim women and to offer a systematic reading and an analytical discussion of the political, economic and cultural structures that inform gender relations and sexuality. The course starts with an examination of early Islam and religious sources with regard to women's status, then moves on to nationalist and modernization movements in the 19th and 20th centuries, and finally focuses on women and men's lives in contemporary Egypt, Turkey and Iran. In this framework, special attention is given to Islamist mobilizations, the family, sexuality, neoliberalism, women's labor and LGBT."}, {"name": "Learning Objectives", "value": "Learning Objectives: <br/>Develop an interdisciplinary understanding of gender relations, sexuality and social change in the Middle East <br/><br/> Know the main historical periods and social factors that play in the social construction of gender in Egypt, Iran and Turkey<br/><br/>Obtain the knowledge of common sociological concepts in relation to gender <br/><br/>Evaluate the merits of common representations of the Middle East and its people <br/><br/>Understanding commonalities and differences of gender issues between the US and the countries in focus"}, {"name": "Teaching Method", "value": "DiscussionLecture"}, {"name": "Class Materials (Required)", "value": "Leila Ahmed, 1992, Women and Gender in Islam, Yale University Press <br/>Farha Ghannam, 2013, Live or Die Like a Man: Gender Dynamics in Urban Egypt, Stanford University Press.<br/><br/>Course readings will also be available on Canvas"}], "lmod": "1/9/16 6:51 PM (CT)", "subject": "MENA"}]