[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Technological Institute M349"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "33448", "title": "WCAS BIOL_SCI 164-0-2 Genetics and Evolution", "class_attributes": "Natural Sciences Distro Area<br/><br/>", "section": "33448", "instructors": [{"instructor_phone": "", "instructor_name": "Eric Michael Hill", "instructor_addr": ""}], "topic": "", "course": "164-0", "descriptions": [{"name": "Overview of class", "value": "Modern genetic theory is a basic underlying principle for all biology. Recent advances have lead to the development of techniques to manipulate genetic information, commonly referred to as &quot;genetic engineering&quot;. This course is designed to introduce non-major students to the field of genetics and promote scientific curiosity in the life sciences. Students will learn important concepts of classical genetics and heredity as well as modern techniques of genetic engineering. Particular attention will be given to the role of genetics in disease and evolution and the use of genetic engineering in these areas. The impact of genetic information and genetic engineering on society will also be addressed. There are no prerequisites for this course."}, {"name": "Learning Objectives", "value": "By the end of the quarter, students will be able to:<br/>1) Describe the basic principles controlling the expression and inheritance of genetic information. <br/>2) Describe the theory of evolution in your own terms.<br/>3) Define genetic engineering and explain common mechanisms used manipulate genetic information. <br/>4) Analyze current uses for genetic engineering in studying disease and evolution and evaluate future roles for genetic engineering in science and society."}, {"name": "Teaching Method", "value": "This class will consist of lectures, in-class exercises, and group discussions."}, {"name": "Evaluation Method", "value": "In-class assessments will be used to measure student progress toward reaching the intended learning goals. Reading and writing assignments will be used to prepare students for in-class discussion on recent technological advancements and discoveries in genetics and evolution."}, {"name": "Class Materials (Required)", "value": "No textbook required. Required readings and lecture slides will be provided throughout the course."}], "lmod": "2/21/17 6:44 PM (CT)", "subject": "BIOL_SCI"}]