[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Technological Institute M349"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "33448", "title": "WCAS BIOL_SCI 164-0-2 Genetics and Evolution", "class_attributes": "Natural Sciences Distro Area<br/><br/>", "section": "33448", "instructors": [{"instructor_phone": "", "instructor_name": "Eric Michael Hill", "instructor_addr": ""}], "topic": "", "course": "164-0", "descriptions": [{"name": "Overview of class", "value": "This course is designed for non-biology majors as an introduction to the life sciences and to encourage scientific curiosity. Students will learn about the mode of inheritance, genetic engineering and to explore Darwinian Evolution. The application of genetics and evolution to everyday life and the impact on society will also be addressed. A deep understanding of genetic processes will be provided, granting students a platform to form knowledgeable opinions on today's most popular scientific controversies, including genetically modified organisms (GMO's). There are no prerequisites for this course."}, {"name": "Learning Objectives", "value": "By the end of the quarter, students will be able to:<br/>1. Describe the basic principles of genetics and the implications to human disease.<br/>2. Relate principles in genetics to their role in natural selection and evolutionary change.<br/>3. Evaluate mainstream scientific articles in order to draw sound conclusions.<br/>4. Assess the power of publicly available media sources on societal thought.<br/>5. Self-evaluate to explore own scientific biases and attitudes toward current scientific advancements."}, {"name": "Teaching Method", "value": "This class will consist of short daily lectures, small in-class activities, and group discussions."}, {"name": "Evaluation Method", "value": "In-class assessments will be used to measure student progress toward reaching the intended learning goals.<br/>Weekly assignments and readings will be used to prepare students for in-class discussions on recent scientific advancements and discoveries as presented by the media."}, {"name": "Class Materials (Required)", "value": "No textbook required. Required readings include media articles that will be provided throughout the course."}], "lmod": "2/6/17 8:38 AM (CT)", "subject": "BIOL_SCI"}]