[{"school": "WCAS", "overview_of_class": "What does 2015's Mad Max: Fury Road tell us about how to get along? How can we recognize present-day realities in its surreal cinematic assault on the senses? As interlocking narratives of globalization, resource competition, and ecological crisis collide in the news, the vital natural resources on which human lives and relationships depend have increasingly taken center stage in recent fiction and film. Whether it's a question of \"too much\" or \"not enough\" - of deluge or scarcity - the tales we will read and watch together in this course bring us in close to \"resource wars\" and utopian (or dystopian) imaginaries, so that we can see them through every day, intimate encounters. Each zooms in, in other words, from geopolitical power struggles over problems caused by oil and water, to their effects on a human scale - often to remind us that this is the scale where our actions count. Mixing fast-paced action, futuristic sci-fi, devastating satire, and surreal beauty, these works cannot be captured by a single mood, and they likewise resist being reduced to explanations of history and policy, or \"dry\" questions of drilling and water rights. Our discussions of the novels and films for the course will instead be guided by how each represents pressing problems of competition and coexistence.", "name": "Studies in Theme", "section": "20", "topic": "Tales of Oil and Water", "course": "304-0", "meeting_time": ["MoWe 9:30AM - 10:50AM"], "path": "/class-descriptions/4650/WCAS/COMP_LIT/304-0/22370", "instructor": ["Tristram Nash Wolff"], "id": "22370", "subject": "COMP_LIT"}, {"school": "WCAS", "overview_of_class": "The Japanese city is the main site of Japanese modernity and of its contradictions. As in many other places with leaders determined to modernize quickly, the prewar Japanese government systematically stripped the countryside of resources in order to build and display the central institutions of a modern nation, most of which were in the cities. These developments recast Tokyo as the epitome of Japan's modern success in economic and political terms and as the site of its cultural and social disintegration. Tokyo and nearly all Japanese cities then were virtually leveled during World War II. After the war, the newly reconstructed cities became the central arenas for Japanese efforts to create democracy. <br/><br/>This co-taught course examines the cultural representations of the modern Japanese city from its construction to its destruction and then regeneration. We will study the ways Japanese transformed Tokyo into an imperial capital and then recast it as a space for new forms of political and social relationships after the war. Throughout its history, Tokyo has been Japan's central site for defining and redefining class and gender identities as well as participating in mass consumption. We will consider how authors and filmmakers represented individual and collective experiences of urban life and the ways that urban space shaped the very form and possibilities of life in modern Japan.", "name": "Studies in Theme", "section": "21", "topic": "Japan's Modern Revolution", "course": "304-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4650/WCAS/COMP_LIT/304-0/22371", "instructor": ["Laura E Hein", "Patrick James Noonan"], "id": "22371", "subject": "COMP_LIT"}]