[{"class_mtg_info": [{"meet_t": "We 7:00PM - 8:20PM", "meet_l": "Annenberg Hall G28"}], "school": "WCAS", "overview_of_class": "One of the most important communication skills necessary for a successful academic career is the ability to write effectively in a variety of genres. This course aims to address the needs of nonnative speakers of English in developing their writing skills. We will focus both on the mechanics of English sentences and paragraphs as well as the local and global discourse structure of written texts. A workshop atmosphere is encouraged in the classroom, and online homework assignments encourage students to extend their writing practice into their own fields of expertise and interest. Students will also receive explicit constructive criticism from the instructor on regular electronic submissions. This class is a \"hybrid\" course, meaning that 50% of the class is conducted online. Rather than meeting for two and a half hours per week, we meet for only one and a quarter hours, and that face-to-face time is spent working on the issues presented in each weekly unit.", "qtr": "Fall 2017", "name": "Written English for Non-native Speakers", "title": "WCAS LING 381-0-20 Written English for Non-native Speakers", "lmod": "9/12/17 7:16 PM (CT)", "section": "20", "topic": "", "course": "381-0", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "descriptions": [{"name": "Overview of class", "value": "One of the most important communication skills necessary for a successful academic career is the ability to write effectively in a variety of genres. This course aims to address the needs of nonnative speakers of English in developing their writing skills. We will focus both on the mechanics of English sentences and paragraphs as well as the local and global discourse structure of written texts. A workshop atmosphere is encouraged in the classroom, and online homework assignments encourage students to extend their writing practice into their own fields of expertise and interest. Students will also receive explicit constructive criticism from the instructor on regular electronic submissions. This class is a \"hybrid\" course, meaning that 50% of the class is conducted online. Rather than meeting for two and a half hours per week, we meet for only one and a quarter hours, and that face-to-face time is spent working on the issues presented in each weekly unit."}, {"name": "Registration Requirements", "value": "The course is open to international graduate students, visiting scholars, research associates, faculty, and staff of Northwestern University. Auditing is permitted, though priority is given to graduate students who are officially registered for credit. Attendance policy for auditors: two absences w/o notice in a row OR three absences w/ or w/o notice throughout the quarter lead to a drop. Spots will be offered to other auditors until the official drop date. Instructor consent is required. <br/><br/>Students must complete an online form from English Language Programs in order to be eligible for the class and obtain a permission number. Contact elp@northwestern.edu for specific registration instructions."}, {"name": "Learning Objectives", "value": "By the end of this course, students should be able to:<br/> <br/>? Describe key features of rhetorical structure of academic written English.<br/>? Identify their specific strengths and weaknesses when using written English.<br/>? Draft, revise, and edit a piece of writing appropriate for an American academic audience, incorporating feedback from the course instructor and peers.<br/>? Demonstrate progress toward improved proficiency (clarity, accuracy, and effectiveness)."}, {"name": "Teaching Method", "value": "DiscussionGroup workLectureOnline workOther: Peer feedback<br/>"}, {"name": "Evaluation Method", "value": "You are expected to complete regular readings and assignments each week, including the online assignments. The concepts introduced in these readings and assignments will form the basis for classroom work, so it is important that you complete them in advance of the class for which they are assigned."}, {"name": "Class Materials (Required)", "value": "Class materials will be available online."}, {"name": "Class Materials (Suggested)", "value": "Class materials will be available online."}, {"name": "Class Notes", "value": "This course is open to international graduate students, scholars, and staff of Northwestern University. First priority is given to PhD students, then TGS Masters students. Auditing is permitted, though priority for space in the class will be given to those who are registered for credit."}], "instructor": ["Kenneth Leon Konopka"], "class_attributes": "", "id": "10033", "subject": "LING"}]