[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Swift Hall 231"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores<br/>Add Consent: Department Consent Required<br/>Drop Consent: Department Consent Required<br/>", "qtr": "Fall 2016", "name": "10176", "title": "WCAS PSYCH 101-6-21 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>Attendance at 1st class mandatory<br/><br/>", "section": "10176", "instructors": [{"instructor_phone": "847/491-3652", "instructor_name": "Sara Cantonia Broaders", "instructor_addr": "Swift 243, 2029 Sheridan Road"}], "topic": "Psychology and &quot;Weird&quot; Beliefs", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "Lots of people have beliefs that other people think are just plain weird. Why do people have these beliefs? We'll look at &quot;weird&quot; beliefs within our culture as well as some cross-cultural examples, and try to understand what leads people to develop and maintain these beliefs. Another issue is that one person's &quot;weird&quot; belief may be another person's firmly held conviction. From this perspective, we'll also try to understand which beliefs are rational. Among the topics we may cover are: witchcraft, alien abduction, superstition, parapsychology, ghosts, evolution vs. creationism, repressed memories of abuse, multiple personality disorder, and spirit possession. Students will learn to use a wide variety of academic and not-so-academic resources (including empirical research articles, ethnographic descriptions, philosophical arguments, popular press books, and documentary films) to explore the bases for these beliefs and practices."}, {"name": "Teaching Method", "value": "Discussion, supplemented with videos. We may have some class debates."}, {"name": "Evaluation Method", "value": "Students will be evaluated based on their participation in class discussion, peer review of other students' work, and written assignments. Overall participation in class discussion will account for 15% of the grade, peer review will be 5%, and written assignments will be 80% of the final course grade.<br/><br/>NUMBER OF WRITING ASSIGNMENTS AND THEIR LENGTHS: Students will write discussion questions of approximately a half-page to a page on the readings for each class meeting. Students will also write two papers during the quarter: a two-page paper on an assigned topic at the beginning of the term and a longer final paper (8-10 pages) that will entail finding several additional resources beyond those in the syllabus. Students will also write peer critiques for the first paper."}, {"name": "Class Materials (Required)", "value": "READING LIST: We will have several books and many chapters and articles from other sources. The required books are most likely to be: <br/><br/><br/>1. Shermer, M. (2011). The believing brain: From ghosts and gods to politics and conspiracies - How we construct beliefs and reinforce them as truths. Times Books. <br/><br/><br/>2. Sagan, C. (1996). The demon-haunted world. Ballantine Books. <br/><br/><br/>3. Gilovich, T. (1991). How we know what isn't so: The fallibility of human reason in everyday life. Free Press. <br/><br/><br/>4. Luhrmann, T.M. (1989). Persuasions of the witch's craft: Ritual magic in contemporary England. Harvard University Press. <br/><br/><br/>5. Clancy, S.A. (2005). Abducted: How people come to believe they were kidnapped by aliens. Harvard University Press <br/><br/><br/>6. Miller, K. (2009). Only a theory: Evolution and the battle for America's soul. Penguin Books.<br/><br/><br/>7. Lipson, C. (2008). Doing honest work in college: How to prepare citations, avoid plagiarism, and achieve real academic success. (2nd edition). Chicago: University of Chicago Press. <br/><br/><br/>Chapters and articles from other sources will be available either through the Blackboard system or in a course reader available for purchase"}], "lmod": "10/30/16 7:09 PM (CT)", "subject": "PSYCH"}]