[{"class_mtg_info": [{"meet_t": "Th 3:30PM - 4:50PM", "meet_l": "2315 Campus Dr Clinic 1620"}], "school": "SoC", "overview_of_class": "Purpose:<br/>The purpose of this course is two-fold:<br/>1. To welcome doctoral students into the community of professional practitioners. <br/>2. To provide a forum for discussion* of contemporary ethical practices, issues, and dilemmas of importance to clinical audiologists.", "qtr": "Winter 2017", "name": "Clinical Study and Practicum in Audiology", "title": "SoC CSD 415-4-20 Clinical Study and Practicum in Audiology", "lmod": "2/5/17 6:36 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Jennifer Mary Phelan", "instructor_addr": ""}, {"instructor_phone": "", "instructor_name": "Kristine Marie Grohne Riley", "instructor_addr": ""}], "topic": "", "course": "415-4", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Purpose:<br/>The purpose of this course is two-fold:<br/>1. To welcome doctoral students into the community of professional practitioners. <br/>2. To provide a forum for discussion* of contemporary ethical practices, issues, and dilemmas of importance to clinical audiologists."}, {"name": "Registration Requirements", "value": "Enrollment in the Northwestern University Doctor of Audiology (AuD) Program."}, {"name": "Learning Objectives", "value": "The course provides information that serves to support and empower clinical audiologists as they become acculturated into professional practice settings. Readings, class presentations, and discussions review appropriate professional conduct and the causes and consequences of misconduct."}, {"name": "Teaching Method", "value": "*Discussion. An important aspect of this course is the opportunity to learn from the exchange of participant ideas, opinions, experiences and interpretation of lecture information, presentations, and readings. As such, `discussion' reflecting reasoned thought, an understanding of the general principles of ethics, and an appreciation for the seriousness of ethics violations is expected and the quality of individual contributions will be weighed. By expressing your views and indicating why you hold those views, you will either become stronger in holding on to those views or you will see reasons for reconsideration. In either case, you will benefit from these discussions."}, {"name": "Class Materials (Required)", "value": "Primary texts:<br/>Hamil, T. (2006). Ethics in Audiology: Guidelines for Ethical Conduct in Clinical, Educational, and Research Settings, Reston, VA: American Academy of Audiology. [To order, see: www.audiology.org/academystore; or call Elizabeth Lowman, 1-800-222-2336, ext 1039]<br/><br/>Irwin, D., Pannbacker, M., Powell, T., &amp; Vekovius, G. (2007). Ethics for Speech-LanguagePathologists and Audiologists: An illustrative casebook. Clifton Park, NY: Thomsen Delmar Learning. [Available from: Thomson Learning, PO Box 6904, Florence , KY 41022-6904. Phone: 1-800-354-9706; Fax: 1-800-487-8488.]"}, {"name": "Class Materials (Suggested)", "value": "Every effort will be made to conserve paper. As such, course participants will depend heavily on Blackboard (NU's Course Management System), internet resources, and the Hamil and Irwin, et al texts (see below)."}, {"name": "Class Notes", "value": "Requirements:<br/>Home Study<br/>Scope of Practice in Audiology. In order to recognize and avoid unethical behavior, it is important to be fully grounded in the currently accepted Scope of Practice for clinical audiologists. Find the Audiology Scope of Practice document on the internet (Google: ASHA Audiology), read it, and refer to it as necessary throughout the course and when preparing your final presentation.<br/><br/>Discussion*-based<br/>Ethical vs. Unethical Behavior class discussions. In Weeks 2, 3, and 7, a series of examples of ethical and unethical behavior will be presented for class brief review and discussion*. <br/><br/>Ethical Practice Dilemma class discussions*. In Weeks 5, 6 &amp; 7, a series of ethics dilemmas will be raised for class discussion*.<br/><br/>Other Issues and Dilemmas. In Week Eight, selected other `issues' will be reviewed and discussed*."}], "path": "/class-descriptions/4650/SoC/CSD/415-4/25935", "instructor": ["Jennifer Mary Phelan", "Kristine Marie Grohne Riley"], "class_attributes": "", "id": "25935", "subject": "CSD"}]