[{"class_mtg_info": [{"meet_t": "MoWeFr 11:00AM - 11:50AM", "meet_l": "Harris Hall L28"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "37178", "title": "WCAS LATIN 201-3-20 Introduction to Latin Literature", "class_attributes": "", "section": "37178", "instructors": [{"instructor_phone": "847/491-8029", "instructor_name": "Francesca   Tataranni", "instructor_addr": "Crowe Hall 3-171"}], "topic": "", "course": "201-3", "descriptions": [{"name": "Overview of class", "value": "The third quarter of second-year Latin combines literary analysis with mastery of grammar and syntax at the intermediate level. A grade of C- or better satisfies the WCAS language requirement. <br/>This is mainly a workshop course, with discussion focusing on questions by members of the course. Though translation will be a component in evaluation, it will be a relatively minor criterion of success. The main topics of discussion will be how meaning and emphasis are communicated in Latin. <br/>Though Latin 201-3 concentrates on language skills, it also develops skills of analysis that are foundational for the future study of literature in any language."}, {"name": "Registration Requirements", "value": "PREREQUISITES: Successful completion of Latin 201-2 or by placement test. Students who earned a 4 on the AP Latin exam can enroll in the class without taking the placement test. For further information, contact the Director of Latin Instruction Francesca Tataranni (f-tataranni@northwestern.edu)."}, {"name": "Teaching Method", "value": "Discussion, with emphasis on student participation. Ownership of this class is entirely in the students' hands, with the instructor functioning as facilitator."}, {"name": "Evaluation Method", "value": "Attendance and participation in class, weekly quizzes, a translation project with a final examination for students with less than an A average."}, {"name": "Class Materials (Required)", "value": "Required: 1) D.H. Garrison, The Student's Catullus,(4th edition Oklahoma, 2012) ISBN: 978-0806142326 - list price $27<br/>2) Guy Lee, The Poems of Catullus (Oxford World Classics, 1990) ISBN: 978-0192835871-list price $14"}, {"name": "Class Materials (Suggested)", "value": "Recommended: Allen and Greenough's New Latin Grammar, by Anne Mahoney (Focus Publ./R. Pullins Co. 2001) - ISBN-13: 978-1585100279"}, {"name": "Class Notes", "value": "RESTRICTIONS: No P/N."}], "lmod": "4/3/16 8:10 PM (CT)", "subject": "LATIN"}]