[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Norris Center Big Ten Room 104"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Registration is reserved for Philosophy PhD Graduate Students", "qtr": "Spring 2016", "name": "31585", "title": "WCAS PHIL 357-0-21 Topics in Metaphysics and Epistemology", "class_attributes": "Graduate Students Only<br/><br/>", "section": "31585", "instructors": [{"instructor_phone": "847/491-2555", "instructor_name": "Fabrizio   Cariani", "instructor_addr": "Crowe 3-171"}], "topic": "Counterfactuals and Alternative Possibilities", "course": "357-0", "descriptions": [{"name": "Overview of class", "value": "Suppose Sally says: &quot;If Obama had not been president, healthcare reform would not have happened before 2016&quot;. Sally's statement is a counterfactual: that is, it is engages us to think about alternate possibilities. In this class, we will try to understand counterfactuals from the intertwined points of view of metaphysics, epistemology, psychology and philosophy of language. We will ask questions like: how does Sally's counterfactual statement differ in meaning from a purely factual statement like &quot;Obama is president&quot;? Can we make sense of the idea that, while &quot;Obama is president&quot; is a statement about this world, Sally's counterfactual is in some sense a statement about another world? Can we ever know counterfactual statements to be true? And, finally, how do ordinary people reason with counterfactuals?"}, {"name": "Learning Objectives", "value": "- Acquire knowledge of the classical theories of counterfactuals in the fields of metaphysics, epistemology, philosophy of language and psychology. - Acquire the method to analyze difficult and abstract arguments critically, rigorously and independently. - Work on their ability to produce their own rigorous arguments on the material of the course - Acquire the ability to represent problems abstractly and think of possible solutions to them in terms of the abstract representation."}, {"name": "Teaching Method", "value": "Lecture"}, {"name": "Evaluation Method", "value": "There will be homework assignments and two papers (a short one and a long one)."}, {"name": "Class Materials (Required)", "value": "Most of the materials will be available on Canvas. However, students should buy the following book: David K. Lewis &quot;Counterfactuals&quot;, Blackwell. ISBN-13: 978-0631224259"}], "lmod": "4/3/16 8:13 PM (CT)", "subject": "PHIL"}]