[{"class_mtg_info": [{"meet_t": "We 2:00PM - 4:50PM", "meet_l": "Crowe Hall Room 1-140"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "23729", "title": "WCAS PHIL 460-0-20 Seminar in Ethical Theory", "class_attributes": "Graduate Students Only<br/><br/>", "section": "23729", "instructors": [{"instructor_phone": "847/467-6249", "instructor_name": "Stephen John White", "instructor_addr": "Crowe Hall, Room 1-159"}], "topic": "The Practical Point of View", "course": "460-0", "descriptions": [{"name": "Overview of class", "value": "The focus of the seminar will be the &quot;practical&quot; point of view, or the point of view we take up as agents deliberating about what to do. It has frequently been alleged that as rational deliberators, we are necessarily committed to viewing ourselves and our agency in a distinctive light. For instance, it has been argued that we are committed to regarding ourselves as free, or as responsible, or to viewing our actions as aimed at some good, or at any rate as subject to objective normative constraints. We will be looking at several attempts to defend these and related claims in order to better understand the general idea that the distinctive nature of the practical, or deliberative point of view provides a basis for a conception of ourselves as morally responsible agents."}, {"name": "Registration Requirements", "value": "Department Consent"}, {"name": "Learning Objectives", "value": "Students will:<br/><br/> Be able to articulate and evaluate philosophical claims about the distinctive commitments and presuppositions of rational deliberation. <br/><br/> Further develop their skills in philosophical writing, analysis, and argumentation"}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Weekly reading responses; final paper"}, {"name": "Class Materials (Required)", "value": "Weekly readings will be available through the course website"}, {"name": "Class Notes", "value": "Graduate students from departments outside of Philosophy must email the professor for permission to enroll."}], "lmod": "1/9/16 6:51 PM (CT)", "subject": "PHIL"}]