[{"class_mtg_info": [{"meet_t": "MoWe 12:30PM - 1:50PM", "meet_l": "Locy Hall 106"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: REASON: Pre-registration is not allowed for this class. Please try again during regular registration.", "qtr": "Spring 2017", "name": "35459", "title": "WCAS POLI_SCI 490-0-24 Special Topics in Political Science", "class_attributes": "", "section": "35459", "instructors": [{"instructor_phone": "", "instructor_name": "Makram   Abbes", "instructor_addr": ""}], "topic": "Plato &amp; Aristotle in the Islamic Tradition", "course": "490-0", "descriptions": [{"name": "Overview of class", "value": "POLI SCI 490-0-24 Spring 2017 &quot;Plato and Aristotle in the Islamic Tradition&quot;, Makram ABBES<br/>This course covers the reception of the philosophy of Plato and Aristotle in the Islamic world. It aims to show how these two authors were part of the cultural and political fabric from al-Kindi (Ninth century) to Averroes (Twelfth century). Although Aristotle curriculum was best known to the Muslim philosophers than the texts of Plato, these two authors were considered as an example of human wisdom, moral excellence and the basis of a solid scientific methodology. Plato was referred to as the « Divine » and the « Sublime » while Aristotle was the « Sage » or the « First Master ». After giving an account of the work translated and commented on in Arabic, the course deals with the major topics of moral and political philosophy in which the influence of Plato and Aristotle was quite visible in Râzî (d. 925), Fârâbî (d. 950) or Averroes's works (d. 1198). A special attention will be paid to the central role played by Plato's Republic and Aristotles's Nicomachean Ethics in shaping political aspects of Islamic philosophy, and in creating new issues related to the place of the philosopher in society, the theological-political problem, and the model of the virtuous City."}], "lmod": "2/12/17 7:00 PM (CT)", "subject": "POLI_SCI"}]