[{"class_mtg_info": [{"meet_t": "Mo 2:00PM - 4:50PM", "meet_l": "ANTHRO Sem Rm B07 - 1810 Hinmn"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "28044", "title": "WCAS ANTHRO 390-0-33 Topics In Anthropology", "class_attributes": "", "section": "28044", "instructors": [{"instructor_phone": "", "instructor_name": "Eli S Suzukovich III", "instructor_addr": "1810 Hinman Avenue, Evanston, IL 60208-1310"}], "topic": "The Ethnobiology of Maple Syrup", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "Sesipâskw'pêskân is the Nehiywa (Cree) word for a maple sugar camp. It's the time in between late winter and early spring when families gather to collect maple sap, and to harvest fish, beavers, and early spring plants, or at least it used to be. As the earth's climate changes, maple trees and the subsequent maple syrup industry in the U.S. and Canada are being affected, in both good and bad ways. To compound this, the demand for maple syrup is rising in Asia. The class will cover these effects, their impact on Native American and non-Native communities, the maple syrup industry, and maple species themselves. <br/> <br/>Students will work in groups and conduct radial observations of selected trees. Trees will be tapped to collect small batches of raw sap to examine water/sugar ratios, hormone release, flow rates, species differentiation in sap quality, and correlated with soil quality, ambient temperature, precipitation. Students will also learn about how to utilize outdoor space as an informal science classroom and develop community based citizen science methods and curriculum. The class will periodically check in with the sugar bush activities on the Ho'Chunk reservation in Wisconsin. We will compare tapping results between the two locations in order to understand how maple trees are behaving/being affected by climate change in different climate zones and to explore the possibility of developing a regional predictive model for tapping maples as the climate changes throughout the following years.<br/> <br/>The final product for the class will be a group report that will act as an ongoing yearly record of sap flow and quality, overall tree health, and climate effects on tree behavior. A copy of the report will go to facilities management to be added to their campus tree inventory."}, {"name": "Class Materials (Required)", "value": "Articles will be provided"}], "lmod": "12/25/16 6:54 PM (CT)", "subject": "ANTHRO"}]