[{"class_mtg_info": [{"meet_t": "Th 12:00PM - 5:00PM", "meet_l": "Hogan 2-112 Cell/Tissue Cultur"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-requisite: Students must have completed NEUROSCIENCE 202 and 306 or BIOL_SCI 302 or BIOL_SCI 311 or gain consent of the instructor to enroll in this course.<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Winter 2017", "name": "21787", "title": "WCAS NEUROSCI 350-0-1 Advanced Neurophysiology Laboratory", "class_attributes": "", "section": "21787", "instructors": [{"instructor_phone": "847/467-0475", "instructor_name": "Daniel A Dombeck", "instructor_addr": "2409 Pancoe"}], "topic": "", "course": "350-0", "descriptions": [{"name": "Overview of class", "value": "In this laboratory course you will perform electrophysiological experiments in which signals from living neurons (action potentials, local field potentials, post synaptic potentials) are recorded using amplifiers and data logging equipment commonly found in advanced research labs around the world. You will learn to analyze and interpret the signals that you record and learn to use chemical compounds to alter neural activity. Once a basic understanding of neural recording is achieved, you will reproduce classic neuroscience experiments, such as inducing long term potentiation in hippocampal neurons. The experience of this class will help you appreciate the complexity of the brain and will help neuroscience textbook material that you have covered in other classes come to life. Prerequisite: NEUROSCI 202 and 306."}, {"name": "Registration Requirements", "value": "Pre-requisities: NEUROSCI 202 and 306, or BIOL SCI 302 or 311 or consent of instructor. Must gain consent of the instructor to register."}, {"name": "Learning Objectives", "value": "At the end of this course, students will be able to:<br/>1. Use a patch clamp amplifier, stimulating amplifier and pClamp software (the most common software found in electrophysiology laboratories around the world) for recording and stimulating from neural systems.<br/>2. Independently set up neural recordings and perform electrophysiology experiments.<br/>3. Analyze neural recording data using computer software (Clampfit and Matlab).<br/>4. Design experiments and collect data guided by statistical principles such that a specific hypothesis can be accepted or rejected with statistical confidence.<br/>5. Effectively communicate experimental methods and results to a group of peers."}, {"name": "Teaching Method", "value": "Laboratory"}, {"name": "Evaluation Method", "value": "100 points total<br/>6 lab reports x 10 points each 60 points<br/>Class participation 25 points<br/>Class project 15 points"}, {"name": "Class Materials (Required)", "value": "The Design of Experiments in Neuroscience, 2nd Ed., Mary E. Harrington. ISBN: 9781412974325. List Price: $70.00."}, {"name": "Class Notes", "value": "Must gain consent of the instructor to register."}], "lmod": "12/24/16 7:05 PM (CT)", "subject": "NEUROSCI"}]