[{"class_mtg_info": [{"meet_t": "Mo 2:00PM - 4:50PM", "meet_l": "Kresge 4364 Classics Sem Rm"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: REASON: Pre-registration is not allowed for this class. Please try again during regular registration.<br/>Add Consent: Department Consent Required<br/>", "qtr": "Spring 2017", "name": "33100", "title": "WCAS COMP_LIT 412-0-20 Literary Studies Colloquium", "class_attributes": "", "section": "33100", "instructors": [{"instructor_phone": "", "instructor_name": "William N West", "instructor_addr": ""}], "topic": "Ovidian Poetics", "course": "412-0", "descriptions": [{"name": "Overview of class", "value": "Metamorphoses, Ovid's book of changes, continues to be one of the most widely productive texts in the history of world literature. In this class we will consider this poem as a kind of paradigm for poiesis, in which transformation is more prominent than creation, and development overshadows origin. We will look at some of the stories Metamorphoses tell, how they tell them, and why; we will look at how those stories have been read and changed in turn, by readers and rewriters, into natural science, ethical prescription, political lessons, psychoanalysis. We will also consider how Metamorphoses have splintered across genres and modes, like the epic, the novel, the lyric, the dramatic?and the visual, the operatic, the cinematic, the digital. We will not attempt anything like a history of reception; the subject is too vast and the description too orderly. Instead, we will try to account in part for the promiscuity and fecundity of the idea of becoming-Ovidian, or of being metamorphic across a range of periods and texts. We will look to Metamorphoses not as the point of origin of a history, but as a kind of core from which other kinds of production have drawn matter and energy. Insofar as is possible we will draw on the particular areas of expertise of the seminar participants."}], "lmod": "2/12/17 6:51 PM (CT)", "subject": "COMP_LIT"}]