[{"school": "WCAS", "overview_of_class": "The alphabet rendered poetry obsolete, once and for all. Since the written word overtook the Homeric epic poem as a kind of communal Wikipedia, poetry has been less about communicating information and more about lyric expression. Recently, digital technologies have been seen to present this same challenge to the book. Like poetry, we might say that the book isn't dead, it has simply lost its claim as the primary source of information. Over the last two decades, some of the most interesting works of art and poetry have turned to the book in both form and content, as both inspiration and fallen idol. It has never been easier for writers to publish, not just on Twitter and Facebook, but across a range of Print on Demand (POD) platforms for the printed book. This course examines recent works of poetry alongside new developments in print technologies. From Seth Siegelaub's The Xerox Book (1968) to new works of POD poetry published throughout the quarter (TBA, 2017), we will study the emergence of innovative forms of writing the book under the influence of digital networks. Additionally, we will conduct our own experiments using print on demand in a series of collaborative and independent scholarly projects. No previous experience with either poetry or publishing is required. All students will publish books about poetry made on the internet.", "name": "Humanities in the Digital Age", "section": "20", "location": "University Hall 122", "topic": "Print-on-Demand Poetry: Making Books After the Int", "course": "325-6", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4650/WCAS/HUM/325-6/24201", "instructor": ["Daniel Scott Snelson"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "24201", "subject": "HUM"}, {"school": "WCAS", "overview_of_class": "Since their emergence in the World War II-era, digital technologies have been hailed as revolutionary agents of cultural transformation?for both good and ill. Charting a middle course between the breathless optimism of technophilia and the alarmism of technophobia, we will analyze digital computational technologies analytically and historically from a humanities perspective. We will pay particular attention to aesthetic forms responding to the problem of how digital media enable both unprecedented transparency and opacity: from dataveillance and sharing on social media to glitch art and the oddly impersonal dimensions of networked sexuality. Taking a comparative perspective, we will survey a series of digital aesthetic genres from videogames to video art to electronic literature. Possible objects of study include Thatgamecompany's Journey, David OReilly's Everything, videos by Laura Poitras, Natalie Bookchin, Takeshi Murata, and Lynn Kirby, and e-lit by John Cayley and William Poundstone.", "name": "Humanities in the Digital Age", "section": "22", "location": "Harris Hall L28", "topic": "Digital Media Studies", "course": "325-6", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4650/WCAS/HUM/325-6/27473", "instructor": ["James Joseph Hodge"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "27473", "subject": "HUM"}]