[{"school": "WCAS", "overview_of_class": "This course will explore the overlapping histories of Islam in the United States from the presence of enslaved African Muslims in the original colonies to present day debates over the place of Islam in secular society. Special attention will be paid to the role of Muslims in the African diaspora as an enduring social, cultural, and political force shaping this history. Students will therefore learn especially about the routes of Islam through plantation slavery and slave rebellion, as well as twentieth-century Pan-African organizing, the Civil Rights movement, and hip hop. We will also connect this history to more recent trends in immigration, the \"War on Terror,\" and state surveillance of mosques. There are no prerequisites, though it is highly recommended that students arrive with an understanding of the basic terminology of Islamic studies, and a keen interest in exploring the Islam's connection to issues of American race, religion, colonialism, and secularism.", "name": "Topics in Islam", "section": "20", "topic": "Histories of Islam in the US", "course": "359-0", "meeting_time": ["MoWe 11:00AM - 12:20PM"], "path": "/class-descriptions/4650/WCAS/RELIGION/359-0/24599", "instructor": ["William Eugene Caldwell"], "id": "24599", "subject": "RELIGION"}, {"school": "WCAS", "overview_of_class": "This seminar is designed to analyze anthropological approaches to the study of Islam and Muslims in the MENA region and the Islamicate world. We will begin the course by critically revisiting the historical legacies that mediate contemporary debates on and representations of Muslims and Islam. We will explore what it means to take Islam as an object of anthropological analysis and the kinds of normative assumptions that underlie references to \"religion\" and \"tradition.\" Second, we will closely examine seminal interventions advanced by Ernst Gellner, Clifford Geertz and Michael Gilsenan before turning to Talal Asad's analysis of anthropological categories of religion and his attempts to reformulate the study of Islam as a discursive tradition. Situating these debates within the broader intellectual history of anthropological thought, we will then proceed to examine the analytical purchase of symbolic, discursive and practice-centered approaches in studies of Islam. In the second half of the course, we will shift our attention to more ethnographically grounded materials that explore Muslim engagements with, and responses to, various facets of modernity such as gender inequality, capitalist economics and neoliberalist development, religious minorities and the secular nation-state as well urban life and practices of leisure.", "name": "Topics in Islam", "section": "21", "topic": "Anthropology of Islam: Symbol, Discourse, Practice", "course": "359-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4650/WCAS/RELIGION/359-0/24600", "instructor": ["Emrah   Yildiz"], "id": "24600", "subject": "RELIGION"}]