[{"class_mtg_info": [{"meet_t": "Fr 9:00AM - 11:50AM", "meet_l": "Harris Hall L40"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "33423", "title": "WCAS HISTORY 410-3-20 General Field Seminar in American History", "class_attributes": "Graduate Students Only<br/><br/>", "section": "33423", "instructors": [{"instructor_phone": "847/491-7356", "instructor_name": "Michael S Sherry", "instructor_addr": "Harris Hall Room 207"}], "topic": "", "course": "410-3", "descriptions": [{"name": "Overview of class", "value": "This course introduces graduate students in history and adjunct disciplines (they are encouraged to take this class) to major themes in modern US history and its historiography. It selectively examines established scholarship, recent work seen as on the cutting edge, and challenges of practice in the discipline. It also helps prepare students for exams and teaching, and for those specializing in the 20th century, to identify topics they may wish to research further."}, {"name": "Teaching Method", "value": "Discussion"}, {"name": "Evaluation Method", "value": "Based on 15-20 pages of essay writing, exact schedule and format to be determined, and on participation in discussion."}, {"name": "Class Materials (Required)", "value": "TENTATIVE READING LIST: <br/>(tentative; in some cases only selections will be assigned; and with some articles/essays added) Michael H. Hunt, Ideology and U.S. Foreign Policy (1987). <br/>George Chauncey, Gay New York: Gender, Urban Culture, and the Making of the Gay Male World, 1890-1940 (1994). <br/>Kevin Boyle, Arc of Justice: A Saga of Race, Civil Rights, and Murder in the Jazz Age (2004). <br/>Daniel T. Rodgers, Atlantic Crossings: Social Politics in a Progressive Age (1998). <br/>David Kennedy, Freedom from Fear: The American People in Depression and War, 1929-1945. <br/>James T. Sparrow, Warfare State: World War II Americans and the Age of Big Government (2011).<br/>Nancy MacLean, Freedom is Not Enough: The Opening of the American Workplace (2008) <br/>Beth Bailey and David Farber, eds., The Sixties: From Memory to History (1994) <br/>Philip Jenkins, Decade of Nightmares: The End of the Sixties and the Making of Eighties America (2006). Jefferson Cowie, Stayin' Alive: The 1970s and the Last Days of the Working-Class (2010) <br/>David Harvey, A Brief History of Neo-Liberalism (2005) <br/>Daniel Rodgers, Age of Fracture (2011)"}], "lmod": "4/3/16 8:04 PM (CT)", "subject": "HISTORY"}]