[{"school": "SoC", "overview_of_class": "This course is a a workshop for creating expressive projects that cross between digital and corporeal space. The course will focus on understanding the relationship between screens, the spaces around screens, and human performance. The course is a practical survey of systems that create meaning by engendering human interaction and participation. Students are encouraged to use a range of creative media to initiate playful situations that span different disciplines and dimensions of art-making. Units are constructed around questions of what contexts are suitable for the combination of live performance and media, how one might approach different audiences, and how one constructs a system that negotiates order with unexpected results. Students will have the opportunity to conceptualize their own projects and select from a menu of approaches in order to resolve them. Students will be evaluated through active participation, individual exercises, reading responses, presentations, and unit projects in group critique. The course is designed for students of any experience level.<br/><br/>Learning Outcomes:<br/>By the end of the quarter students should have a strong understanding of contemporary developments in media-enabled performance. Students should also have a working understanding of different tools for performing with media and technology as an individual production practice. Students should also be able to discern what tool and approach is appropriate and effective for a given concept, as well as how to seek out additional resources on their own.<br/><br/>Materials:<br/>Readings will be provided as pdf or web documents.", "name": "Topics in Interactive Media", "section": "20", "location": "Louis Hall 118", "topic": "Media-enabled Performance", "course": "376-0", "meeting_time": ["TuTh 1:00PM - 2:50PM"], "path": "/class-descriptions/4640/SoC/RTVF/376-0/14313", "instructor": ["Charles Stephen Evans"], "class_attributes": "Prerequisites apply, see description<br/><br/>", "id": "14313", "subject": "RTVF"}, {"school": "SoC", "overview_of_class": "This course is a workshop for understanding interactive arts through the cultural lens of video games. The course will focus on the practical use of introductory game creation tools as well as their relationship to other media. The course aims to distinguish between how video games extend traditions of artistic exchange and how they offer novel and unexplored modes of communication unique to the medium. The course is designed to engender an active and critical perspective on what games are and how they relate to other cultural texts through analysis, discussion, production, and play. Students will have the opportunity to conceptualize their own game projects and select from a menu of approaches in order to resolve them. Students will be evaluated through active participation, individual exercises, reading responses, presentations, and unit projects in group critique. The course is designed for students with no prior game making experience, although students with experience are welcome to enroll<br/><br/>Learning Outcomes:<br/>By the end of the quarter students should have a strong understanding of contemporary developments in interactive art with special attention to the field of video games. Students should also have a working understanding of different tools for expressing their own ideas video games as an individual production practice. Students should also be able to discern what tool and approach is appropriate and effective for a given concept, as well as how to seek out additional resources on their own.<br/><br/>Materials:<br/>Readings will be provided as pdf or web documents.", "name": "Topics in Interactive Media", "section": "21", "location": "Louis Hall 118", "topic": "Introductory Game Studio", "course": "376-0", "meeting_time": ["MoWe 10:00AM - 11:50AM"], "path": "/class-descriptions/4640/SoC/RTVF/376-0/14314", "instructor": ["Charles Stephen Evans"], "class_attributes": "Prerequisites apply, see description<br/><br/>", "id": "14314", "subject": "RTVF"}]