[{"school": "DOHA", "overview_of_class": "<p>The course will introduce you to the role of science and technology in different societies around world from different time periods. We will examine several case studies that raise important questions related to the relationship among science, technology, and society. We will explore how both local and global human endeavors influenced the development of science and technology and how societies were in turn shaped by these technoscientific developments. Along the way, important concepts and key terms in Science and Technology Studies will be introduced.</p>", "name": "Topics in Science and Technology Studies", "section": "70", "location": "Northwestern Qatar Room 2-201", "topic": "Science, Technology & Society", "course": "242-0", "meeting_time": ["WeSu 10:30AM - 11:50AM (AST)"], "path": "/class-descriptions/4660/DOHA/INTERDIS/242-0/30748", "instructor": ["Yulianto Salahuddin Mohsin"], "class_attributes": "", "id": "30748", "subject": "INTERDIS"}, {"school": "DOHA", "overview_of_class": "<p>Electricity dominates our lives. But our electrified world presents opportunities as well as challenges. Electric-powered technologies help complete many of our tasks and many claim electricity to be underlying energy of our civilization. At the same time, electricity exposes inequalities in the world (not all societies have access to it) and serious environmental implications. Drawing from a variety of sources and disciplines, this course examines the nuts and bolts of electricity, the history of electricity and electrification, and the consequences (good and bad) of our electrified world.</p>", "name": "Topics in Science and Technology Studies", "section": "71", "location": "Northwestern Qatar Room 2-257", "topic": "Our Electrified World", "course": "242-0", "meeting_time": ["TuSu 08:30AM - 09:50AM (AST)"], "path": "/class-descriptions/4660/DOHA/INTERDIS/242-0/30749", "instructor": ["Yulianto Salahuddin Mohsin"], "class_attributes": "", "id": "30749", "subject": "INTERDIS"}]