[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Locy Hall 109"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "38335", "title": "WCAS SPANISH 395-0-1 Topics in Latin American, Latina and Latino, and/or Iberian Cultures", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "38335", "instructors": [{"instructor_phone": "", "instructor_name": "Dierdra Joy Reber", "instructor_addr": ""}], "topic": "", "course": "395-0", "descriptions": [{"name": "Overview of class", "value": "Between Work and Freedom: Representations of Labor in Latin America<br/><br/>In Pablo Trapero's 1999 film Mundo grúa, blue-collar protagonist &quot;Rulo&quot; yearns to operate a construction crane because he thinks it will make him &quot;free as a bird.&quot; Indeed, capitalism famously promises?not only promises, but claims to be synonymous with?freedom. Others, like Lauren Berlant, counter-assert that capitalism's promises are little more than &quot;cruel optimism,&quot; and that its reality is that of miring the many in asymmetrical &quot;precarity.&quot;<br/><br/>This course will study a panoramic representation of work?urban, rural, white- and blue-collar, domestic, professional, agrarian, long-term, temporary?in Latin America, including Brazil and the U.S. border. We will strive for a diversity of region in studying a composite portrait of the representation of contemporary labor. Our principal medium will be film (such as Lisandro Alonso's La libertad and Gabriel Mascaró's Boi Neon), though we will include literary texts whenever possible (such as Diamela Eltit's Mano de obra).<br/><br/>The syllabus for the first two-thirds of the quarter will be set by the instructor; students will have the opportunity to contribute content during the last third of the course, depending upon enrollment. Students will be expected to participate actively in class discussion throughout, and to write short critical reactions ahead of each class session, in addition to a final paper. Class and viewings/readings will be in Spanish.<br/><br/>Prerequisite: 1 course from 250, 251, 260, or 261."}], "lmod": "2/21/17 6:51 PM (CT)", "subject": "SPANISH"}]