[{"class_mtg_info": [{"meet_t": "MoWeFr 2:00PM - 2:50PM", "meet_l": "Technological Institute L221"}, {"meet_t": "Tu 2:00PM - 2:50PM", "meet_l": "Technological Institute L160"}], "school": "MEAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "13246", "title": "MEAS MAT_SCI 314-0-01 Thermodynamics of Materials", "class_attributes": "", "section": "13246", "instructors": [{"instructor_phone": "", "instructor_name": "Lincoln James Lauhon", "instructor_addr": "3017 Cook Hall"}], "topic": "", "course": "314-0", "descriptions": [{"name": "Overview of class", "value": "MAT_SCI 314 &quot;Thermodynamics of Materials.&quot; Classical and statistical thermodynamics; entropy and energy functions in liquid and solid solutions and their applications to phase equilibria. Lectures, problem solving.<br/><br/>Objectives:<br/>1. Introduce the fundamental laws of thermodynamics<br/>2. Familiarize students with both classical and statistical approaches<br/>3. Describe the thermal behavior of solid materials, including phase transitions<br/>4. Introduce solution thermodynamics with respect to liquid and solid solutions<br/>5. Consider the basis of order-disorder transformations in materials<br/>6. Use thermodynamics to predict and interpret phase equilibria (simple phase diagrams)<br/>7. Familiarize students with modern software programs to predict phase diagrams.<br/><br/>A student who has completed this course will be able to articulate the fundamental laws of thermodynamics and use them in basic problem solving, be able to discriminate between classical and statistical approaches, be able to use thermodynamics to describe the thermal behavior of solid materials, including phase transitions, be able to use thermodynamics to describe order-disorder transformations in materials, be capable of applying solution thermodynamics for describing liquid and solid solution behavior, to use thermodynamics and modern software packages to predict and interpret phase equilibria in simple unary and binary systems.<br/><br/>Relationship to Department Outcomes:<br/>Supports 2, 3, 4, 5"}, {"name": "Registration Requirements", "value": "Chem 103 or 172; Math 230; Phys 135-1"}, {"name": "Teaching Method", "value": "Three lectures, one problem-solving session per week, weekly laboratory."}, {"name": "Evaluation Method", "value": "Homework (25%), Quizzes (40%), and Final Exam (35%)."}, {"name": "Class Materials (Required)", "value": "&quot;Thermodynamics in Materials Science,&quot; 2nd Ed., Robert DeHoff, (Taylor and Francis, 2006), ISBN:978-0849340659"}], "lmod": "10/30/16 6:43 PM (CT)", "subject": "MAT_SCI"}]