[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "555 Clark B03"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-registration - Reserved for Art History majors and minors, &amp; Art Theory majors.", "qtr": "Spring 2017", "name": "32432", "title": "WCAS ART_HIST 367-0-1 Special Topics in American Art", "class_attributes": "", "section": "32432", "instructors": [{"instructor_phone": "", "instructor_name": "Christine Anne Bell", "instructor_addr": ""}], "topic": "Rembering the Civil War", "course": "367-0", "descriptions": [{"name": "Overview of class", "value": "This course will travel the still contested terrain of Civil War memory. Beginning with the immediate postwar period through Reconstruction and the present, we will consider how symbols (such as the Confederate flag), images (paintings, photographs, films), objects (souvenirs, commemorative sculpture), and sites (battlefield parks, cemeteries, plantations) have been enlisted in remembering the Civil War. Relying on scholarship about historical memory, we will study how representations of this pivotal event in American history have been shaped by northern and southern whites as well as by African-Americans, aiming to understand the significance of different memories to different groups at specific historical moments. Background on the Civil War is helpful but not necessary; we'll be building our historical knowledge of the war and its aftermath as we examine Civil War memory-making. Be prepared for a visit to a site of Civil War remembrance in the Chicago area."}, {"name": "Teaching Method", "value": "DiscussionSeminar"}, {"name": "Evaluation Method", "value": "Class participationExam, mid-termReadingsWriting assignments"}, {"name": "Class Materials (Required)", "value": "Tony Horwitz. Confederates in the Attic. New York: Vintage Books, 1999 ISBN: 978-0679758334.  Additional readings available through NUcat."}], "lmod": "2/7/17 6:40 PM (CT)", "subject": "ART_HIST"}]