[{"class_mtg_info": [{"meet_t": "Mo 6:00PM - 8:50PM", "meet_l": "TBA"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Prerequisite: Students must complete Psych 205-0 before taking this course.", "qtr": "Spring 2017", "name": "35748", "title": "WCAS PSYCH 375-0-20 Psychological Tests &amp; Measures", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>Attendance at 1st class mandatory<br/><br/>", "section": "35748", "instructors": [{"instructor_phone": "", "instructor_name": "Renee Suzanne Engeln", "instructor_addr": "Swift 304"}], "topic": "", "course": "375-0", "descriptions": [{"name": "Overview of class", "value": "What do intelligence tests really measure? Do psychologists still show people inkblots? Why does my future employer want me to take a personality test? This course will address these and many other questions related to the current science of psychological tests and measures. The assessments we'll focus on will be primarily from the fields of clinical and personality psychology. We will also cover some tests relevant to social psychology and industrial-organizational psychology. Course topics include the theory behind psychological testing and assessment; the historical context for psychological testing and related legal and ethical considerations; the basics of test construction and evaluation, including reliability, validity, and standardization; and common measures of personality, psychopathology, and ability, and their psychometric properties. During the course, you will work to develop your own measure of a psychological construct and to evaluate the psychometric soundness of test scores resulting from this measure. After successful completion of this course, you should be able to demonstrate proficiency with regard to the terminology and concepts involved in psychological testing, conduct relevant statistical analyses including factor analysis, demonstrate an understanding of the purposes and applications of commonly used psychological tests, and critically evaluate the use and misuse of psychological testing, both historically and presently. This course is highly recommended for those hoping to pursue graduate study in psychology, especially clinical psychology."}, {"name": "Registration Requirements", "value": "Prerequisite: Psych 205."}, {"name": "Evaluation Method", "value": "Evaluation methods include two exams, an ongoing (group) research project, and lab-based activities."}, {"name": "Class Materials (Required)", "value": "Cohen, R.J. &amp; Swerdlik, M.E. (2010). Psychological testing and assessment: An introduction to tests and measurement. (7th edition). New York: McGraw Hill. <br/>*Other readings will be posted on Canvas.<br/>ISBN: 978-0073129099"}], "lmod": "2/6/17 6:54 PM (CT)", "subject": "PSYCH"}]