[{"school": "WCAS", "overview_of_class": "This course considers the political, economic, ethical, legal, and institutional issues involved in environmental decision-making. Drawing from both domestic and international cases, with an emphasis on the US, we will consider the formation and implementation of different environmental policies across a range of topics, which may include natural resources, coastal and marine resources, endangered species, air and water pollution, energy, climate change, sustainable development, hazardous waste, toxics, and environmental justice. The course is designed to give students an understanding of important conceptual issues in environmental policy-making, as well as an overview of core policies related to the US and internationally. Requirements include active class participation, short assignments and quizzes, and midterm and final examinations.", "name": "Special Topics in Environmental Policy and Culture", "section": "22", "location": "Harris Hall 107", "topic": "U.S. Environmental Politics", "course": "390-0", "meeting_time": ["MoWe 11:00AM - 12:20PM"], "path": "/class-descriptions/4660/WCAS/ENVR_POL/390-0/33833", "instructor": ["Kimberly Ruggles Marion Suiseeya"], "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "id": "33833", "subject": "ENVR_POL"}, {"school": "WCAS", "overview_of_class": "The term ?natural disaster' conjures images of tsunamis, earthquakes, volcanoes, and other powerful forces of nature that strike without warning, inflicting massive suffering on a powerless and unsuspecting populace. We now have several decades' worth of research from the social sciences and humanities showing that so-called \"natural\" disasters are not very natural at all. Instead, they are deeply political and profoundly man-made. This course adopts a historical and global approach in order to denaturalize disaster. From famines in British India to earthquakes in post-colonial Peru, from floods in New Orleans to nuclear disaster in Japan, we will see how disasters expose and exacerbate pre-existing inequalities, inflicting suffering disproportionately among those groups already marginalized by race, class, gender, geography, and age. These inequalities shape not only the impact of the disaster but the range of responses to it, including political critique and retrenchment, relief and rebuilding efforts, memorialization, and planning - or failing to plan - for future disasters of a similar kind. The course culminates in a unit on the contemporary challenge of anthropogenic global climate change, the ultimate man-made disaster. We will consider how memories, fears, and fantasies of past disasters are being repurposed to create new visions of what climate change will look like.", "name": "Special Topics in Environmental Policy and Culture", "section": "23", "location": "Kresge Centennial Hall 2-415", "topic": "The Politics of Disaster: A Global Environmental H", "course": "390-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4660/WCAS/ENVR_POL/390-0/33834", "instructor": ["Lydia   Barnett"], "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "id": "33834", "subject": "ENVR_POL"}, {"school": "WCAS", "overview_of_class": "This course studies art that is motivated by ecological concerns, exploring how artists and activists have adapted artistic strategies to address environmental issues over the past 50 years. Themes to be addressed may include sustainability, materiality, labor, and recycling; how artists collaborate with natural processes; how art can address crises such as industrial toxins and global warming; and the place of human ecologies and political struggles in relation to gender, race, poverty, territory and indigeneity. The class will involve some film screenings, meetings with artists, and field trips outside of class hours. In particular, a required field trip (all expenses paid by the Art History Department's Warnock Fund) to Carbondale, in downstate Illinois, will be held from the afternoon of Thursday, May 11 to the morning of Sunday, May 14. Students must be available for this trip in order to take the class.", "name": "Special Topics in Environmental Policy and Culture", "section": "24", "location": "Kresge Centennial Hall 2-410", "topic": "Art, Ecology, and Politics", "course": "390-0", "meeting_time": ["Th 2:00PM - 4:50PM"], "path": "/class-descriptions/4660/WCAS/ENVR_POL/390-0/33835", "instructor": ["Rebecca Elizabeth Zorach"], "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "id": "33835", "subject": "ENVR_POL"}, {"school": "WCAS", "overview_of_class": "This undergraduate course examines connections between the natural environment, politics, and society across the global North and South. We will begin by discussing theories of environment-society relations in sociology and what we mean by \"environmental problems\" and \"environmental values.\" The remainder of the course will be organized into three substantive sections, on varieties of environmentalism; environment and development; and environment, inequality, and social justice. As we go through the readings, we will consider major themes such as the rise of organized collective action like environmental activism and individual responses like green consumerism and \"freeganism\"; the opportunities and limitations of institutional and policy responses to environmental degradation; the tensions between environmental protection and economic development; the relationship between environmental degradation and inequality within and among countries; and the roles of scientific knowledge and non-expert knowledge in making sense of environmental problems and solutions. Our substantive case studies will cover topics like water, energy, waste, and climate change.", "name": "Special Topics in Environmental Policy and Culture", "section": "25", "location": "University Hall 121", "topic": "Environment, Politics and Society", "course": "390-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4660/WCAS/ENVR_POL/390-0/37884", "instructor": ["Maria   Akchurin"], "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "id": "37884", "subject": "ENVR_POL"}, {"school": "WCAS", "overview_of_class": "This class is an introduction to the growing field of Ethnobiology which is the scientific study of dynamic relationships among peoples, biota, and environments. As a multidisciplinary field, ethnobiology integrates anthropology, geography, systematics, population biology, ecology, mathematical biology, pharmacology, conservation, and sustainable development. This class will cover the origins and evolution of ethnobiology theory and practice ranging from folk science, polymaths, taxonomic and colonial practices, the rise of Indigenous science methods, and the contemporary focus on creating networks among researchers of various disciplines to face the challenges of rapid ecological change and shifting political economies.", "name": "Special Topics in Environmental Policy and Culture", "section": "26", "location": "Locy Hall 109", "topic": "Introduction to Ethnobiology Theory and Practice", "course": "390-0", "meeting_time": ["MoWe 12:30PM - 1:50PM"], "path": "/class-descriptions/4660/WCAS/ENVR_POL/390-0/37894", "instructor": ["Eli S Suzukovich III"], "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "id": "37894", "subject": "ENVR_POL"}, {"school": "WCAS", "overview_of_class": "Packed with volcanos, \"little\" ice ages, and fierce debates about scientific efforts to model the most irregular of natural phenomenon, this course explores the impact of weather and climate on historical trends in antiquity, the early modern period, and the modern period in Europe, America, and the Globe. It also traces the complicated science and politics of meteorology from the Enlightenment until the twentieth century. Finally, we will spend nearly a third of the course tackling this question: Can historical examples of global climate crises provide any sense of what the future holds, or, crucially, blueprint for public policy?", "name": "Special Topics in Environmental Policy and Culture", "section": "27", "location": "Locy Hall 110", "topic": "Weather and Climate in History", "course": "390-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4660/WCAS/ENVR_POL/390-0/37895", "instructor": ["Sheila Two Wille"], "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "id": "37895", "subject": "ENVR_POL"}]