[{"class_mtg_info": [{"meet_t": "Mo 3:00PM - 5:50PM", "meet_l": "Sound Tank Comp Lab - RTVF FSL"}], "school": "SoC", "enrl_requirement": "Enrollment Requirements: PRE-REQ:  Reserved for students who have taken and passed RTVF 190.", "qtr": "Winter 2017", "name": "24575", "title": "SoC RTVF 373-0-20 Topics in Sound", "class_attributes": "Prerequisites apply, see description<br/><br/>", "section": "24575", "instructors": [{"instructor_phone": "", "instructor_name": "Stephan Michael Moore", "instructor_addr": ""}], "topic": "Creating Multi-channel Sound Environments", "course": "373-0", "descriptions": [{"name": "Overview of class", "value": "RTVF 373-0 Sec. 20 <br/>Topics in Sound: Creating Multichannel Sound Environments<br/>Meets M 3:00-5:50 <br/>Frances Searle 1-101<br/><br/>Overview: The Northwestern University Audiology Clinic has a state of the art audio facility called ViSoR (the Virtual Sound Room). Its sound system, with 33 speakers and 4 subwoofers, is capable of reproducing a sonic environment with incredible resolution, depth and clarity. The purpose of ViSoR is both to assist in new approaches to the clinic's work with patients, and to serve as a tool for researchers in Audiology, Speech Pathology, and related fields. In this class, we will create rich sonic environments using ViSoR, in collaboration with the Audiology Clinic staff and researchers, using our audio skills to advance ViSoR's usefulness as a tool for research and clinical care. Along the way, we will hone our skills in sound collection and processing, as well as learning new strategies for sound localization and spatial deployment. In the final weeks of the class, we will open the possibility of exploring ViSoR as a sophisticated theater for artistic expression.<br/><br/>Learning Objectives:?<br/>? to develop the technical and planning skills needed to create realistic reproductions of sonic environments in a large multi-channel sound system using the ViSoR Lab and its Constellation/CueStation system.<br/>? to learn about the field of Audiology, and to interact with the clinical staff at the NU Audiology lab to develop sonic environments built to their specifications and useful for their purposes.?<br/><br/>Evaluation method:<br/>(late) mid-term project, final project, 2-3 incremental assignments, attendance and participation.<br/><br/>Class notes:<br/>Prerequisites: RTVF 384 or SAI 501, or permission of instructor<br/>Required materials: USB drive (or other means of storing and transporting data) and any needed studio deposits.<br/>Students will need to complete on online HIPAA training session prior to the beginning of class. Information on how to obtain this training will be shared after registration is complete."}], "lmod": "12/29/16 6:46 PM (CT)", "subject": "RTVF"}]