[{"school": "WCAS", "overview_of_class": "Legal Studies 376-0-20 \"Comparative Constitutionalism: Constitutional Challenges in Comparative Perspective\", Galya Ben-Arieh Ruffer, Spring 2017 (also Poli_Sci 390-0-24)<br/><br/>In this course we will be thinking about how and whether constitutions shape national values and offer a framework for legitimacy and governance to hold together diverse societies and resolve deeply rooted social tensions and ethnic divisions. We will consider the constitutional responses of countries such as the U.S., Canada, France, Germany, Great Britain, Hungary, Kenya, South Africa and Australia to the challenges of terrorist bombings, the rise of populism, hate crimes, legitimacy of public authority, and refugee crisis and examine the birth of constitutionalism that is currently underway in Africa where the peaceful exchange of power, a value that we have taken for granted, is still an aspiration for countries such as Rwanda and the Democratic Republic of Congo. In learning about the varying traditions of written and unwritten constitutions, civil and common law and the foundations and structures of separation of powers and judicial review of the constitutionality of laws in these countries, students will learn to think critically about the U.S. Constitution and the different ways in which constitutional democracies provide for public order, counter-majoritarian governance, equality and protection of the rights of minorities through rule of law and question whether constitutional solutions can address the kinds of social and political problems we have today.", "name": "Topics in Legal Studies", "section": "20", "location": "Parkes Hall 222", "topic": "Comparative Constitutionalism", "course": "376-0", "meeting_time": ["MoWe 9:30AM - 10:50AM"], "path": "/class-descriptions/4660/WCAS/LEGAL_ST/376-0/34030", "instructor": ["Galya Benarieh Ruffer"], "class_attributes": "No Freshmen<br/><br/>", "id": "34030", "subject": "LEGAL_ST"}, {"school": "WCAS", "overview_of_class": "Legal_St 376-0-21 \"Mass Incarceration\" (also Soc_Pol 351) Heather Schoenfeld (Spring 2017)<br/><br/>This course is designed for upper-level students interested in social policy, politics, inequality and law. It explores the \"carceral state\" or the institutions and policies that create a system of criminalization and punishment in the United States. Within the carceral state, the focus of the course is on the history and policies in the United States that led to the highest per capita incarceration rate in the world. The course examines and moves beyond various common explanations for mass incarceration, including crime, politics, public opinion, racism and the \"prison industrial complex.\" It then explores specific policies and practices that created and sustain high levels of incarceration, including sentencing, prison programing, and prosecutorial discretion. Finally, it addresses recent attempts at reform, including policies around re-entry, drug courts and prison conditions. Students read a variety of materials including statutes, policy reports, social science research, law review articles and case law. Assignments include a class presentation and fifteen page research paper.", "name": "Topics in Legal Studies", "section": "21", "location": "555 Clark B03", "topic": "Mass Incarceration", "course": "376-0", "meeting_time": ["MoWe 11:00AM - 12:20PM"], "path": "/class-descriptions/4660/WCAS/LEGAL_ST/376-0/34031", "instructor": ["Heather Alma Schoenfeld"], "class_attributes": "", "id": "34031", "subject": "LEGAL_ST"}, {"school": "WCAS", "overview_of_class": "Legal_St 376-0-22 \"Law and the Origins of American Capitalism\" Susan Gaunt Stearns (Spring 2017)<br/><br/>This course examines the intertwined development of American law and American capitalism from the nation's founding until the turn of the 20th century. It will examine the relationship between law and economic activity in a variety of forms, from counterfeiting to slavery.", "name": "Topics in Legal Studies", "section": "22", "location": "Annenberg Hall G29", "topic": "Law and the Origins of American Capitalism", "course": "376-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4660/WCAS/LEGAL_ST/376-0/34032", "instructor": ["Susan Gaunt Stearns"], "class_attributes": "", "id": "34032", "subject": "LEGAL_ST"}, {"school": "WCAS", "overview_of_class": "Legal_St 376-0-23 \"Development of American Indian Law and Policy\" (also HISTORY 300-0-38, HUM 370-4-30, AMER_ST 310-0-22) Doug Kiel (Spring 2017)<br/><br/>In this course, we will conceptualize Native peoples as nations, not merely racial/ethnic minorities. Students will learn about the unique legal landscape in Indian Country by charting the historical development of tribal governments and the ever-changing body of U.S. law and policy that regulates Indian affairs. We begin by studying Indigenous legal traditions, the European doctrine of discovery, and diplomatic relations between Native nations and European empires. We then shift our focus to treaty-making, the constitutional foundations of federal Indian law, 19th century U.S. Supreme Court decisions, and the growth of the federal bureaucracy in Indian Country. The course devotes considerable attention to the expansion of tribal governmental authority during the 20th century, the contemporary relationship between Indian tribes and the federal/state governments, and the role of federal Indian law as both a tool of U.S. colonial domination and a mechanism for protecting the interests of Indigenous communities.", "name": "Topics in Legal Studies", "section": "23", "location": "Annenberg Hall G32", "topic": "Development of American Indian Law and Policy", "course": "376-0", "meeting_time": ["MoWe 9:30AM - 10:50AM"], "path": "/class-descriptions/4660/WCAS/LEGAL_ST/376-0/37387", "instructor": ["Douglas   Kiel"], "class_attributes": "", "id": "37387", "subject": "LEGAL_ST"}]