[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "Locy Hall 214"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-registration - Reserved for Political Science students.", "qtr": "Spring 2017", "name": "35528", "title": "WCAS POLI_SCI 312-0-20 Statistical Research Methods", "class_attributes": "Formal Studies Distro Area<br/><br/>", "section": "35528", "instructors": [{"instructor_phone": "847/467-1148", "instructor_name": "Jason W Seawright", "instructor_addr": ""}], "associated_classes": [{"component": "DIS", "room": "Locy Hall 106", "meeting_time": "Th 11:00AM - 11:50AM"}, {"component": "DIS", "room": "Locy Hall 106", "meeting_time": "Th 2:00PM - 2:50PM"}], "topic": "", "course": "312-0", "descriptions": [{"name": "Overview of class", "value": "How racist is the average American, and what makes some more racist than others? Why can't Democrats and Republicans just get along? Does a country's colonial experience shape its future political and economic possibilities? These questions, and many more, have been addressed by statistical research in political science.<br/><br/>This course explores quantitative/statistical research methods in the social sciences, with the goal of determining what makes a good descriptive or causal inference about politics. For the first half of the course, we will review the basics of statistical theory and quantitative research design. In the second half, we will examine applications of these methods to various topics in political science. For each application, we will consider the technical requirements and properties of the method being employed, as well as the available evidence regarding how these requirements and properties fit with the specific application at hand. With this information, we will determine what we can legitimately claim to have learned from the application and consider alternative designs that might serve to supplement or improve our learning. Students will thus learn how to evaluate other people's statistical work, but also how to design, execute, and interpret their own statistical models."}, {"name": "Learning Objectives", "value": "By the end of the course, students will be expected to know how to to design, conduct, interpret, and evaluate quantitative research in political science. They will be able to formulate relevant research questions, find data, carry out preliminary statistical analysis, and use regression and related tools to answer descriptive and causal questions about politics."}, {"name": "Teaching Method", "value": "Lecture &amp; Discussion Sections"}, {"name": "Evaluation Method", "value": "Weekly hands-on assignments and a final exam worth 30% of the grade."}, {"name": "Class Materials (Required)", "value": "The Fundamentals of Political Science Research, by Paul M. Kellstedt and Guy D. Whitten. Cambridge University Press. 2013. ISBN 1107621666.<br/><br/>Discovering Statistics Using R, by Andy Field, Jeremy Miles, Zoe Field. SAGE Publications. 2012. ISBN 1446200469."}], "lmod": "2/9/17 6:45 PM (CT)", "subject": "POLI_SCI"}]