[{"class_mtg_info": [{"meet_t": "Th 6:00PM - 8:50PM", "meet_l": "Louis Hall 118"}], "school": "SoC", "overview_of_class": "Primarily designed for the MFA in Documentary, this class will address finalizing the look and sound of student's documentary projects.  We will cover basic color correction and sound design, using Avid and Premiere's built-in color and audio tools as well as basics in Davinci Resolve, Adobe Audition, and Pro-Tools.  In addition to becoming familiar with the basics of color and sound, we'll cover what steps to take when working with a colorist and sound designer, and how to prepare \"deliverables\" for broadcast, web, and festivals.<br/> <br/>Primary consideration will be given to MFA in Documentary students.  Remaining spots will be given to interested undergrads.", "qtr": "Winter 2016", "name": "Topics in Post-Production", "title": "SoC RTVF 378-0-20 Topics in Post-Production", "lmod": "1/9/16 6:39 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Jeff Clayton Brown", "instructor_addr": ""}], "topic": "Professional Post", "course": "378-0", "enrl_requirement": "Enrollment Requirements: Pre-requisite: Students must have taken, be currently enrolled, or concurrently registered for RTVF 190 for the upcoming quarter.", "descriptions": [{"name": "Overview of class", "value": "Primarily designed for the MFA in Documentary, this class will address finalizing the look and sound of student's documentary projects. We will cover basic color correction and sound design, using Avid and Premiere's built-in color and audio tools as well as basics in Davinci Resolve, Adobe Audition, and Pro-Tools. In addition to becoming familiar with the basics of color and sound, we'll cover what steps to take when working with a colorist and sound designer, and how to prepare &quot;deliverables&quot; for broadcast, web, and festivals.<br/> <br/>Primary consideration will be given to MFA in Documentary students. Remaining spots will be given to interested undergrads."}, {"name": "Class Materials (Required)", "value": "The required text is After Effects Apprentice: Real-World Skills for the Aspiring Motion Graphics Artist by Chris and Trish Meyer. Other texts I'll be drawing from are:<br/>- Creating Motion Graphics with After Effects, Trish and Chris Meyer<br/>- The After Effects Illusionist, Chad Perkins<br/>- After Effects Expressions, Marcus Geduld<br/> <br/>We will also pull liberally from various tutorials and resources online."}], "path": "/class-descriptions/4610/SoC/RTVF/378-0/22381", "instructor": ["Jeff Clayton Brown"], "class_attributes": "", "id": "22381", "subject": "RTVF"}]