[{"class_mtg_info": [{"meet_t": "We 2:00PM - 4:50PM", "meet_l": "McMillen Crowe Hall 4-130"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "23384", "title": "WCAS GERMAN 403-0-20 German Literature, Critical Thought and New Media 1900-1945", "class_attributes": "", "section": "23384", "instructors": [{"instructor_phone": "847/467-2966", "instructor_name": "Peter D Fenves", "instructor_addr": "1800 Sherman, Suite 106"}], "topic": "Aesthetics: 1735 and 1935", "course": "403-0", "descriptions": [{"name": "Overview of class", "value": "The aim of this seminar is to approach two groundbreaking inquiries into the status of aesthetics that were drafted?under very different circumstances?around 1935: Walter Benjamin`s &quot;Kunstwerk in der Zeitalter seiner technischen Reproduzierbarkeit&quot; (The artwork in the age of its technical reproducibility) and Martin Heidegger`s &quot;Ursprung des Kunstwerks&quot; (Origin of the artwork). In preparation for a reading of these two contrasting attempts to re-think the tradition of aesthetics from the ground up, the seminar begins with an analysis of the first work in which the term &quot;aesthetics&quot; appeared, namely Alexander Baumgarten`s 1735 dissertation, Meditationes philosophicae de nonnullis ad poema pertinentibus (generally translated, oddly enough, as &quot;Reflections on Poetry&quot;). After a discussion of the Leibniz-inspired context that enabled Baumgarten to conceive of &quot;aesthetics&quot; as a &quot;science&quot; that is analogous to &quot;logic&quot; (understood as the study of rational knowledge), the seminar will concentrate on a series of stages in the development of the German (and perhaps Danish) aesthetic tradition. The choice of texts will depend on student interest; but the possibilities include Kant, Schelling, Hegel, Kierkegaard, and Nietzsche. In the final half of the seminar, we will attend to the aforementioned essays from 1935, while adding further texts of Benjamin and Heidegger in response to individual student interests. Among the primary questions we will be asking are these: Where does language stand in the construction and de-structuring of the concept of aesthetics? Why does the concept of aesthetics first emerge in the context of a &quot;philosophical meditation&quot; on poetry, when poetry is supposed to be only of the many forms of art that come under scrutiny in the new science? And to what extent does the Leibnizian origin of the term &quot;aesthetics&quot; reflect itself in the directions of thought proposed by Heidegger and Benjamin in their respective writings?"}, {"name": "Teaching Method", "value": "Seminar discussion."}, {"name": "Evaluation Method", "value": "Two in-class presentations (one informal, the other written in advance), seminar paper."}, {"name": "Class Materials (Suggested)", "value": "1) Alexander Baumgarten, Reflections on Poetry, ed. Karl Ashenbrenner and William Holther (Berkeley, Ca.: University of California Press, 1954; translation of Meditationes philosophicae de nonnullis ad poema pertinentibus, 1735). 2) Martin Heidegger, Der Ursprung des Kunstwerks (in whatever edition the student prefers); Walter Benjamin, &quot;Das Kunstwerk in der Zeitalter seiner technischen Reproduzierbarkeit&quot; (with emphasis on the 1935 edition that is available in several places both in German and English)."}, {"name": "Class Notes", "value": "Discussion is in English; readings are in German (and perhaps Danish), but English translations will be available, and students can write in whatever language they prefer."}], "lmod": "1/9/16 6:48 PM (CT)", "subject": "GERMAN"}]