[{"school": "SoC", "overview_of_class": "The goal of this course is to provide you with a context within which to understand the history of musical theatre while cultivating your own opinions about the art form and how it relates to society.  This course is a research based course. You will research and discussion topics weekly, followed by weekly presentations.  These topics are assigned by era so that we may analyze and compare the material to the history of society.  You will also apply your growing knowledge of musical theatre history whileengaging in discussion with your peers.  Throughout the course there will be group discussions, group research, independent research, group presentations and writing responses to prompts, which will require critical thinking and self reflection. There will be weekly readings, weekly presentations and two papers due.", "name": "Music Theatre History", "section": "20", "topic": "", "course": "367-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4610/SoC/THEATRE/367-0/24109", "instructor": ["Matthew Alan Hawkins"], "id": "24109", "subject": "THEATRE"}, {"school": "SoC", "overview_of_class": "This course will focus on the evolution of musical theatre in the U.S. from the early 20th century up to our current times.  We will look at the foundations, development and various manifestations of this uniquely &quot;American&quot; art form, examining it in relation to social, cultural, and economic history.  This will entail analysis of individual musicals, a contextual overview of the major players within the field, and an unpacking of the industry that surrounds and forms the conditions within which musical theatre is created and practiced.  We will be digging into the past to better understand current developments within musical theatre, both within the Broadway paradigm and outside of it.", "name": "Music Theatre History", "section": "21", "topic": "", "course": "367-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4610/SoC/THEATRE/367-0/27718", "instructor": ["Roxane H Heinze-Bradshaw"], "id": "27718", "subject": "THEATRE"}]