[{"school": "SoC", "overview_of_class": "RTVF 412: Cultural History of Film<br/>Mon 1:00-2:50 (lecture - meets with RTVF 312)<br/>3:30-5:30 (seminar discussion for RTVF 412 only)<br/> <br/>The lecture component of this course offers an introductory survey of world film history from the 1890s to the outbreak of World War II. Running in tandem with the weekly lecture is a graduate-only seminar in which we will discuss additional readings and questions of historiography and pedagogy. The course is thus intended to 1) acquaint students with key developments in the history of film to 1939, 2) to develop an understanding of the various methodological approaches to writing film history, and 3) to serve as a workshop for the discussion of pedagogical issues in teaching film and media history. <br/> <br/>We will examine a wide range of films?feature-length narratives as well as animated, experimental, and early shorts?and place them in their historical and cultural context. The course will cover such topics as: early cinema in Europe and the United States; race, gender, and stardom in early American cinema; various national cinemas of the 1920s, including Germany, France, and the Soviet Union; the introduction of sound to motion pictures; the spaces of film exhibition; the Hollywood studio system of the 1920s and 1930s; regimes of film censorship; the film industries in Japan and India; and French Poetic Realism. We will be viewing a variety of genres and styles, including slapstick, horror, German Expressionism, French Impressionism, revolutionary cinema and screwball comedy.<br/> <br/>Assessment:<br/> <br/>Participation 10%<br/>Book report 20%<br/>Research reports 20% (four reports, each worth 5%)<br/>Research paper/syllabus 50%<br/> <br/> <br/>20% of your grade will be comprised of a Research Portfolio. This consists of four 1-2 page reports in which you work with primary sources. The culmination of the portfolio will be a 15-20 page Research Paper on a topic of your choosing related to film culture before 1939. You also have the option to create a syllabus for a course on Film History. Once during the quarter you will be asked to give an oral presentation in the seminar about a film history text that you choose from a list on the syllabus.<br/> <br/> <br/>The required texts:<br/> Norris Center Bookstore<br/> Film History: An Introduction, (3rd ed.), by Kristin Thompson and David Bordwell<br/> Film History: Theory and Practice by Robert C. Allen and Douglas Gomery<br/> <br/> Quartet Copies, 818 Clark Street, 328-0720<br/> 312-1 Reader<br/> <br/>Additional graduate readings on Canvas", "name": "Cultural History of Film", "section": "20", "topic": "", "course": "412-0", "meeting_time": ["Mo 1:00PM - 2:50PM", "Mo 3:30PM - 5:20PM"], "path": "/class-descriptions/4650/SoC/RTVF/412-0/24572", "instructor": ["Jacob Arnaud Smith"], "id": "24572", "subject": "RTVF"}]