[{"school": "WCAS", "overview_of_class": "This course will-through both reading and writing-explore the art of what is often called literary journalism, narrative nonfiction, or what John McPhee calls \"the literature of fact.\" The best of nonfiction narrative wields a fierce power, poking and prodding our preconceptions of the world, pushing us to look at ourselves and others through a different prism. What makes for a compelling story? (What tools might we borrow from fiction?) Why employ the use of narrative? How does it help form our view of people and events? We'll explore the craft of reporting and research which borrows from a variety of disciplines, including anthropology, history and sociology - and work with rigor and discipline on the art of good writing. We'll read nonfiction narratives-both book and magazine articles-on a host of subjects, ranging from war and poverty to the environment and sports. We'll work in this class as a professional writer might, from draft to draft. There will be regular writing assignments, and students will be asked to craft a longer narrative on a subject of interest to them. The course will be run as a seminar, so there will be an emphasis on critical class discussion.", "name": "The Art of Nonfiction", "section": "20", "location": "University Library 5722", "topic": "Telling Stories", "course": "303-0", "meeting_time": ["Mo 2:00PM - 4:50PM"], "path": "/class-descriptions/4610/WCAS/WRITING/303-0/27198", "instructor": ["Alex W Kotlowitz"], "class_attributes": "", "id": "27198", "subject": "WRITING"}, {"school": "WCAS", "overview_of_class": "", "name": "The Art of Nonfiction", "section": "21", "location": "University Hall 218", "topic": "Writing for Social Change", "course": "303-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4610/WCAS/WRITING/303-0/27199", "instructor": ["Robert A Gundlach"], "class_attributes": "Prerequisites apply, see description<br/><br/>Permission of department<br/><br/>", "id": "27199", "subject": "WRITING"}]