[{"school": "MUSIC", "overview_of_class": "This course takes as its premise that music is a cultural object deeply connected to its political environment, and asks how music in a variety of genres has worked in service of, or in opposition to, political forces throughout history. Among others, case studies to be examined will include: Music and Propaganda in the Renaissance Italian Court; Music and the Reformation; Music and Nationalism; Music under a Totalitarian State; Protest Music and Civil Rights in the 1960s; and Beyoncé's Lemonade. This reading-intensive course will also include weekly listening assignments, weekly Canvas discussion board entries, a midterm, student-led discussion, and a final research project. No prior musical experience is required: Musicians and non-musicians alike are welcome.", "name": "Selected Topics in Music Literature for Non-Majors", "section": "20", "location": "RCMA 1-180", "topic": "Music and Politics", "course": "175-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4660/MUSIC/GEN_MUS/175-0/35794", "instructor": ["Jason K Rosenholtz-Witt"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "35794", "subject": "GEN_MUS"}, {"school": "MUSIC", "overview_of_class": "This course develops listening and writing skills to consider how musical artists achieve the status of \"icon\" and the ways in which their music addresses gender, sexuality, race, and political affiliation. Throughout the quarter, we will consider how communities turn to musicians in service of their cultural, political, and affective needs through individual case studies of icons ranging from Richard Wagner to Whitney Houston. Class time will be spent discussing assigned listening and readings, listening as a group, and developing research and writing strategies toward a final term paper.", "name": "Selected Topics in Music Literature for Non-Majors", "section": "21", "location": "RCMA 1-164", "topic": "Icons, Taste, and Musical Communities", "course": "175-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4660/MUSIC/GEN_MUS/175-0/35795", "instructor": ["Kyle Christopher Kaplan"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "35795", "subject": "GEN_MUS"}]