[{"school": "WCAS", "overview_of_class": "Brazilian Film (taught in English)<br/> <br/>Brazil's film history is one of the richest in Latin America; in this course, we will follow its interwoven threads of experimental film, comedy, documentary social cinema, and narrative film, tracing their persistent thematic links that define nation, politics, and culture from the early twentieth to the early twenty-first centuries. Working through the decades, we will begin with silent film of the 1930s and the chanchada (slapstick comedy) that would become prolific in the 1940s, moving into the 1950s as a liminal space between this early entertainment-oriented cinematic production and the more political Cinema Nôvo of the 1960s in which foreign influence is particularly salient in the form of Italian Neorealism, the French &quot;Nouvelle Vague&quot; (&quot;New Wave&quot;), and a European gaze on Brazilian culture. As we will see, Cinema Nôvo portrays Brazilian poverty and social injustice in epic archetypal terms; in the following years, filmmakers focus increasingly on the gritty realities of the street, first in the narrative form of avant-garde Cinema da Boca do Lixo (&quot;garbage&quot; film), followed by a surge in documentary attention to homelessness, indigence, violence, and crime. The so-called &quot;Retomada&quot; of the 1990s put Brazilian film back on the international festival circuit, with thematics that blend narrative drama and documentary social realism. We will focus especially on how the tendency toward social diagnostics is a constant of Brazilian film from its earliest years through to the present moment; we will frame our analysis throughout the course with the culturally canonical ideas articulated in legendary modernist writer Oswald de Andrade's &quot;manifesto antropófago&quot; (cannibalist manifesto; 1928) and iconic Cinema Nôvo director Glauber Rocha's &quot;estética da fome&quot; (aesthetics of hunger; 1965), complementing our own direct critical engagement with the films with essays by Randal Johnson, Robert Stam, Franthiesco Ballerini, and Peter Rist, among other prominent Brazilian film critics.<br/><br/>Films may include:<br/>Mário Peixoto, Limite (1931)<br/>Adhemar Gonzaga and Humberto Mauro (Cinédia Studios), A voz do carnaval (The Carnival Voice; 1933)<br/>Vittorio de Sica, Ladri di biciclette (Bicycle Thieves; 1948)<br/>Lima Barreto, O cancageiro (1953)<br/>Marcel Camus, Orfeu Negro (Black Orpheus; 1959)<br/>Jean-Luc Godard, A Bout de souffle (Breathless; 1960)<br/>Nelson Pereira dos Santos, Vidas secas (Barren Lives; 1963)<br/>Glauber Rocha, Terra em transe (Land in Anguish; 1967)<br/>Rogério Sganzerla, O bandido da luz vermelha (The Red Light Bandit; 1968)<br/>Júlio Bressane, Matou a família e foi ao cinema (Killed the Family and Went to the Movie Theater; 1969)<br/>Joaquim Pedro de Andrade, Macunaíma (1969)<br/>Carlos Diegues, Bye Bye Brazil (1979)<br/>Héctor Babenco, Pixote (1981)<br/>Suzana Amaral, A hora da estrela (The Hour of the Star; 1985)<br/>Carla Camurati, Carlota Joaquina, Princesa do Brasil (Carlota Joaquina, Princess of Brazil; 1995)<br/>Fabio Barreto, O quatrilho (1995)<br/>Walter Salles, Central do Brasil (Central Station; 1998)<br/>Fernando Meirelles and Kátia Lund, Cidade de Deus (City of God; 2002).<br/>José Padilha and Felipe Lacerda, Ônibus 174 (Bus 174; 2002)<br/>Jorge Furtado, O homen que copiava (The Man Who Copied; 2003)<br/>Lucy Walker, Waste Land (2010)<br/>Kleber Mendonça Filho, Aquarius (2016)", "name": "Contemporary Brazil: Literature and Film", "section": "1", "topic": "", "course": "380-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4650/WCAS/PORT/380-0/24845", "instructor": ["Dierdra Joy Reber"], "id": "24845", "subject": "PORT"}]