[{"class_mtg_info": [{"meet_t": "Th 6:15PM - 9:15PM", "meet_l": "Swift Hall 107"}], "school": "SCS", "overview_of_class": "The purpose of this course is to present an overview of the field of psychology. Among the topics we will cover are: perception, memory, thinking and problem solving, motivation, emotion, social influences on behavior, personality, psychological disorders, and the treatment of psychopathology. Class lectures, readings, and discussions will convey a sense of some of the foundational questions and methods of the science of psychology. Ultimately, the goal of this course is to impart an initial understanding of some fundamentals of human nature and behavior, as well as instill a deeper appreciation for the science of psychology.   The class will have weekly quizzes and a comprehensive final exam. Carries social science credit.", "qtr": "Winter 2016", "name": "Introduction to Psychology", "title": "SCS PSYCH 110-CN-66 Introduction to Psychology", "lmod": "1/9/16 6:42 PM (CT)", "section": "66", "instructors": [{"instructor_phone": "847/491-3652", "instructor_name": "Sara Cantonia Broaders", "instructor_addr": "Swift 243, 2029 Sheridan Road"}], "topic": "", "course": "110-CN", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "The purpose of this course is to present an overview of the field of psychology. Among the topics we will cover are: perception, memory, thinking and problem solving, motivation, emotion, social influences on behavior, personality, psychological disorders, and the treatment of psychopathology. Class lectures, readings, and discussions will convey a sense of some of the foundational questions and methods of the science of psychology. Ultimately, the goal of this course is to impart an initial understanding of some fundamentals of human nature and behavior, as well as instill a deeper appreciation for the science of psychology. The class will have weekly quizzes and a comprehensive final exam. Carries social science credit."}, {"name": "Registration Requirements", "value": "None"}, {"name": "Learning Objectives", "value": "Students will learn some of the most fundamental theories of psychology and the types of empirical support for them.<br/><br/>Students will learn how research is conducted on psychological topics.<br/><br/>Students will understand some of the practical applications of psychology."}, {"name": "Class Materials (Required)", "value": "Materials may include the following:<br/><br/>Gazzaniga, Heatherton, &amp; Halpern (4th ed). Psychological Science. Norton Publishers. ISBN: 978-0-393-91157-2."}], "path": "/class-descriptions/4610/SCS/PSYCH/110-CN/27825", "instructor": ["Sara Cantonia Broaders"], "class_attributes": "", "id": "27825", "subject": "PSYCH"}]