[{"school": "WCAS", "overview_of_class": "Disease knows no borders. Both pathogens and lifestyles move around the world and the people of every country share the risks. The responsibility for ensuring the public health rests with governments at local, national and international levels. Public health interventions require cooperation and partnerships at each level and with civil society organizations, corporations, businesses and individuals. Advances in technology can significantly reduce the burden of disease and improve the quality of health and life. To effectively address global health challenges, technology must be integrated into health systems in ways that are both appropriate and sustainable. These interventions are affected by public policies, availability of resources and theories of public health and disease. Existing health organizations are increasingly challenged by the scope and magnitude of the current and future threats to public health such as the AIDS pandemic; the emergence of new and more virulent infectious diseases; the threats of bio-terrorism; growing resistance to antibiotics; lack of basic infrastructure of water, sanitation and inadequate access to drugs in developing countries; and overabundance of foods and complications from affluence, leading to health problems such as diabetes in higher income countries. <br/>This course will examine the global epidemiology of these diseases and threats to the populations of the world, and the current technological and organizational strategies that have been established to respond. A series of diseases and geographical regions will be analyzed to consider how the international community uses technology and organizes its response to current problems in global public health. Special attention will be given to examples of effective technologies and intervention strategies.", "name": "Special Topics in Global Health", "section": "22", "topic": "Managing Global Health Challenges", "course": "390-0", "meeting_time": ["Mo 6:00PM - 9:00PM"], "path": "/class-descriptions/4640/WCAS/GBL_HLTH/390-0/12289", "instructor": ["Michael W Diamond"], "id": "12289", "subject": "GBL_HLTH"}, {"school": "WCAS", "overview_of_class": "Since the early 2000s, there has been an exponential increase in the number of foreigners volunteering in low-income communities, within orphanages, clinics, schools, and communities. This expansion has been echoed by locals, who are also providing voluntary labor in a variety of locales throughout their communities. This class explores the discourses and practices that make up volunteering and voluntourism, from the perspectives of volunteers, hosts, and a range of professional practitioners both promoting and critiquing this apparent rise in &quot;the need to help&quot;. What boons and burdens occur with the boom of volunteer fervor world-wide? Why do people feel the need to volunteer, and what consequences do these voluntary exchanges have on the volunteers, and on those communities and institutions that are subject to their good intentions? What are the ethics and values that make up &quot;making a difference&quot; amongst differently-situated players who are involved in volunteering? Given that volunteers often act upon best intentions, what are the logics that justify philanthropy and the differential standards by which volunteers are judged based on where they go and how they engage in volunteering? This class seeks out some answers to these questions, and highlights why the increased concern for strangers that undergirds volunteering should also be, in itself, cause for our concern.", "name": "Special Topics in Global Health", "section": "23", "topic": "Volunteerism and the Need to Help", "course": "390-0", "meeting_time": ["We 1:00PM - 3:50PM", "We 1:00PM - 3:50PM", "We 1:00PM - 1:50PM"], "path": "/class-descriptions/4640/WCAS/GBL_HLTH/390-0/12290", "instructor": ["Noelle   Sullivan"], "id": "12290", "subject": "GBL_HLTH"}, {"school": "WCAS", "overview_of_class": "Native Americans experience significant disparities in health and in access to health care. This course introduces students to Native American health by exploring the social, cultural, political, and environmental determinants influencing Native health both historically and today. This course is a reading intensive, discussion-based seminar, drawing upon research and contributions from a variety of disciplines including anthropology, sociology, history, American Indian studies, population and public health, and medicine. Some seminar topics will include Native medicine, infectious diseases and the Columbian Exchange, Federal obligations to Native communities, substance abuse, intergenerational/historic trauma, environmental health, and indigenous health globally.", "name": "Special Topics in Global Health", "section": "24", "topic": "Native American Health", "course": "390-0", "meeting_time": ["Tu 3:00PM - 5:50PM"], "path": "/class-descriptions/4640/WCAS/GBL_HLTH/390-0/12291", "instructor": ["Margaret Ellen Pollak"], "id": "12291", "subject": "GBL_HLTH"}]