[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Kresge Centennial Hall 2-331"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "33899", "title": "WCAS GNDR_ST 390-0-22 Topics in Gender and Sexuality Studies", "class_attributes": "", "section": "33899", "instructors": [{"instructor_phone": "", "instructor_name": "Vinita   Chaudhry", "instructor_addr": ""}], "topic": "Trans, Etc.: Cross-Cultural Approaches to Gender D", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "&quot;Gender variant populations have existed throughout time and are widely accepted elsewhere.&quot; This is a phrase that many have heard or stated, from academics studying gender and sexuality to activists and politicians advocating for the rights of transgender people in the United States. While the phrase can be useful, how do we account for that &quot;elsewhere?&quot; What does it mean for scholars, particularly social scientists, who engage directly with populations around the world, to study gendered categories within and outside of the United States? In light of the recently heightened visibility among gender nonconforming people in the United States, we will also consider such questions as, what does &quot;transgender&quot; mean? Is it only a Western category? How and when does the growing field of transgender studies account for non-Western contexts? <br/><br/>The course will survey a range of historical and ethnographic studies of gender diversity and non-conformity from around the world, including the United States, India, Thailand, Iran, and Brazil. Students will critically reflect on the ethics of studying &quot;the other,&quot; particularly in relation to gender (and sexuality), and analyze what it means to categorize people around the world according to particular notions of gender. With each case study, students will also consider political-economic and regional contexts, and the ways in which sexuality, race, caste, class, and other local forms of categorization can inform gendered subjectivity. <br/><br/>By focusing on ethnographic and in-depth historical studies, the course will ultimately ask students to consider how to conduct research and ask questions about gender and related categories both within the United States and/or in the places and communities we imagine to exist elsewhere."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Class participation: 15%<br/>Paper, final: 40%<br/>Paper, mid-term: 25%<br/>Writing assignments: 20%<br/>"}, {"name": "Class Materials (Required)", "value": "Valentine, David. 2007. Imagining Transgender. Durham: Duke University Press. <br/><br/>Nanda, Serena. 2014. Gender Diversity: Crosscultural Variations. Second Edition. Waveland Press. <br/><br/>All other course materials will be available for download on Canvas."}], "lmod": "2/6/17 8:41 AM (CT)", "subject": "GNDR_ST"}]