[{"school": "WCAS", "overview_of_class": "Why do political opponents sometimes kill each other? This class introduces students to social scientific explanations of political violence. The first part of this course will focus on theories of social action that explain A) How large societal forces and elite behavior create the outbreak of different episodes of political violence such as suicide terrorism, insurgency, revolution and riots B) the processes that drive individual participation in these events and C) how the two combine. The second part of the course applies these theoretical lenses to a wide range of violent events such as the French revolution, race riots in the United States, suicide bombing in the Middle East, ethnic cleansing in Kosovo and insurgency in El Salvador.", "name": "Introductory Topics in Sociology", "section": "20", "location": "Annenberg Hall G15", "topic": "Politics, Violence, & Society", "course": "276-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4650/WCAS/SOCIOL/276-0/24753", "instructor": ["Robert   Braun"], "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "id": "24753", "subject": "SOCIOL"}, {"school": "WCAS", "overview_of_class": "What can bandits teach us about institutions? Why does a choice made to slow typing down still affect our modern laptops? This course approaches the study of sociological institutions from a unique perspective: understanding how these institutions emerge and address existing societal problems. We focus on both coordination-type dilemmas: how to parent, best approaches to marketing and collective-action dilemmas: how to police fishermen going over quota, farmers reining in downstream pollution. We end with a study of how institutions persist, possibly beyond their useful lifespan, such as the persistence of the intentionally inefficient `QWERTY' keyboard and its application to health care.", "name": "Introductory Topics in Sociology", "section": "21", "location": "Kresge Centennial Hall 2-425", "topic": "Breaking Rules, Making Rules", "course": "276-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4650/WCAS/SOCIOL/276-0/24754", "instructor": ["Jean Marie Clipperton"], "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "id": "24754", "subject": "SOCIOL"}]