[{"class_mtg_info": [{"meet_t": "We 1:00PM - 3:50PM", "meet_l": "Annenberg Hall G29"}, {"meet_t": "We 1:00PM - 3:50PM", "meet_l": "Elder Hall 030 Seminar Room"}, {"meet_t": "We 1:00PM - 1:50PM", "meet_l": "Annenberg Hall G29"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "12290", "title": "WCAS GBL_HLTH 390-0-23 Special Topics in Global Health", "class_attributes": "No Freshmen<br/><br/>", "section": "12290", "instructors": [{"instructor_phone": "847/467-2780", "instructor_name": "Noelle   Sullivan", "instructor_addr": "1812 Hinman Avenue, #303, Evanston"}], "topic": "Volunteerism and the Need to Help", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "Since the early 2000s, there has been an exponential increase in the number of foreigners volunteering in low-income communities, within orphanages, clinics, schools, and communities. This expansion has been echoed by locals, who are also providing voluntary labor in a variety of locales throughout their communities. This class explores the discourses and practices that make up volunteering and voluntourism, from the perspectives of volunteers, hosts, and a range of professional practitioners both promoting and critiquing this apparent rise in &quot;the need to help&quot;. What boons and burdens occur with the boom of volunteer fervor world-wide? Why do people feel the need to volunteer, and what consequences do these voluntary exchanges have on the volunteers, and on those communities and institutions that are subject to their good intentions? What are the ethics and values that make up &quot;making a difference&quot; amongst differently-situated players who are involved in volunteering? Given that volunteers often act upon best intentions, what are the logics that justify philanthropy and the differential standards by which volunteers are judged based on where they go and how they engage in volunteering? This class seeks out some answers to these questions, and highlights why the increased concern for strangers that undergirds volunteering should also be, in itself, cause for our concern."}], "lmod": "10/30/16 7:05 PM (CT)", "subject": "GBL_HLTH"}]