[{"class_mtg_info": [{"meet_t": "Mo 6:15PM - 9:15PM", "meet_l": "Technological Institute F281"}], "school": "SCS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "38055", "title": "SCS ASTRON 120-CN-62 Highlights of Astronomy", "class_attributes": "", "section": "38055", "instructors": [{"instructor_phone": "847/467-7100", "instructor_name": "Andrew J Rivers", "instructor_addr": "1918 Sheridan"}], "topic": "", "course": "120-CN", "descriptions": [{"name": "Overview of class", "value": "Building from fundamental physical principles of gravity, light and matter, this course will explore our modern ideas about the solar system, stars, galaxies, and the universe. We will explore two primary themes: the origin and destiny of the universe and the search for life within it. In-class demonstrations will be used to elucidate concepts. The course will include an expert-led trip to the historic Northwestern Dearborn Observatory for night sky observing (weather permitting). This course is designed for non-science majors."}, {"name": "Registration Requirements", "value": "None."}, {"name": "Learning Objectives", "value": "-Correlate understanding of basic physical principles to astrophysical applications in order to explain how we know what we know about the universe <br/>-Explain the development of fundamental theories such as the Nebular Hypothesis of solar system formation and the Big Bang theory of the universe's origin and evolution. <br/>-Analyze levels of certainty in the fundamental theories (Nebular Hypothesis, Big Bang theory, etc.) compared to alternative ideas.<br/>-Apply fundamental concepts in astronomy to current research results. <br/>-Analyze a scientific theory to determine whether it is a good theory."}, {"name": "Teaching Method", "value": "Lecture<br/>Class Participation <br/>Demonstrations<br/>Discussion<br/>Readings<br/>Writing Assignments"}, {"name": "Evaluation Method", "value": "In-Class Quizzes and take home Worksheets <br/>Midterm Exam<br/>Final Exam<br/>Writing Assignments"}, {"name": "Class Materials (Required)", "value": "Universe, 10th Edition, Freedman &amp; Kauffman, W.H. Freeman, ISBN13: 978-1-4641-2492-1."}, {"name": "Class Notes", "value": "This class is intended for non-science majors and no previous background in physics or astronomy is needed. Although equations are introduced in class, no mathematical problem solving is required. We will cover foundational principles of gravity, light and motion that are needed to understand astronomy phenomena and astronomical theories."}], "lmod": "2/19/17 6:42 PM (CT)", "subject": "ASTRON"}]