[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "University Hall 118"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores<br/>Add Consent: Department Consent Required<br/>Drop Consent: Department Consent Required<br/>", "qtr": "Fall 2016", "name": "11271", "title": "WCAS ECON 101-6-40 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "11271", "instructors": [{"instructor_phone": "847/491-8220", "instructor_name": "James Andrew Hornsten", "instructor_addr": "Andersen Hall"}], "topic": "Regulating New Technologies", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "The rapid development of new technologies forces us to frequently revisit two age-old questions. First, how should we decide whether to adopt a cutting edge product for which the benefits and costs (perhaps in terms of compromised privacy, autonomy, security and ethics) are somewhat unknown? Second, to what degree should government regulators protect consumers of new goods and services? In this seminar, we will consider a range of government interventions - including laissez faire, paternalistic nudges, and the Nanny State - and explore ways various economic actors try to influence policy and adapt to an ever-changing economic environment. Our discussions will focus on topics such as drones and driverless vehicles, smart appliances and the Internet of Things, 3-D printing, virtual reality, sharing economy apps (Uber, Airbnb, TaskRabbit), performance enhancing drugs and implants, CRISPR and de-extinction, cybersecurity, police body cameras and wearables, space tourism and exploration, Bitcoin, nanobots, and other sci-fi ideas that have become reality."}, {"name": "Evaluation Method", "value": "Grades will be based on written assignments (70%), your comments on papers written by peers (10%), and participation (20%). Each student will lead at least one discussion and attend several short, individual writing conferences with the instructor for individual feedback. For writing assignments, there will be three short papers (about 5 pages each on a specific topic), one long paper (about 10 pages on a general topic about regulation), and two opportunities to provide feedback to a peer. Students will use feedback on rough drafts to make revisions for the final drafts of the short papers."}, {"name": "Class Materials (Required)", "value": "We will rely on a wide variety of sources, tentatively including classic and popular books, recent mainstream and academic articles, local experts, and videos. Most of the sources will be available online."}], "lmod": "10/30/16 7:03 PM (CT)", "subject": "ECON"}]