[{"class_mtg_info": [{"meet_t": "MoWe 12:30PM - 1:50PM", "meet_l": "Fisk Hall 114"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Freshmen may not register for this course.", "qtr": "Winter 2016", "name": "24971", "title": "WCAS HISTORY 395-0-31 Research Seminar", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "24971", "instructors": [{"instructor_phone": "847/491-7448", "instructor_name": "Carl Forbes   Petry", "instructor_addr": "Harris Hall Room 329"}], "topic": "Arabian Nights Counter Culture or Pornography", "course": "395-0", "descriptions": [{"name": "Overview of class", "value": "The Arabian Nights are the most popular example of Arabic literature in the western world. They inspired playwrights during the heyday of print culture, and filmmakers as recently as Walt Disney's Aladdin. From the historian's perspective, they are a collection of stories compiled during the Middle Ages in such cities as Cairo and Damascus. They reflect traditions that are much older, and draw upon legends widely repeated in such diverse regions as China, India, Iran and Turkey. Analysts of pre-modern societies in the Islamic world now recognize The Arabian Nights as a major literary source that sheds light on many types of colorful people whose antics enlivened the scene in great Islamic cities of pre-modern times, but who remain largely invisible in more formal sources. The Nights also raise issues of cultural practice that contrast with formal strictures imposed by such sacred texts as the Koran itself. The fact that the stories were allegedly told by a woman conniving to stave off vengeance killings by a ruler raises intriguing questions about male-female relations. We will consider these issues in the context of various translations that themselves reveal biases of modern-day writers, who may have reveled in the worlds of counter-culture or pornography."}, {"name": "Teaching Method", "value": "Discussion of issues and themes indicated in the syllabus question sets. All participants will be asked to lead a discussion on a particular story or version in translation."}, {"name": "Evaluation Method", "value": "For 392, active participation in discussion (50%), submission of reviews of two books addressing critical scholarship on the Nights (50%);<br/>For 395, active participation in discussion (50%), submission of independent research project (ca. 20-25 pages) based on critical scholarship. No examinations."}, {"name": "Class Materials (Required)", "value": "N. J. Dawood, Tales from the Arabian Nights ISBN 978-0385123655<br/><br/>Robert Irwin, The Arabian Nights, A Companion ISBN 978-1860649837<br/><br/>Richard Burton, The Arabian Nights, A Plain and Literal Translation<br/><br/>Course pack"}, {"name": "Class Notes", "value": "No P/N Option; attendance at first class mandatory.<br/><br/>HISTORY OF CONCENTRATION: Africa/Middle East"}], "lmod": "1/9/16 6:48 PM (CT)", "subject": "HISTORY"}]