[{"class_mtg_info": [{"meet_t": "Tu 9:30AM - 12:20PM", "meet_l": "Annenberg Hall G30"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "24756", "title": "WCAS GBL_HLTH 390-0-23 Special Topics in Global Health", "class_attributes": "No Freshmen<br/><br/>", "section": "24756", "instructors": [{"instructor_phone": "", "instructor_name": "Peter Andrew Locke", "instructor_addr": "1812 Hinman Avenue"}], "topic": "The Social Determinants of Health", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "This upper-level seminar in medical anthropology examines the role of social markers of difference including race, class, nationality, gender, sexuality, age and religion in current debates and challenges in the theory and practice of global health. We will explore contemporary illness experiences and therapeutic interventions in sociocultural and historical context through case studies from the US, Brazil, and South Africa. Students will be introduced to key concepts such as embodiment, medicalization, structural violence, the social determinants of health, and biopolitics. Central questions of the seminar include: How do social categories of difference determine disease and health in individuals and collectivities? How is medical science influenced by economic and political institutions and by patient mobilization? How does social and economic inclusion/exclusion govern access to treatment as well as care of the self and others?<br/> <br/>The course will provide advanced instruction in anthropological and related social scientific research methods as they apply to questions of social inequality and public health policy in both the United States and in emerging economic powers. The course draws from historical accounts, contemporary ethnographies, public health literature, media reports, and films."}, {"name": "Class Materials (Required)", "value": "Inclusion: The Politics of Difference in Medical Research (Steven Epstein)<br/>When Bodies Remember: Experiences and Politics of AIDS in Post-Apartheid South Africa (Didier Fassin)<br/>The Pastoral Clinic: Addiction and Dispossession along the Rio Grande (Angela Garcia)<br/>Travesti: Sex, Gender, and Culture among Brazilian Transgendered Prostitutes (Don Kulick)<br/>Uncertain Suffering: Racial Health Care Disparities and Sickle Cell Disease (Carolyn Rouse)"}], "lmod": "1/9/16 6:47 PM (CT)", "subject": "GBL_HLTH"}]