[{"school": "WCAS", "overview_of_class": "This course studies the formal properties in select Anglophone African texts and relates aesthetic choices to identity politics. It considers debates in African writing (e.g., what language the literatures should be written in and who is qualified to respond to it) in the context of 21st-century transnational realities. Important will be the relationship between folkloric devices and modern forms and the use of experimentation to not only generate aesthetic pleasure but also to shield texts from possible censorship. Paying attention to plot, syntax, lexis, and various semantic deviations used to foreground (or underground) aspects of the text, we will read creative works by Chimamanda Ngozi Adichie, Ayi Kwei Armah, Nadine Gordimer, Ngugi wa Thiong'o, among other writers, alongside theoretical materials on African literature and on literary form.", "name": "Studies in Theme", "section": "20", "location": "University Hall 121", "topic": "Form in African Writing", "course": "304-0", "meeting_time": ["MoWe 9:30AM - 10:50AM"], "path": "/class-descriptions/4660/WCAS/COMP_LIT/304-0/33102", "instructor": ["Evan M Mwangi"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "33102", "subject": "COMP_LIT"}, {"school": "WCAS", "overview_of_class": "This course is primarily concerned with the treatment of issues of gender and sexuality in the literary work of French writers of the mid-to-late 20th century. It aims to develop our skills in the close reading of literary works in relation to the literary and theoretical framework and the historical and social period in which they developed. To that end, we will read essays on feminine sexuality by Freud and Lacan, excerpts from Beauvoir's groundbreaking essay, The Second Sex, social and historical accounts of the period, analyses by feminist scholars, and novels by a range of writers including Leduc, Duras, and Guibert.", "name": "Studies in Theme", "section": "21", "location": "University Hall 318", "topic": "Gender and Sexuality", "course": "304-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4660/WCAS/COMP_LIT/304-0/33103", "instructor": ["Jane Bradley   Winston"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "33103", "subject": "COMP_LIT"}, {"school": "WCAS", "overview_of_class": "Reading Elena Ferrante: The Reinvention of Friendship, Love, and Motherhood <br/><br/>In 2016, Time magazine included the Italian novelist who works under the pseudonym \"Elena Ferrante\" on its list of the year's hundred most influential people. How did this happen? To answer this question, we will explore some of the most celebrated novels of this mysterious writer, who is beloved not only in Italy but also in the US and around the world. Critics in The New York Times, The New Yorker, N+1, The London Review of Books, and numerous other publications have given ecstatic reviews to her writings, typically describing their effect as \"mesmerizing,\" \"stunning,\" and \"brutally honest.\" Indeed, Ferrante's fearless, cliché-annihilating explorations of friendship, loneliness, troubling loves, sexuality, violence, and maternity suggest a creative and disruptive refashioning of traditional feminist concerns on an epic scale. We begin our consideration of her work with The Days of Abandonment, which revises the trope of the abandoned woman in new and startling ways. The genealogy of this trope will be a key topic, starting with the mythical story of Dido's abandonment by Aeneas and encompassing modern examples such as de Beauvoir's The Woman Destroyed as well as the contemporary film adaptation of Ferrante's novel itself. We will then read The Lost Daughter, the novelist's sophisticated and uncanny investigation of the agonized ambivalence of motherhood. Finally, the course concludes with My Brilliant Friend, the first volume of her bestselling series of Neapolitan novels. In particular, we will focus on how this text redefines the contested territory of women's friendship and completely overturns the pop-culture conventions of narrative paradigms such as Sex and the City. Throughout, we will address Ferrante's decision to keep her true identity secret, thus setting in motion the media's frenzy to unmask her. <br/><br/>Taught in English, seminar style.", "name": "Studies in Theme", "section": "22", "location": "Locy Hall 214", "topic": "Reading Elena Ferrante", "course": "304-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4660/WCAS/COMP_LIT/304-0/33104", "instructor": ["Alessia   Ricciardi"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "33104", "subject": "COMP_LIT"}, {"school": "WCAS", "overview_of_class": "", "name": "Studies in Theme", "section": "23", "location": "Kresge Centennial Hall 2-410", "topic": "What is a Place?", "course": "304-0", "meeting_time": ["Tu 3:00PM - 5:50PM"], "path": "/class-descriptions/4660/WCAS/COMP_LIT/304-0/33105", "instructor": ["Hannah J Feldman"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "33105", "subject": "COMP_LIT"}]