[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Locy Hall 106"}], "school": "SoC", "enrl_requirement": "Enrollment Requirements: Reserved for Theatre Majors and Minors", "qtr": "Winter 2016", "name": "27718", "title": "SoC THEATRE 367-0-21 Music Theatre History", "class_attributes": "", "section": "27718", "instructors": [{"instructor_phone": "", "instructor_name": "Roxane H Heinze-Bradshaw", "instructor_addr": "1949 Campus Drive Office 224"}], "topic": "", "course": "367-0", "descriptions": [{"name": "Overview of class", "value": "This course will focus on the evolution of musical theatre in the U.S. from the early 20th century up to our current times. We will look at the foundations, development and various manifestations of this uniquely &quot;American&quot; art form, examining it in relation to social, cultural, and economic history. This will entail analysis of individual musicals, a contextual overview of the major players within the field, and an unpacking of the industry that surrounds and forms the conditions within which musical theatre is created and practiced. We will be digging into the past to better understand current developments within musical theatre, both within the Broadway paradigm and outside of it."}, {"name": "Learning Objectives", "value": "demonstrate a working knowledge of significant musicals, artists, and eras of American musical theatre<br/>identify the characteristics of specific types of musicals<br/>understand the relationship of musical theatre to American culture and society<br/>articulate the economic systems that have impacted and continue to shape musical theatre production<br/>recognize contemporary iterations of musical theatre across artistic genre"}, {"name": "Teaching Method", "value": "Discussion: Films/videos Lecture<br/>Presentations, Readings, Writing assignments"}, {"name": "Evaluation Method", "value": "Attendance: Class participation<br/>Exams, Papers, Presentations, Quizzes"}, {"name": "Class Materials (Required)", "value": "Broadway: The American Musical (PBS series) boxed CD set."}], "lmod": "1/9/16 6:40 PM (CT)", "subject": "THEATRE"}]