[{"class_mtg_info": [{"meet_t": "MoTh 8:00AM - 9:20AM", "meet_l": "Frances Searle Building 1441"}], "school": "SoC", "enrl_requirement": "", "qtr": "Spring 2017", "name": "32769", "title": "SoC CSD 493-0-20 Vocal Physiology and Pathology", "class_attributes": "Prerequisites apply, see description<br/><br/>", "section": "32769", "instructors": [{"instructor_phone": "847/491-2518", "instructor_name": "William Nathan Waller", "instructor_addr": ""}], "topic": "", "course": "493-0", "descriptions": [{"name": "Overview of class", "value": "This course will focus on the diagnosis and management of congenital, acquired and non-organic disorders of phonation. Included is the review of the anatomic and physiological bases of phonation, respiration and articulation/resonation."}, {"name": "Registration Requirements", "value": "CSD 301, CSD 406 and an acoustic phonetic or physical science course"}, {"name": "Learning Objectives", "value": "Describe anatomy and physiology of the vocal mechanism. Describe respiration, phonation, resonance and articulation as related to modulation of voice. Describe neurophysiology of respiration, phonation and resonance. Identify measurable variables as related to modulation of voice (acoustic, aerodynamic, perceptual). (ASHA III-B) Describe life span changes including pediatric development of the vocal mechanism and aging influences on respiration, phonation, resonance and articulation (ASHA III-BC).<br/>Identify etiologies and describe characteristics of vocal pathologies (benign, malignant, and neuropathologic) including incidence and prevalence. (ASHA III-C)<br/>Identify techniques for prevention of voice disorders and promotion of vocal wellness (vocal hygiene, avoiding phonotrauma) in varied clinical, educational and corporate settings. Identify evidence-based treatment approaches and outcomes to voice disorders: behavioral, medical (including pharmacological), surgical, and combination strategies. (ASHA III-D)<br/>The applicant must demonstrate knowledge of standards of ethical conduct. (ASHA III-E)<br/>The applicant must demonstrate knowledge of processes used in research and the integration of research principles into evidence-based clinical practice. (ASHA III-F)<br/>Knowledge of contemporary professional issues related to the management of voice disorders (ASHA III-G)"}, {"name": "Evaluation Method", "value": "Assessment &amp; Grading:<br/>Article Review 10%<br/>Quizzes 40% <br/>Midterm 25%<br/>Final 25%"}, {"name": "Class Materials (Required)", "value": "Aronson, A.E., &amp; Bless, D.M. (2009). Clinical Voice Disorders (4th ed.). Thieme Medical<br/> Publishers, Inc. <br/><br/>Boone, D.R., McFarlane, S.C., Von Berg, S.L. (2013). The Voice and Voice Therapy <br/> (9th ed.). Boston: Pearson, Allyn and Bacon."}, {"name": "Class Materials (Suggested)", "value": "Colton, R.H., &amp; Casper, J.K. (1996). Understanding Voice Problems: A Physiological Perspective for Diagnosis and Treatment (2nd ed.). Baltimore: Lippincott Williams &amp; Wilkins."}], "lmod": "2/16/17 6:38 PM (CT)", "subject": "CSD"}]