[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "University Hall 112"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores<br/>Add Consent: Department Consent Required<br/>Drop Consent: Department Consent Required<br/>", "qtr": "Fall 2016", "name": "12303", "title": "WCAS HISTORY 101-6-20 First-Year Seminar-European History", "class_attributes": "WCAS First-Year Seminar<br/><br/>Attendance at 1st class mandatory<br/><br/>Freshmen/Sophomores Only<br/><br/>", "section": "12303", "instructors": [{"instructor_phone": "847/491-2877", "instructor_name": "Benjamin   Frommer", "instructor_addr": "Harris Hall Room 206"}], "topic": "Collaboration and Resistance", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "Nazi Germany's genocide of European Jewry depended on far more than just members of the National Socialist Party and the country's military. From Vichy France in the West to the occupied Soviet territories in the East, the persecution, expropriation, and murder of millions involved countless civilians and state officials at all levels of government. Many of those who collaborated with the Nazis did so for personal or partisan gain and/or because they were themselves antisemites. Many others, however, were drawn into the process of genocide without necessarily having planned to aid the Germans. This course considers the causes, consequences and limits of complicity in the Holocaust. In particular, we will examine collaboration at the face-to-face level of relations between neighbors and with local officials. We will explore the most vexed questions of complicity among occupied peoples and within ghettos and concentration camps. We will follow these questions up through the end of the war and beyond and explore the measures postwar European states took (or, more commonly, did not take) to identify and punish those who profited from the murder of the continent's Jews."}, {"name": "Registration Requirements", "value": "GRADING BASIS: ANC"}, {"name": "Teaching Method", "value": "Discussion"}, {"name": "Evaluation Method", "value": "Discussion (20%) and written assignments (80%); Four essays (4-6 pages each)"}, {"name": "Class Materials (Required)", "value": "**Tentative until order posted to Norris website**<br/>Deák, István. Europe on Trial: The Story of Collaboration, Resistance, and Retribution during World War II.<br/>9780813347899.<br/>Gross, Jan T. Golden Harvest: Events at the Periphery of the Holocaust. 9780199731671. Levi, Primo. Survival in Auschwitz. 9781492942580. Tec, Nechama. Dry Tears: The Story of a Lost Childhood. 9780195035001."}, {"name": "Class Notes", "value": "AREA OF CONCENTRATION: Europe"}], "lmod": "10/30/16 7:05 PM (CT)", "subject": "HISTORY"}]