[{"class_mtg_info": [{"meet_t": "We 6:00PM - 8:50PM", "meet_l": "Annie May Swift Hall 109"}, {"meet_t": "Th 5:30PM - 8:20PM", "meet_l": "Annie May Swift Hall 109"}], "school": "SoC", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24479", "title": "SoC RTVF 298-0-20 Studies in Media Topics", "class_attributes": "Freshmen Only<br/><br/>", "section": "24479", "instructors": [{"instructor_phone": "", "instructor_name": "Erik Steven Gernand", "instructor_addr": ""}], "topic": "Applying Genre", "course": "298-0", "descriptions": [{"name": "Overview of class", "value": "RTVF 298: Applying Genre<br/><br/>-Overview of class (Generally describe the class here. Include assignment and project information, if desired.)<br/>How does the construct of genre aid the filmmaker in finding their voice? How might it hinder? Students will research a variety of cinematic genres, then utilize them to develop original narrative-based story premises. <br/><br/>Students will generate their own genre-based, original, feature-length and short film concepts based on weekly prompts given in class. Each student will leave the course with an idea book filled with 27 ideas for future projects that they have workshopped in class and revised.<br/><br/>The class will meet twice weekly. Wednesday will be for workshop and discussion of ideas/concepts. There will be a film screening every Thursday that will be a prompt for the next genre we will examine.<br/><br/>-Registration Requirements (Pre-Reqs)<br/>none<br/><br/>-Learning Objectives<br/>Through readings, screenings, written assignments, and classroom discussion, students will examine film genre and its impact on both the filmmaker and the audience.<br/><br/>-Teaching Method<br/>Lecture, reading assignments, discussion, in-class screenings, and in-class workshop of student assignments. This is a supportive environment where students are encouraged to participate in a community marked by an atmosphere of collaboration. <br/><br/>-Evaluation Method<br/>Students will be evaluated based on their successful completion of the weekly writing assignment, weekly presentation of their ideas in class, and active participation in the creative workshop environment with all students.<br/><br/>-Class Materials (Required)<br/>Myth and the Movies: Discovering The Mythic Structure of 50 Unforgettable Films, <br/>by Stuart Voytilla, Michael Wiese Productions (1999).<br/><br/>-Class Materials (Suggested)<br/><br/>-Class Notes (What else would you like the student to know about this class?)"}], "lmod": "12/25/16 6:47 PM (CT)", "subject": "RTVF"}]