[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "Parkes Hall 222"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "32069", "title": "WCAS ASIAN_LC 290-0-21 Introductory Topics in Asian Languages and Cultures", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "32069", "instructors": [{"instructor_phone": "", "instructor_name": "Mi-Ryong   Shim", "instructor_addr": ""}], "topic": "Modern Korean Literature", "course": "290-0", "descriptions": [{"name": "Overview of class", "value": "Topic: Modern Korean Literature <br/>This course examines the development of modern Korean literature from the 1900s to the 1970s. In addition to providing a survey of major works of modern Korean literature, this course will examine the significance and role of literature in Korean society, topics that have been intensely debated upon ever since the modern notion of &quot;literature&quot; was introduced to Korea. We will explore questions such as: How have the social and historical contexts of this period - from Japanese colonialism to Korean War and national division to rule by authoritarian governments - shaped Korean literature? Why have so many Korean writers asked, &quot;What is literature?&quot; How have they attempted to answer this fundamental question? The readings for the course will include works of literary fiction and criticism, as well as historical and/or critical readings, which will be used to supplement and contextualize the literary texts. All readings will be in English. No previous knowledge of Korea or Korean language is required."}, {"name": "Learning Objectives", "value": "This course is designed to introduce students to the history and major works of modern Korean literature through literary texts in English translations. Students will sharpen their skills in close reading and critical analysis."}, {"name": "Teaching Method", "value": "Discussion with some lecture on cultural context."}, {"name": "Evaluation Method", "value": "Attendance and participation<br/>Weekly response papers (200-250 words each)<br/>Midterm paper (5-6 pages long)<br/>Final paper (7-8 pages long)"}, {"name": "Class Materials (Required)", "value": "Required books will be available through the campus bookstore. Other readings will be uploaded on the course Canvas website."}], "lmod": "4/3/16 7:44 PM (CT)", "subject": "ASIAN_LC"}]