[{"school": "WCAS", "overview_of_class": "Prof. James Mahoney, Global Development, Winter 2017<br/>This course explores the economic and social changes that have constituted \"development,\" and that have radically transformed human society. The course focuses on both the historical experience of Europe and the contemporary experience of countries in Africa, Asia, and Latin America. In the historical discussion, we explore the birth of the \"nation state\" as the basic organizing unit of the international system; the transition from agrarian to industrial economic systems; and the expansion of European colonialism across the globe. In our discussion of Africa, Asia, and Latin America, we consider the legacies of colonialism for development; the ways in which countries have attempted to promote economic development and industrialization; and issues of inequality and human welfare in an increasingly globally connected world.", "name": "Special Topics in Political Science", "section": "21", "topic": "Global Development", "course": "390-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4650/WCAS/POLI_SCI/390-0/22899", "instructor": ["James L Mahoney"], "id": "22899", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "Prof. Loubna El Amine, Human Rights Between East and West Winter 2017<br/>Are human rights universal or are they a Western product? Does the Universal Declaration of Human Rights represent a universal consensus among cultures or an imposition by the West on the rest of the world? What are the origins of the idea of human rights? Can human rights, or similar ideas, be found in all traditions of thought? In this course, students study the philosophical conception of human rights and the cultural debates surrounding it. They consider challenges leveled against the declared universalism of human rights. They assess these challenges from the perspective of two non-western traditions: Islam and Confucianism.", "name": "Special Topics in Political Science", "section": "22", "topic": "Human Rights Between East and West", "course": "390-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4650/WCAS/POLI_SCI/390-0/22900", "instructor": ["Loubna   El Amine"], "id": "22900", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "\"Religion and Politics beyond Freedom and Violence\" Prof. Elizabeth Shakman Hurd Winter 2017<br/>This course moves beyond liberal assumptions about religion, secularism and modernity to consider the complex entanglements of religion with human life, law, and public culture in the US and abroad. Beginning with the debates over yoga, the public display of crèches in the United States, and the question of who is a Jew in the United Kingdom, we will then move further afield to reflect on a series of dilemmas involving the law and politics of religious difference in other contexts. The course traverses disciplinary, geographic, and secular-religious boundaries, drawing on readings from politics, socio-legal studies, religious studies, anthropology, history, and popular culture. Students will also consider their own experiences of living with religious diversity, as we explore tools and strategies to think in new ways about the place of religion in the contemporary world.", "name": "Special Topics in Political Science", "section": "23", "topic": "Religion and Politics Beyond Freedom", "course": "390-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4650/WCAS/POLI_SCI/390-0/22901", "instructor": ["Elizabeth S Hurd"], "id": "22901", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "\"Religion and Politics in the State of Israel\" Prof. Joseph Ringel Winter 2017<br/>This course discusses the relationship between religion and politics in Israel. We will explore the theoretical/ideological background and historical development of that relationship; the advantages and disadvantages of that system; the various religious groups and parties represented in the political system; and how that relationship affects government policies regarding both domestic issues and foreign policy, including a section on religious violence and peace-making. We will likewise delve into broader questions as to the applicability of the Israeli model to other part of the world, to what extent the Israeli model represents broader trends in the Middle East specifically and in the world at large, and the complex nature of the relationship between democracy and religion (or between religion and politics in a democracy). This course will utilize academic literature from a variety of fields, including anthropology, political science, religion, and history, and employs literature from interdisciplinary fields, including Jewish Studies, Islamic Studies, and Middle Eastern and North African studies. By the end of the course, it is hoped that you will understand the ways in which religion and politics in Israel impact each other, the cultural and historical context of how those interactions developed, the impact that relationship has, and how the study of religion and politics in Israel is relevant to our lives in the US. Note that this course is a 300-level course, and as such, has a heavy writing component, which fits the format and subject of the course better than quizzes or exams. The point is to think about and synthesize the material. The grade will be based on 4 papers, each of which will be do at the end of every second week, as well as class participation. These include 2 response papers (about 5 pp. each), a term paper (about 10 pp.), and a final paper (about 5 pp.). In terms of reading requirements, students will be required to use Robert D. Lee's Religion and Politics in the Middle East: Identity, Ideology, Institutions, and Attitudes (Boulder, CO: Westview Press, 2014; ISBN: 9780813348735) and to complete the readings listed in the syllabus, which will include articles and relevant sections of books that will be posted on CAESAR/CANVAS. Though there are no registration requirements for this class, newer students not used to the system should keep these requirements in mind. The course will consist of both a lecture as well as ample time for fun interactive learning and class discussion and participation.", "name": "Special Topics in Political Science", "section": "24", "topic": "Religion and Politics in the State of Israel", "course": "390-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4650/WCAS/POLI_SCI/390-0/22902", "instructor": ["Joseph Tzvi Ringel"], "id": "22902", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "\"War and Peace\" Prof. Daniel Krcmaric Winter 2017<br/>This course covers the political science literature on the causes of war. We will primarily focus on interstate war, but the class also will include extensions to civil war, insurgency, terrorism, and humanitarian intervention.", "name": "Special Topics in Political Science", "section": "25", "topic": "War and Peace", "course": "390-0", "meeting_time": ["We 9:30AM - 12:20PM"], "path": "/class-descriptions/4650/WCAS/POLI_SCI/390-0/22903", "instructor": ["Daniel Joseph Krcmaric"], "id": "22903", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "Non-state armed groups Prof. Ana Arjona Winter 2017<br/>This seminar explores different aspects of non-state armed groups including insurgents, terrorist groups, criminal organizations and gangs. The course discusses theories and evidence on the origins and behavior of these groups as well as on the consequences of their presence on local communities, governments and markets.", "name": "Special Topics in Political Science", "section": "26", "topic": "Nonstate Armed Groups", "course": "390-0", "meeting_time": ["Th 2:00PM - 4:50PM"], "path": "/class-descriptions/4650/WCAS/POLI_SCI/390-0/22904", "instructor": ["Ana Maria Arjona"], "id": "22904", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "", "name": "Special Topics in Political Science", "section": "27", "topic": "Breaking Rules, Making Rules", "course": "390-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4650/WCAS/POLI_SCI/390-0/28176", "instructor": ["Jean Marie Clipperton"], "id": "28176", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "", "name": "Special Topics in Political Science", "section": "28", "topic": "Politics, Violence, and Society", "course": "390-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4650/WCAS/POLI_SCI/390-0/28177", "instructor": ["Robert   Braun"], "id": "28177", "subject": "POLI_SCI"}]