[{"class_mtg_info": [{"meet_t": "Th 9:00AM - 11:50AM", "meet_l": "Scott Hall 201 Ripton Room"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "24564", "title": "WCAS POLI_SCI 443-0-1 International Law and International Politics", "class_attributes": "", "section": "24564", "instructors": [{"instructor_phone": "847/491-4842", "instructor_name": "Karen   Alter-Hanson", "instructor_addr": "Scott Hall #318"}], "topic": "", "course": "443-0", "descriptions": [{"name": "Overview of class", "value": "Scholars and practioners recognize that international law and international legal institutions are increasingly important in international politics. The study of international law is also an intellectual arena for theoretical innovation. This seminar examines contemporary scholarship regarding international law and international relations. <br/><br/>The topic of international law is a place to study the interaction of material, power and normative forces, and a place where one can employ all of the newest methods and approaches in political science. The new international law scholarship is being built in an unusually interdisciplinary fashion. We will be reading work that builds on economic theories, sociological theories, and traditional international relations approaches. We will also be examining questions of broad interest within political science and sociology- the social construction and influence of norms in international affairs, the importance of murky issues like legitimacy and fairness in shaping public perceptions and actor behavior, and how institutions of international law including international treaties and international courts implicitly and explicitly shape the international political process and state behavior."}, {"name": "Registration Requirements", "value": "Graduate student and undergrads who have taken PS 343"}, {"name": "Learning Objectives", "value": "This course examines contemporary theories regarding international law and international relations. The goal is to understand the literature and debates, and to use the topic of international law to deepen one's understandings of the different approaches to political science"}, {"name": "Teaching Method", "value": "seminar"}, {"name": "Evaluation Method", "value": "Participation + research paper"}, {"name": "Class Materials (Required)", "value": "Goldsmith, Jack L., and Eric A. Posner. 2005. The limits of International law. Oxford; New York: Oxford University Press.<br/><br/>Plus a on-line readings/course pack"}], "lmod": "1/9/16 6:52 PM (CT)", "subject": "POLI_SCI"}]