[{"class_mtg_info": [{"meet_t": "We 12:00PM - 2:50PM", "meet_l": "Louis Hall 118"}], "school": "SoC", "overview_of_class": "Students will learn the fundamentals of independent/low-budget film producing, from pre-production through final delivery.  Emphasis will be placed on both applied research and hands-on practice through serving as producer on a student short film in pre-production or production during the quarter.   You will be required to deliver an end-of-quarter pitch presentation supplying a detailed schedule and budget for the short film to which you are attached as producer.", "qtr": "Winter 2016", "name": "Topics in Pre-Production", "title": "SoC RTVF 370-0-20 Topics in Pre-Production", "lmod": "1/9/16 6:39 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Kyle Richard Henry", "instructor_addr": ""}], "topic": "Producing", "course": "370-0", "enrl_requirement": "Enrollment Requirements: Pre-requisite: Students must have taken, be currently enrolled, or concurrently registered for RTVF 190 for the upcoming quarter.<br/>Add Consent: Department Consent Required<br/>", "descriptions": [{"name": "Overview of class", "value": "Students will learn the fundamentals of independent/low-budget film producing, from pre-production through final delivery. Emphasis will be placed on both applied research and hands-on practice through serving as producer on a student short film in pre-production or production during the quarter. You will be required to deliver an end-of-quarter pitch presentation supplying a detailed schedule and budget for the short film to which you are attached as producer."}, {"name": "Registration Requirements", "value": "RTVF 190"}, {"name": "Evaluation Method", "value": "Attendance/participation, one short essay, one scheduling exercise and one final pitch presentation which includes a full shooting schedule and budget."}, {"name": "Class Materials (Required)", "value": "The Independent Film Producers Survival Guide<br/><br/>? Vachon, Christine, with David Edelstein. Shooting to Kill. Harper, 1998. ISBN-13: 978-0380798544<br/><br/>- Additional PDF readings posted to Blackboard"}], "path": "/class-descriptions/4610/SoC/RTVF/370-0/22377", "instructor": ["Kyle Richard Henry"], "class_attributes": "", "id": "22377", "subject": "RTVF"}, {"class_mtg_info": [{"meet_t": "TuTh 3:00PM - 4:50PM", "meet_l": "Louis Hall 118"}], "school": "SoC", "overview_of_class": "This class will explore the amazing power of After Effects and it's related suite of plug-ins and partner apps (including Mocha and Cinema 4D).  We will cover an array of techniques including basic 2D animation, text and title manipulation, motion & planar tracking, 3D animation (including virtual 3D lighting), virtual camera tracking, keying and compositing, particles and emitters. <br/> <br/>You will make a presentation, work on several in-class exercises, complete a moderately-sized project, and complete a final exam project (there will be no written exam).  There is the likelihood of some quizzes to make sure you are keeping up with the material.<br/> <br/>This will be a technical and somewhat dense class.  Fair warning: if you are not a patient person who likes tweaking details until they are just right, or if you are not fluent in Mac and enjoy working with complex software, the class may not be for you.  If you do enjoy these things, you will have a lot of fun.<br/> <br/>I would like to create a workshop atmosphere - I expect you to be leaning over to watch each other's computers, checking different approaches and techniques, asking questions out loud rather than raising your hand, finding new and different approaches online and sharing them with the class, and generally helping each other along.  This does NOT mean chaos - making noise and conversation where it is not helpful.", "qtr": "Winter 2016", "name": "Topics in Pre-Production", "title": "SoC RTVF 370-0-21 Topics in Pre-Production", "lmod": "1/9/16 6:39 PM (CT)", "section": "21", "instructors": [{"instructor_phone": "", "instructor_name": "Jeff Clayton Brown", "instructor_addr": ""}], "topic": "Motion Graphics", "course": "370-0", "enrl_requirement": "Enrollment Requirements: Pre-requisite: Students must have taken, be currently enrolled, or concurrently registered for RTVF 190 for the upcoming quarter.", "descriptions": [{"name": "Overview of class", "value": "This class will explore the amazing power of After Effects and it's related suite of plug-ins and partner apps (including Mocha and Cinema 4D). We will cover an array of techniques including basic 2D animation, text and title manipulation, motion &amp; planar tracking, 3D animation (including virtual 3D lighting), virtual camera tracking, keying and compositing, particles and emitters. <br/> <br/>You will make a presentation, work on several in-class exercises, complete a moderately-sized project, and complete a final exam project (there will be no written exam). There is the likelihood of some quizzes to make sure you are keeping up with the material.<br/> <br/>This will be a technical and somewhat dense class. Fair warning: if you are not a patient person who likes tweaking details until they are just right, or if you are not fluent in Mac and enjoy working with complex software, the class may not be for you. If you do enjoy these things, you will have a lot of fun.<br/> <br/>I would like to create a workshop atmosphere - I expect you to be leaning over to watch each other's computers, checking different approaches and techniques, asking questions out loud rather than raising your hand, finding new and different approaches online and sharing them with the class, and generally helping each other along. This does NOT mean chaos - making noise and conversation where it is not helpful."}, {"name": "Class Materials (Required)", "value": "The required text is After Effects Apprentice: Real-World Skills for the Aspiring Motion Graphics Artist by Chris and Trish Meyer. Other texts I'll be drawing from are:<br/>- Creating Motion Graphics with After Effects, Trish and Chris Meyer<br/>- The After Effects Illusionist, Chad Perkins<br/>- After Effects Expressions, Marcus Geduld<br/> <br/>We will also pull liberally from various tutorials and resources online."}], "path": "/class-descriptions/4610/SoC/RTVF/370-0/22378", "instructor": ["Jeff Clayton Brown"], "class_attributes": "", "id": "22378", "subject": "RTVF"}]