[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "Block Auditorium"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "36687", "title": "WCAS ART_HIST 228-0-1 Introduction to Pre-Columbian Art", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "36687", "instructors": [{"instructor_phone": "", "instructor_name": "Virginia Elizabeth Miller", "instructor_addr": ""}], "associated_classes": [{"component": "DIS", "room": "Harris Hall L06", "meeting_time": "Fr 11:00AM - 11:50AM"}, {"component": "DIS", "room": "Harris Hall L28", "meeting_time": "Fr 1:00PM - 1:50PM"}, {"component": "DIS", "room": "TBA", "meeting_time": "TBA"}, {"component": "DIS", "room": "TBA", "meeting_time": "TBA"}], "topic": "", "course": "228-0", "descriptions": [{"name": "Overview of class", "value": "An introduction to the art and architecture of the Pre-Columbian civilizations of Mexico, Central, and South America from approximately 1500 B.C.E. to the Spanish invasion of the 16th century. Among the topics to be examined for Mesoamerica will be the great stone heads of the early Olmec civilization, the early urban center and pyramids of Teotihuacan, ancient Maya calendrics, history, and writing, and the eclectic art style developed by the short-lived imperial Aztec. In the Andean region, we will explore the enduring textile tradition of Peru, the early religious cult of Chavín, the great earth drawings of the Nazca, the spectacular recent burial finds of the Moche, and the impressive stone architecture, road system, and irrigation works of the Inka. Students will learn to recognize differences in artistic styles between cultures as well as to track how these cultures influenced each other. Additionally we will briefly study the impact of the European conquest on indigenous art and culture. Travel to the Art Institute will be required at least once during the term."}, {"name": "Evaluation Method", "value": "Mid-term, final, two short papers"}, {"name": "Class Materials (Required)", "value": "Rebecca Stone, Art of the Andes (3rd ed.) <br/>Mary Miller, The Art of Mesoamerica (5th ed.)"}], "lmod": "4/3/16 7:44 PM (CT)", "subject": "ART_HIST"}]