[{"class_mtg_info": [{"meet_t": "MoWeFr 10:00AM - 10:50AM", "meet_l": "Harris Hall L06"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "34916", "title": "WCAS ENGLISH 324-0-20 Studies in Medieval Literature", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "34916", "instructors": [{"instructor_phone": "847/491-5679", "instructor_name": "Barbara Jane   Newman", "instructor_addr": "University Hall 215"}], "topic": "Pagan &amp; Christian in Medieval Literature", "course": "324-0", "descriptions": [{"name": "Overview of class", "value": "Medieval culture was overwhelmingly Christian, yet it was heir to a rich variety of pre-Christian religions. Germanic paganism brought its monsters, its defiant heroism, and its expectation of a coming &quot;twilight of the gods,&quot; while Celtic paganism supplied fairy temptresses, magical objects, and mysterious Otherworld visitors. Classical paganism contributed the pantheon of Greco-Roman gods and goddesses, a stoic resignation to divine will, and an elaborate mythology of love. Contrary to popular belief, the Church did not suppress the use of pagan sources in vernacular literature. But it is fascinating to see how medieval writers adapted and transformed the narrative materials they inherited, producing sophisticated texts that present an overtly Christian point of view layered above tantalizing and elusive pagan subtexts. We will read a selection of Old and Middle English works and several others translated from the French, learning in the process how malign Fate was converted into the providential will of an all-seeing God; how Chaucer integrated Jupiter, Mars, Venus, and Diana into a Christian worldview; and how a Celtic goddess's cauldron of plenty became the Holy Grail?the chalice from which Christ and his apostles drank at the Last Supper."}, {"name": "Teaching Method", "value": "Mainly discussion; a few lectures."}, {"name": "Evaluation Method", "value": "Class participation, four 10-minute quizzes, three 5-7 pp. papers (creative options allowed)."}, {"name": "Class Materials (Required)", "value": "Beowulf, trans. Seamus Heaney (Norton);<br/>The Canterbury Tales, 2nd ed., ed. V. A. Kolve and Glending Olson (Norton Critical Edition);<br/>Sir Gawain and the Green Knight, trans. Marie Boroff, ed. Laura Howes (Norton Critical Edition);<br/>Chrétien de Troyes, Perceval, trans. Ruth Harwood Cline (U. of Georgia Press);<br/>Robert de Boron, Merlin and the Grail, trans. Nigel Bryant (D. S. Brewer);<br/>The Quest of the Holy Grail, trans. P. M. Matarasso (Penguin);<br/>Sir Thomas Malory, Le Morte D'Arthur, ed. William Caxton, Vol. 2 (Penguin). <br/><br/>Please buy only these editions and translations. Books are available at Norris; course packet at Quartet Copies."}, {"name": "Class Notes", "value": "Pre 1830"}], "lmod": "4/3/16 7:58 PM (CT)", "subject": "ENGLISH"}]