[{"school": "WCAS", "overview_of_class": "This course helps students understand oral history as part of a political battlefield in Latin America in which popular political consciousness, collective identities, and social movements are made. We will unpack the concepts and practices of oral history by discussing the theoretical and methodological challenges that professional historians and social scientists confronted when doing oral history in the region and beyond. Then, we will study the \"archives of terror\" of the Dirty Wars of Central and South America (1960s-1990s), in which various forms of orality (i.e. documentary film, testimony, life histories, interviews, and truth commissions) helped victims of violence as well as perpetrators to intervene in the peace processes and/or democratic transitions seeking justice, reparation, forgiveness, forgetfulness, amnesty, and immunity. We will analyze the political, epistemological, ethical, and aesthetical limitations of these efforts to heal the wounds of state-led violence, dictatorship, genocide, and guerrilla warfare. The overarching goal of the course is to understand oral history as a prism that reflects and refracts oral and written forms of making sense of the past, and to understand why it has played such a fundamental role in the definition of the \"historical truth\" in the turbulence of Latin America at the end of the twentieth century and the beginning of the twenty-first.", "name": "Approaches to History", "section": "20", "location": "University Library 5722", "topic": "Oral Hist & Terror Archives in Latin Amer", "course": "393-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4620/WCAS/HISTORY/393-0/33434", "instructor": ["Lina M Britto"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "33434", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "Modern world history is a story of cultural, economic, and biological interchange. This seminar explores some of the ways people and things circulated between China and \"the West\" (primarily Great Britain but also continental Europe and, to a lesser extent, the United States) from roughly 1839 to the mid-twentieth century. The course primarily will focus on the Euro-American influence on modern China, but we will not ignore the question of how China contributed to the transformation of the modern West. We will concentrate on particular topics (intellectual and scientific exchange, the transformation of women's lives, the opium trade, the missionary enterprise, war, and treaty ports as sites of cultural hybridity and change). Students will also write a term paper on a particular topic of interest to them.", "name": "Approaches to History", "section": "22", "location": "University Hall 101", "topic": "China and the West", "course": "393-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4620/WCAS/HISTORY/393-0/33435", "instructor": ["Melissa A Macauley"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "33435", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "This seminar will review the history of wilderness in America, both in the broad sense of wilderness as a general term meaning \"pristine\" or \"uninhabited\" nature and in the specific sense of wilderness as the highest level of protection for public lands managed by the federal government. We will consider the role that the concept of wilderness has played in the conservation and environmental movements, and the ways that it both grounds those movements and pushes them in problematic directions, especially as it relates to the underrepresented wilderness experiences of particular social groups. Finally, we will consider the abstract issues of wilderness in terms of specific wilderness areas in the late-twentieth-century United States.", "name": "Approaches to History", "section": "24", "location": "Technological Institute LG72", "topic": "", "course": "393-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4620/WCAS/HISTORY/393-0/33436", "instructor": ["Keith Mako Woodhouse"], "class_attributes": "Historical Studies Distro Area<br/><br/>Attendance at 1st class mandatory<br/><br/>", "id": "33436", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "This course will explore the period of the Ottoman Empire's collapse and the formation of nation-states in the Middle East. We will first learn about the conceptual categories \"nation\" and \"nationalism,\" and then apply this knowledge to critically evaluate several case studies about transitions to nationhood in the region.", "name": "Approaches to History", "section": "26", "location": "Harris Hall L06", "topic": "Nationalism in the Middle East", "course": "393-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4620/WCAS/HISTORY/393-0/33437", "instructor": ["Ipek Kocaomer Yosmaoglu"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "33437", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "Vietnamese refugees and Korean immigrants came to the United States with experiences of war that are passed to younger generations as both silence and memory. How can we understand and represent the experiences of both the older and younger generations? How do their experiences transform the history of Asian Americans as well as the broader history of the United States? What does war mean in the American experience? This research seminar focuses on Vietnamese American and Korean American communities in the Chicago area in an attempt to answer these and other questions through focused oral history research and public presentations.", "name": "Approaches to History", "section": "28", "location": "Harris Hall L06", "topic": "Memories of War", "course": "393-0", "meeting_time": ["MoWe 11:00AM - 12:20PM"], "path": "/class-descriptions/4620/WCAS/HISTORY/393-0/38029", "instructor": ["Ji-Yeon   Yuh"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "38029", "subject": "HISTORY"}]