[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "Harris Hall L28"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-registration is reserved for students majoring or minoring in Asian Languages &amp; Cultures, Asian Studies, or International Studies.", "qtr": "Spring 2017", "name": "32522", "title": "WCAS ASIAN_LC 290-0-22 Introductory Topics in Asian Languages and Cultures", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "32522", "instructors": [{"instructor_phone": "847/467-7419", "instructor_name": "Mi-Ryong   Shim", "instructor_addr": "1880 Campus Drive, Kresge Hall, Office 4-415"}], "topic": "Korean Film and Society", "course": "290-0", "descriptions": [{"name": "Overview of class", "value": "This interdisciplinary course explores 20th and 21st century Korean films as sites for historical inquiry and social analysis. We will examine how legacies of colonialism, national division, and the Cold War in East Asia are articulated through the medium of cinema in South and North Koreas. We will also look at how Korean national identities are produced in relation to the global circulation of films and transnational market forces. Through this course, students will gain an understanding of some of the major issues in modern Korean history and society, as well as learn to think critically about the language of cinema."}, {"name": "Learning Objectives", "value": "Students will be introduced to major themes in modern Korean culture, society, and history. Students will develop skills in analyzing films as cultural texts. <br/>Students will sharpen critical reading and writing skills."}, {"name": "Teaching Method", "value": "Lecture and Discussion"}, {"name": "Evaluation Method", "value": "Participation, attendance, preparation for class.<br/>Response papers.<br/>Midterm and final analytical papers."}, {"name": "Class Materials (Required)", "value": "Timothy Corrigan, A Short Guide to Writing About Film (available at the campus bookstore for purchase)<br/>Readings and streaming films accessible via Canvas Course site"}], "lmod": "2/13/17 6:41 PM (CT)", "subject": "ASIAN_LC"}]