[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Kresge Centennial Hall 2-410"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-requisite: Students must have completed Philosophy 150 in order to enroll in this class.", "qtr": "Winter 2017", "name": "22727", "title": "WCAS PHIL 250-0-20 Elementary Logic II", "class_attributes": "Formal Studies Distro Area<br/><br/>", "section": "22727", "instructors": [{"instructor_phone": "847/491-4452", "instructor_name": "Michael John Glanzberg", "instructor_addr": "Crowe 1-148"}], "associated_classes": [{"component": "DIS", "room": "Kresge 3438 Philosophy Sem. Rm", "meeting_time": "Fr 1:00PM - 1:50PM"}, {"component": "DIS", "room": "Kresge 3438 Philosophy Sem. Rm", "meeting_time": "Fr 2:00PM - 2:50PM"}], "topic": "", "course": "250-0", "descriptions": [{"name": "Overview of class", "value": "In 150, you learned how to prove that certain arguments are valid and how to show that some others are not valid (by providing counter-examples). In 250, we develop this toolkit further in a number of directions. We will see how the logic you learned in 150 can be applied to produce a number of interesting results, including its ability to describe basic facts about arithmetic. We will see how to really prove that 1=1=2! We will also look at how it can be used to describe complicated notions of infinity, and how there really are different sizes of infinity! We will also learn alternative ways of thinking about the apparatus of logic, especially, ways of thinking about logic in terms of what the logical words mean, rather than in terms of systems of deduction. We will explore some limitations of the logic you learned in 150, and see some things it cannot do, and why not. Finally, we will examine some ways of expanding the resources of logic beyond what you saw in 150, which overcome some of these limitation, but at significant costs."}, {"name": "Registration Requirements", "value": "PHIL 150 or permission of instructor."}, {"name": "Learning Objectives", "value": "By the end of this course, students will have a deeper understanding of how logic works, what it can do, and what it cannot do. They will also understand a range of important applications of logic, that are significant to philosophy, and to other fields including mathematics."}, {"name": "Teaching Method", "value": "Discussion sectionLecture"}, {"name": "Evaluation Method", "value": "Weekly Homework (most weeks), midterm exams, final exam.<br/><br/>The course satisfies the logic requirement for graduate students in the Philosophy department: graduate students will have a different final project."}, {"name": "Class Materials (Required)", "value": "Lecture notes provided in class."}], "lmod": "12/24/16 7:05 PM (CT)", "subject": "PHIL"}]