[{"class_mtg_info": [{"meet_t": "Th 6:00PM - 9:00PM", "meet_l": "Annenberg Hall G21"}], "school": "SESP", "overview_of_class": "In this course students finalize and reflect on the data that they have collected in order to analyze and interpret them for the Master’s Project. Students apply published literature to their own projects as they investigate possible meanings and interpretations of their data while learning additional research methodologies including ones for the analysis of student work, case studies/critical incidences, and video. Students examine their data in order to provide the most satisfactory resolution to their Master Project research question, culminating in a paper and a public sharing of the results of their action research.", "qtr": "Spring 2016", "name": "Research and Analysis II: Research Methodology and Data Collection", "title": "SESP MS_ED 407-0-20 Research and Analysis II: Research Methodology and Data Collection", "lmod": "4/3/16 7:27 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Joseph C Senese", "instructor_addr": ""}], "topic": "", "course": "407-0", "enrl_requirement": "Enrollment Requirements: Registration is reserved for MS_ED Department Majors Only", "descriptions": [{"name": "Overview of class", "value": "In this course students finalize and reflect on the data that they have collected in order to analyze and interpret them for the Master&#8217;s Project. Students apply published literature to their own projects as they investigate possible meanings and interpretations of their data while learning additional research methodologies including ones for the analysis of student work, case studies/critical incidences, and video. Students examine their data in order to provide the most satisfactory resolution to their Master Project research question, culminating in a paper and a public sharing of the results of their action research."}], "path": "/class-descriptions/4620/SESP/MS_ED/407-0/36939", "instructor": ["Joseph C Senese"], "class_attributes": "", "id": "36939", "subject": "MS_ED"}]