[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Locy Hall 214"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "37363", "title": "WCAS AF_AM_ST 380-0-22 Topics in African-American Studies", "class_attributes": "", "section": "37363", "instructors": [{"instructor_phone": "", "instructor_name": "Celeste Michele Watkins-Hayes", "instructor_addr": ""}], "topic": "HIV/AIDS", "course": "380-0", "descriptions": [{"name": "Overview of class", "value": "The remarkable transformation of HIV/AIDS from an inevitable death sentence to a manageable chronic illness in well-resourced countries like the United States is one of the most noteworthy scientific achievements of the past 35 years. Recent medical advances have made the goal of an AIDS-free generation plausible in the US, and the epidemic commands less and less public attention. Yet the rate of new HIV infections in the US hovers stubbornly at approximately 50,000/year, and HIV/AIDS is widely recognized as not only a medical epidemic but also a manifestation of complex inequalities at the intersections of race, class, gender, and sexuality. In this advanced undergraduate seminar, students will develop an in-depth understanding of the scope and dimensions of HIV/AIDS in the United States and abroad and consider the role of race, class, gender, and sexuality in the epidemic. We will also explore how social movements, public policies, and cultural representations (film, art, media, public debate, etc) have played integral roles in the epidemic and the response."}, {"name": "Class Materials (Required)", "value": "This is a tentative booklist. Please confirm all books before purchasing. In some cases, excerpts may be posted to Canvas. <br/>Harden, Victoria. 2012. AIDS at 30: A History. Dulles, VA: Potomac Books. (tentative) ISBN 1597972940 Mackenzie, Sonja. 2013. Structural Intimacies: Sexual Stories in the Black AIDS Epidemic. Rutgers University Press. (tentative) ISBN: 0813560977 Cohen, Cathy. 1999. The Boundaries of Blackness: AIDS and the Breakdown of Black Politics (tentative) ISBN: 0226112896"}], "lmod": "2/20/17 6:43 PM (CT)", "subject": "AF_AM_ST"}]