[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "University Hall 118"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Spring 2016", "name": "34886", "title": "WCAS ENGLISH 101-6-25 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "34886", "instructors": [{"instructor_phone": "", "instructor_name": "Shaundra J Myers", "instructor_addr": ""}], "topic": "The Present Past: Fictions of Slavery", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "Is it time, as some argue, to put the legacy of slavery behind us? This first-year seminar will explore debates about the relation of the present to the past by studying a broad range of contemporary narratives of slavery. We will examine depictions of slavery, as well as its shadow, across a range of African American literary genres, including the novel, short fiction, poetry, essays, and the graphic novel. Beginning in the 1960s, the tradition of the &quot;neo-slave narrative&quot; emerged within African American literature. We will investigate why and how this literary form developed and how the diverse texts that make up this tradition reimagine the past and reorient the present. Our explorations will center on the utility of different narrative modes, from realism to experimentalism, in addressing issues of loss, reparation, historiography, and cultural appropriation. We will begin with key 19th-century narratives by Frederick Douglass and Harriet Jacobs before turning to latter-day representations of slavery, including Toni Morrison's novel Beloved, Kyle Baker's graphic novel Nat Turner, stories from John Keene's Counternarratives, and Natasha Trethewey's poetry collection Native Guard. We will put these literary texts in conversation with other cultural narratives and remains of slavery, including the unearthing of the African Burial Ground in Manhattan, the visual art of Kara Walker, and the stories our own DNA can now tell through genetic genealogy."}, {"name": "Teaching Method", "value": "Discussion (in class and on line) and peer workshops."}, {"name": "Evaluation Method", "value": "Three analytical papers, participation, discussion, oral presentation, and brief ungraded response writing.<br/><br/>NUMBER OF WRITING ASSIGNMENTS AND THEIR LENGTHS: Two short papers (2-5 pp.), one longer paper (5-7 pp.), and brief ungraded response writing."}, {"name": "Class Materials (Required)", "value": "Frederick Douglass, Narrative of the Life of Frederick Douglass, an American Slave, Written by Himself;<br/>Harriet Jacobs, Incidents in the Life of a Slave Girl;<br/>Toni Morrison, Beloved;<br/>selected stories from John Keene's Counternarratives;<br/>Kyle Baker, Nat Turner;<br/>selected poems from Natasha Trethewey's Native Guard;<br/>and supplemental readings and screenings."}], "lmod": "4/3/16 7:57 PM (CT)", "subject": "ENGLISH"}]