[{"class_mtg_info": [{"meet_t": "We 2:00PM - 4:50PM", "meet_l": "Scott Hall 201 Ripton Room"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "23047", "title": "WCAS POLI_SCI 411-0-20 Theories of American Political Institutions", "class_attributes": "", "section": "23047", "instructors": [{"instructor_phone": "847 4671147", "instructor_name": "Laurel Harbridge Yong", "instructor_addr": "601 University Place # 311"}], "topic": "", "course": "411-0", "descriptions": [{"name": "Overview of class", "value": "This course provides a broad overview of the literature on American political institutions, introduces some of the major theoretical perspectives and controversies, and encourages a wide-ranging familiarity with the substance of American politics. Although not all subjects are covered nor is the entirety <br/>of any topic covered, my hope is that each student will gain a better understanding of the field and some of the newest directions of research on institutions. **For more information about this course, please contact the instructor directly via email.**"}, {"name": "Registration Requirements", "value": "Graduate student or advanced undergraduate with permission from faculty."}, {"name": "Learning Objectives", "value": "1) Critically evaluate the arguments and evidence in articles and books.<br/>2) Write analytic papers.<br/>3) Understand the range of substantive and methodological approaches to studying American Politics."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Papers, Discussion/Participation, Option of take-home final exam or research paper"}, {"name": "Class Materials (Required)", "value": "- Noel, Hans. 2013. Political &quot;Ideologies and Political Parties in American. New York: Cambridge University Press. ISBN 978-1-107-62052-0 (paperback)<br/>- Lee, Frances E. 2009. Beyond Ideology: Politics, Principles, and Partisanship in the U.S. Senate. Chicago: University of Chicago Press. ISBN 9780226470764 <br/>(paperback)<br/>- Volden, Craig and Alan E. Wiseman. 2014. Legislative Effectiveness in the United States COngress: The Lawmakers. New York: Cambridge University Press. ISBN 978-0521152266 (paperback)<br/>- Beckmann, Matthew N. 2010. Pushing the Agenda: Presidential Leadership in U.S. Lawmaking, 1953-2004. New York: Cambridge University Press. ISBN 978-<br/>0521162913 (paperback)<br/>- Baumgartner, Frank, Jeffrey M. Berry, Marie Hojnacki, David C. Kimball, and Beth L. Leech. 2009. Lobbying and Policy Change: Who Wins, Who Loses, and Why. Chicago, University of Chicago Press. ISBN: 9780226039459 (paperback)<br/>- Bailey, Michael A. and Forrest Maltzman. 2011. The Cosntrained Court: Law, Politics, and the Decisions Justices Make. Princeton: Princeton University <br/>Press. ISBN 9780691151052 (paperback)<br/>- Jones, Bryan D., and Frank R. Baumgartner. 2005. The Politics of Attention: How Government Prioritizes Problems. Chicago: University of Chicago Press. <br/>ISBN 9780226406534 (paperback)<br/>- Masket, Seth. 2016. The Inevitable Party: Why Attemps to Kill the Party System Fail and How they WEaken Democracy. New York: Oxford University Press. ISBN<br/>9780190220846 (paperback)."}], "lmod": "12/25/16 7:05 PM (CT)", "subject": "POLI_SCI"}]