[{"class_mtg_info": [{"meet_t": "Mo 9:00AM - 11:50AM", "meet_l": "Fisk Hall 311"}], "school": "JOUR", "enrl_requirement": "Enrollment Requirements: Registration is reserved for IMC Full-Time Students only.<br/>Add Consent: Department Consent Required<br/>", "qtr": "Spring 2016", "name": "31199", "title": "JOUR IMC 498-0-21 Practicum", "class_attributes": "", "section": "31199", "instructors": [{"instructor_phone": "", "instructor_name": "Scot Rexford Wheeler", "instructor_addr": ""}], "topic": "Digital Analytics", "course": "498-0", "descriptions": [{"name": "Overview of class", "value": "Digital Analytics course delivers an applied understanding of digital analytics tools, methods and organizational approaches that will let students connect the dots between digital analytics and digital communications strategy, design and delivery. The goal of the course is to give students the capability to lead the evolution of digital marketing practices in their organizations through an understanding of the collection and application of data to solve marketing problems. Students will have exposure to an array of the most current digital analytics tools, and will conduct exercises and engage in discussions that illustrate how data and analytics should ideally shape marketing planning, content strategy, digital design and marketing performance evaluation. The course will cover the collection of data from web, email, social, mobile and paid display media through tagging, testing and survey, and will explore the marketing and business application of this data for performance evaluation, communications planning, design and content development &amp; targeting. The application of marketing analytics in the overall emerging &quot;big data&quot; structures in organizations will be explored. The progression toward increasing capabilities for real-time 1:1 marketing through algorithmic targeting and content personalization will also be discussed in this context, as will the ever changing privacy landscape and questions around who &quot;owns&quot; consumers' digital data."}], "lmod": "4/3/16 7:11 PM (CT)", "subject": "IMC"}]