[{"school": "WCAS", "overview_of_class": "Prof. Galya Ruffer \"Critical Perspectives on Human Rights\" Winter 2016<br/>Human rights have become the dominant frame for thinking about social justice and the path to human rights is paved with written documentation of human rights abuses and testimony. How do we know what we know about human rights abuses? In this course students will consider the relationship between the documentation of human rights abuses and justice. In our examination we will question: on what does the will to address human rights depend? And, how do the international narratives that emerge of human rights abuses relate to the victims and survivors of those abuses? Students will be introduced to the international human rights framework and then focus on the practice of human rights through case studies on the prosecution of sexual violence in international courts, the advocacy campaign to end the warehousing of refugees in camps and the struggle to recognize FGM as a form of persecution. We will question the received wisdom about the role of human rights in struggles for justice and learn about tensions between human rights and national sovereignty, the role of advocacy groups and the challenges of localizing human rights. Students will be introduced to the methodologies and tools of human rights documentation and consider the challenges of thinking as a human rights advocate. Based on our study of research and writing about rights, students will develop and share their own research projects.", "name": "Political Research Seminar", "section": "20", "location": "University Library 4722", "topic": "Critical Perspectives on Human Rights", "course": "395-0", "meeting_time": ["Mo 2:00PM - 4:50PM"], "path": "/class-descriptions/4610/WCAS/POLI_SCI/395-0/24424", "instructor": ["Galya Benarieh Ruffer"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>Auditing not permitted<br/><br/>Department Majors Only<br/><br/>Juniors/Seniors Only<br/><br/>", "id": "24424", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "Poli_Sci 395-0-23 \"Race, Place, and Space: Diversity in Democratic Politics\" Thomas Ogorzalek, Spring 2015<br/><br/>Racial and ethnic politics in the U.S. (and elsewhere) have often been understood in terms of spatial dynamics and composition: Does local diversity heighten or soften racial tension? What kinds of diversity create the most challenges for governance? What kinds of spaces make for different intergroup dynamics? These kinds of questions have become even more important under conditions of demographic change and deepening political polarization. This seminar will encourage students to critically engage with and contribute to current debates and research on the relationship between political geography and intergroup relations, and contribute original", "name": "Political Research Seminar", "section": "22", "location": "Scott Hall 212", "topic": "Race, Place, and Space in Democratic Politics", "course": "395-0", "meeting_time": ["Tu 3:30PM - 6:20PM"], "path": "/class-descriptions/4610/WCAS/POLI_SCI/395-0/24425", "instructor": ["Thomas Kenneth Ogorzalek"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>Auditing not permitted<br/><br/>Department Majors Only<br/><br/>Juniors/Seniors Only<br/><br/>", "id": "24425", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "Political Science 395, Winter 2016, Professor Jordan Gans-Morse \"Politics of Corruption\"<br/>What is corruption? How does it affect politics, economics, and the overall quality of life around the world?  This course explores these and related questions.  The first part of the course investigates various types of corruption - such as bribery, vote buying, and financial kickbacks - with a focus on recent examples from numerous countries.  The second part of the course considers the consequences of corruption, with a particular emphasis on its impact on democracy and economic development.   The final part of the course focuses on corruption's roots and examines a variety of anti-corruption policies.", "name": "Political Research Seminar", "section": "23", "location": "Scott Hall 201 Ripton Room", "topic": "Politics of Corruption", "course": "395-0", "meeting_time": ["We 9:00AM - 11:50AM"], "path": "/class-descriptions/4610/WCAS/POLI_SCI/395-0/24426", "instructor": ["Jordan Luc Gans-Morse"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>Auditing not permitted<br/><br/>", "id": "24426", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "Prof. Jackie Stevens \"The rule of law\" Winter 2016<br/>\"The rule of law\" is a phrase used to imply a range of expectations subjects or citizens hold of their governments and each other.  This course will explore the origins of the concept, and read selected political and legal theorists reflecting on the relation between the form and content of law and the use of violence and civil penalties to maintain order, develop a national or religious identity, and instantiate individual rights in modernity.  The course will focus on the jurisprudence of statutory interpretation, with special attention to U.S. laws that constrain government authority.  We will read current laws, regulations, and court opinions as well as texts by Max Weber, Hans Kelsen, Walter Benjamin, Carl Schmitt, Franz Kafka, Jacques Derrida, and Michel Foucault.", "name": "Political Research Seminar", "section": "24", "location": "Scott Hall 212", "topic": "The Rule of Law and Its Critics", "course": "395-0", "meeting_time": ["We 2:00PM - 4:50PM"], "path": "/class-descriptions/4610/WCAS/POLI_SCI/395-0/24427", "instructor": ["Jacqueline   Stevens"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>Auditing not permitted<br/><br/>", "id": "24427", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "Political Science 395, Winter 2016, Professor Andrew Roberts, \"Fixing the US Constitution\"<br/>This class will consider to what extent the US Constitution is flawed and needs repair. It will consider key provisions in the Constitution and their effects on politics. It will then begin to look at constitutional designs from around the world to find potential solutions to these problems. The class will be conducted in seminar format with frequent in-class debates. The culmination of the class is a major seminar paper of 15-20 pages which will propose a change to the US Constitution and evaluate its potential effects.", "name": "Political Research Seminar", "section": "25", "location": "Scott Hall 107 Burdick Room", "topic": "Fixing the U.S. Constitution", "course": "395-0", "meeting_time": ["Tu 9:00AM - 11:50AM"], "path": "/class-descriptions/4610/WCAS/POLI_SCI/395-0/24428", "instructor": ["Andrew L Roberts"], "class_attributes": "", "id": "24428", "subject": "POLI_SCI"}]