[{"school": "WCAS", "overview_of_class": "Geographic Information Systems (GIS) are computer systems that allow users to construct, visualize, and analyze geospatial data. While its use is trans-disciplinary, the course will focus on how to apply GIS techniques to important scientific questions in the environmental sciences. Specifically, students are introduced to exemplar problems in climate science, hydrology, geochemistry, and ecology that require geospatial analysis. Using these authentic scientific tasks as a motivational context, students learn the basic techniques for both acquiring and analyzing vector (i.e., points, lines, polygons) and raster (i.e., gridded) datasets. This includes spatial data acquired from field measurements using Global Positioning System (GPS), airborne / spaceborne remote sensing, and other mapping techniques. Data is primarily analyzed using the professional standard in GIS software - ArcGIS. However, instruction will be conducted such that skills can be readily extended to other GIS platforms. Furthermore, quantitative analyses in ArcGIS will be coordinated with analyses using other quantitative software (e.g., Matlab). Instruction will assume no prior experience using these specialized software packages. However, basic computer proficiency is expected of incoming students.", "name": "Special Topics in Earth and Planetary Science", "section": "01", "topic": "Geographic Infomation Systems", "course": "390-0", "meeting_time": ["TuTh 3:30PM - 6:00PM"], "path": "/class-descriptions/4610/WCAS/EARTH/390-0/23257", "instructor": ["Matthew William Rossi"], "id": "23257", "subject": "EARTH"}, {"school": "WCAS", "overview_of_class": "Are microbes important to the Earth System? Yes! This course will explore the fundamental controls on distribution, diversity, and activity of microbes across the Earth. We will focus on the dynamics within and between populations including ecological interactions between microbes and other microbes, higher organisms, and geochemical fluxes. The course will culminate in a survey of the ecology of microbe-rich environments on Earth today including the ocean, soils, the subsurface, extreme environments, and the human body!", "name": "Special Topics in Earth and Planetary Science", "section": "02", "topic": "Microbial Ecology", "course": "390-0", "meeting_time": ["MoWeFr 12:00PM - 12:50PM"], "path": "/class-descriptions/4610/WCAS/EARTH/390-0/23258", "instructor": ["Magdalena Rose Osburn"], "id": "23258", "subject": "EARTH"}, {"school": "WCAS", "overview_of_class": "Topic: Outer Solar System Satellites <br/> <br/><br/>This seminar examines the diverse satellites of Saturn and Jupiter. These worlds of fire and ice, young and old, split personalities, and relationships with planetary rings, have dramatically changed many of our ideas. We will cover their discovery and role in the history of sciences, physical characteristics, recent probes and findings, as well as theories for their evolution and tectonic activity. Also included, planning for future missions to outer solar system satellites to understand the formation of our solar system and additionally the search for life beyond the terrestrial planets. Recent results from Pluto will be highlighted in the seminar.", "name": "Special Topics in Earth and Planetary Science", "section": "03", "topic": "Outer Solar System Satellites", "course": "390-0", "meeting_time": ["MoWe 3:00PM - 4:50PM"], "path": "/class-descriptions/4610/WCAS/EARTH/390-0/28056", "instructor": ["Donna M Jurdy"], "id": "28056", "subject": "EARTH"}]