[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Parkes Hall 222"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Sociology/MORS PhD Students", "qtr": "Winter 2017", "name": "24697", "title": "WCAS SOCIOL 403-0-20 Field Methods", "class_attributes": "", "section": "24697", "instructors": [{"instructor_phone": "847/491-3495", "instructor_name": "Gary A Fine", "instructor_addr": "1810 Chicago Ave. Rm. 221"}], "topic": "", "course": "403-0", "descriptions": [{"name": "Overview of class", "value": "The problem with learning to do fieldwork is that you need to learn everything all at once. Fieldwork defies compartmentalization or much setting of priorities. For the most part, people learn to do fieldwork rather than being taught to do it. On the theory that learning to do fieldwork is more a matter of being socialized rather than of learning techniques, the course is arranged to provide a concentrated exposure to fieldwork. Through your own and your colleagues' field experiences and four quite different books by fieldworkers, you will be exposed to a wide variety of field settings. These monographs and your own experiences will also provide us with a common base to draw on in reflecting on the methodological and ethical issues addressed in the pieces on how to do fieldwork and ethnographic writing."}, {"name": "Teaching Method", "value": "largely discussion"}, {"name": "Evaluation Method", "value": "based primarily on written work (weekly fieldnotes, weekly memos, final paper); attendance and participation required; no p/n"}, {"name": "Class Materials (Required)", "value": "Tentative booklist. Please confirm all books before purchase:<br/><br/><br/>Emerson, Contemporary Field Research<br/><br/>Emerson, Fretz, and Shaw, Writing Ethnographic Fieldnotes<br/><br/>Feldman, Bell, and Berger, Gaining Access<br/><br/>Fine, Morel Tales<br/><br/>Heimer and Staffen, For the Sake of the Children<br/><br/>Pattillo, Black Picket Fences<br/><br/>Stevens, Kingdom of Children"}], "lmod": "12/29/16 7:05 PM (CT)", "subject": "SOCIOL"}]