[{"school": "WCAS", "overview_of_class": "A casual consideration of the fields of fine arts and science might suggest that they are completely unrelated disciplines. However if one looks more closely one discovers that art and science have developed in parallel fashion throughout history. Capabilities in the art world have changed dramatically due to scientific invention. Perhaps more surprisingly some aspects of scientific research have been driven by the need for new capabilities originally expressed from the art world. This seminar will consider the intimate relationship between chemistry and fine arts from the point of view of the evolution of capabilities through history, the evolution (or degradation) of individual works of art with time, the importance of chemistry in detecting art forgery, and the adverse effects of the link between art and science on economy and personal and environmental health.", "name": "First-Year Seminar", "section": "02", "topic": "Chemistry of Art:Color,Forgery&amp; Effects on Society", "course": "105-6", "meeting_time": ["TuTh 9:30AM - 10:50AM"], "path": "/class-descriptions/4640/WCAS/CHEM/105-6/10752", "instructor": ["Frederick J Northrup"], "id": "10752", "subject": "CHEM"}, {"school": "WCAS", "overview_of_class": "In The Chemistry of Food we will explore the chemistry and science of nutrition, cooking, food preservation, flavoring, coloring, and aroma. We will explore the science of salt, sugar &amp; high fructose corn syrup, leavening agents, microwaves, proteins, and fats. What is the science behind genetically modified foods and why is it so controversial? What is celiac disease and gluten sensitivity? Is gluten sensitivity real? What does the science say? These questions, and more, will be explored through readings that will include the textbooks listed below. Grades will be based on class participation and short writing assignments, four papers based on the readings, and a final term paper.", "name": "First-Year Seminar", "section": "03", "topic": "The Chemistry of Food", "course": "105-6", "meeting_time": ["MoWeFr 11:00AM - 11:50AM"], "path": "/class-descriptions/4640/WCAS/CHEM/105-6/10753", "instructor": ["Owen P Priest"], "id": "10753", "subject": "CHEM"}]