[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "ANTHRO Sem Rm B07 - 1810 Hinmn"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "31954", "title": "WCAS ANTHRO 390-0-24 Topics In Anthropology", "class_attributes": "", "section": "31954", "instructors": [{"instructor_phone": "", "instructor_name": "Stefanie Toney Graeter", "instructor_addr": "Room 105, 1812 Hinman"}], "topic": "Toxicity, Politics, and Slow Violence", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "From Chernobyl and Bhopal to Deep Water Horizon and Flint, Michigan toxicity looms as a persistent, uncertain, and often-intangible hazard throughout the world. The production and use of infrastructure, warfare, energy, agriculture, and everyday commodities present the potential for both massive chemical disasters as well as daily, long-term toxic exposure or what scholars refer to as &quot;slow violence.&quot; This seminar examines the commodity chains, political controversies, fraught science, social movements, racial discrimination, and economic inequalities connected to the toxins we live with. Our ethnographic and historical case studies will cover diverse regions and contexts including: mining in Latin America and Indonesia, the Bhopal and Chernobyl disasters, nuclear energy and warfare, oil extraction and fracking, urban lead exposure in Michigan and Chicago, pesticides in the Caribbean, industrial runoff in Japan, work place exposures in the US and more."}, {"name": "Teaching Method", "value": "Seminar-style (guided discussion). <br/>PowerPoint usage minimal<br/>Occasional film selections<br/>Screen-free classroom unless permission previously granted"}, {"name": "Evaluation Method", "value": "Class Participation: 25%<br/>Reading Responses: 20%<br/>Midterm Paper: 30%<br/>Final Exam: 25%"}, {"name": "Class Materials (Required)", "value": "A course reader, including excerpts from the following books or similar articles. 1-2 of them may be chosen as case studies and read in their entirety: <br/><br/>Rachel Carson, &quot;Silent Spring.&quot;<br/>Adriana Petryna, &quot;Life Exposed: Biological Citizens after Chernobyl.&quot;<br/>Brett Walker, &quot;Toxic Archipelago: A History of Industrial Disease in Japan.&quot;<br/>Kate Brown, &quot;Plutopia: Nuclear Families, Atomic Cities, and the Great Soviet and American Plutonium Disasters.&quot;<br/>Joseph Masco, &quot;The Nuclear Borderlands: The Manhattan Project in Post-Cold War New Mexico.&quot; <br/>Michelle Murphy, &quot;Sick Building Syndrome and the Problem of Uncertainty: Environmental Politics, Technoscience, and Women Workers.&quot;<br/>Kim Fortun, &quot;Advocacy after Bhopal: Environmentalism, Disaster, New Global Orders.&quot;<br/>Gabrielle Hecht, &quot;Being Nuclear: Africans and the Global Uranium Trade.&quot;<br/>Fabiana Li, &quot;Unearthing Conflict: Corporate Mining, Activism, and Expertise in Peru.&quot;<br/>Melissa Checker, &quot;Polluted Promises: Environmental Racism in a Southern Town.&quot;"}, {"name": "Class Notes", "value": "Course Requirements:<br/>50-80 pages of reading per/week<br/>Active participation in class<br/>Weekly reading responses<br/>Midterm paper (6-8 pages)<br/>Final exam"}], "lmod": "4/3/16 7:43 PM (CT)", "subject": "ANTHRO"}]