[{"school": "SoC", "overview_of_class": "The Tempest seems to sweep us away to another world: an island of shape-shifting spirits, mysterious music, magic, and romance. And yet for many readers and audiences, the play also seems to reflect Western colonial history in uncanny ways. Owing partly to its politically charged blend of imagination and history, The Tempest has long been among the most popular plays in Shakespearean performance, criticism, and adaptation. It has been revisited and revised by myriad artists and thinkers over the course of more than four hundred years. This course will explore the play's potential for spectacle, its compelling themes and conflicts, and its political pertinence through the \"original\" First Folio text and several of the play's numerous, widely varied adaptations on stage and beyond: in films, novels, musicals, paintings, and more. We will pay special attention to the characters of Caliban, Miranda, and Prospero, and how performances and interpretations of them represent and/or intervene in politics of race, gender, sexuality, and colonialism. Assessments will include attendance and discussion, presentations, a midterm essay, and a final project.", "name": "Special Topics in History", "section": "20", "location": "Wirtz 240 Seminar Room 2", "topic": "Shakespeare and Adaptation", "course": "366-0", "meeting_time": ["MoWe 11:00AM - 12:20PM"], "path": "/class-descriptions/4650/SoC/THEATRE/366-0/24966", "instructor": ["Benjamin Thomas Hilb"], "class_attributes": "", "id": "24966", "subject": "THEATRE"}, {"school": "SoC", "overview_of_class": "This course will focus on the role of the dramaturg as researcher and collaborator in the theatrical profession. Students will work on applying research to real world production situations, and they will practice writing for different audiences (Artistic Directors, subscription audiences, student groups, etc.). In a new twist, it will be taught in collaboration with the Graduate Dramaturgy course taught by Dassia Posner, and there will be one coordinated project between the two classes, as well as shared guest speakers. For their final project, students will create study guides for a production of their choice.", "name": "Special Topics in History", "section": "23", "location": "Wirtz 240 Seminar Room 2", "topic": "Dramaturgy", "course": "366-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4650/SoC/THEATRE/366-0/24968", "instructor": ["Roxane H Heinze-Bradshaw"], "class_attributes": "", "id": "24968", "subject": "THEATRE"}, {"school": "SoC", "overview_of_class": "", "name": "Special Topics in History", "section": "24", "location": "Wirtz 215 Instruct Black Box 3", "topic": "Plays of Suzan Zeder", "course": "366-0", "meeting_time": ["Th 3:00PM - 5:50PM"], "path": "/class-descriptions/4650/SoC/THEATRE/366-0/27515", "instructor": ["Rives B Collins"], "class_attributes": "", "id": "27515", "subject": "THEATRE"}]