[{"class_mtg_info": [{"meet_t": "Fr 9:30AM - 12:30PM", "meet_l": "Ford Eng Design Cntr G-201"}], "school": "SoC", "overview_of_class": "Information -> Design -> Response<br/>Communication design is the intentional design of information to motivate a response. Communication design relies on a combination of the senses (hearing, sight, touch, sound, and taste) to attract attention.<br/>This studio course will introduce you to the fundamentals of communication design. You will practice individual techniques and how you might layer the techniques to hone your message. Once you achieve mastery in these techniques, you can choose the appropriate technique to suit the information you are communicating.<br/>In the process of learning techniques of communication design, you will also learn the design process. The design process emphasizes collaboration and rapid iteration - expressing and testing ideas with an audience in a virtuous cycle.  You will develop this understanding through studio critique and in-class and out of class assignments.   The class will lay the foundation for productive and creative use of design in communication.<br/>Aims<br/>? To facilitate a range of communication skills that encourage you to express your creativity in a practical and imaginative way using a variety of forms: spoken, written, and visual.<br/>? To develop the cognitive and practical skills associated with communication graphics, problem solving, and critical thinking.<br/>? To develop your capacity and ability in the area of visual-spatial reasoning<br/>? To provide a learning environment where you can plan, organize, and present appropriate communication design solutions using a variety of skills, techniques, and media<br/>? To develop an appreciation for, and understanding of, aesthetic principles and their importance in the designed environment.<br/>Learning Objectives<br/>The objectives of this course are to develop your knowledge, understanding, skills, and competencies in Communication Design, while fostering the use of communication design in problem solving.<br/>Upon completion of the course, you should be:<br/>? Familiar with the principles, concepts, terminology, and methodologies associated with communication design (ex. typography, hierarchy, grid)<br/>? Able to apply the principles of communication design to a variety of concrete and abstract communication problems.<br/>? Able to model, in two dimensions, communication design problems and solutions, using a range of appropriate techniques and media.<br/>? Appreciative of the role of communication design in the visual communication of ideas.<br/>? Able to freehand sketch, in two dimensions, as a means of communication and as an aid to spatial reasoning and refinement<br/>? Able to evaluate design solutions and solve design problems on the basis of sound aesthetic principles and to appreciate the impact of design on the visual quality of the human environment.<br/>? Able to constructively and respectfully critique communication design work recognizing strengths and opportunities for improvement.<br/>Topics Covered<br/>? Design Process<br/>? Professional Practice<br/>? Typography<br/>? Grid<br/>? Hierarchy<br/>? Photography<br/>? 2D Sketch<br/>? Visualization<br/>? Storyboarding<br/>? Video Sketch<br/>Course Structure<br/>This course has several learning objectives - all packed into 10 short weeks. It is extremely important that you stay on top of the reading and assignments. Parts of this course will be new and challenging for many of you; for this reason, class time has been allotted to work through some of the design exercises with the instructor and peers close at hand. The tradeoff, however, is that you are expected to complete out of classroom assignments with great care. This class is designed to stretch you! Work with your more experienced classmates outside of class and be ready with questions when you arrive. If you don't try to complete the exercises ahead of time, you are likely to miss the benefit of in class studio critiques.<br/>? Reading/Viewing Assignments<br/>? Almost every class will have a required readings/video to prepare you for the learning we will do together. Readings draw from the textbook, Joel Katz's Designing Information, Buxton's Sketching User Experiences, videos, and articles linked on the website.<br/>? Class Meetings<br/>? Class meetings will incorporate group discussion, group critique, design exercises, and studio time to work with help from the instructor and colleagues.<br/>? Assignments<br/>? You will work throughout the course to create individual assignments that will result in a final portfolio due at the end of class. You are encouraged to revise your assignments after the studio critique.<br/>? Tutorials<br/>? Students will lead 1-hour tutorials on software to teach those unfamiliar with new communication design software on Tuesdays when the Segal Design Lecture is not occurring<br/>Field Trips<br/>? Students will visit two design firms (small and large) in Chicago to learn about professional communication design and human centered design practice.", "qtr": "Winter 2016", "name": "Special Topics Research Seminar", "title": "SoC MTS 525-0-20 Special Topics Research Seminar", "lmod": "1/9/16 6:39 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Elizabeth M Gerber", "instructor_addr": ""}], "topic": "Communication Design", "course": "525-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Information -&gt; Design -&gt; Response<br/>Communication design is the intentional design of information to motivate a response. Communication design relies on a combination of the senses (hearing, sight, touch, sound, and taste) to attract attention.<br/>This studio course will introduce you to the fundamentals of communication design. You will practice individual techniques and how you might layer the techniques to hone your message. Once you achieve mastery in these techniques, you can choose the appropriate technique to suit the information you are communicating.<br/>In the process of learning techniques of communication design, you will also learn the design process. The design process emphasizes collaboration and rapid iteration - expressing and testing ideas with an audience in a virtuous cycle. You will develop this understanding through studio critique and in-class and out of class assignments. The class will lay the foundation for productive and creative use of design in communication.<br/>Aims<br/>? To facilitate a range of communication skills that encourage you to express your creativity in a practical and imaginative way using a variety of forms: spoken, written, and visual.<br/>? To develop the cognitive and practical skills associated with communication graphics, problem solving, and critical thinking.<br/>? To develop your capacity and ability in the area of visual-spatial reasoning<br/>? To provide a learning environment where you can plan, organize, and present appropriate communication design solutions using a variety of skills, techniques, and media<br/>? To develop an appreciation for, and understanding of, aesthetic principles and their importance in the designed environment.<br/>Learning Objectives<br/>The objectives of this course are to develop your knowledge, understanding, skills, and competencies in Communication Design, while fostering the use of communication design in problem solving.<br/>Upon completion of the course, you should be:<br/>? Familiar with the principles, concepts, terminology, and methodologies associated with communication design (ex. typography, hierarchy, grid)<br/>? Able to apply the principles of communication design to a variety of concrete and abstract communication problems.<br/>? Able to model, in two dimensions, communication design problems and solutions, using a range of appropriate techniques and media.<br/>? Appreciative of the role of communication design in the visual communication of ideas.<br/>? Able to freehand sketch, in two dimensions, as a means of communication and as an aid to spatial reasoning and refinement<br/>? Able to evaluate design solutions and solve design problems on the basis of sound aesthetic principles and to appreciate the impact of design on the visual quality of the human environment.<br/>? Able to constructively and respectfully critique communication design work recognizing strengths and opportunities for improvement.<br/>Topics Covered<br/>? Design Process<br/>? Professional Practice<br/>? Typography<br/>? Grid<br/>? Hierarchy<br/>? Photography<br/>? 2D Sketch<br/>? Visualization<br/>? Storyboarding<br/>? Video Sketch<br/>Course Structure<br/>This course has several learning objectives - all packed into 10 short weeks. It is extremely important that you stay on top of the reading and assignments. Parts of this course will be new and challenging for many of you; for this reason, class time has been allotted to work through some of the design exercises with the instructor and peers close at hand. The tradeoff, however, is that you are expected to complete out of classroom assignments with great care. This class is designed to stretch you! Work with your more experienced classmates outside of class and be ready with questions when you arrive. If you don't try to complete the exercises ahead of time, you are likely to miss the benefit of in class studio critiques.<br/>? Reading/Viewing Assignments<br/>? Almost every class will have a required readings/video to prepare you for the learning we will do together. Readings draw from the textbook, Joel Katz's Designing Information, Buxton's Sketching User Experiences, videos, and articles linked on the website.<br/>? Class Meetings<br/>? Class meetings will incorporate group discussion, group critique, design exercises, and studio time to work with help from the instructor and colleagues.<br/>? Assignments<br/>? You will work throughout the course to create individual assignments that will result in a final portfolio due at the end of class. You are encouraged to revise your assignments after the studio critique.<br/>? Tutorials<br/>? Students will lead 1-hour tutorials on software to teach those unfamiliar with new communication design software on Tuesdays when the Segal Design Lecture is not occurring<br/>Field Trips<br/>? Students will visit two design firms (small and large) in Chicago to learn about professional communication design and human centered design practice."}, {"name": "Class Materials (Required)", "value": "None"}], "path": "/class-descriptions/4610/SoC/MTS/525-0/26802", "instructor": ["Elizabeth M Gerber"], "class_attributes": "", "id": "26802", "subject": "MTS"}, {"class_mtg_info": [{"meet_t": "Th 3:00PM - 5:50PM", "meet_l": "Annenberg Hall G29"}], "school": "SoC", "overview_of_class": "This course explores various trajectories and developments that shape research, scholarship, and literature in Media, Technology, and Society. In part, this course takes an historical approach and selectively examines past research in the field. Another component of this course includes selectively examining various topics, themes, issues, and concerns that have attracted attention from scholars in the past, and continue to attract attention today. Yet another component of this course selectively examines changes over time in scholarship related to Media, Technology, and Society: how ideas and interests of scholars can rise, can fade, and can be transformed. Students will produce a research project relevant to their own research interests, in consultation with the instructor.", "qtr": "Winter 2016", "name": "Special Topics Research Seminar", "title": "SoC MTS 525-0-21 Special Topics Research Seminar", "lmod": "1/9/16 6:39 PM (CT)", "section": "21", "instructors": [{"instructor_phone": "", "instructor_name": "James J Schwoch", "instructor_addr": ""}], "topic": "The Shaping of Scholarship", "course": "525-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "This course explores various trajectories and developments that shape research, scholarship, and literature in Media, Technology, and Society. In part, this course takes an historical approach and selectively examines past research in the field. Another component of this course includes selectively examining various topics, themes, issues, and concerns that have attracted attention from scholars in the past, and continue to attract attention today. Yet another component of this course selectively examines changes over time in scholarship related to Media, Technology, and Society: how ideas and interests of scholars can rise, can fade, and can be transformed. Students will produce a research project relevant to their own research interests, in consultation with the instructor."}], "path": "/class-descriptions/4610/SoC/MTS/525-0/26803", "instructor": ["James J Schwoch"], "class_attributes": "Graduate Students Only<br/><br/>", "id": "26803", "subject": "MTS"}, {"class_mtg_info": [{"meet_t": "Tu 1:00PM - 3:50PM", "meet_l": "Frances Searle Building 1483"}], "school": "SoC", "overview_of_class": "Noshir Contractor, Northwestern University<br/>Joseph N. Cappella, University of Pennsylvania<br/>Dhavan Shah, University of Wisconsin Madison<br/> <br/>Time:         1:00-4:00 CST / 2:00-5:00 EST on Tuesdays between 1/12/16 to 5/10/16<br/>Class meetings will be synchronous across locations<br/> <br/>Schedule:   Sixteen instructional sessions are slotted on Tuesdays at the specified time during the specified dates. Each registering students is required to attend at least thirteen (13) of the sixteen (16) scheduled meetings. Given the three-hour meeting time of the seminar, that will generate 39.0 hours of instructional time at each participating institution. The formal meeting dates will be bookended with an optional kickoff meeting and an optional closing meeting. See a complete schedule below, including weeks by coordinating faculty member, topic areas, and tentative guest speaker.  <br/> <br/>Structure:  After the introductory session when we discuss goals and explore points of collaboration, each participating faculty member will be responsible for programing five sessions, with a commitment to lead at least one session and secure four leading researchers in the domain of computational social science as speakers.  Northwestern will handle the technology support, with each participating unit securing a room with a large monitor (for simulcasting), a conference calling center, and a webcam (for interaction),  Each weekly session will have one hour dedicated to hearing a presentation from a distinguished researcher on the topic, followed by an hour of Q&A and joint discussion that will include the presenter, the participating faculty, and the students from each institution.  After that, instructors will go offline for a focused session of one hour with the students at their institution.<br/>           <br/>Class will culminate with a workshop hosted at Northwestern University:<br/> <br/>June 21-22, 2016 at Evanston, IL<br/> <br/>The workshop is scheduled to preceed the  2016 International Conference on Computational Social Science, June 23-26 at Northwestern University http://www.kellogg.northwestern.edu/news-events/conference/ic2s2/2016.aspx<br/> <br/>Profile:      Students who take this class should have some familiarity with computational methods and tools, and an active research project or program that involves use of these approaches in social science inquiry.<br/> <br/>Topics:        Data acquisition, management and preparation<br/>Data ethics, retention, and privacy protections<br/>Computational approaches to language processing<br/>Computational approaches in network science<br/>Computational approaches to social media data<br/>Computational approaches to recommendation systems<br/>                    Emerging computational models and modeling tools", "qtr": "Winter 2016", "name": "Special Topics Research Seminar", "title": "SoC MTS 525-0-22 Special Topics Research Seminar", "lmod": "1/9/16 6:39 PM (CT)", "section": "22", "instructors": [{"instructor_phone": "", "instructor_name": "Noshir   Contractor", "instructor_addr": ""}], "topic": "", "course": "525-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Noshir Contractor, Northwestern University<br/>Joseph N. Cappella, University of Pennsylvania<br/>Dhavan Shah, University of Wisconsin Madison<br/> <br/>Time: 1:00-4:00 CST / 2:00-5:00 EST on Tuesdays between 1/12/16 to 5/10/16<br/>Class meetings will be synchronous across locations<br/> <br/>Schedule: Sixteen instructional sessions are slotted on Tuesdays at the specified time during the specified dates. Each registering students is required to attend at least thirteen (13) of the sixteen (16) scheduled meetings. Given the three-hour meeting time of the seminar, that will generate 39.0 hours of instructional time at each participating institution. The formal meeting dates will be bookended with an optional kickoff meeting and an optional closing meeting. See a complete schedule below, including weeks by coordinating faculty member, topic areas, and tentative guest speaker. <br/> <br/>Structure: After the introductory session when we discuss goals and explore points of collaboration, each participating faculty member will be responsible for programing five sessions, with a commitment to lead at least one session and secure four leading researchers in the domain of computational social science as speakers. Northwestern will handle the technology support, with each participating unit securing a room with a large monitor (for simulcasting), a conference calling center, and a webcam (for interaction), Each weekly session will have one hour dedicated to hearing a presentation from a distinguished researcher on the topic, followed by an hour of Q&amp;A and joint discussion that will include the presenter, the participating faculty, and the students from each institution. After that, instructors will go offline for a focused session of one hour with the students at their institution.<br/> <br/>Class will culminate with a workshop hosted at Northwestern University:<br/> <br/>June 21-22, 2016 at Evanston, IL<br/> <br/>The workshop is scheduled to preceed the 2016 International Conference on Computational Social Science, June 23-26 at Northwestern University http://www.kellogg.northwestern.edu/news-events/conference/ic2s2/2016.aspx<br/> <br/>Profile: Students who take this class should have some familiarity with computational methods and tools, and an active research project or program that involves use of these approaches in social science inquiry.<br/> <br/>Topics: Data acquisition, management and preparation<br/>Data ethics, retention, and privacy protections<br/>Computational approaches to language processing<br/>Computational approaches in network science<br/>Computational approaches to social media data<br/>Computational approaches to recommendation systems<br/> Emerging computational models and modeling tools"}], "path": "/class-descriptions/4610/SoC/MTS/525-0/26804", "instructor": ["Noshir   Contractor"], "class_attributes": "", "id": "26804", "subject": "MTS"}]