[{"school": "JOUR", "overview_of_class": "This course, taught by Bloomberg News Editor-in-Chief Emeritus <br/>Matthew Winkler, will focus on the principles of reporting, writing and applied business and economic knowledge that helped transform Bloomberg News over the last quarter century. The class will develop an individual's reporting skills, offering the opportunity to work with Bloomberg reporters and editors and will include visits to the company's office in Chicago. Students will additionally learn to demonstrate that the story of the economy, business and markets is recorded best when the focus is on the greatest diversity of participants.", "name": "Special Topics", "section": "20", "location": "Fisk Hall 307", "topic": "The Bloomberg Way", "course": "390-0", "meeting_time": ["We 1:00PM - 3:50PM"], "path": "/class-descriptions/4640/JOUR/JOUR/390-0/17406", "instructor": ["Elizabeth   Bennett"], "class_attributes": "No Freshmen<br/><br/>", "id": "17406", "subject": "JOUR"}, {"school": "JOUR", "overview_of_class": "This course will examine issues relating to the organization of the Internet and the response by the US government and private industry to cyberthreats. Students will be introduced to legal concepts relating to the private sector and civilian government engagement in cyberspace. The course will also include an examination of the application of traditional laws of armed conflict to the new cyber domain and the differing approach to cyber issues in other countries.<br/>Goals: increased ability to cover these issues; production of an in-depth story on a cybersecurity issue.", "name": "Special Topics", "section": "21", "location": "Meets in Non-General PurposeRm", "topic": "Covering Cybersecurity and Surveillance", "course": "390-0", "meeting_time": ["Th 9:00AM - 11:50AM"], "path": "/class-descriptions/4640/JOUR/JOUR/390-0/17407", "instructor": ["Mary Ellen   Shearer"], "class_attributes": "Registration is By Application Only<br/><br/>", "id": "17407", "subject": "JOUR"}, {"school": "JOUR", "overview_of_class": "Native American Environmental Issues and the Media introduces students to indigenous issues, such as treaty-based hunting, fishing, and gathering rights; air and water quality issues; mining; land-to-trust issues; and sacred sites. These issues have contributed to tension between Native and non-Native communities and have become the subject of news reports, in both mainstream and tribal media. We will focus on how the media cover these issues and how that coverage contributes to the formation of public opinion and public policy. Students will read and analyze newspaper and on-line news reports and view and critique broadcast news stories and documentaries about Native environmental topics.", "name": "Special Topics", "section": "22", "location": "McCormick Foundation Ctr 2107", "topic": "Native American Environmental Issues and the Media", "course": "390-0", "meeting_time": ["TuTh 10:30AM - 12:20PM"], "path": "/class-descriptions/4640/JOUR/JOUR/390-0/17408", "instructor": ["Patricia Ann Loew"], "class_attributes": "No Freshmen<br/><br/>", "id": "17408", "subject": "JOUR"}, {"school": "JOUR", "overview_of_class": "journalistic and non-news digital platforms ? we will learn what makes a story powerful. We'll see how the masters of storytelling appeal to our senses and take us on a journey that helps an audience understand a complex issue or cause. We'll look at how character, images and a careful plotting of story beats affect the viewer ? in documentary shorts, short videos for NGOs as well as political and corporate image pieces. Coursework will include readings, classroom discussions, analyses of stories and a final project, done in groups, producing a video story for a local client.", "name": "Special Topics", "section": "25", "location": "Fisk Hall 308", "topic": "The Art of Persuasive Video Storytelling", "course": "390-0", "meeting_time": ["MoWe 12:00PM - 1:50PM"], "path": "/class-descriptions/4640/JOUR/JOUR/390-0/17436", "instructor": ["Craig Weldon Duff"], "class_attributes": "Prerequisites apply, see description<br/><br/>", "id": "17436", "subject": "JOUR"}, {"school": "JOUR", "overview_of_class": "Each quarter, multidisciplinary teams of students, faculty, and professionals come together to collaborate in the Knight Lab to produce cutting-edge digital work, research, thought?innovating across every part of the media-making process. The Student Lab places journalism and computer science students together on teams to work on an important problem for the future of media, rapidly moving beyond conversation and hypothesis to well-reasoned action during the quarter. Each project is scoped for a single quarter but students are encouraged to join the lab for multiple quarters. Students will work closely with faculty and professional mentors along the way. Our process combines research, design thinking, building, user testing, critical and analytical work, storytelling, cutting-edge technology, and experimentation?often within the confines of a single, specific problem. Come to learn, experiment, and create the future of media with us.", "name": "Special Topics", "section": "26", "location": "Meets in Non-General PurposeRm", "topic": "Knight Lab", "course": "390-0", "meeting_time": ["TuTh 2:30PM - 4:20PM"], "path": "/class-descriptions/4640/JOUR/JOUR/390-0/17442", "instructor": ["Zach   Wise", "Emily Lauren Withrow"], "class_attributes": "No Freshmen<br/><br/>", "id": "17442", "subject": "JOUR"}, {"school": "JOUR", "overview_of_class": "Since the first days of the Internet, Chicago has been home to fascinating startup businesses at the intersection of media and technology. In this course, students will study the pros and cons of locating an innovative new business in the Chicago area; examine products and services that are being built and tested here today; analyze the choices that are being made by media companies, tech entrepreneurs, and investors; and observe how the general public learns about these businesses. Course work includes readings, lectures by faculty and guest speakers, several field trips with associated reporting, and a final team project.", "name": "Special Topics", "section": "27", "location": "Fisk Hall B11", "topic": "Media Innovation and Chicago's Startup Culture", "course": "390-0", "meeting_time": ["TuTh 2:00PM - 4:20PM"], "path": "/class-descriptions/4640/JOUR/JOUR/390-0/17453", "instructor": ["Owen R Youngman", "William David Swislow", "Carol Fowler Klobucar"], "class_attributes": "", "id": "17453", "subject": "JOUR"}]