[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Ford Eng Design Cntr ITW 1350"}], "school": "MEAS", "overview_of_class": "Product or system design projects carried out by small student groups. Project definition, conceptual and detailed design, evaluation, and documentation.<br/><br/>WHO TAKES IT<br/>Nobel Prize winner Herbert Simon said, \"Science is the study of what is. Engineering is the creation of what is to be.\" The essence of engineering is design. Most engineers work on some sort of product development, whether it be creating new products or making better products, all based on a fairly well-defined design process. In ME 398, student teams create a new product for an outside client using this design process. Undergraduates take this course in their fourth year, after having mastered many of the engineering tools that they will use in their careers. Mechanical engineering students are required to take either this course or ME 340-2 to fulfill their design requirement. Two former students in this course went on to win the iF Product Design Award in an international design competition based in Germany for their design of the Swingline Worx Mini Stapler in 2000.", "qtr": "Fall 2017", "name": "Engineering Design - Senior Capstone, Quarter 1", "title": "MEAS MECH_ENG 398-1-1 Engineering Design - Senior Capstone, Quarter 1", "lmod": "9/12/17 6:43 PM (CT)", "section": "1", "topic": "", "course": "398-1", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Product or system design projects carried out by small student groups. Project definition, conceptual and detailed design, evaluation, and documentation.<br/><br/>WHO TAKES IT<br/>Nobel Prize winner Herbert Simon said, \"Science is the study of what is. Engineering is the creation of what is to be.\" The essence of engineering is design. Most engineers work on some sort of product development, whether it be creating new products or making better products, all based on a fairly well-defined design process. In ME 398, student teams create a new product for an outside client using this design process. Undergraduates take this course in their fourth year, after having mastered many of the engineering tools that they will use in their careers. Mechanical engineering students are required to take either this course or ME 340-2 to fulfill their design requirement. Two former students in this course went on to win the iF Product Design Award in an international design competition based in Germany for their design of the Swingline Worx Mini Stapler in 2000."}, {"name": "Registration Requirements", "value": "Senior Standing"}, {"name": "Learning Objectives", "value": "The course provides an experience in the creative aspects of design from project definition to ideation to functional prototypes. Industry sponsored projects are carried by student groups. Throughout the 10-week period, students will have the opportunity to experience the entire process of design, including defining product specifications, developing creative design ideas, evaluating design concepts based on engineering analysis, describing the detailed design using CAD drawings, and building physical prototypes to demonstrate feasibility. Former students in this course won various product design awards, such as the international design competition based in Germany and the Margaret and Muir Frey Memorial Prize for Innovation and Creativity at Northwestern University."}, {"name": "Evaluation Method", "value": "Assignments/evaluations may include prototypes, oral presentations, interim reports, final reports, and quizzes or exams."}, {"name": "Class Materials (Suggested)", "value": "Product Design and Development, Ulrich and Eppinger, McGraw Hill, 6th edition, 978-0078029066.<br/>Lecture Notes<br/>Design Notebook"}, {"name": "Class Notes", "value": "Advanced Study<br/><br/>Students interested in pursuing further study in product design development should consider the Engineering Design and Innovation (EDI) program or the Master of Product Development (MPD) program at Northwestern University. EDI is a program for the recent engineering graduate, while MPD is designed for working professionals and requires at least 3 years of work experience."}], "instructor": ["David W Gatchell", "Michael Joseph Beltran"], "class_attributes": "", "id": "13095", "subject": "MECH_ENG"}]