[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Technological Institute M345"}], "school": "WCAS", "overview_of_class": "This course provides an overview of the physical processes governing environmental systems, from the Earth's lithosphere to hydrosphere to atmosphere. We will cover internal and external sources of energy to the Earth system; the processes from tectonic to atmospheric that are driven by that energy; and some human impacts on the resulting environmental systems. Students will gain physical science perspectives on current debates about environmental issues, such as those over water resources, energy, and climate change", "qtr": "Spring 2016", "name": "Earth: A Habitable Planet", "title": "WCAS ENVR_SCI 201-0-20 Earth: A Habitable Planet", "lmod": "4/3/16 7:59 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "847.491.7460", "instructor_name": "Patricia A Beddows", "instructor_addr": "Tech F285"}], "topic": "", "course": "201-0", "enrl_requirement": "Enrollment Requirements: Pre-requisite: Students must have completed CHEM 103 to enroll in this course.", "descriptions": [{"name": "Overview of class", "value": "This course provides an overview of the physical processes governing environmental systems, from the Earth's lithosphere to hydrosphere to atmosphere. We will cover internal and external sources of energy to the Earth system; the processes from tectonic to atmospheric that are driven by that energy; and some human impacts on the resulting environmental systems. Students will gain physical science perspectives on current debates about environmental issues, such as those over water resources, energy, and climate change"}, {"name": "Learning Objectives", "value": "Upon completion of this course students will be able to: <br/>· Describe the bio-geo-physico-chemical processes that maintain the Earth in a homeostatic and dynamic state. <br/>· Recognize the complexity of the Earth system and the interdependence of environmental processes. <br/>· Apply a scientific approach to the investigation of events in daily life. <br/>· Analyze a specific environmental situation within a large context. <br/>· Assess how current and future human activities may affect the Earth System. <br/><br/>For the engineering student, the course primarily supports the following ABET program outcome criteria: <br/>(a) An ability to apply knowledge of Earth science. <br/>(h) The broad education necessary to understand the impact of engineering solutions in a global, economic, environmental and social context. <br/>(i) A recognition of the need for, and an ability to engage in life-long learning <br/>(j) A knowledge of contemporary issues."}, {"name": "Teaching Method", "value": "Class will be lecture-based, but class periods will also include discussions and exercises that require thoughtful student participation. Students are expected to complete all assigned reading before class in order to contribute to discussions and required in-class exercises. Lectures will highlight and expand upon the most important topics in the assigned readings, but will not cover every topic covered in readings; likewise, some topics covered in lecture will not be covered in readings. Exams will cover all of the material from both lectures and readings. Therefore, success in this class requires both careful reading of assigned materials AND alert attendance in class."}, {"name": "Class Materials (Required)", "value": "Textbook: Brian J. Skinner and Barbara W. Murck, 2011. The Blue Planet: An Introduction to Earth System Science. 3rd Edition. Publisher: John Wiley &amp; Sons. Available at the University bookstore, online used and new, and as a digital e-book. IMPORTANT: Read the 3rd Edition of this textbook, published in 2011 in hardcover (or as a digital e-book). Earth system science and environmental science evolve rapidly as new datasets emerge and Earth's environment continues to change. This means that the 2nd Edition, published in 1999, is very out-of-date on some topics."}, {"name": "Class Notes", "value": "BONUS Opportunities:<br/><br/>IPCC Report - Towards the end of the class, a bonus opportunity will be announced to provide a short paper on the Intergovernmental Panel on Climate Change report. <br/><br/>Seminars - Select seminars with topics relevant to Environmental Science will offered for your attendance, and then delivery of a summary statement. These will be announced in class as they become available through the various department seminar series. <br/><br/>Write your own examination questions! - You are encouraged to submit examination questions for the quizzes and midterm exams through CANVAS. These will be viewable by the whole class. By engaging with the material and participating in this question development, you may find that you know a good percentage of the testing material. I strongly encourage you to participate in your learning through this opportunity."}], "path": "/class-descriptions/4620/WCAS/ENVR_SCI/201-0/31043", "instructor": ["Patricia A Beddows"], "class_attributes": "Natural Sciences Distro Area<br/><br/>", "id": "31043", "subject": "ENVR_SCI"}]