[{"class_mtg_info": [{"meet_t": "MoWeFr 2:00PM - 2:50PM", "meet_l": "Technological Institute M345"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "33841", "title": "WCAS ENVR_SCI 390-0-21 Special Topics in Environmental Sciences", "class_attributes": "", "section": "33841", "instructors": [{"instructor_phone": "", "instructor_name": "Paul James Caradonna", "instructor_addr": ""}], "topic": "The Ecology of Climate Change", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "This course is designed to give students a broad scientific understanding of the causes and consequences of climate change from an ecological perspective. We will learn about the basics of climate: past, present and future. Through examination of the primary scientific literature, we will learn how individuals, populations, communities, and entire ecosystems response to changing climate conditions. We will examine the scientific evidence behind common misconceptions regarding contemporary climate change. We will learn how scientists forecast future climate conditions and climate change responses, and we will discuss what it means to be in the Anthropocene and what we can do about it."}, {"name": "Registration Requirements", "value": "None"}, {"name": "Learning Objectives", "value": "Students will be familiar with the science behind contemporary climate change and why it matters."}, {"name": "Teaching Method", "value": "DiscussionLecture"}, {"name": "Evaluation Method", "value": "Students will be evaluated based on their performance on exams, class participation, and other course assignments."}, {"name": "Class Materials (Required)", "value": "Book(s):<br/>Title: Field Notes from a Catastrophe: Man, Nature, and Climate Change<br/>Author: Elizabeth Kolbert<br/>ISBN: 9781620409886"}, {"name": "Class Materials (Suggested)", "value": "Title: Ecology of Climate Change: The Importance of Biotic Interactions<br/>Author: Eric Post<br/>ISBN: 9781499846139"}], "lmod": "2/19/17 6:48 PM (CT)", "subject": "ENVR_SCI"}]