[{"class_mtg_info": [{"meet_t": "TuTh 1:00PM - 2:50PM", "meet_l": "Helmerich Auditorium"}], "school": "SoC", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Spring 2016", "name": "31755", "title": "SoC RTVF 378-0-20 Topics in Post-Production", "class_attributes": "Prerequisites apply, see description<br/><br/>", "section": "31755", "instructors": [{"instructor_phone": "", "instructor_name": "Kyle Richard Henry", "instructor_addr": ""}], "topic": "Finishing", "course": "378-0", "descriptions": [{"name": "Overview of class", "value": "This course is designed to take ambitious student film works-in-progress beyond the assembly or first/second rough-cut stage to a finished cut that has been shaped by rigorous re-evaluation. Directors or editors MUST submit the current cut of their film via a password protected private link (e.g. Vimeo or YouTube) to the instructor via email BEFORE the first week of classes. This can either be an assembly or rough cut of any length and any genre (e.g. narrative, documentary, experimental, et al). Classes will include: feedback sessions, test-screenings, editing labs and allowing sections of your work to be re-edited by classmates in order to open the work up to further possibilities. Through readings and screenings, we will survey current festival programming to better familiarize yourself with the curatorial landscape. Additionally, you will acquire advanced finishing techniques, including color correction, sound-mixing and effects application within AVID. Students will be graded on re-cuts, class attendance/participation, and accomplishing final picture-lock."}, {"name": "Class Materials (Required)", "value": "PDF readings posted to Canvas.<br/><br/>Equipment (suggested):<br/><br/>1 x USB Flash Drive (any size/brand/vendor, aprox $7-25)<br/><br/>1 x Mac formatted USB 3 external hard drive with a spindle speed of 7200 rpm, any GB size (any brand/vendor, price varies from aprox $100-150) for your project files if you don't already have your media stored on an external drive. Do NOT store the only copy of your media on ISIS or RTVF server spaces."}], "lmod": "4/3/16 7:23 PM (CT)", "subject": "RTVF"}]