[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Locy Hall 214"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "31102", "title": "WCAS ITALIAN 349-0-20 Topics in Italian Culture and Literature", "class_attributes": "Read &amp; Discuss in language<br/><br/>", "section": "31102", "instructors": [{"instructor_phone": "", "instructor_name": "Francesca   Pola", "instructor_addr": ""}], "topic": "Contemporary Italian Culture Through Art", "course": "349-0", "descriptions": [{"name": "Overview of class", "value": "Contemporary Italian culture through art - crucial topics of identity from the 1970s to the present: the body and the city. An art history interdisciplinary course in Italian studies that focuses on two crucial topics of identity, investigating their presence and meaning in the artistic imagery of the country from the 1970s to the present, as two ideally complementary spaces: the body as the space of the private, and the city as the space of the public. The course will concentrate on artistic strategies that have been challenging the traditional definition of art as an autonomous object, transforming it into an open space of expression for pluralism and a transcultural perspective. Time-based media such as performance, video art and new media, as well as society-based and participatory practices such as interactive installation and public art will be at the core of attention. Focusing on seminal ideas, events, pieces and protagonists from the period, we will analyze how the increasing development of time-based and society-related artistic practices from the 1970s to the present day mirrors broader dynamics and changes in the Italian context and its culture. The body will be investigated both as medium and as subject of artistic expression: this will allow us to address issues of gender on a physical, psychological and cultural level through topics such as sexuality, perspective and role, as in the work of women pioneers of body art such as Gina Pane or Ketty La Rocca, or in the &quot;tableau vivant&quot; staged by Luigi Ontani.<br/>The city will be addressed both as space for interaction, sharing and action, as in Mauro Staccioli's &quot;sculture intervento&quot; (intervention sculptures) or in public art projects, and as a subject of representation and narrative, as in urban photography and video or in Studio Azzurro's immersive &quot;ambienti sensibili&quot; (sensitive environments). The interdisciplinary approach uses artworks, artists' writings, documents of any kind (from paper to video) as indexes of socio-cultural issues in connection to design, architecture, photography, music, fashion, cinema and theater."}, {"name": "Learning Objectives", "value": "The course is intended to provide the students with:<br/>- a cultural understanding of the crucial topics of body and city in Italian culture and identity from the 1970s to the present through visual art;<br/>- a knowledge of main protagonists of Italian art investigating these crucial topics from the 1970s to the present;<br/>- an ability to connect these themes and data in an interdisciplinary perspective;<br/>- an enhanced intercultural perspective on the relationship between Italian and foreign culture (especially, although not exclusively, American), both in connection to the period examined and more in general to wider crucial characteristics;<br/>- a preliminary overview on the relatively new field of digital art history sources in the field."}, {"name": "Teaching Method", "value": "Slide lectures, in-class discussions and activities, analysis of single artworks, artists' writings (with attention to both content and language characteristics), documents of any kind (photographs, printed matter, audio and visual recordings...)."}, {"name": "Evaluation Method", "value": "Attendance, assignments, participation (40%) + Term paper and its presentation to class (60%)."}, {"name": "Class Materials (Required)", "value": "Handouts will be provided for each class; students will have to take notes during lectures and discussion, and do reading and writing assignments from lesson to lesson."}, {"name": "Class Notes", "value": "Taught in Italian."}], "lmod": "4/3/16 8:10 PM (CT)", "subject": "ITALIAN"}]