[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "Kresge Centennial Hall 2-430"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "22700", "title": "WCAS ARABIC 311-2-20 Arabic IV", "class_attributes": "", "section": "22700", "instructors": [{"instructor_phone": "8474670927", "instructor_name": "Ragy H Ibrahim Mikhaeel", "instructor_addr": ""}], "topic": "", "course": "311-2", "descriptions": [{"name": "Overview of class", "value": "During this class, we will be working on developing students' reading and comprehension abilities, as well as on improving their speaking and writing abilities. <br/><br/>Students will be trained to use the grammatical concepts discussed through the drills in their writing assignments. Although Al-Kitab III is the benchmark/ principal textbook of the course, we will examine different genres from sources other than Al-kitaab. Examples include short stories , cotemporary poetry , Turath literature such as Alf Layla wa Layla, and Quranic Suras. An emphasis will be given to media news both written and visual."}, {"name": "Registration Requirements", "value": "Passing Arabic 311-1 with a C- and/or instructor's approval."}, {"name": "Learning Objectives", "value": "By the end of this quarter you will:<br/><br/>1. Have mastered the grammatical concepts covered in Al-Kitaab and learnt how to integrate them in your writing. <br/>2. Be more confident when you hold conversations with native Arabic speakers on basic topics and certain advanced topics (e.g. Politics, Culture, etc...). <br/>3. Be more familiar with the differences between the few formal settings of using MSA as spoken Arabic and everyday spoken Arabic dialects.<br/>4. Comprehend authentic literary texts currently in circulation in the Arab World <br/>( e.g. Bahaa Tahir, Youssef Idris, Tawfik Al-Hakim).<br/>5. Comprehend authentic audio/video texts: i.e. comprehend main points / ideas and understand thouroughly the more familiar topics (tentative topics: the Arabic media, Arab - Israeli conflict, Arab- American relations and Globalization and the Arab World).<br/>6. Improve your ability to comprehend rapid speech.<br/>7. Improve your writing ability to write accurate and idiomatic texts. Develop a mastery of using more diverse set of connectors than the 311-1 level."}, {"name": "Teaching Method", "value": "Lectures , presentations and discussions.<br/><br/>Language of instruction and conversation in class is entirely in Arabic. In the event that student does not understand, he/she should try to ask clarifying questions in Arabic. Personalized goals for improving writing and speaking skills of each student will be developed on individual basis based on each student's level of mastery of writing and speaking strengths and weaknesses. The course will also use examples from Arab media and both basic and advanced topics on &quot;Arabic in everyday life&quot;."}, {"name": "Evaluation Method", "value": "Midterm in class exam, Take home exams, term papers, quizzes, writing assignments based on weekly readings and class participation. "}, {"name": "Class Materials (Required)", "value": "Al-Kitaab fii Ta?allum al-?Arabiyya with DVDs: Part Three. By Kristen Brustad, Mahmoud Al-Batal and Abbas al-Tonsi. [ISBN 1-58901-149-X]. <br/><br/>Other resources covering media news and short stories and other literary genre will be provided by the instructor prior to class. Advanced grammar topics and exercises will be introduced through resources other than al-Kitaab."}, {"name": "Class Notes", "value": "By the end of the 311 sequence, You should be able to write in MSA according to the four major criteria adopted by Illinois Certification Testing System:<br/><br/>Purpose?the fulfillment of the objective of the assignment in reference to the<br/>intended audience, purpose, and occasion<br/>Organization?the organization, development, and support of ideas<br/>Vocabulary?the selected vocabulary and idiomatic expressions<br/>Grammar?the constructed grammatical forms, character formations, and<br/>syntactic constructions, including spelling, diacritical marks, and punctuation<br/><br/>An excellent response to the assignment would fully address the assigned topic and<br/>develop the topic by extensive elaboration of specific points. The message would be<br/>clearly and effectively communicated in a socioculturally appropriate manner.<br/>Ideas would be coherently presented and the flow of language would be smooth<br/>and varied in well-constructed sentences. The vocabulary used would reflect a<br/>broad command of the target language and appropriate use of idiomatic<br/>expressions. The excellent response would exhibit control of grammar, avoiding<br/>errors in syntax that interrupt communication. The response would be accurate in<br/>spelling or character formation and in use of diacritical marks and punctuation.<br/><br/>Ref.<br/>Illinois Certification Testing System<br/>STUDY GUIDE Page 47.<br/>Illinois State Board of Education<br/>An Equal Opportunity/Affirmative Action Employer<br/>Printed by the Authority of the State of Illinois<br/>Foreign Language:Arabic 137<br/>http://www.il.nesinc.com/PDFs/IL_field137_SG.pdf"}], "lmod": "12/29/16 6:53 PM (CT)", "subject": "ARABIC"}]