[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "University Hall 412"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores<br/><br/>Reserved for Freshmen and Sophomores", "qtr": "Spring 2017", "name": "34214", "title": "WCAS HISTORY 102-6-22 First-Year Seminar-American History", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "34214", "instructors": [{"instructor_phone": "", "instructor_name": "Ashley Campbell Johnson", "instructor_addr": "Harris Hall - Room L35"}], "topic": "Beyond Rosie the Riveter: Women, Wages and Politic", "course": "102-6", "descriptions": [{"name": "Overview of class", "value": "This freshman seminar explores the ways in which ordinary women entered both the political arena and the workforce during the twentieth century. Pushing beyond stereotypes of Rosie the Riveter and radical feminism, seminars will seek to answer how ordinary women, rich and poor, black and white, young and old, challenged the status quo. At times, these challenges could be categorized as political movements and other times women were simply living their lives, trying to make ends meet and survive as mothers, wives, and workers. Through speeches, memoirs, letters from the Newberry Collections, and excerpts from historical works, participants will discuss and analyze the ways ordinary women exercised rights and power through work and play, laying the groundwork for a movement of women who demanded not just the vote, but equal pay and recognition. Students will read and discuss the way women negotiated politics during the Temperance movement, how women entered the workforce, and the ways state benefits relegated many women to second-class citizenship. The class will investigate ideas about &quot;welfare queens,&quot; feminists, and women activists in 2017, questioning how women's political work may shape policy in the future."}, {"name": "Registration Requirements", "value": "GRADING BASIS - P/N"}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Class Notes", "value": "AREA OF CONCENTRATION - Americas"}], "lmod": "2/14/17 6:45 PM (CT)", "subject": "HISTORY"}]