[{"school": "SoC", "overview_of_class": "Family communication and health communication represent two areas in the communication studies field that emerged in the last quarter of the 20th Century. Currently scholars are beginning to work at the intersection of these areas with the goals of understanding and potentially altering families' interactions regarding members' health. The concept of \"health\" will be broadly interpreted, including physical and psychological health.<br/>This course addresses the intersection of family members as they address the issues of health. It will examine: (1) family theories that shed light on such interactions, (2) communication patterns that tend to emerge around certain health-related issues. This course explores the intersection of illness/disability/death and family communication. Relying on a set of theoretical frameworks. including family systems theory, topics to be addressed include: child and adult cancer, addictions, genetics, disabilities, death, cultural health norms, and health prevention practices.<br/>This course is designed specifically to focus on both academic and professional writing. Therefore the topic of writing will be addressed in most classes and assignments will be designed to foster skill development in writing for the public as well as an academic audience. This may include writing editorials, creating tweets, or pamphlets for teens. A final paper is required.", "name": "Communication Studies Research Seminar", "section": "20", "location": "Frances Searle Building 1483", "topic": "Family Comm About Health", "course": "394-0", "meeting_time": ["Tu 2:00PM - 4:50PM"], "path": "/class-descriptions/4650/SoC/COMM_ST/394-0/23537", "instructor": ["Kathleen Galvin   Wilkinson"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>Juniors Only<br/><br/>", "id": "23537", "subject": "COMM_ST"}, {"school": "SoC", "overview_of_class": "This course explores various trajectories and developments in the general area of media, communication and the environment, with a particular focus on Alaska. Students will complete a research project equivalent to a 20-page written paper, as is consistent with the CS 394 requirement. Alaska is the central theme of the seminar, although students also have the opportunity to explore other media-communication-environment themes. 2017 marks the 150th anniversary of the Alaska Purchase, and two Northwestern University were centrally involved in the events that led up to the USA purchase of Alaska Territory from Russia in 1867. There is a glacier in Alaska named in honor of Northwestern University. Topics discussed in class, and possible research topics, include attempts to build a telegraph and cable system across Alaska to Siberia in the 1860s, and the role of Northwestern faculty as scientific researchers for that project; the emergence of electronic communication networks in Alaska over the past 150 years, including both commercial and military networks; the recent rise of \"Alaska TV shows\" on American television; the indigenous peoples of Alaska and their self-representation through media production; and studies about Alaska, the Arctic, and global climate change. The instructor will work with each student to develop a research topic. The class will also provide an introduction and overview to ways in which environmental concepts can be approached and understood from the perspectives of media and communication studies.", "name": "Communication Studies Research Seminar", "section": "21", "location": "Annenberg Hall G29", "topic": "Eco-Media: Alaska", "course": "394-0", "meeting_time": ["We 2:00PM - 4:50PM"], "path": "/class-descriptions/4650/SoC/COMM_ST/394-0/23538", "instructor": ["James J Schwoch"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>Department Majors Only<br/><br/>Juniors Only<br/><br/>", "id": "23538", "subject": "COMM_ST"}, {"school": "SoC", "overview_of_class": "Popular narratives often laud Internet-based technologies, particularly Web 2.0 applications?blogs, social media, and video-streaming platforms?for providing new outlets for creative expression. Through processes of disintermediation, these tools provide an opportunity for creative entrepreneurs to achieve voice, recognition, and celebrity without the help of traditional gatekeepers. While it's true that people seeking to break into the creative industries leverage digital platforms to build an audience for their work, not all creative entrepreneurs achieve recognition or financial success. In this course, we will interrogate disintermediation by examining the history and present state of a variety of creative industries, drawing on primary sources, academic literature, and journalism. We will consult empirical research to identify who is most likely to benefit from the participatory opportunities digital media affords and under what conditions they may find success. A variety of written and oral exercises will culminate in production of a final paper, in which students will draw on their analysis of primary and secondary sources to describe and evaluate how a particular creative community or individual artist draws on digital technologies to build an audience for their work.", "name": "Communication Studies Research Seminar", "section": "22", "location": "Annenberg Hall G29", "topic": "Creative Entrepreneurs Online", "course": "394-0", "meeting_time": ["Mo 1:00PM - 3:50PM"], "path": "/class-descriptions/4650/SoC/COMM_ST/394-0/23539", "instructor": ["Erin Flynn Klawitter"], "class_attributes": "Undergraduate Students Only<br/><br/>", "id": "23539", "subject": "COMM_ST"}]