[{"class_mtg_info": [{"meet_t": "Tu 6:15PM - 9:15PM", "meet_l": "Parkes Hall 214"}], "school": "SCS", "overview_of_class": "Approximately 500 years ago, populations from Asia, Africa, Europe, and the Americas began to weave networks of trade and communication that spanned the globe and created the foundations for today's globalized world. This course will explore the origins of our contemporary world and the historic transition from the Agrarian to the Modern Era. This is a history of connectivity and conflict, expansion and exploitation, imperialism and innovation. It is also a history often seen and recounted as the triumph of Western civilization. However, this course will take a more expansive view, exploring developments in all parts of the globe - from the silver flowing into China's economy to the coal pulled out of England's earth - to better understand both the integration and inequality that still defines the modern world. In doing so, the course will also assess the historical process and myriad ways historians have sought to explain our past.", "qtr": "Fall 2017", "name": "Global History: Early Modern to Modern Transition", "title": "SCS HISTORY 250-A-64 Global History: Early Modern to Modern Transition", "lmod": "9/12/17 6:54 PM (CT)", "section": "64", "topic": "", "course": "250-A", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Approximately 500 years ago, populations from Asia, Africa, Europe, and the Americas began to weave networks of trade and communication that spanned the globe and created the foundations for today's globalized world. This course will explore the origins of our contemporary world and the historic transition from the Agrarian to the Modern Era. This is a history of connectivity and conflict, expansion and exploitation, imperialism and innovation. It is also a history often seen and recounted as the triumph of Western civilization. However, this course will take a more expansive view, exploring developments in all parts of the globe - from the silver flowing into China's economy to the coal pulled out of England's earth - to better understand both the integration and inequality that still defines the modern world. In doing so, the course will also assess the historical process and myriad ways historians have sought to explain our past."}, {"name": "Registration Requirements", "value": "None."}, {"name": "Learning Objectives", "value": "By the end of the course, students will or will be able to:<br/>-Identify significant developments and trends in the global transition to the modern era<br/>-Describe key events from this period with a focus on connections to broader trends in global history<br/>-Analyze an historical argument and the evidentiary basis for such arguments<br/>-Compose an historical argument supported by historical evidence and analysis of other secondary sources<br/>-Empathize with diverse groups of historical actors"}, {"name": "Teaching Method", "value": "Class Participation<br/>Discussion<br/>Group Work<br/>Lecture<br/>Readings<br/>Writing Assignments"}, {"name": "Evaluation Method", "value": "Attendance & Participation: 20%<br/>Exams: 20%<br/>In-Class Project: 10%<br/>Papers: 40% <br/>Weekly Discussion Questions: 10%"}, {"name": "Class Materials (Required)", "value": "Required Reading (available at Norris as well as most other booksellers):<br/>-Robert B. Marks, The Origins of the Modern World: A Global and Environmental Narrative from the Fifteenth to the Twenty-First Century, 3rd Edition (ISBN: 9781442212404)<br/>-Greg Grandin, The Empire of Necessity: Slavery, Freedom, and Deception in the Modern World (ISBN: 9781250062109)<br/>-Additional course materials will be available on Canvas<br/><br/>Recommended Additional Reading (also available at Norris):<br/>-Kenneth Pomeranz and Steven Topik, The World that Trade Created: Society, Culture and the World Economy, 1400 to the Present, 3rd Edition (ISBN: 9780765623553)"}, {"name": "Class Materials (Suggested)", "value": "Attendance at the first class meeting is mandatory."}], "instructor": ["Matthew Ross June"], "class_attributes": "", "id": "18118", "subject": "HISTORY"}]