[{"school": "DOHA", "overview_of_class": "<p>This course will analyze how images of Islam are fashioned in the U.S. media in dialogue with (and/or ignorance of) the long history of Islam in America. As a minority religious community, American Muslims have responded and hoped to shape their own media narrative, but face enduring challenges relating to Islamophobia, race, neo-liberalism, and international events. This course examines the crafting of media narratives both about Islam and by Muslims in America. It also compares these narratives with the actual religious identities of Muslims in America over two centuries or more.</p>", "name": "Special Topics", "section": "70", "location": "Carnegie Mellon Room 3046", "topic": "Islam, America, and the Media", "course": "390-0", "meeting_time": ["MoTuWeSu 02:30PM - 05:30PM (AST)"], "path": "/class-descriptions/4630/DOHA/JOUR/390-0/41515", "instructor": ["Abraham Naseem Abusharif", "Zachary Valentine Wright"], "class_attributes": "", "id": "41515", "subject": "JOUR"}, {"school": "DOHA", "overview_of_class": "<p>This is a survey course dedicated to the pretty simple proposition that sports are more than entertainment, more than popular culture. Sports are a social institution no less than education, religion, or the military, and no less important. Sports are also oldest form of 'reality television' and the most expensive, highest-earning media product. This course is intended to help students interested in sports and sports journalism to improve their craft by identifying and explaining social meanings in the world of sports. In short, it's a sports class that looks at society through the lens of sports. Many are quick to see sports as a metaphorical training ground for 'life'. Life is this case includes commerce and industry, domestic and international politics (including war), gender identity and sexuality, race and ethnic relations, religion and spirituality, and popular culture from fashion to video games. This course considers sports in some of these various contexts. We do it through weekly monitoring of sports media, documentary films, and research and writing assignments.</p>", "name": "Special Topics", "section": "71", "location": "Carnegie Mellon Room 3048", "topic": "Sports, Media & Society", "course": "390-0", "meeting_time": ["MoTuWeSu 09:00AM - 12:00PM (AST)"], "path": "/class-descriptions/4630/DOHA/JOUR/390-0/41516", "instructor": ["Amy Kristin Sanders"], "class_attributes": "", "id": "41516", "subject": "JOUR"}, {"school": "DOHA", "overview_of_class": "<p>This course provides students with learning about the global perspective of strategic communication and exposure to some of the best marketing communication practices from all over the world, exhibited and discussed in the Cannes International Festival of Creativity. This festival celebrates creativity in all forms of communication and offers a great opportunity for learning and networking: industry experts share their brand success stories or creative productions in digital, broadcast, film, PR, and IMC among many others. With plenary sessions, seminars, forums, master classes and workshops, the students will find about new trends in marketing communications in general and in specific interests they may have, such as health communication, entertainment, sports or innovation. Students will also have the opportunity to attend a one-on-one portfolio session with industry experts who meet with the students and comment on their portfolios. Networking is another opportunity in this gathering, as the students can meet with practitioners and peers from various universities.This course starts locally with two meetings to introduce the course and the structure of the festival, then 10 days travel to the festival and back to Doha to reflect on the learning and complete the assigned project.</p>", "name": "Special Topics", "section": "72", "location": "Carnegie Mellon Room 3177", "topic": "Global Perspectives in Strategic Communication", "course": "390-0", "meeting_time": ["TBA"], "path": "/class-descriptions/4630/DOHA/JOUR/390-0/41517", "instructor": ["Ilhem   Allagui"], "class_attributes": "", "id": "41517", "subject": "JOUR"}, {"school": "DOHA", "overview_of_class": "<p>This field-reporting course that is scheduled for summer 2016 in Berlin, will task students with exploring the issues centered on the waves of migrants entering the country over the past year from the Middle East, Balkans and Africa, and which has subsequently forced the country to repeatedly raise its projection of the number of people seeking asylum. Students will be charged with exploring the current migrant crisis from multiple angles, as well as looking into the motives behind the growing Islamophobia and Xenophobia in Germany, which is the birthplace of the PEGIDA (Patriotic Europeans against the Islamisation of the Occident) movement - a German anti-Islam political organization that today has many sympathizers across Western Europe. At the same time, students will explore the history of immigration to Germany, which started at the end of World War II and reached a new high in 2015 with over 1.1 million people expected to claim asylum.</p>", "name": "Special Topics", "section": "73", "location": "Qatar Studio Building 012", "topic": "Reporting on Migrant Crisis in Berlin", "course": "390-0", "meeting_time": ["MoTuWeTh 01:30PM - 05:30PM (AST)"], "path": "/class-descriptions/4630/DOHA/JOUR/390-0/41518", "instructor": ["Miriam   Berg"], "class_attributes": "", "id": "41518", "subject": "JOUR"}]