[{"class_mtg_info": [{"meet_t": "Tu 6:15PM - 9:15PM", "meet_l": "TBA"}], "school": "SCS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "38103", "title": "SCS ORG_BEH 369-CN-14 Entrepreneurship and Technology", "class_attributes": "", "section": "38103", "instructors": [{"instructor_phone": "", "instructor_name": "Karl Tan Muth", "instructor_addr": ""}], "topic": "", "course": "369-CN", "descriptions": [{"name": "Overview of class", "value": "This course focuses on early-stage companies (including, but not only, startups) and how they are structured, financed, managed, scaled, and sold. It is an example-driven course that demands substantial research outside class; past students have mentioned spending between 2 to 4 hours each week outside of class on research - if you are not prepared to do work outside class each week to prepare for the following week, do not take this course. While the course focuses on technology companies, this is interpreted broadly to include telecommunications, financial technology, medical technology, hardware innovation, and other topics; this is not a sector-specific course focused on &quot;pure tech&quot; (e.g. social media startups, ad tech, etc.)."}, {"name": "Registration Requirements", "value": "Students with a working knowledge of microeconomics will enjoy an advantage in this course, but there are no strict requirements. Many students take ORGBEH 371 prior to this course, but this is not required."}, {"name": "Learning Objectives", "value": "Students will be able to examine a company from an investor perspective and describe its strategy, trajectory, challenges, market environment, competitors, and likely financing options. Students will be able to evaluate a company's team and judge whether it is appropriate to the company's stage, ambitions, and products/services mix."}, {"name": "Teaching Method", "value": "This is a case-driven, highly-collaborative course with a Socratic, conversational classroom environment.<br/><br/>Occasionally, I may bring guest speakers (entrepreneurs) to class to discuss real-world examples."}, {"name": "Evaluation Method", "value": "The evaluation is based on a midterm exam and a final project."}, {"name": "Class Materials (Required)", "value": "The course materials are ever-evolving; often, they will change from week to week as startups we are keeping track of in class pivot, make announcements, evolve, or go out of business. Students are expected to keep track of what is going on in class and adjustments made to the syllabus and readings."}, {"name": "Class Notes", "value": "This is one of the most popular courses I've designed at Northwestern and students have contacted me months or years later remarking how their work experience and professional perspective was shaped by the analysis done in this course. If you have already taken ORG BEH 371 and enjoyed it, I highly recommend taking this course to add to your knowledge of the early-stage venture space - the examples and coursework in this course are more concrete, whereas 371 is more theoretical."}], "lmod": "2/20/17 6:41 PM (CT)", "subject": "ORG_BEH"}]