[{"class_mtg_info": [{"meet_t": "MoWeFr 2:00PM - 3:20PM", "meet_l": "Technological Institute M345"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "33301", "title": "WCAS ECON 325-0-30 Economic Growth &amp; Development", "class_attributes": "", "section": "33301", "instructors": [{"instructor_phone": "", "instructor_name": "Marti   Mestieri Ferrer", "instructor_addr": ""}], "topic": "", "course": "325-0", "descriptions": [{"name": "Overview of class", "value": "How can economies grow rich? And how may economies fail to grow rich?<br/>These are fundamental questions in economics. Even Adam Smith alluded to them in the title of his<br/>book, &quot;The Wealth of Nations.&quot; These broad questions are the main focus of this course. No one can<br/>claim to have the answer to these difficult questions. However, economic theories can inform us on<br/>some important determinants of long-run growth patterns and development performances. In this<br/>course, we will cover some of the leading theories proposed to understand different aspects of long-run<br/>growth and development: Saving and capital accumulation, technological change, structural change,<br/>demographic transition, income distribution, imperfect credit markets, etc. (see the preliminary list of<br/>topics below)<br/>Detailed Contents of the Class (Preliminary)<br/>1. Facts and Measurement<br/>2. Traditional Theories of Economic Growth (Harrod-Domar, Solow)<br/>3. New Growth Theories (Human Capital, Endogenous Technological Progress)<br/>4. History, Expectations and Development (Complementarities, Increasing Returns and<br/>Poverty traps, some trade)<br/>5. Credit Markets (Alternative micro underpinnings and related theories)<br/>6. Inequality and Growth (Measurement, Kuznets Hypothesis, Interaction with Credit Mkts)<br/>7. Population Growth and Economic Development (Demographic Transition, Unified<br/>Growth Theory)<br/>8. International Linkages: Trade and Financial Markets (time permitting)<br/>9. Political Economy of Growth (time permitting)"}, {"name": "Registration Requirements", "value": "Economics 310-1, 310-2, 311-1, and 281 (or my permission). This course is<br/>designed for economics majors, and I assume that you are familiar with the basic concepts and<br/>tools in economics."}, {"name": "Teaching Method", "value": "Lectures and discussion section."}, {"name": "Evaluation Method", "value": "Mostly based on the two in-class quizzes, scheduled to be done in-class on 4/25 and 5/25, but<br/>also the final exam (if need be). Quiz-I covers the materials in the first half (eight lectures) and<br/>Quiz-II covers those in the second half (eight lectures). These quizzes count equally. Your<br/>performance is judged based on the distribution of the simple sum of the numerical scores<br/>of the two quizzes. The students who perform well enough in these two quizzes, meaning that they<br/>deserve a C or better are exempt from the final exam. Those who do not perform well enough in these<br/>two quizzes are given the opportunity to improve their final grade to a C by taking the final exam."}, {"name": "Class Materials (Required)", "value": "Development Economics by Debraj Ray; Princeton University Press, 1998. ISBN-13: 978-0691017068"}, {"name": "Class Materials (Suggested)", "value": "The Mystery of Economic Growth by Elhanan Helpman, 2004. ISBN-13: 9780674015722."}, {"name": "Class Notes", "value": "In this course, we will not discuss much on the economic institutions and conditions that prevail<br/>in/are specific of many developing countries. These questions are analyzed in Econ 326."}], "lmod": "4/3/16 7:56 PM (CT)", "subject": "ECON"}]