[{"class_mtg_info": [{"meet_t": "MoWe 9:30AM - 10:50AM", "meet_l": "Parkes Hall 222"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "35416", "title": "WCAS POLI_SCI 390-0-24 Special Topics in Political Science", "class_attributes": "No Freshmen<br/><br/>", "section": "35416", "instructors": [{"instructor_phone": "", "instructor_name": "Galya Benarieh Ruffer", "instructor_addr": ""}], "topic": "Constitutional Challenges in Comparative Perspecti", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "POLI SCI 390-0-24 Spring 2017 &quot;Constitutional Challenges in Comparative Perspective&quot; Prof. Galya Ruffer<br/>On Nov. 17, 2016 shortly after the U.S. national elections, Indiana Judge Sarah Evans Barker delivered remarks to the 68 new citizens during a naturalization ceremony about the turbulent, ugly and divisive events of the weeks leading up to the elections. She told these new citizens that they would now be called up to do their part in helping to build and maintain our country's best values and highest principles and historic traditions. She spoke about our qualities as a country such as fairness, tolerance, compassion, equality, civility and freedom and values of diversity, tolerance, brotherhood, equality, goodwill, fairness and the rule of law. Where do our national values come from? In what way does our Constitution bind us to these values if at all? In Europe, values are directly inscribed in the European Charter and the Copenhagen criteria set out the rules that define whether a country has sufficient intent in its democratic and human rights values to join the European Union. In this course we will be thinking about how and whether constitutions shape national values and offer a framework for legitimacy and governance to hold together diverse societies and resolve deeply rooted social tensions and ethnic divisions. We will consider the constitutional responses of countries such as the U.S., Canada, France, Germany, Great Britain, Hungary, Kenya, South Africa and Australia to the challenges of terrorist bombings, the rise of populism, hate crimes, legitimacy of public authority, and refugee crisis and examine the birth of constitutionalism that is currently underway in Africa where the peaceful exchange of power, a value that we have taken for granted, is still an aspiration for countries such as Rwanda and the Democratic Republic of Congo. In learning about the varying traditions of written and unwritten constitutions, civil and common law and the foundations and structures of separation of powers and judicial review of the constitutionality of laws in these countries, students will learn to think critically about the U.S. Constitution and the different ways in which constitutional democracies provide for public order, counter-majoritarian governance, equality and protection of the rights of minorities through rule of law and question whether constitutional solutions can address the kinds of social and political problems we have today."}, {"name": "Learning Objectives", "value": "? Students will learn about the different ways in which constitutions structure government, freedoms and protect the rights of citizens and minorities. <br/>? In exploring these topics, students will learn how constitutional designs respond to competing claims, try to diffuse controversy and accommodate different constituencies. <br/>? The intention of considering these different approaches is to enable students to improve their capacities to think systematically about constitutions, different structures for organizing governments and establishing just and efficacious governments, and about the role of constitutional law and courts.<br/>? Throughout this course, students will develop critical reading, thinking, and writing skills<br/>? By the end of the quarter, students should be able to understand and explain some of the similarities and differences in doctrines of law, analyze the assumptions of courts and policy makers, and understand how constitutional law responds differently to political, social and economic challenges in these countries."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Discussion, presentations, final exam"}], "lmod": "2/20/17 6:49 PM (CT)", "subject": "POLI_SCI"}]