[{"class_mtg_info": [{"meet_t": "Th 6:15PM - 9:15PM", "meet_l": "Kresge Centennial Hall 2-335"}], "school": "SCS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "38073", "title": "SCS POLI_SCI 390-CN-66 Special Topics", "class_attributes": "", "section": "38073", "instructors": [{"instructor_phone": "", "instructor_name": "Sean Christopher Burns", "instructor_addr": ""}], "topic": "The Arab Spring and its Consequences", "course": "390-CN", "descriptions": [{"name": "Overview of class", "value": "The Arab Spring of 2010-2011 was an optimistic time of rapid and unexpected change that has had far reaching consequences. Its reverberations continue to be felt in the multiple civil wars in the Middle East as well as the hopeful signs of transformation in Tunisia. This course will look closely at the causes and outcomes of the Arab Spring from 2010 until now. The first half of the course will look at the causes and the variation of protest and government response. The second half of the class will examine outcomes from multiple angles, including politics, civil war, social change, and international conflict."}, {"name": "Registration Requirements", "value": "There are no prerequisites, but previous classes in political science or the politics and history of the Middle East would be helpful."}, {"name": "Learning Objectives", "value": "At the end of the class, students will be expected to have a strong knowledge of the events and ongoing impact of the Arab Spring. Students should be able to articulate multiple theories for why the Arab Spring occurred when and how it did and why different countries ended up with different outcomes. Through individual research, students should demonstrate a particular expertise in one or more cases or aspects of the Arab Spring and its ongoing consequences."}, {"name": "Teaching Method", "value": "This class will be heavily dependent on reading and in-class discussion. Students will read up-to-the-minute scholarship on the Arab Spring and historical explanations of the different cases and discuss the various theories and events in class. In-class assignments will include short reading responses and group work and discussion."}, {"name": "Evaluation Method", "value": "Grading will be based on class participation, short in-class reading responses, and an individual research paper on a specific issue or country impacted by the Arab Spring. The research paper will be written in two parts over the course of the quarter, as a midterm and final assignment. Students will meet individually with the professor to formulate questions and methodology for the paper before embarking on the final project."}, {"name": "Class Materials (Required)", "value": "Course materials will include current books and articles on the Arab Spring. Articles will be offered through Canvas. Students will be responsible for buying the books online; they will not be provided in the campus bookstore. Students will also be responsible for following the news out of the Middle East and responding to current events."}, {"name": "Class Notes", "value": "The Arab Spring is ongoing and the class will respond to current events. Both the events and the political science theory explaining them are constantly evolving. New books and articles are coming out all the time, and the syllabus will evolve with these changes. This should make for a dynamic and interesting class."}], "lmod": "2/21/17 6:42 PM (CT)", "subject": "POLI_SCI"}]