[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "Fisk Hall 114"}], "school": "WCAS", "overview_of_class": "In an age in which religion has become the idiom of insurgency for contesting power from the centers of the world, the secular mix of participatory and representative democracy currently sweeping Latin America warrants closer study, both for what it can teach us about the region and the future of democracy itself. This course will focus on contemporary socio-political developments in Latin America in long-term historical context, and the different methodological approaches to researching and writing the history of the present. As freshman seminar, the class will be run as an open workshop that is writing- and discussion-oriented, and aimed to help first-year students to improve their analytical and critical abilities. Students work together through the specific challenges they encounter, and share the research and writing process as well as their final products with the class. Initially, we focus on the practical side of the \"historian's craft,\" and consider the sources, methods, and problems of research for Latin American and Caribbean history. Then we move into individual cases in order to consider how change and crisis in the late-twentieth and early twenty-first centuries is connected to earlier conjunctures. We examine current developments in the Andes (with particular attention to Bolivia, and Venezuela), the Caribbean (particularly Cuba), and Central America (specifically Mexico). The goal is to comprehend four major historical problems: the popular democratic mobilizations of impoverished working people, the election and trajectories of Left and center-Left governments, the expansive wave of terror of the illegal drug business, and U.S. foreign policy in the hemisphere. Finally, we explore the inextricably bound history of the Americas in order to understand one of the most politically charged issues of our present: Latin American immigration to the U.S.", "qtr": "Winter 2016", "name": "First-Year Seminar-American History", "title": "WCAS HISTORY 102-6-20 First-Year Seminar-American History", "lmod": "1/9/16 6:48 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Lina M Britto", "instructor_addr": "Harris Hall 302"}], "topic": "Contemporary Latin America in Historical Perspecti", "course": "102-6", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "descriptions": [{"name": "Overview of class", "value": "In an age in which religion has become the idiom of insurgency for contesting power from the centers of the world, the secular mix of participatory and representative democracy currently sweeping Latin America warrants closer study, both for what it can teach us about the region and the future of democracy itself. This course will focus on contemporary socio-political developments in Latin America in long-term historical context, and the different methodological approaches to researching and writing the history of the present. As freshman seminar, the class will be run as an open workshop that is writing- and discussion-oriented, and aimed to help first-year students to improve their analytical and critical abilities. Students work together through the specific challenges they encounter, and share the research and writing process as well as their final products with the class. Initially, we focus on the practical side of the &quot;historian's craft,&quot; and consider the sources, methods, and problems of research for Latin American and Caribbean history. Then we move into individual cases in order to consider how change and crisis in the late-twentieth and early twenty-first centuries is connected to earlier conjunctures. We examine current developments in the Andes (with particular attention to Bolivia, and Venezuela), the Caribbean (particularly Cuba), and Central America (specifically Mexico). The goal is to comprehend four major historical problems: the popular democratic mobilizations of impoverished working people, the election and trajectories of Left and center-Left governments, the expansive wave of terror of the illegal drug business, and U.S. foreign policy in the hemisphere. Finally, we explore the inextricably bound history of the Americas in order to understand one of the most politically charged issues of our present: Latin American immigration to the U.S."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "AttendanceClass participationPaper, finalPapersAttendance and participation, response papers, oral presentations, in-class assignments, and a final paper"}, {"name": "Class Materials (Required)", "value": "Charles Bergquist, Labor and the Course of American Democracy: U.S. History in Latin American Perspective (1996) ISBN 1859841260 (pbk.) 1859848656<br/><br/><br/>Greg Grandin, Empire's Workshop: Latin America, the United States, and the Rise of the New Imperialism (2006) ISBN 0805077383<br/><br/><br/>Forrest Hylton and Sinclair Thomson, Revolutionary Horizons: Past and Present in Bolivian Politics (2007) ISBN 9781844670703 (hbk.) 1844670708 (hbk.) 184467097X (pbk.) 9781844670970 (pbk.)<br/><br/><br/>Steve Ellner, Rethinking Venezuelan Politics: Class, Conflict, and the Chávez Phenomenon (2008) ISBN 781588265609 (hardcover : alk. paper) 1588265609 (hardcover : alk. paper)<br/><br/><br/>Anabel Hernández, Narcoland. The Mexican Drug Lords and Their Godfathers (2013) ISBN 9781781680735 (alk. paper) 1781680736 (alk. paper)<br/><br/><br/>Cocalero, a film by Alejandro Landes, Bolivia 2007 The Revolution will not be televised, a film by Kim Bartley, Venezuela 2002."}, {"name": "Class Notes", "value": "Attendance and participation are evaluated. No lap-top use in classroom. Special cases will be considered. Electronic devices should be silenced or turned off.<br/><br/>HISTORY AREA OF CONCENTRATION: Americas"}], "path": "/class-descriptions/4610/WCAS/HISTORY/102-6/24896", "instructor": ["Lina M Britto"], "class_attributes": "WCAS First-Year Seminar<br/><br/>Attendance at 1st class mandatory<br/><br/>Freshmen/Sophomores Only<br/><br/>", "id": "24896", "subject": "HISTORY"}, {"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "University Library 4770"}], "school": "WCAS", "overview_of_class": "Abraham Lincoln is remembered as one of the greatest heroes of American history.  But what do we really know about Lincoln, and how do we know it?  In this course we will explore Lincoln's life and writings, and we will also look at how people have understood and remembered Lincoln over the last 150 years.  We will focus on Lincoln's biography, his stance on slavery and emancipation, and his understanding of presidential power in wartime.  We will also ask what we can learn about the United States from representations of Lincoln in monuments, music, and films.  Field trips may be involved.", "qtr": "Winter 2016", "name": "First-Year Seminar-American History", "title": "WCAS HISTORY 102-6-21 First-Year Seminar-American History", "lmod": "1/9/16 6:48 PM (CT)", "section": "21", "instructors": [{"instructor_phone": "847/491-2849", "instructor_name": "Katherine   Masur", "instructor_addr": "Harris Hall Room 202"}], "topic": "Abraham Lincoln in History and Memory", "course": "102-6", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "descriptions": [{"name": "Overview of class", "value": "Abraham Lincoln is remembered as one of the greatest heroes of American history. But what do we really know about Lincoln, and how do we know it? In this course we will explore Lincoln's life and writings, and we will also look at how people have understood and remembered Lincoln over the last 150 years. We will focus on Lincoln's biography, his stance on slavery and emancipation, and his understanding of presidential power in wartime. We will also ask what we can learn about the United States from representations of Lincoln in monuments, music, and films. Field trips may be involved."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Papers"}, {"name": "Class Materials (Required)", "value": "Michael P. Johnson, ed., Abraham Lincoln, Slavery, and the Civil War: Selected Writings and Speeches. ISBN 978-0312558130<br/><br/>Charles Lipson, Doing Honest Work in College: How to Prepare Citations, Avoid Plagiarism, and Achieve Real Academic Success, 2nd ed. ISBN 9780226484778<br/><br/>Course reader"}, {"name": "Class Notes", "value": "HISTORY AREA OF CONCENTRATION: Americas"}], "path": "/class-descriptions/4610/WCAS/HISTORY/102-6/24897", "instructor": ["Katherine   Masur"], "class_attributes": "WCAS First-Year Seminar<br/><br/>Attendance at 1st class mandatory<br/><br/>Freshmen/Sophomores Only<br/><br/>", "id": "24897", "subject": "HISTORY"}, {"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Locy Hall 305"}], "school": "WCAS", "overview_of_class": "C. P. Snow famously claimed that science and literature formed two antagonistic camps.  On one side was Tolstoy, who condemned science for not answering the only question that matters: \"What shall we do and how shall we live?\"  And on the other were scientists who dismissed literature as so much fluff, irrelevant for our technological age.  This course, by contrast, looks at the dialogue between science and literature in the twentieth century, from the rise of evolutionary science to the space race.  We will read fiction about science (some of it, science fiction!) as well as memoirs by great twentieth-century scientists.  To place these accounts in historical context, we will read essays by thinkers such as the sociologist Max Weber, the naturalist Thomas Huxley, the poet Matthew Arnold, and C. P. Snow.  We will ask how science and literature have approached the question of the good society and the good life, and how their answers can align?and how they differ.", "qtr": "Winter 2016", "name": "First-Year Seminar-American History", "title": "WCAS HISTORY 102-6-22 First-Year Seminar-American History", "lmod": "1/9/16 6:48 PM (CT)", "section": "22", "instructors": [{"instructor_phone": "847/467-4038", "instructor_name": "Kenneth L Alder", "instructor_addr": "Harris Hall 110"}], "topic": "Science and Literature: The Good Society", "course": "102-6", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "descriptions": [{"name": "Overview of class", "value": "C. P. Snow famously claimed that science and literature formed two antagonistic camps. On one side was Tolstoy, who condemned science for not answering the only question that matters: &quot;What shall we do and how shall we live?&quot; And on the other were scientists who dismissed literature as so much fluff, irrelevant for our technological age. This course, by contrast, looks at the dialogue between science and literature in the twentieth century, from the rise of evolutionary science to the space race. We will read fiction about science (some of it, science fiction!) as well as memoirs by great twentieth-century scientists. To place these accounts in historical context, we will read essays by thinkers such as the sociologist Max Weber, the naturalist Thomas Huxley, the poet Matthew Arnold, and C. P. Snow. We will ask how science and literature have approached the question of the good society and the good life, and how their answers can align?and how they differ."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Class participationPaper, finalParticipation, several short essays, and one medium-length final paper"}, {"name": "Class Materials (Required)", "value": "Bertolt Brecht, Life of Galileo, ISBN: 9780143105381<br/><br/><br/>Lauren Redniss, Radioactive: Marie &amp; Pierre Curie: A Tale of Love and Fallout, Paperback, It books 2010, ASIN: B004GY433Q<br/><br/><br/>Freeman Dyson, Disturbing the Universe, ISBN: 9780465016778<br/><br/><br/>Primo Levi, The Periodic Table, ISBN: 9780805210415<br/><br/><br/>C. P. Snow, The Two Cultures, ISBN: 9781107606142<br/><br/><br/>James Watson, The Double Helix, ISBN: 9780393950755<br/><br/><br/>Max Weber, Science as a Vocation<br/><br/><br/>H. G. Wells, The Time Machine, ISBN: 9780486284729<br/><br/><br/>E. O. Wilson, Naturalist, ISBN: 9781597260886"}, {"name": "Class Notes", "value": "HISTORY AREA OF CONCENTRATION: Americas, Europe, Science and Technology"}], "path": "/class-descriptions/4610/WCAS/HISTORY/102-6/24898", "instructor": ["Kenneth L Alder"], "class_attributes": "WCAS First-Year Seminar<br/><br/>Attendance at 1st class mandatory<br/><br/>Freshmen/Sophomores Only<br/><br/>", "id": "24898", "subject": "HISTORY"}]