[{"school": "MUSIC", "overview_of_class": "COURSE DESCRIPTION: This course will focus on various intersections of music and religion in the Western tradition (although certain non-Western examples will be considered by way of comparison and contrast). The most obvious such intersection is that of musical settings of liturgical texts, typically, though not necessarily, resulting in music which is actually part of a worship service. But music hardly needs to set liturgical texts in order to take on religious meanings and associations. Many sacred texts are not liturgical at all, much music perceived as religiously meaningful is purely instrumental, and the rituals of concert-going and composer-adulating, as these have developed over the last two centuries, have often been compared to those of worship services. The topics we cover will be considered in the light of aesthetic theories put forward as to the relations between aesthetics, theology, and beauty.<br/><br/> The first half of the course will get under way through an examination of the many and varied musical references contained in the Bible. This will be followed by a critical examination of the two principal approaches to sacred music which have long been held up as the models most worthy of emulation: a cappella-style of vocal polyphony of the mature Renaissance in Roman Catholic lands, and medieval (\"Gregorian\") chant, which experienced a noteworthy revival of interest in the Romantic period. We will also explore the flip side of these models, i. e. the long history of condemnation of religious music perceived as falling short of the appropriate stylistic criteria. Music growing out of the various strains of the Protestant Reformation, such as the chorales of Martin Luther, the French psalm-settings of Claude Goudimel, and the choral works and passions of Heinrich Schütz, will be considered in terms of its embodiment of the ideals of that movement. Highly varied approaches to Jewish music (synagogal cantillation, the Chasidic \"niggun,\" and the controversy over the use of organ in worship services) will complete this part of the course.<br/><br/> The second half of the course will focus on representative compositions seen as vehicles of religious meaning (whether \"sacred\" music or not, and whether the composers and audiences in question are \"religious\" or not). Some will be chosen among the numerous prayer scenes contained in operas both secular (Verdi's La forza del Destino) and religious (Poulenc's Dialogues of the Carmelites) in nature. Choral examples may include Haydn's Creation, Bach's St. John Passion and St. Matthew Passion, Mozart's Vesperae Solenne de Confessore and his Requiem Mass, Beethoven's Missa Solemnis, Mendelssohn's Elijah, Requiem masses by Verdi and Fauré, Brahms' Ein deutsches Requiem, Mahler's Symphony #2, and mystically-inspired music by modernists such as Schoenberg, Krenek, Webern, and Messiaen as well as recent \"holy minimalists\" like Tavener and Pärt and composers inspired by the sacred traditions of the East (Holst, Cage, Lieberson, Harrison).", "name": "Selected Topics", "section": "20", "location": "RCMA 1-172", "topic": "Music + Religion 1500-2000", "course": "335-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4660/MUSIC/MUSICOL/335-0/35889", "instructor": ["Jesse   Rosenberg"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "35889", "subject": "MUSICOL"}]