[{"class_mtg_info": [{"meet_t": "Mo 2:00PM - 4:50PM", "meet_l": "Crowe 4-130 Rel Studies Sem Rm"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Spring 2017", "name": "31130", "title": "WCAS RELIGION 462-0-20 Topics in American Religious History &amp; Contemporary Practice", "class_attributes": "", "section": "31130", "instructors": [{"instructor_phone": "847/467-5410", "instructor_name": "Sylvester Alric Johnson", "instructor_addr": "5-128 Crowe, 1860 Campus Dr"}], "topic": "", "course": "462-0", "descriptions": [{"name": "Overview of class", "value": "This graduate seminar examines key themes in American religions: transnationalism, empire, race, indigeneity, and national security. Students will read theoretical and historical studies of Americans religions to engage with several fundamental problems that have commanded recent scholarly attention. How have globalization and hemispheric approaches reshaped the way scholars conceptualize the &quot;origins&quot; and trajectories of American religions? How have formations of US empire shaped religion and politics? What have scholars meant by the &quot;co-constitution&quot; of race and religion, and how has this manifested throughout the history of American religions? What is the &quot;national security paradigm,&quot; and how has it reshaped the relationship between religion and state power? Are recent anti-Muslim state practices a novel development or an iteration of an historical pattern? What analysis of American religions is demanded by accounting for indigeneity? <br/><br/>Students will lead and participate in weekly discussions, write a book review, and produce a research essay of approximately 15 pages that engages with one or more key themes from the seminar."}, {"name": "Class Materials (Required)", "value": "Ned Blackhawk, Violence over the Land. [ISBN: 978-0674027206] <br/>Albert Hurtado, Intimate Frontiers. [ISBN: 978-0826319548 ]<br/>Sylvester Johnson &amp; Steven Weitzman, The FBI and Religion. [ISBN: 978-0520287280]<br/>Maria Elena Martínez, Genealogical Fictions. [ISBN: 978-0804776615 ]<br/>Mahmood Mamdani, Good Muslim, Bad Muslim. [ISBN: 978-0385515375 ]<br/>W. Paul Reeve, Religion of a Different Color. [ISBN: 978-0199754076 ]<br/>Jalane Schmidt, Cachita's Streets: The Virgin of Charity, Race, and Revolution in Cuba. [ISBN: 978-0822359371 ]<br/>Andrea Smith, Native Americans and the Christian Right. [ISBN: 978-0822341635 ]<br/>Karine Walther, Sacred Interests. [ISBN: 978-1469625393 ]<br/>Judith Weisenfeld, New World A-Coming. [ISBN: 978-1479888801 ]<br/>Richard White, The Middle Ground: Indians, Empires, and Republics in the Great Lakes Region, 1650-1815. [ISBN: 978-0521183444 ]"}], "lmod": "2/6/17 6:54 PM (CT)", "subject": "RELIGION"}]