[{"class_mtg_info": [{"meet_t": "Mo 3:00PM - 5:50PM", "meet_l": "Parkes Hall 224"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "23191", "title": "WCAS COMP_LIT 414-0-20 Comparative Studies in Genre", "class_attributes": "", "section": "23191", "instructors": [{"instructor_phone": "847/467-4712", "instructor_name": "Marcus G Moseley", "instructor_addr": "1800 Sherman, Suite 106"}], "topic": "", "course": "414-0", "descriptions": [{"name": "Overview of class", "value": "The twentieth century has been referred to as &quot;The Jewish Century.&quot; Jews in Western Europe, in particular Germany, played an extraordinarily disproportionate role in the forging of European modernity in all fields of culture, finance, and politics. The mass entrance of Jews to the secular cultural sphere following upon civil emancipation was accompanied by the rise of modern anti-Semitism that shook the foundations of Western civilization in the last century. At the same time Jewish culture was convulsed from within by the emergence of what Isaac Deutscher famously termed &quot;the non-Jewish Jew.&quot; In Eastern Europe, in particular, this cultural ferment led to the efflorescence of moern secular literatures in Hebrew and Yiddish. This led in turn, in the early decades of the last century, to an intense and fruitful dialogue between Eastern and Western European Jewish modernist cultural trends. Thus &quot;East and West&quot; served as the title of a leading Jewish periodical both in German and Hebrew. Among prominent Jewish figures who stand as testimony to this encounter we may number the S.Y. Agnon, Marc Chagall, Walter Benjamin, Gershom Scholem, Franz Kafka, Martin Buber-the scroll is long indeed. Jews, to employ a Yiddish proverb, &quot;were sitting in the corner in the middle of the room.&quot;<br/><br/>Topics of discussion include: Germany as the laboratory of Jewish modernity; anti-Semitism and Jewish self-hatred; the cultural encounter of Eastern and Western European Jewry; the emergence of Modern Hebrew and Yiddish literatures; Jewish heretics and the shaping of twentieth-century sensibilities"}, {"name": "Class Materials (Required)", "value": "Figures to be studied in Solomon Maimon, Franz Kafka, Karl Marz, Gershom Scholem, Sigmund Freud, Haim Nahman Bialik, Sholem Aleichem, Marc Chagall."}], "lmod": "1/9/16 6:46 PM (CT)", "subject": "COMP_LIT"}]