[{"class_mtg_info": [{"meet_t": "MoWeFr 10:00AM - 10:50AM", "meet_l": "Locy Hall 301"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "20518", "title": "WCAS GERMAN 224-0-20 Contemporary Germany", "class_attributes": "Historical Studies Distro Area<br/><br/>Given in English<br/><br/>No prerequisite in the language<br/><br/>", "section": "20518", "instructors": [{"instructor_phone": "847/467-7067", "instructor_name": "Jan   Behrs", "instructor_addr": "Kresge Hall, Rm 3337, 1880 Campus Drive"}], "topic": "", "course": "224-0", "descriptions": [{"name": "Overview of class", "value": "The emergence of political extremism in West Germany during the late 1960s and early 1970s struck at the core of Germany society and reverberated through the Western world. Beyond its political effects, left-wing terrorism also strongly affected the culture and thought of West Germany, which had hitherto presented itself as a constitutional democracy polity that had successfully &quot;overcome&quot; the traumas of the Nazi era. The seminar traces the history of political terrorism in post-war German society and also tries to locate it within a larger framework of militant protests throughout Europe and the world. Particular attention will be given to the actions of the infamous Red Army Faction (RAF) which also left its mark in German popular culture. While the RAF and other left-wing groups of the 1960s and 1970s are the main focus of the class, we will also talk about the disquieting phenomenon of right-wing terrorism, currently a much-discussed topic in Germany because of the ongoing revelations about the National Socialist Underground (NSU)."}, {"name": "Teaching Method", "value": "Class participationDiscussionGroup workLectureReadingsWriting assignments"}, {"name": "Evaluation Method", "value": "AttendanceClass participationPaper, finalPaper, mid-termQuizzes"}, {"name": "Class Materials (Required)", "value": "Readings and films for the class will be available on Canvas."}], "lmod": "12/29/16 6:58 PM (CT)", "subject": "GERMAN"}]