[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "University Hall 121"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Registration is reserved for History, International Studies and Jewish Studies students.", "qtr": "Spring 2017", "name": "34407", "title": "WCAS HISTORY 203-1-1 Jewish History 750-1492", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "34407", "instructors": [{"instructor_phone": "847/467-1967", "instructor_name": "David   Shyovitz", "instructor_addr": "Harris Hall - Room 314"}], "associated_classes": [{"component": "DIS", "room": "University Library 3322", "meeting_time": "We 2:00PM - 2:50PM"}, {"component": "DIS", "room": "Harris Hall L05", "meeting_time": "We 10:00AM - 10:50AM"}, {"component": "DIS", "room": "Kresge Centennial Hall 2-343", "meeting_time": "We 11:00AM - 11:50AM"}], "topic": "", "course": "203-1", "descriptions": [{"name": "Overview of class", "value": "This course surveys the development of Jewish culture and civilization in the medieval period, from roughly 750 (the rise of the Abbasid Caliphate in Baghdad) to 1492 (the expulsion of the Jews of Spain). We will explore the varied, rich, nuanced experiences of Jewish communities in Europe and the Islamic East, and trace the ways in which Jewish culture, thought, and socio-political life developed over a vast chronological and geographical expanse. We will consistently seek to situate Jewish experiences both against the backdrop of earlier Jewish history, as well as in relation to the contemporary Christian and Islamic cultures in which medieval Jews were embedded. The course will conclude by exploring the varied ways in which medieval societies gave way to &quot;early modernity,&quot; and by tracing the continuities and disjuncture between the two periods. Readings for this course include both primary documents (in English translation) and secondary sources. The goals of the course will include grappling with how historians use primary documents to reconstruct Jewish history, and learning to read works of historical interpretation with a careful and critical eye."}, {"name": "Teaching Method", "value": "Lecture, Discussion"}, {"name": "Evaluation Method", "value": "Paper &amp; Final Exam"}], "lmod": "2/13/17 6:44 PM (CT)", "subject": "HISTORY"}]