[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "1801 Hinman Ave 2225"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "25047", "title": "WCAS HISTORY 300-0-26 New Lectures in History", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "25047", "instructors": [{"instructor_phone": "847/467-4829", "instructor_name": "Paul James Gillingham", "instructor_addr": "Harris Hall 323"}], "associated_classes": [{"component": "DIS", "room": "University Hall 118", "meeting_time": "Fr 1:00PM - 1:50PM"}, {"component": "DIS", "room": "University Hall 118", "meeting_time": "Fr 3:00PM - 3:50PM"}, {"component": "DIS", "room": "University Hall 118", "meeting_time": "Fr 4:00PM - 4:50PM"}], "topic": "Revolution and Empire in Cuba", "course": "300-0", "descriptions": [{"name": "Overview of class", "value": "The Spanish Empire ended definitively in 1898 with the loss of Cuba, Puerto Rico and the Philippines in a short and disastrous war with the United States, whose victory marked its emergence as a global empire. Sixty years later that successor empire was unable to contain a revolution in Cuba that created an enduring communist state. This course focuses on those two imperial moments in Cuba, combining the social history of colonial rule and revolt with a Latin American perspective on critical moments in international relations. Readings span the writings of slaves, revolutionaries, soldiers, diplomats and muckraking journalists, to consider why Spanish rule endured so long in Cuba; why it eventually failed; and what the implications of that failure were for the island's twentieth-century history. Finally, the same question is applied to revolutionary Cuba: why did it endure so long?"}, {"name": "Registration Requirements", "value": "This course takes students along a sonorous trip through Latin America and the Spanish-speaking Caribbean. We will travel from country to country studying son in Cuba, samba in Brazil, tango in Argentina, corrido in Mexico, and vallenato in Colombia, among others, in order to comprehend how certain sounds became emblems of modern nations. We will also navigate the circuits in which certain sounds, such as cumbia, salsa, rock, hip hop, and reggaeton crossed geographic boundaries and evolved into transnational genres that express the collective experience of exile and migration of large populations. We address these histories in an interdisciplinary manner, reading history, anthropology, sociology, and ethnomusicology, and analyzing critically song lyrics, music videos, feature films, and documentaries. The goal is to help students understand why popular music has been a vehicle of nation-state formation in the region. By the end of the course, students should be able to explain how popular music in Latin America figures in struggles over hegemony, socio-economic mobility, and urbanization, as a means of protests and revolt, as a field for developing patterns of consumption for emerging national markets, and as symbolic currency in international negotiations involving issues of representation, legitimacy, and self-determination."}, {"name": "Teaching Method", "value": "Discussion sectionLecture"}, {"name": "Evaluation Method", "value": "Exam, finalExam, mid-termQuizzesQuizzes, midterm and final exams, research paper"}, {"name": "Class Materials (Required)", "value": "Louis Pérez, Cuba Between Empires, 1878-1902 (University of Pittsburgh, 1983) ISBN: 9780822934721<br/><br/><br/>Matt D. Childs, The 1812 Aponte Rebellion in Cuba and the struggle against Atlantic slavery (University of North Carolina Press, 2006) ISBN: 9780807857724<br/><br/><br/>Miguel Barnet, Biography of a Runaway Slave (Trans. W. Nick Hill, Curbstone Press, 1994) ISBN: 9781880684184"}, {"name": "Class Notes", "value": "HISTORY AREA OF CONCENTRATION: Americas"}], "lmod": "1/9/16 6:48 PM (CT)", "subject": "HISTORY"}]