[{"class_mtg_info": [{"meet_t": "Tu 5:00PM - 7:50PM", "meet_l": "Harris Hall L06"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "23082", "title": "WCAS ANTHRO 320-0-20 Peoples of Africa", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "23082", "instructors": [{"instructor_phone": "847/491-4825", "instructor_name": "Caroline H Bledsoe", "instructor_addr": "1810 Hinman Ave., Room 201, EV Campus"}], "topic": "", "course": "320-0", "descriptions": [{"name": "Overview of class", "value": "This course introduces students to major themes in the anthropological study of Africa, the world area that most inspired the development of anthropology as a discipline. Examining the diversity of contemporary African societies and moments in the colonial past, we will explore in depth several related themes that derive from the classics as well as the contemporary anthropological corpus. These themes center on the creation of social ties, making a living, and managing health and uncertainty in volatile times. Specific topics will include kinship and marriage, production and exchange, health, population, economic development, corruption, political patronage, war, and the dynamics of movement and transnationalism."}, {"name": "Registration Requirements", "value": "No P/N allowed."}, {"name": "Class Materials (Required)", "value": "The main readings for the course will concentrate on in-depth ethnographies. They will be supplemented by other readings, some of which are included in a course packet that will be available at Quartet Copies (Clark &amp; Benson Sts). Please note: I have not included in the for-purchase packet materials that can be found online, either through the university's website or through links I point you to. <br/>1. Ba, Mariama. 1981. So Long a Letter. Heinemann. 978-1577668060<br/>2. Evans-Pritchard, E.E. 1940. The Nuer. Oxford University Press 978-0195003222 <br/>3. Smith, Daniel Jordan. 2007. A Culture of Corruption: Everyday Deception and Popular Discontent in Nigeria. Princeton University Press. 978-0691136479<br/>4.Jannike Verheijen. 2013. Balancing Men, Morals and Money: Women's Agency between HIV and Security in a Malawi Village. 9789054481324<br/>Leiden: African Studies Centre. African Studies Collection, 53 (available online)"}], "lmod": "12/25/16 6:54 PM (CT)", "subject": "ANTHRO"}]