[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Technological Institute M120"}], "school": "WCAS", "overview_of_class": "Legal Studies 398-1,2 is a two-quarter sequence required for all Legal Studies majors. This seminar exposes students to a variety of theoretical and methodological approaches to law and legal institutions; over two quarters, students will develop their own research paper on a topic of interest.", "qtr": "Fall 2016", "name": "Advanced Research Seminar 1", "title": "WCAS LEGAL_ST 398-1-20 Advanced Research Seminar 1", "lmod": "10/30/16 7:07 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "847 491 3987", "instructor_name": "Joanna Lynn Grisinger", "instructor_addr": "620 Lincoln St #201"}], "topic": "", "course": "398-1", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "descriptions": [{"name": "Overview of class", "value": "Legal Studies 398-1,2 is a two-quarter sequence required for all Legal Studies majors. This seminar exposes students to a variety of theoretical and methodological approaches to law and legal institutions; over two quarters, students will develop their own research paper on a topic of interest."}, {"name": "Registration Requirements", "value": "Restricted to Legal Studies majors. Department consent required."}, {"name": "Learning Objectives", "value": "Once you complete the Advanced Research Seminar, you should be able to: <br/>- Read and analyze diverse primary legal and political sources carefully and accurately, with attention to the author's perspective, position, and credibility, and to the source's general context.<br/>- Be familiar with research methods and best practices regarding qualitative and quantitative data, written materials, and electronic databases.<br/>- Read, evaluate, summarize, and engage with scholarly works by others, and be able to analyze authors' arguments for evidence, context, strength, and credibility. <br/>- Understand how to work with and situate one's own work within existing scholarship and how to properly cite facts, ideas, and scholarship.<br/>- Generate original research questions regarding the relationship of law and society and devise research strategies for answering research questions.<br/>- Make clearly written and organized arguments that are well supported by primary sources. <br/>- Design and execute an original research project."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Research assignments, papers, active participation in class activities."}, {"name": "Class Materials (Required)", "value": "- Gerald Graff and Cathy Birkenstein, They Say/I Say: The Moves that Matter in Academic Writing, 3rd ed. (New York: W.W. Norton &amp; Co., 2014) ISBN:9780393935844 <br/>- Michael Harvey, The Nuts and Bolts of College Writing, 2nd ed. (Hackett, 2013) ISBN: 9781603848985 <br/>- Additional required reading will be available via Canvas and through NU library databases."}, {"name": "Class Notes", "value": "Attendance at first class required."}], "path": "/class-descriptions/4640/WCAS/LEGAL_ST/398-1/13156", "instructor": ["Joanna Lynn Grisinger"], "class_attributes": "", "id": "13156", "subject": "LEGAL_ST"}]