[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Parkes Hall 223"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "17392", "title": "WCAS ENGLISH 368-0-20 Studies in 20th-Century Literature", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "17392", "instructors": [{"instructor_phone": "", "instructor_name": "Whitney Blair Taylor", "instructor_addr": ""}], "topic": "Our Monsters, Ourselves", "course": "368-0", "descriptions": [{"name": "Overview of class", "value": "Spell-casting witches, blood-sucking vampires, mindless zombies, evil robots, and invading aliens. What do our obsessions with specific supernatural, technological, or extraterrestrial threats to humanity tell us about cultural investments at a specific time and place? In this course, we will examine popular culture's preoccupation with supernatural or extra-worldly &quot;villains&quot; in literature, nonfiction, films, and other media. This course will contextualize those trends in the historical, cultural, and political anxieties or interests of the time, including contemporaneous ideas of national identity, gender and sexuality, and developments in science and technology. For instance, the recent popularity of zombies has been linked to fears about increasing globalization, and alien invasion was a particularly popular theme in movies and literature at the intersection of the Cold War and humans' exploration of space. Course material will also include satires of these crazes, which often expose the fears or desires underlying our fascination with particular literary figures or genres. We will investigate existing academic and nonfiction theses about why certain threats to humanity are popular in certain cultural moments; we will also develop our own hypotheses about why particular &quot;monsters&quot; or narratives captivate the popular imagination. Since this class has a wide scope, students will have the opportunity to pursue the topic that interests them most in a final paper/presentation."}, {"name": "Teaching Method", "value": "Discussion."}, {"name": "Evaluation Method", "value": "Participation, two papers and shorter responses, and a brief oral presentation."}, {"name": "Class Materials (Required)", "value": "Bram Stoker, Dracula; H.G. Wells, The War of the Worlds; Virginia Woolf (as E.V. Odle), The Clockwork Man; Isaac Asimov, I, Robot; Philip K. Dick, &quot;Imposter;&quot; William March, The Bad Seed; selections from Kim Newman's Anno Dracula series; Stephen King, Salem's Lot; Octavia Butler, Fledgling; Jane Austen and Seth Grahame-Smith, Pride and Prejudice and Zombies; Max Brooks, The Zombie Survival Guide."}], "lmod": "10/30/16 7:04 PM (CT)", "subject": "ENGLISH"}]