[{"class_mtg_info": [{"meet_t": "Tu 6:15PM - 9:15PM", "meet_l": "Wieboldt Hall 512"}], "school": "SCS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "27832", "title": "SCS RTVF 322-CN-14 Genre", "class_attributes": "", "section": "27832", "instructors": [{"instructor_phone": "", "instructor_name": "Alexander Mark Thimons", "instructor_addr": ""}], "topic": "Television Melodrama", "course": "322-CN", "descriptions": [{"name": "Overview of class", "value": "This course is an introduction to the American melodrama on television. We will read theoretical texts about the melodrama as a narrative mode that negotiates cultural tensions, especially surrounding the family, gender, and sexuality. We will also explore melodrama historically, as a persistent but malleable form that adapts to changes in the television industry and in American culture at large, focusing in particular on its prominence in times of historical crisis (Vietnam, the AIDS epidemic, the war on drugs). The course will consider melodrama as it appears in anthology dramas/TV movies, procedurals, the miniseries, serial dramas, reality shows, and even sitcoms. Screenings may include soap operas, Roots, Route 66, M*A*S*H, Friday Night Lights, Battlestar Galactica, Starsky and Hutch, thirtysomething, Brian's Song, Requiem for a Heavyweight, Wild Palms, The Wire, and others. Readings will include essays by Lynne Joyrich, Jane Feuer, Thomas Elsaesser, Tania Modleski, and others. Carries humanities credit."}, {"name": "Registration Requirements", "value": "None."}, {"name": "Learning Objectives", "value": "Students should expect to: <br/>1. Study melodrama as a historically pervasive narrative mode<br/>2. Consider melodrama as a way to negotiate tensions and contradictions in American life<br/>3. View a variety of historical and contemporary melodramatic television programs<br/>4. Practice reading comprehension strategies, especially when faced with challenging academic texts<br/>5. Hone their writing skills, so that they can practice writing clearly and persuasively"}, {"name": "Teaching Method", "value": "Classes will involve lecture and discussion, and students should expect to actively participate in the class sessions. Students will also complete writing assignments and view relevant television programs."}, {"name": "Evaluation Method", "value": "Evaluation will be based on class participation, small writing assignments, quizzes, and a final assignment?either an exam or a longer essay."}, {"name": "Class Materials (Required)", "value": "All readings will be available as PDF files on Canvas."}], "lmod": "1/9/16 6:42 PM (CT)", "subject": "RTVF"}]