[{"school": "WCAS", "overview_of_class": "Are we what we eat? 19th century French gastronome Jean Anthelme Brillat-Savarin famously stated as much in his Physiology of Taste (1825), but what does this mean within America's increasingly globalized food system? The phrase &quot;you are what you eat&quot; suggests that the act of eating is one of entrenchment: food choices represent and intensify one's own cultural and personal identity. But considering that issues of food access, obesity, and unfair or illegal food labor practices within the food system cut across race and class boundaries, this may now be an inaccurate - or at the very least - uncomfortable maxim. This course interrogates themes of identity, ethnicity, and nationalism by examining ?American cuisine' against the constraints of power and inequality in the US food system. We will focus on how national identity is constructed, affirmed, or refused through food choices by surveying foundational works within the field of food studies and connecting them to the pressing social issues of today, particularly as they manifest in the everyday activity of eating.", "name": "Special Topics in the Humanities", "section": "20", "topic": "Eating the Other in America", "course": "370-3", "meeting_time": ["MoWe 9:30AM - 10:50AM"], "path": "/class-descriptions/4650/WCAS/HUM/370-3/24207", "instructor": ["Hiilei Julia Hobart"], "id": "24207", "subject": "HUM"}, {"school": "WCAS", "overview_of_class": "How do sexuality, race, gender, and class shape new media? This course explores the role of intersectional identity in technological transformations in media, focusing on the transition from analog to digital. Students will read historical case studies and theoretical essays on such topics as how social media affect how queer users interact and self-identify, how race influences cable TV distribution, and how gender shaped early radio. The course is organized into three key areas of inquiry - culture, organization, and technology - with the goal of understanding the complex ways they interrelate.", "name": "Special Topics in the Humanities", "section": "30", "topic": "Queer New Media", "course": "370-3", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4650/WCAS/HUM/370-3/24208", "instructor": ["Aymar Christian Jean"], "id": "24208", "subject": "HUM"}]