[{"class_mtg_info": [{"meet_t": "Mo 4:30PM - 7:20PM", "meet_l": "McMillen Crowe Hall 4-130"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Winter 2016", "name": "23192", "title": "WCAS COMP_LIT 411-0-20 Critical Practices", "class_attributes": "", "section": "23192", "instructors": [{"instructor_phone": "847/491-8259", "instructor_name": "Alessia   Ricciardi", "instructor_addr": "1860 S. Campus Drive, Crowe Hall #2-133"}], "topic": "Critical Theory: Rhetoric, Philosophy, Linguistics", "course": "411-0", "descriptions": [{"name": "Overview of class", "value": "This course explores a selection of Jacques Lacan's essays and seminars while assessing his continuing relevance for fields as diverse as literature, film studies, and political theory. We will consider at length Lacan's notions of the unconscious, language, sexuality, gender difference, the drives (especially the death drive), the mirror stage, the imaginary, the symbolic and the real, the gaze, enjoyment, and the object petit a. We will also examine what important psychoanalytic elements appear to be missing from his theory (e.g. affects). In what direction does Lacan's thinking extend psychoanalysis after Freud? How should we take his propensity for sophistry? Our reading will cover a broad sample of the Essays, Seminar VII (particularly the section on Antigone), Seminar XI (particularly the section on the gaze as object petit a and XX (particularly the section on jouissance and the section on God and Woman's jouissance). We will conclude with a look at ?i?ek's Lacanian analyses of films and Badiou's political re-reading of Lacan. The author of a forthcoming book on Lacan and Derrida, Professor Isabelle Alfandary of Université de Paris III will visit us as a special guest."}, {"name": "Registration Requirements", "value": "Prior to the start of class and in preparation for our discussion, please read Sigmund Freud's The Interpretation of Dreams (at least Chapter Seven), Jokes and Their Relation to the Unconscious, the Wolf Man case study, Beyond the Pleasure Principle, and Civilization and its Discontents, as well as Sam Weber's Return to Freud: Jacques Lacan's Dislocation of Psychoanalysis."}, {"name": "Teaching Method", "value": "Taught in English, seminar-style. Open to advanced undergraduates."}, {"name": "Evaluation Method", "value": "Participation 25%, oral presentation 25%, final paper (14-15 pages) 50%"}, {"name": "Class Materials (Required)", "value": "Lacan, Écrits, trans. Bruce Fink (New York: Norton, 2006), The Seminars of Jacques Lacan: Book VII, Book VIII, Book XI, Book XX"}], "lmod": "1/9/16 6:46 PM (CT)", "subject": "COMP_LIT"}]