[{"class_mtg_info": [{"meet_t": "MoTuWeTh 12:00PM - 12:50PM", "meet_l": "University Library 3670"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24098", "title": "WCAS FRENCH 121-2-23 Intermediate French", "class_attributes": "Attendance at 1st class mandatory<br/><br/>Prerequisites apply, see description<br/><br/>", "section": "24098", "instructors": [{"instructor_phone": "847/497-5631", "instructor_name": "Joseph P Derosier", "instructor_addr": "1860 Campus Drive Crowe Hall #2-155"}], "topic": "", "course": "121-2", "descriptions": [{"name": "Overview of class", "value": "French 121-2 is the second quarter of a three-quarter course for students who have completed French 121-1 or have been placed in that course by the French department. The aim of the course is to develop students' communication skills and cultural knowledge. Class meets four times a week. No P/N allowed. The last quarter of the sequence (125-3) allows you/sudents to satisfy the WCAS language requirement (grade of C- or higher)."}, {"name": "Teaching Method", "value": "The primary goal of this course is to develop students speaking, listening, reading and writing skills in a cultural context and to foster their critical thinking. Through study, exercises, conversation and various class activities, students will review and practice basic grammar, while exploring contemporary French and Francophone cultures. Class will be conducted in French. Students are expected to attend class daily, to actively participate and to spend at least 2 hours of work outside of class for each contact hour."}, {"name": "Evaluation Method", "value": "Class participation, homework &amp; quizzes, three compositions, four lesson tests and end-of-quarter oral test."}, {"name": "Class Materials (Required)", "value": "Réseau: Communication, Intégration, Intersections. Jean Marie Schultz, Marie-Paule Tranvouez, Second edition, Pearson. Online Student Activities Manual for Réseau: Communication, Intégration, Intersections. Pearson."}], "lmod": "12/25/16 6:59 PM (CT)", "subject": "FRENCH"}]