[{"school": "WCAS", "overview_of_class": "This course will examine the ways magic is viewed and practiced in various cultures, its relationship to mainstream religious practice in each of those cultures, and a range of theories that have been proposed regarding the relationship between magic and religion.", "name": "Topics in Comparative Religion", "section": "20", "location": "Kresge Centennial Hall 2-425", "topic": "Religion and Magic", "course": "379-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4660/WCAS/RELIGION/379-0/31074", "instructor": ["Richard   Kieckhefer"], "class_attributes": "Ethics &amp; Values Distro Area<br/><br/>", "id": "31074", "subject": "RELIGION"}, {"school": "WCAS", "overview_of_class": "Life is not Fair: Theories and Practices of Justice<br/><br/>This course will look at historical and comparative theories of justice from theological and philosophical sources in the Western Tradition. We will begin by a review of justice theory within the Hebrew Bible, the New Testament and the Quran, and explore how the concepts of fairness, treatment of the vulnerable, equity, freedom, rights and contracts expand our historical ideas about how to distribute social goods in a world of scarcity and finitude beginning with Enlightenment ideas of fairness. We will critically examine the turn toward utility and happiness, then contract theories of justice as modernity expanded our ideas of fairness. We will explore contemporary theories of justice, including Rawl and his critics, and Singer, Nussbaum. Sachs, and challenges to liberal theorists by liberation theology, African American political theory, and feminist critique. The class will conclude with an exploration of how justice theories are applied in practical terms against problems of access and distribution in American public life.", "name": "Topics in Comparative Religion", "section": "21", "location": "Parkes Hall 212", "topic": "Life is not Fair: Theories and Practices of Justi", "course": "379-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4660/WCAS/RELIGION/379-0/31075", "instructor": ["Laurie S Zoloth"], "class_attributes": "Ethics &amp; Values Distro Area<br/><br/>", "id": "31075", "subject": "RELIGION"}]