[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "University Hall 418"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Freshmen may not register for this course.", "qtr": "Spring 2016", "name": "33400", "title": "WCAS HISTORY 395-0-22 Research Seminar", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "33400", "instructors": [{"instructor_phone": "847/491-7652", "instructor_name": "Dyan H Elliott", "instructor_addr": "Harris Hall Room 337"}], "topic": "Medieval Saints and Sinners", "course": "395-0", "descriptions": [{"name": "Overview of class", "value": "Medieval saints and sinners were embodiments of the struggle between good and evil. But these polarities were never stable. The worst sinners frequently made the best saints: throughout the Middle Ages, society was fascinated by the drama of moral conversion expressed in the lives of the legendary &quot;prostitute&quot; saints. But conceptions of sanctity and sin also fluctuated in response to social change. Once Christianity became the dominant religion, tales of martyrdom gave way to acts of self-mortification. By the same token, sin tended to be assessed in terms of actions and their consequences in the early Middle Ages. In the twelfth century, however, there was a revolutionary emphasis on conscience that tended to locate sin in the intention. Society's spiritual heroes and sinful ne'er do wells constitute prisms through which the moral universe is refracted."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Research paper"}, {"name": "Class Materials (Required)", "value": "READING LIST: <br/>Clanchy, Michael, ed. Letters of Abelard and Heloise. Penguin, 2004. 978-0140448993 Cook, William R. and Ronald Be Hertzman. The Medieval World View. 3d ed. Oxford, 2011. 978- 0195373684 <br/>Kempe, Margery. The Book of Margery Kempe. Ed. Anthony Bale. Oxford UP, 2015. 978-0199686643 Raymond of Peñafort. Summa of Marriage. Toronto: Pontifical Institute, 2005. 978-0888442918 <br/>Ward. Benedicta, trans. Sayings of the Desert Fathers. Rev. Ed. Liturgical Press, 1984. 978-0879079598"}, {"name": "Class Notes", "value": "HISTORY AREA OF CONCENTRATION: European"}], "lmod": "4/3/16 8:04 PM (CT)", "subject": "HISTORY"}]