[{"school": "WCAS", "overview_of_class": "A metaphor so irresistible it's in constant danger of destroying itself: our &quot;way through life&quot; stops whispering &quot;life is like travel&quot; to us when &quot;way through life&quot; becomes just the way you talk about life. (See what I did there?) But what happens when the metaphor is reanimated? And how can we tell it's there? Does it matter anyway?<br/> <br/>In this course we will follow the path of these questions through the people whose city all paths (well, roads) proverbially lead to. How do the poets Catullus, Virgil, and Horace, and the prose authors Seneca and Apuleius use motifs of journeys and transportation as figurations of life? What lessons emerge? Is it really all about the journey after all? Let's go find out.", "name": "Special Topics in the Humanities", "section": "20", "topic": "Death and Life's Journey in Roman Literature", "course": "370-6", "meeting_time": ["MoWe 11:00AM - 12:20PM"], "path": "/class-descriptions/4620/WCAS/HUM/370-6/31182", "instructor": ["John Kyrin Schafer"], "id": "31182", "subject": "HUM"}, {"school": "WCAS", "overview_of_class": "In the context of the 400th anniversary of Shakespeare's death, this course undertakes close reading of selected plays divided into three distinct sections, each of which raises a different set of questions and thus presents a different vantage point. The first cluster of plays focuses on examples of &quot;Performing Race in Shakespeare.&quot; The second group on &quot;Shakespeare's Women&quot; explores the range and variety of the roles and identities available to female characters. The third section examines how &quot;Shakespeare's Endings&quot; are constructed in generic forms from comedy to tragedy and inquires to what extent these conclusions resolve the problems that have emerged over the course of an individual drama.<br/><br/>Ultimately our goal will be to combine these three perspectives as overlapping approaches that lead to a comprehensive discussion of the complexities of Shakespeare's work. <br/><br/>Finally, the title &quot;Shakespeare in Our Time&quot; asks us to reflect on our contemporary position with regard to Shakespeare as an author who is located in both past and present. How can the two points?1616 and 2016?on the long historical timeline be linked without being simply equated?", "name": "Special Topics in the Humanities", "section": "21", "topic": "Shakespeare In Our Time", "course": "370-6", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4620/WCAS/HUM/370-6/31183", "instructor": ["Peter B Erickson"], "id": "31183", "subject": "HUM"}, {"school": "WCAS", "overview_of_class": "Art, Writing, Technology: New Approaches to the Digital Humanities<br/><br/>In 1882, Friedrich Nietzsche used his typewriter to declare: &quot;Our writing tools are also working on our thoughts.&quot; How might we reconsider the history of art and literature in a time when our thoughts are being worked over by iPhones, YouTube, and Google? Can we rewrite this archive using tactics found in contemporary art and poetry? This class follows emerging trends in art and writing to construct new approaches to historical objects that are equally likely to appear on Soundcloud, in a PDF, through online videos, or even on Facebook. Studying the digital humanities alongside modes of contemporary art and letters, we'll reimagine historical works through today's emerging forms and formats. Through readings and class visits from artists and poets, we will explore works that translate established forms into a variety of new media formats. How might Twitter facilitate works of art? What does YouTube demand of poetry? Using a combination of seminar conversations and collaborative workshops, we'll engage in a series of weekly experiments that attempt to reconfigure the history of art and literature through the filter of contemporary writing tools. No previous training in art, poetry, or new media is required.", "name": "Special Topics in the Humanities", "section": "22", "topic": "Art, Writing, Technology", "course": "370-6", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4620/WCAS/HUM/370-6/36623", "instructor": ["Daniel Scott Snelson"], "id": "36623", "subject": "HUM"}]