[{"class_mtg_info": [{"meet_t": "TBA", "meet_l": "TBA"}], "school": "SCS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "38115", "title": "SCS ACCOUNT 390-DL-12 Topics in Accounting:", "class_attributes": "", "section": "38115", "instructors": [{"instructor_phone": "", "instructor_name": "Robert Keith Minniti", "instructor_addr": ""}], "topic": "", "course": "390-DL", "descriptions": [{"name": "Overview of class", "value": "This course is designed for individuals who would like to obtain a basic introduction to forensic accounting. We will review the history of the forensic accounting profession in the United. Participants will be exposed to the various professional associations and certifications in the forensic accounting field. We will discuss the career opportunities in forensic accounting field and the skills and knowledge necessary to be a successful forensic accountant. We will discuss various engagements performed by forensic accountants such as fraud investigations, compliance audits, and business valuations. We will spend several weeks discussing various fraud schemes, including occupational frauds, cyber frauds, identity theft, and consumer frauds including how they occur and what can be done to prevent or detect these types of fraud schemes. We will discuss various methods for valuing a business, valuing intangible assets, and calculating economic damages. We will review the procedures for preparing engagement reports and discuss how to prepare for deposition and trial testimony. Current articles and videos will be provided to keep the course topics relevant."}, {"name": "Registration Requirements", "value": "This course is conducted completely online. A technology fee will be added to tuition."}, {"name": "Learning Objectives", "value": "The goals for this course are:<br/><br/>A. Discuss the forensic accounting profession.<br/>B. Conceptualize fraud.<br/>C. Develop and execute a fraud investigation plan.<br/>D. Identify legal issues in the forensic accounting profession.<br/>E. Calculate economic damages.<br/>F. Evaluate business valuation approaches and methods.<br/>G. Apply the professional standards that apply to forensic Explain the reporting and testifying processes.<br/>H. Summarize preventive and detective controls."}, {"name": "Teaching Method", "value": "Case studies<br/>Class participation<br/>Discussion<br/>Videos<br/>Lecture<br/>Online work <br/>Presentations<br/>Readings<br/>Research project<br/>Writing assignments"}, {"name": "Evaluation Method", "value": "Class participation and papers"}, {"name": "Class Materials (Required)", "value": "Forensic Accounting And Fraud Examination<br/>William Hopwood, Jay Leiner, &amp; George Young<br/>ISBN: 978-0-07-813666-5<br/>Publisher: McGraw-Hill Irwin"}], "lmod": "2/21/17 6:40 PM (CT)", "subject": "ACCOUNT"}]