[{"school": "WCAS", "overview_of_class": "The title of this course is misleading. This course is not designed to solely present studies of Native Americans and so that we can lament things that have happened to them. By contrast, this course is designed to examine the historic and contemporary circumstances that have produced the concept or Native America(n) as a social category and amidst the broader racial/colonial assemblage of modern social formations post-1492. This course, moreover, is designed to facilitate a study (that is, a methodology of seeing, understanding, knowing, and explaining) of power, space, and politics from the perspective of indigenous peoples of the lands now referred to as the continent of North America (Anahuac and Turtle Island) and its modern and settler colonial nation states. The course is designed from a viewpoint of &quot;conquest&quot; not as an event but as a process; an intended, sustained, and defining element of such settler colonial formations. Central to this project will be an intense scrutiny of settler colonialism, its inherent socio-logics, and the histories of violent dispossession (literal and symbolic) and genocide (literal and symbolic) that it produces.", "name": "Topics in Latina and Latino Social and Political Issues", "section": "20", "topic": "Native American Studies", "course": "392-0", "meeting_time": ["Th 5:00PM - 7:50PM"], "path": "/class-descriptions/4620/WCAS/LATINO/392-0/35428", "instructor": ["John David Marquez"], "id": "35428", "subject": "LATINO"}, {"school": "WCAS", "overview_of_class": "This course is designed to enhance students' knowledge of urban schooling, especially as related to dynamics of race, class, and culture. It provides an analysis of policies and practices and how they have/are implemented to meet the &quot;need&quot; of the individuals and groups who interact with these institutions. We will explore the following: historical and political economic factors influencing urban education; the distribution of opportunity and wealth in cities and schools; multicultural education, the development of positive school cultures, and the use of community services and resources. The goal is to encourage and foster students' critical thinking and reflective practice to address the pressing challenges which students face in American urban public schools.", "name": "Topics in Latina and Latino Social and Political Issues", "section": "21", "topic": "Urban Education: Race, Class, &amp; Culture", "course": "392-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4620/WCAS/LATINO/392-0/35429", "instructor": ["Alejandro Eduardo Carrion"], "id": "35429", "subject": "LATINO"}]