[{"class_mtg_info": [{"meet_t": "We 2:00PM - 5:00PM", "meet_l": "ANTHRO Sem Rm B07 - 1810 Hinmn"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Fall 2016", "name": "10083", "title": "WCAS ANTHRO 322-0-1 Introduction to Archaeology Research Design &amp; Methods", "class_attributes": "", "section": "10083", "instructors": [{"instructor_phone": "847/491-4564", "instructor_name": "Amanda Lee Logan", "instructor_addr": "1812 Hinman Ave. Room 203"}], "topic": "", "course": "322-0", "descriptions": [{"name": "Overview of class", "value": "This class is fundamentally about how?and why?we do archaeology. Over the course of the quarter, we will take what interests you about archaeology and build a scaffold for how you think about these interests and how you might examine them in depth in the future. The main goal is to produce a high quality NSF proposal by the end of the course (NSF Graduate Research Fellowship Program proposal for undergraduates; NSF Doctoral Dissertation Improvement Grant for graduate students). To that end, we will spend time reviewing successful proposals to decipher how scholars link theory, data, methods, and analysis in their research projects. We will work our way through the main methods in every archaeologists' tool kit: regional survey, excavation, and materials analysis. Upon completion of the course, students should feel comfortable writing grant proposals and be ready to design their own independent archaeological research project."}, {"name": "Registration Requirements", "value": "Enrollment: undergrad (jr/sr only; permission required) and graduate"}, {"name": "Evaluation Method", "value": "1) Article Critiques: three article critiques assigned over the quarter<br/><br/>2) Individual sections of grant proposal, written and workshopped over the course of the quarter<br/><br/>3) Final grant proposal, due at end of quarter"}, {"name": "Class Materials (Required)", "value": "Articles on CANVAS"}], "lmod": "10/30/16 6:58 PM (CT)", "subject": "ANTHRO"}]