[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Parkes Hall 223"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "23929", "title": "WCAS ENGLISH 344-0-20 18th-Century Fiction", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "23929", "instructors": [{"instructor_phone": "", "instructor_name": "Helen F Thompson", "instructor_addr": ""}], "topic": "Thinking with Jane Austen", "course": "344-0", "descriptions": [{"name": "Overview of class", "value": "If you're attracted by the title of this class, chances are that you're a fan of Jane Austen. Love her or not-and this seminar also aims to speak to those who do not-you probably agree when she describes her novels as &quot;the little bit (two inches wide) of ivory on which I work with so fine a brush.&quot; Austen offers a tiny painted cameo as a metaphor for her novels to belittle their topic: family life, courtship, and marriage. But Austen's metaphor also takes her far outside the home, because a bit of ivory involves global traffic?elephants are not native to England.<br/><br/>This class aims to challenge Austen's characterization of her work by pondering how her novels make us think?and what they invite us to think about. In this class, we'll read four Austen novels, each paired with complementary readings to help illuminate the historical, critical, and global questions they help us ask. We will read Austen's Pride and Prejudice alongside a prostitute narrative and feminist writing by Austen's shocking contemporary Mary Wollstonecraft. We'll ponder this novel's sexual underbelly: how does Austen portray female sexuality in the early nineteenth century? Is marriage?even happy marriage?really all about romance? Next, we will read Austen's Emma alongside economic history by E. P. Thompson and Karl Marx to think about social status and class antagonism. How much does social class define who you are and whom you like, in the nineteenth century and today? For our third novel, we'll read Austen's Mansfield Park alongside contemporary critical treatments of the Middle Passage, slavery, and global trading networks. We'll also read the abolitionist Thomas Clarkson to ponder the question: how can we say that Mansfield Park is about slavery when its references to this topic are rare? What critical techniques do we use to argue for the meaning of literary texts? Finally, we'll read Austen's Northanger Abbey to reflect on the story she tells about popular novels like her own. Alongside Northanger Abbey, we'll read excerpts from popular Gothic fiction of the time, and aesthetic theories of the sublime, to reflect on Gothic horror and sensation, then and now.<br/><br/>There will be three mandatory film screenings for this class: Pride and Prejudice, directed by Joe Wright; Clueless, directed by Amy Heckerling; and Mansfield Park, directed by Patricia Rozema."}, {"name": "Teaching Method", "value": "Discussion"}], "lmod": "12/25/16 6:58 PM (CT)", "subject": "ENGLISH"}]