[{"class_mtg_info": [{"meet_t": "TuTh 5:00PM - 6:20PM", "meet_l": "Kresge Centennial Hall 2-319"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "13720", "title": "WCAS ARABIC 316-1-20 Reading Arabic Literature - Poetry (in Arabic)", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "13720", "instructors": [{"instructor_phone": "8474670927", "instructor_name": "Ragy H Ibrahim Mikhaeel", "instructor_addr": ""}], "topic": "", "course": "316-1", "descriptions": [{"name": "Overview of class", "value": "The course offers a valuable chance to students who want to explore Arab literary traditions in depth. It also provides foundational skills for students who want to pursue graduate careers in Arabic literature or Middle Eastern Studies. This course will survey the Arabic literary tradition with an emphasis on poetry. Our readings will also include drama, religious and Sufi poems, grammar and linguistics and philosophy.<br/><br/>The linguistic textual analysis of each reading will focus on:<br/> 1- Advanced grammatical structures.<br/> 2- Use of vocabulary (e.g. gender manifestations).<br/> 3- What is unique about the style.<br/> 4- Comparative lit. : Discuss with the student whether the ideas represented by the author have parallels in the American literary tradition.<br/><br/>In this course we will work intensely on improving reading-for-comprehension skills. However, we will continue to strengthen Arabic writing skills through writing assignments that reflect students abilities of understanding and assimilating the texts. Listening and speaking skills will continue to be improved through in class oral discussions. Special exercises will be developed to improve students understanding and use of essential elements of rhetoric (????????? ??????? ? ??????? ? ?????? ? ???????? ???) and apply them to the texts they read in class."}, {"name": "Registration Requirements", "value": "Completion of Arabic 311 sequence and/or permission from instructor."}, {"name": "Teaching Method", "value": "Lectures, presentations and discussions."}, {"name": "Evaluation Method", "value": "Take home exams, term papers, writing assignments based on weekly readings and class participation."}, {"name": "Class Materials (Required)", "value": "Bassam K. Farangieh: Anthology of Arabic Literature, Culture, and Thought from Islamic Times to the Present. 2005 and selected literary works provided by the instructor."}], "lmod": "10/30/16 6:58 PM (CT)", "subject": "ARABIC"}]