[{"class_mtg_info": [{"meet_t": "Tu 2:00PM - 4:50PM", "meet_l": "University Hall 018"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Spring 2016", "name": "34974", "title": "WCAS ENGLISH 471-0-20 Studies in American Literature", "class_attributes": "", "section": "34974", "instructors": [{"instructor_phone": "", "instructor_name": "Ivy G Wilson Jr", "instructor_addr": ""}], "topic": "Fade to Black: Cultural Production &amp; Poetics of Di", "course": "471-0", "descriptions": [{"name": "Overview of class", "value": "Frantz Fanon has famously written that the conditions of modernity have rendered blackness increasingly illegible, fraught with contradictions that push it outside the realm of facile comprehension and explicability. Taking Fanon's polemic as a cue, this graduate seminar will look at a number of late twentieth-century textual and performance sites with radical instances of experimentation where articulations of blackness move into the interstitial space between meaning and non-meaning, coming into being precisely at the moment when the compositional logic of their anticipated forms are ruptured. <br/> <br/>The course will focus on three primary sites where black artists engage what might be called the poetics of dissolution to examine and critique the processes of racial formation: poetry (where the form of the line or stanza dissolves); music (where sonic interpolations puts additional, if not different, claims on the lyrical content); and visual culture (where the moves toward graphic mimesis are refused delineation)."}, {"name": "Registration Requirements", "value": "permission of department required"}, {"name": "Class Materials (Required)", "value": "The material under consideration will include work by the poets Nathaniel Mackey and Harriet Mullen; turntablists DJ Spooky, Jazzy Jeff, and Premier; songs by musicians from Ella Fitzgerald to Rahzel; and pieces by visual artists Kara Walker and Glenn Ligon. <br/><br/>Theoretical texts may include work by Barthes, Baudrillard, Freud, Fred Moten, and Saussure, as well as ethnomusicologists and linguistic anthropologists."}], "lmod": "4/3/16 7:59 PM (CT)", "subject": "ENGLISH"}]