[{"class_mtg_info": [{"meet_t": "Mo 9:00AM - 11:50AM", "meet_l": "Elder Hall 032 Seminar Room"}], "school": "SoC", "enrl_requirement": "Enrollment Requirements: Reserved for Comm Studies juniors.  Majors who study abroad a full year may enroll senior year.  Comm_ST 394-0 may not be repeated.", "qtr": "Spring 2016", "name": "37659", "title": "SoC COMM_ST 394-0-24 Communication Studies Research Seminar", "class_attributes": "Attendance at 1st class mandatory<br/><br/>Juniors Only<br/><br/>Department Majors/Minors Only<br/><br/>", "section": "37659", "instructors": [{"instructor_phone": "", "instructor_name": "Erin Flynn Klawitter", "instructor_addr": ""}], "topic": "Creative Entrepreneurs Online", "course": "394-0", "descriptions": [{"name": "Overview of class", "value": "Artisans, Musicians &amp; Fashionistas Online: Creative Entrepreneurs in the Age of Disintermediation. <br/><br/>Popular narratives often laud Internet-based technologies, particularly Web 2.0 applications?blogs, social media, and video-streaming platforms?for providing new outlets for creative expression. Through processes of disintermediation, these tools provide an opportunity for creative entrepreneurs to achieve voice, recognition, and celebrity without the help of traditional gatekeepers. While it's true that people seeking to break into the creative industries leverage digital platforms to build an audience for their work, not all creative entrepreneurs achieve recognition or financial success. In this course, we will interrogate the promises of disintermediation by examining the history and present state of a variety of creative industries, drawing on primary sources, academic literature, and journalism. We will consult empirical research to identify who is most likely to benefit from the participatory opportunities digital media affords and under what conditions they may find success. A variety of written and oral exercises will culminate in production of a final paper, in which students will draw on their analysis of primary and secondary sources to describe and evaluate how a particular creative community or individual artist draws on digital technologies to build an audience for their work."}], "lmod": "4/3/16 7:16 PM (CT)", "subject": "COMM_ST"}]