[{"class_mtg_info": [{"meet_t": "MoWeFr 9:00AM - 9:50AM", "meet_l": "Technological Institute L221"}], "school": "MEAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "35274", "title": "MEAS CIV_ENV 260-0-20 Fundamentals of Environmental Engineering", "class_attributes": "", "section": "35274", "instructors": [{"instructor_phone": "847/491-9902", "instructor_name": "Aaron   Packman", "instructor_addr": "2145 N. Sheridan / Tech A314"}], "associated_classes": [{"component": "LAB", "room": "Tech A147", "meeting_time": "Mo 2:00PM - 3:50PM"}, {"component": "LAB", "room": "555 Clark B01", "meeting_time": "Mo 4:00PM - 5:50PM"}], "topic": "Fundam of Environmental Eng", "course": "260-0", "descriptions": [{"name": "Overview of class", "value": "COURSE DESCRIPTION / <br/>Mass and energy concepts applied to major issues facing environmental engineers: safe drinking water, surface water quality, ambient air quality, global atmosphere, managing solid and hazardous wastes. <br/><br/>COURSE OBJECTIVES / <br/>*Grow in appreciation of the importance and complexity of environmental engineering problems and issues <br/>*Use and convert relevant mass and energy units <br/>*Apply fundamental chemical principles to pollution problems <br/>*Set up and solve simple steady-state and non-steady-state mass balances for conservative materials and materials undergoing first-order decay<br/>*Summarize the impacts of major pollutants on water and air quality <br/>*Determine if water is acceptable as a drinking source based on key microbiological and chemical parameters<br/>*Explain water and air quality treatment systems<br/>*Identify and discriminate the classes of solid waste and how those classes are properly managed<br/>*Explain the method by which pollutant limits are set, and perform risk assessment calculations<br/>*Evaluate the data supporting global climate change and ozone depletion <br/>*Interpret environmental issues to lay people, such as friends and family <br/><br/><br/>TOPICS / <br/>Material and Energy Balances; Environmental Chemistry; Mathematics of Growth; Reactors; Water Pollution; Water Quality Control and Treatment; Solid Waste; Risk Assessment; Air Pollution; Air Treatment; Global Atmospheric Change"}, {"name": "Registration Requirements", "value": "CHEM 101 and MATH 224 (taken concurrently)."}, {"name": "Teaching Method", "value": "Two two-hour periods per week - includes recitation. Plus a required laboratory."}, {"name": "Class Materials (Required)", "value": "Environmental Engineering 2e, Student Value Edition / James Mihelcic / ISBN 978-1118941461 / 2nd edition / Wiley"}], "lmod": "4/3/16 6:58 PM (CT)", "subject": "CIV_ENV"}]