[{"school": "SCS", "overview_of_class": "The purpose of this course is to thoughtfully consider psychological theory, methodology, and empirical data relating to questions such as the following: What is it that makes us find beautiful people beautiful? How can evolutionary psychology explain why we find certain features beautiful? Where does this theory fail in terms of predicting perceptions of beauty? Is beauty really in the eye of the beholder? How have beauty ideals shifted over history? How are gender roles and sexual orientation related to beauty and its pursuit? Why is beauty associated with femininity? What cultural biases help those perceived as beautiful and hurt those perceived as lacking in beauty? Are beautiful people happier or more successful? In what ways are beauty standards sometimes destructive? How do cultural standards of beauty affect disorders such as anorexia nervosa, bulimia nervosa, and body dysmorphic disorder? Carries social science credit.", "name": "Topics in Psychology", "section": "64", "location": "Kresge Centennial Hall 2-410", "topic": "Psychology of Beauty", "course": "314-CN", "meeting_time": ["Tu 6:15PM - 9:15PM"], "path": "/class-descriptions/4650/SCS/PSYCH/314-CN/27606", "instructor": ["Renee Suzanne Engeln"], "class_attributes": "", "id": "27606", "subject": "PSYCH"}, {"school": "SCS", "overview_of_class": "This course focuses on examining and understanding the mind of the terrorist in today's world. It will identify and explore the historical roots of terrorism, its geopolitical nature, and especially look closely at the prominent factors involved in the presence of terrorism today. Further, world leaders of terrorism will be studied, e.g., the course will exhaustively critically assess ISIS in the operations of terrorism in the world. Emphasis will be placed on both student contributions as well as involvement in the class and the use of external resources in the class. In this latter connection, an FBI agent will present on current realities regarding domestic and international terrorism. Carries social science credit.", "name": "Topics in Psychology", "section": "65", "location": "University Hall 102", "topic": "Psychology of Terrorism", "course": "314-CN", "meeting_time": ["We 6:15PM - 9:15PM"], "path": "/class-descriptions/4650/SCS/PSYCH/314-CN/27605", "instructor": ["Gary L Phillips"], "class_attributes": "", "id": "27605", "subject": "PSYCH"}]