[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "RCMA 1-168"}], "school": "MUSIC", "enrl_requirement": "", "qtr": "Winter 2017", "name": "27371", "title": "MUSIC MUS_COMP 439-0-20 Compositional Concepts and Techniques", "class_attributes": "", "section": "27371", "instructors": [{"instructor_phone": "847/467-2030", "instructor_name": "Jay Alan   Yim", "instructor_addr": "jaymar@northwestern.edu"}], "topic": "Professional Practices", "course": "439-0", "descriptions": [{"name": "Overview of class", "value": "THIS IS A NEW COURSE FOR AY 2016-2017.<br/><br/>This course will aim to provide guidance to aspiring composers and sound artists with reference to the various ways that they represent themselves to the professional music and art worlds. We will look at hard copy/physical as well as digital forms of presentation, and how those modes are consumed/received. Practical projects will include score preparation, audio editing, writing and designing resumes/cvs, cover letters, grant applications, competition submissions, festivals, networking, etcetera. Visual design basics will be utilized as the potent communicative channel that they are, here in the service of sonic arts. While it must be acknowledged that no such course could ever be considered as exhaustive, nevertheless the goal is to sensitize composers/sound designers to aspects of their preprofessional and continuing professional practice - typically relegated to roles that are ancillary or tangential to the business of creating compelling music ? in a manner that if addressed properly and strategically will be more likely to assist them in launching and maintaining successful careers."}, {"name": "Registration Requirements", "value": "Prerequisites: freshman-level music theory; basic computer and internet literacy; familiarity with a software notation program such as Finale; familiarity with an audio editing program such as Audacity, Garage Band, ProTools, Logic, SoundForge, etcetera"}], "lmod": "12/25/16 6:34 PM (CT)", "subject": "MUS_COMP"}]