[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Kresge 4531 MENA Seminar Rm"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "34446", "title": "WCAS MENA 390-6-21 Advanced Topics in Middle East &amp; North African Studies", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "34446", "topic": "North African Literature in the Age of Social Medi", "course": "390-6", "descriptions": [{"name": "Overview of class", "value": "This course is taught by Writer-in-Residence Driss Ksikes, a prominent Moroccan novelist, playwright, journalist, and magazine editor. All readings are in English translation and discussion is in English. Students who read French and/or Arabic will have the opportunity to read some materials in the original.<br/><br/>The starting point of the seminar is that novels, poems, short stories, plays, may reveal, with a lot of sensitivity and panache, not only personal realms but, sometimes unconsciously, what Jacques Lacan calls the &quot;subjectivity of an era&quot; or as Michel Foucault puts it the &quot;episteme.&quot; This seminar incorporates, in addition to liteary works, critical essays and Internet materials (webpages, videos) to explore what has been at stake in North African societies since the start of the 21st century, which corresponds roughly to the advent of social media. We will focus particularly on the relationship between fragmented representations of reality by masses of connected individuals and idiosyncratic expressions produced by literary actors. How do writers deal with the sudden popularization of speech and discourse online? Do they incorporate or employ different forms of speech within their texts? And how do users of social media address or deal with &quot;elite&quot; literary froms? How does this new ecosystem of discourse production affect the literary world, in terms of content, format and communication? And finally, how do literary texts interact with collective upheavals, such as the 2011 uprisings, largely echoed and accelerated by social media?<br/><br/>Novels, plays, and poetry by authors including Yassin Adnane, Kamel Daoud, Abdelfattah Kilito, Laila Lalami, Leila Soliman, Youssef Zaidan."}, {"name": "Teaching Method", "value": "Seminar format"}, {"name": "Evaluation Method", "value": "2 papers. Student presentations"}, {"name": "Class Materials (Required)", "value": "Thou Shall Not Speak My Language, by Abdelfattah Kilito<br/>The Meursault Investigation, by Kamel Daoud<br/>Secret Son, by Laila Lalami<br/>Azazeel, by Youssef Zeidan<br/><br/>Essays<br/>After the American Century, by Brian T. Edwards<br/>Cultural Encounters in the Arab World, by Tarik Sabry<br/>&quot;Ihbat : Disillusionment and Arab Spring in Morocco&quot;, by Taïeb Belghazi and Abdelhay Moudden (The Journal of North African studies)<br/><br/>Required texts (available at Norris at on reserve): TO COME"}], "lmod": "2/7/17 6:45 PM (CT)", "subject": "MENA"}]