[{"class_mtg_info": [{"meet_t": "MoWeFr 2:00PM - 3:50PM", "meet_l": "Frances Searle Building 2378"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Registration is reserved for students who have completed BIOL_SCI 378 or 390 or BIOL_SCI 393.", "qtr": "Winter 2017", "name": "21164", "title": "WCAS BIOL_SCI 395-0-20 Molecular Genetics", "class_attributes": "Prerequisites apply, see description<br/><br/>Seniors Only<br/><br/>", "section": "21164", "instructors": [{"instructor_phone": "", "instructor_name": "Richard F Gaber", "instructor_addr": "Cook Hall, Room 3-135"}], "topic": "", "course": "395-0", "descriptions": [{"name": "Overview of class", "value": "Recent advances in genetics and molecular biology have revolutionized the fields of gene expression, cell regulation and functional genomics. These ad advances have fundamentally changed not only our basic understanding in these areas but how we make discoveries. We will explore this revolution directly through the primary research literature. The required reading material will be provided and will consist of several classic papers as well as a larger number of recent papers from the most highly respected research journals. Representative topics will include how genes are manipulated, how gene expression is regulated in vivo, how molecular/genetic analysis of model organisms such as yeast is used to advance understanding in higher organisms, how human disease genes are discovered and a how every gene in an entire genome can be analyzed simultaneously. We will delve deeply into two of the hottest fields in molecular genetics today: epigenetics (chromatin modification and its consequences) and recently developed methods that allow rapid and simple engineering of the genome of almost any organism. Although lectures are provided, the class is small enough to allow students to take an active role through questions and discussion."}, {"name": "Registration Requirements", "value": "Undergraduates who are in their final (graduating) year at Northwestern are allowed to register for this course. All other students must first obtain the consent of the instructor. Pre-requisite: BIO 378 or 390 or 393<br/>Genetic/Molecular Concentrators Only (non-concentrators will need permission numbers)"}, {"name": "Teaching Method", "value": "Three 1.25-hr lectures per week. Although the schedule indicates that we will meet from 2 p.m. until 4 p.m. MWF, it is anticipated that class will only infrequently last more than an hour and 15 minutes. Active participation during in-class discussions is required."}, {"name": "Evaluation Method", "value": "Three midterm exams."}, {"name": "Class Materials (Required)", "value": "All materials will be provided by the instructor."}, {"name": "Class Notes", "value": "Class enrollment is limited to Seniors in the Biological Science major; Juniors and all non-Biological Science majors must contact the professor and request permission to enroll; permission is typically granted to juniors only if they cannot take the course in their senior year; NO Sophomores. Unless otherwise directed, please contact the professor for permission numbers or to be placed on the wait list should the class close out."}], "lmod": "12/25/16 6:55 PM (CT)", "subject": "BIOL_SCI"}]