[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "Kresge Centennial Hall 2-425"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24649", "title": "WCAS RELIGION 374-0-20 Contemporary Religious Thought", "class_attributes": "Ethics &amp; Values Distro Area<br/><br/>", "section": "24649", "instructors": [{"instructor_phone": "", "instructor_name": "Beverly P Mortensen", "instructor_addr": "Religious Studies Dept. Crowe hall, 5-179"}], "topic": "Evolution and God", "course": "374-0", "descriptions": [{"name": "Overview of class", "value": "This course investigates some of the ways in which evolution finds its way from a purely scientific enterprise back to notions of the divine. It also looks at how spiritual systems have explored various ways to see the divine. Evolutionary Spirituality demands this project, as it recognizes levels of development not only of species, but of the human person, the human group and even group systems of thought. In each of these, there was a purely material stage of seeing existence, and in each, the spiritual returns, like a bad penny.....suggesting that it must be dealt with. We shall use Chopra's HOW TO KNOW GOD to show development of ideas about God. Wilber's EYE OF THE SPIRIT will provide some groundwork in Integral Theory. Marion's DEATH OF THE MYTHIC GOD accounts for the developmental experiences of human society and McIntosh's PRESENCE OF THE INFINITE shows the leading edge of spirituality in the Evolutionary movement. TEACHING METHODOLOGY"}, {"name": "Registration Requirements", "value": "Come to the first class."}, {"name": "Learning Objectives", "value": "How to look at the spiritual from as many perspectives as possible.<br/>How to integrate science and the spiritual.<br/>How to understand evolution in the broadest sense.<br/>How to integrate traditional religions and contemporary sensibilities."}, {"name": "Teaching Method", "value": "Class participationDiscussionDiscussion sectionPresentationsReadingsSeminarThe class follows a seminar format. Students will discuss prepared material so they can integrate their reading with modern understanding."}, {"name": "Evaluation Method", "value": "AttendanceClass participationDiscussion sectionPaper, finalPapersPresentationsReadingsWriting assignmentsGrades derive from participation (15%), three papers with discussion points (5% each) three two-page papers (15% each) and one five-page paper (25%)."}, {"name": "Class Materials (Required)", "value": "HOW TO KNOW GOD , Deepak Chopra, Three Rivers Press; 1st Edition. edition (2000), ISBN-10: 0609805231 , ISBN-13: 978-0609805237.<br/><br/>EYE OF THE SPIRIT, Ken Wilber, Shambhala; 3 Sub edition (December 11, 2001), ISBN-10: 1570628718, ISBN-13: 978-1570628719.<br/><br/>DEATH OF THE MYTHIC GOD: The Rise of Evolutionary Spirituality, Jim Marion, Hampton Roads Publishing (July 19, 2004), ISBN-10: 1571744061, ISBN-13: 978-1571744067<br/><br/>PRESENCE OF THE INFINITE...The Spiritual Experience of<br/>Beauty, Truth, &amp; Goodness, Steve McIntosh, Quest Books<br/>October 1, 2015, ISBN-13: 978-0835609418."}, {"name": "Class Notes", "value": "For more information, contact Professor Mortensen at mortbev@gmail.com."}], "lmod": "12/29/16 7:05 PM (CT)", "subject": "RELIGION"}]