[{"class_mtg_info": [{"meet_t": "Mo 12:00PM - 3:00PM", "meet_l": "Meets in Non-General PurposeRm"}, {"meet_t": "Th 10:00AM - 12:30PM", "meet_l": "NON-COMPLIANT TIME/ASSIGN LATE"}], "school": "MEAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "31904", "title": "MEAS DSGN 495-0-1 Special Topics in Engineering Design", "class_attributes": "", "section": "31904", "instructors": [{"instructor_phone": "", "instructor_name": "Craig F Sampson", "instructor_addr": ""}, {"instructor_phone": "", "instructor_name": "Helen Louise von den Steinen", "instructor_addr": ""}], "topic": "Intersect CPG: Transformative Product and Business", "course": "495-0", "descriptions": [{"name": "Overview of class", "value": "This experiential course lives at the intersection of transformative product innovation, design thinking, and business model innovation. The learning experience will be both rich and realistic! <br/><br/>Student teams will work under NDA on five real-world upstream product innovation projects sponsored by Procter &amp; Gamble, experiencing and helping to advance the way in which big innovation works in highly scaled businesses like P&amp;G, as well as comparing innovation at different business scales including startup and licensing. Teams will be formed across schools and majors, including McCormick, Kellogg and Medill. Each multi-disciplined student team will develop both the consumer and business value proposition of their project through hands-on exercises, prototyping, testing and weekly coaching by sponsor mentors on-site and via video conference. <br/><br/>Unique characteristics of this class include physical and virtual product prototyping, business model development at three different scales (startup, licensee, global CPG), pitch development and testing, and robust primary consumer research among the target audience for each project, applying a range of state of the art consumer research methods including ethnography and behavioral psychology. Physical &amp; social science, engineering, business, communication, design plus both physical and digital prototyping skills and interests will all be highly valuable to the teams, and brought together in pursuit of a common innovation goal. In this course, creativity meets rigor, and both win!<br/><br/>The work will be challenging, comprehensive and rewarding, building individual ability and team collaboration skills that will translate to the professional world. If you want to experience how big product and brand innovation works in the world of Consumer Packaged Goods (and, by analogy, to many other businesses), as well as learn powerful frameworks that guide innovation across the broadest range of business scales, then this is the course for you!"}], "lmod": "2/8/17 6:35 PM (CT)", "subject": "DSGN"}]