[{"class_mtg_info": [{"meet_t": "MoWeFr 2:00PM - 2:50PM", "meet_l": "Technological Institute LG68"}], "school": "WCAS", "overview_of_class": "In the late 1970s, approximately 15% of US Americans aged 20 - 74 were obese. These rates have been gradually increasing and last year that figure was over 34% of Americans are obese! Many efforts have been made to decrease the number of Americans that are obese but rates have not significantly decreased.  Discussions in this course will focus on factors influencing weight.  We will briefly review historical trends, touch upon biological influences on weight, and evaluate how psychology and economics may contribute to our eating behaviors and affect public health policy. Questions that will be explored include: What factors influence obesity? What data implies causation versus correlation?  Is there a simple \"cure\" for obesity?  Near the end of the class, students will then use skills honed earlier during class to explore other health related topics.  There are no textbooks required for this course but there will be assigned PDFs posted on Canvas.", "qtr": "Winter 2016", "name": "First-Year Seminar", "title": "WCAS BIOL_SCI 104-6-20 First-Year Seminar", "lmod": "1/9/16 6:43 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "847/491-5061", "instructor_name": "Michele M McDonough", "instructor_addr": "Hogan Hall, Room - 2-100"}], "topic": "Origins of American Obesity", "course": "104-6", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "descriptions": [{"name": "Overview of class", "value": "In the late 1970s, approximately 15% of US Americans aged 20 - 74 were obese. These rates have been gradually increasing and last year that figure was over 34% of Americans are obese! Many efforts have been made to decrease the number of Americans that are obese but rates have not significantly decreased. Discussions in this course will focus on factors influencing weight. We will briefly review historical trends, touch upon biological influences on weight, and evaluate how psychology and economics may contribute to our eating behaviors and affect public health policy. Questions that will be explored include: What factors influence obesity? What data implies causation versus correlation? Is there a simple &quot;cure&quot; for obesity? Near the end of the class, students will then use skills honed earlier during class to explore other health related topics. There are no textbooks required for this course but there will be assigned PDFs posted on Canvas."}, {"name": "Teaching Method", "value": "Writing assignments: Several short papers, outlines, final research paper. <br/>Term Project Presentations: Student presentations<br/>Discussion: Class discussion"}, {"name": "Evaluation Method", "value": "Short papers and assignments- 55%; presentations and class participation-30%; Term Project- 15%<br/><br/>Approximately 3-4 writing assignments (~ 3 pages), 1 term project, a small number of other short assignments, 1 class debate."}, {"name": "Class Materials (Required)", "value": "Reserved books, and selected articles and essays made available on Blackboard."}], "path": "/class-descriptions/4610/WCAS/BIOL_SCI/104-6/20511", "instructor": ["Michele M McDonough"], "class_attributes": "WCAS First-Year Seminar<br/><br/>Freshmen/Sophomores Only<br/><br/>", "id": "20511", "subject": "BIOL_SCI"}]