[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "University Hall 121"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "25048", "title": "WCAS HISTORY 300-0-28 New Lectures in History", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "25048", "instructors": [{"instructor_phone": "847/467-3896", "instructor_name": "Elie   Rekhess", "instructor_addr": "Harris Hall 223"}], "topic": "Hamas and &quot;Islamic Jihad&quot;", "course": "300-0", "descriptions": [{"name": "Overview of class", "value": "The first part of the class consists of introductory sessions dealing with the major historical concepts of political Islam (the Umma, religion and state, the lslamic response to the challenge of the West - 19th C.) It discusses the Modernist Trend (Salafiyya), the rise of Islamic Fundamentalism and Islamic Revivalism in the Middle East in the 20th and 21st centuries. The class discusses the historical background to the rise of political Islam within the Palestinian society, reviewing three periods: Mandatory Palestine (1920s - 1940s), the West Bank and Gaza under Jordan and Egypt's rule (1948-1967), and Israel since 1967. The central part of the course focuses in more detail on Hamas, &quot;Islamic Jihad,&quot; and the Islamic Movement in Israel. It analyses the causes for the rise of revivalist Islam in the territories and in Israel since the 1970s. It deals with the ideology and political platform of Hamas as outlined in its &quot;Charter&quot; (the Islamicization of the Israel-Arab conflict, the Islamicization of the Palestinian nation identity). We will examine the doctrinal and practical principle of Jihad and the idea of martyrdom in Islam (Istishad). A special emphasis will be laid on suicide bombing from a doctrinal and practical point of view. The seminar examines the political participation of Hamas (Municipal, Legislative Council elections - 2006) and its relationship with the PLO. Finally the class reviews the rise of the Islamic Movement in Israel, its particular characteristics, the political divide of the movement (1996) and its role as a social, economic and cultural agent of change in the life of the Arab minority in Israel."}, {"name": "Registration Requirements", "value": "Previous knowledge of Arabic is helpful, but not required"}, {"name": "Teaching Method", "value": "Lecture"}, {"name": "Evaluation Method", "value": "Exam, finalExam, mid-termQuizzesQuiz, midterm, and a final"}, {"name": "Class Materials (Required)", "value": "Abu-Amr, Ziad, Islamic Fundamentalism in the West Bank and Gaza: Muslim Brotherhood and Islamic Jihad. Bloomington: Indiana University Press, 1994. ISBN: 978-0253208668<br/><br/><br/>Course Pack Readings to be purchased at Quartet Copies"}, {"name": "Class Notes", "value": "HISTORY AREA OF CONCENTRATION: Middle East"}], "lmod": "1/9/16 6:48 PM (CT)", "subject": "HISTORY"}]