[{"class_mtg_info": [{"meet_t": "MoWeFr 2:00PM - 2:50PM", "meet_l": "Kresge 3354 German Seminar Rm."}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "20549", "title": "WCAS GERMAN 213-0-20 History, Politics, and Culture in 21st Century German", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "20549", "instructors": [{"instructor_phone": "847/491-8295", "instructor_name": "Saein   Park", "instructor_addr": "Kresge Hall, Rm 3327, 1880 Campus Drive"}], "topic": "", "course": "213-0", "descriptions": [{"name": "Overview of class", "value": "This course is intended for students who would like to prepare for studying abroad or to deepen their cultural and linguistic knowledge regarding integration and multicultural life in Germany. The topics covered in the course will focus partly on topics covered in the integration course (Integrationskurs), a program developed in Germany specifically for immigrants. Topics will include the meaning of democracy, the political structures and political participation in Germany, Germany as a welfare state, a brief history of Germany in the 20th century and how it affects life in the 21st century, life in unified Germany and Europe, educational structures, religious and intercultural integration and social networks. This course will prepare students for the final examination, the &quot;Life Germany&quot; test, an examination written for immigrants in Germany."}, {"name": "Registration Requirements", "value": "102-1 or instructor`s permission<br/>This course is designed for early intermediate-level learners."}, {"name": "Learning Objectives", "value": "Students will: (1) learn how the political system in Germany works and what it means to be a welfare state; (2) become familiar with German history of the 20th century and begin to understand how certain events affected and still shape life in 21st century Germany; (3) be able to talk about current life in Germany and Europe with regard to educational opportunities, religious diversity, and intercultural integration and social networks; (4) improve their linguistic skills."}, {"name": "Teaching Method", "value": "DiscussionLecturePresentationsReadings"}, {"name": "Evaluation Method", "value": "AttendanceClass participationPresentationsQuizzesWriting assignments"}, {"name": "Class Materials (Required)", "value": "Kiliman, Angela, Ondrei Kotas, Johanna Skrodki, Ina Schiffhauer. 2016. 60 Stunden Deutschland. Orientierungskurs. Klett.<br/> ISBN: 3126752284<br/><br/>Kaufmann, Susan, Lutz Rohrmann, Petra Szablewski-Cavus. 2007. Orientierungskurs Deutschland. Langenscheidt. <br/> ISBN: 3468491689<br/><br/> Material costs: $36, approximately"}], "lmod": "12/29/16 6:58 PM (CT)", "subject": "GERMAN"}]