[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "Annenberg Hall G29"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores<br/>Add Consent: Department Consent Required<br/>Drop Consent: Department Consent Required<br/>", "qtr": "Fall 2016", "name": "13186", "title": "WCAS LING 101-6-20 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "13186", "instructors": [{"instructor_phone": "8474914968", "instructor_name": "Robert A Gundlach", "instructor_addr": "555 Clark St., 245"}], "topic": "Language and Childhood", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "How do children achieve the remarkable feat of acquiring language? Which aspects of the human capacity for language are best understood as biological, as species-wide and species-specific? How do families, schools, and communities help shape children's development as speakers and listeners, and eventually their development as readers and writers? How does learning a first language (or more than one language) interact with learning to think, learning to imagine, and developing a sense of identity? How is early language experience related to opportunities later in life? We will begin exploring these questions by reading I Can Hear You Whisper: An Intimate Journey through the Science of Sound and Language by Lydia Denworth and Why We Cooperate by Michael Tomasello. We will also sample firsthand the topics, methods, and forms of argument characteristic of current scientific research, We will then extend our exploration by considering how children learn to read and write and by reflecting on the role of language in children's development of cultural and individual identity."}, {"name": "Teaching Method", "value": "Discussion. Regular opportunities to write and to share ideas developed in essays."}, {"name": "Evaluation Method", "value": "Grades will be based on three short essays (3-4 pages), one longer essay (6-8 pages), and participation in seminar discussions. Students will have the opportunity to revise their essays."}, {"name": "Class Materials (Required)", "value": "Denworth, Lydia, I Can Hear You Whisper: An Intimate Journey through the Science of Sound and Language. Plume (paperback), 2014. ISBN: 978-0142181867.<br/><br/>Tomasello, Michael, Why We Cooperate. MIT Press/Boston Review Books, 2009. ISBN: 978-0262013598."}], "lmod": "10/30/16 7:07 PM (CT)", "subject": "LING"}]