[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Harris Hall 107"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "35324", "title": "WCAS ECON 324-0-20 Western Economic History", "class_attributes": "", "section": "35324", "instructors": [{"instructor_phone": "", "instructor_name": "Mara Pasquamaria Squicciarini", "instructor_addr": ""}], "topic": "", "course": "324-0", "descriptions": [{"name": "Overview of class", "value": "The Course will deal with issues in economic history of Europe between approx. 1500 and 1900."}, {"name": "Registration Requirements", "value": "Econ 310-1 and Econ 311."}, {"name": "Teaching Method", "value": "There will be two lectures a week. The lecture material and readings should be viewed as largely complementary, since the lectures will explain and often dispute the readings, hence both lecture materials and readings will be necessary to pass the course with a good grade. Note: all powerpoint notes, graphs and tables shown in class will be made available on the Canvas site for this course following the lectures."}, {"name": "Evaluation Method", "value": "There will one mandatory midterm exam, and an inclusive final examination. The midterm will cover all reading materials and lecture material of weeks 1-4. Students who score in the top 33% in the midterm will have the option of writing a paper in lieu of the exam. The topic and methodology have to be approved by the TA for the course, and the paper has to be submitted by the day of the final."}, {"name": "Class Materials (Required)", "value": "1. Karl Gunnar Persson, An Economic History of Europe, Cambridge: Cambridge University Press, 2010, ISBN: 978-0521549400.<br/>2. Joel Mokyr, ed., The British Industrial Revolution, Boulder: Westview Press, 1999, ISBN: 9780813333892.<br/>3. Stephen Broadberry and Kevin O'Rourke, eds., The Cambridge Economic History of Europe, Cambridge. University Press, 2010, ISBN: 9780521708388.<br/>4. Additional supplementary collection of reading, which I will place on the Canvas site of this course."}], "lmod": "2/16/17 6:45 PM (CT)", "subject": "ECON"}]