[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "555 Clark B01"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24182", "title": "WCAS GEOG 312-0-20 Geography of Chicago &amp; Its Region", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "24182", "instructors": [{"instructor_phone": "847/491-2855", "instructor_name": "John Crandall   Hudson", "instructor_addr": "1810  Hinman Ave."}], "topic": "", "course": "312-0", "descriptions": [{"name": "Overview of class", "value": "This course devotes a full quarter to the geography of Chicago and the surrounding area. After introductory lectures on Chicago's regional context and its internal geography of neighborhoods, we turn to physical geography including the local climate, geologic history, evolution of Lake Michigan, and the emergence of today's environment. We then follow the historical record, from the early native peoples, the French and British periods, and the first attempts to make a city via the Illinois and Michigan Canal project. An examination of Chicago's 19th century industrial and social history is followed by an analysis of early city planning efforts such as the Burnham Plan. In the second half of the course we trace the pattern of 20th century change in the city, including the arrival of new immigrant groups, growth of the African-American population, the growth of heavy industry, suburban growth, transportation changes, new ethnic groups, and the emergence of the 21st century urban pattern."}, {"name": "Teaching Method", "value": "Lecture-discussion"}, {"name": "Evaluation Method", "value": "Midterm, three map quizzes, final, and two, short written projects."}, {"name": "Class Materials (Required)", "value": "John C. Hudson, Chicago: A Geography of the City and Its Region. University of Chicago Press and Center for American Places, 2006. ISBN 9780226358062. Supplementary readings will be indicated on syllabus."}, {"name": "Class Notes", "value": "No prerequisites but junior standing is recommended."}], "lmod": "12/29/16 6:58 PM (CT)", "subject": "GEOG"}]