[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "University Hall 318"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: REASON: Pre-registration is not allowed for this class. Please try again during regular registration.", "qtr": "Spring 2017", "name": "33103", "title": "WCAS COMP_LIT 304-0-21 Studies in Theme", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "33103", "instructors": [{"instructor_phone": "847/491-8262", "instructor_name": "Jane Bradley   Winston", "instructor_addr": "1860 S. Campus Drive, Crowe Hall #2-101"}], "topic": "Gender and Sexuality", "course": "304-0", "descriptions": [{"name": "Overview of class", "value": "This course is primarily concerned with the treatment of issues of gender and sexuality in the literary work of French writers of the mid-to-late 20th century. It aims to develop our skills in the close reading of literary works in relation to the literary and theoretical framework and the historical and social period in which they developed. To that end, we will read essays on feminine sexuality by Freud and Lacan, excerpts from Beauvoir's groundbreaking essay, The Second Sex, social and historical accounts of the period, analyses by feminist scholars, and novels by a range of writers including Leduc, Duras, and Guibert."}, {"name": "Teaching Method", "value": "Short lectures and class discussions in English."}, {"name": "Evaluation Method", "value": "Class participation is essential. All students will remain current in their readings, attend class regularly, and participate in meaningful ways to our discussions. Students will deliver one short oral presentation and write a mid-term essay and a final research paper. Students' final grades are calculated giving equal weight to participation, oral presentations, mid-term essay and final research paper (25% each)."}, {"name": "Class Materials (Required)", "value": "Violette Leduc, Thérèse et Isabelle<br/>Marguerite Duras, Ravishing of Lol V Stein<br/>Monique Wittig, The Straight Mind<br/>Monique Wittig, Les Guérillières<br/>Monique Wittig, The Lesbian Body<br/>Hervé Guibert, To The Friend Who Did Not Save My Life<br/><br/>Course Reader available at Quartet Copies"}], "lmod": "2/14/17 6:43 PM (CT)", "subject": "COMP_LIT"}]