[{"class_mtg_info": [{"meet_t": "MoWeFr 1:00PM - 1:50PM", "meet_l": "Kresge 3354 German Seminar Rm."}], "school": "WCAS", "overview_of_class": "Using the broad range of media now easily available on the internet, this course will provide an opportunity to learn about current issues in Europe as examined through German language media. Print articles, radio broadcasts, TV news shows, and other internet sources now allow immediate access to news sources and we will use these sources during class discussions and activities to investigate Immigration and Integration in Germany, the Euro and the EU Financial Crisis, Film and Cultural Production, Issues in Education and Economics in Germany and Europe.", "qtr": "Fall 2016", "name": "Current Events in German Media", "title": "WCAS GERMAN 207-0-20 Current Events in German Media", "lmod": "10/30/16 7:05 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "8474918081", "instructor_name": "John   Paluch", "instructor_addr": "Kresge Hall, Rm 3315, 1880 Campus Drive"}], "topic": "Immigration, EU, Music, Film+", "course": "207-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Using the broad range of media now easily available on the internet, this course will provide an opportunity to learn about current issues in Europe as examined through German language media. Print articles, radio broadcasts, TV news shows, and other internet sources now allow immediate access to news sources and we will use these sources during class discussions and activities to investigate Immigration and Integration in Germany, the Euro and the EU Financial Crisis, Film and Cultural Production, Issues in Education and Economics in Germany and Europe."}, {"name": "Registration Requirements", "value": "102-3 or equivalent, strong interest in current affairs."}, {"name": "Learning Objectives", "value": "? Acquire familiarity with resources available on web pages of major media organizations in Germany, Austria and Switzerland.<br/>? Become knowledgeable about current issues in culture and politics and acquire a familiarity with local, national and international contexts for news items.<br/>? Establish patterns of working with media on the web that will provide a foundation for continued engagement with the language and culture of German speaking countries.<br/>? Acquire listening comprehension skills that allow for solid comprehension of regular radio and TV news programs.<br/>? Use discussion methods to develop skills in narrating, comparing, analyzing and synthesizing information taken from texts, and audio and video broadcasts.<br/>? Increase accurately in writing using vocabulary and grammatical structures appropriate for students at theintermediate level."}, {"name": "Teaching Method", "value": "Content material for this course will be taken from readily available internet websites maintained by news organizations, magazines, newspapers and other media related organizations. Material prepared at home will be reviewed, analyzed and discussed during class sessions. Students will have the opportunity to identify their own areas of interest, and these interests will be incorporated into the class over the course of the quarter. Discussions in class will allow for the further development of communication skills and special attention will be paid to the different backgrounds and perspectives that Germans, Europeans and Americans bring to their views of history, politics and culture. A reader with foundation texts, vocabulary and grammar will be used."}, {"name": "Evaluation Method", "value": "Attendance: 20% of final grade<br/>Exam, final: 20% of final grade<br/>Homework: 20% of final grade<br/>Papers: 20% of final grade<br/>Quizzes: 20% of final grade<br/>Access to web and German, Austrian and Swiss websites. Assignments posted on Canvas.<br/><br/>Reader with supporting material and grammar and exercises (Cost estimated at $7-15)"}], "path": "/class-descriptions/4640/WCAS/GERMAN/207-0/12256", "instructor": ["John   Paluch"], "class_attributes": "", "id": "12256", "subject": "GERMAN"}]