[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "Kresge Centennial Hall 2-410"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "22403", "title": "WCAS ASIAN_LC 290-0-20 Introductory Topics in Asian Languages and Cultures", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "22403", "instructors": [{"instructor_phone": "", "instructor_name": "Anne Elizabeth Rebull", "instructor_addr": "Kresge Hall, 1880 Campus Drive, 4-520"}], "topic": "Scriptive Things in Pre-modern China", "course": "290-0", "descriptions": [{"name": "Overview of class", "value": "A scriptive thing, according to Robin Bernstein, &quot;broadly structures a performance while simultaneously allowing for resistance and unleashing original, live variations that may not be individually predictable.&quot; Everyday objects in imperial China had the potential, in the hands of their literati interpreters, to invoke performances that transcended their ordinary uses, and create new principles of appreciation. Objects became scriptive things in the cultures of connoisseurship that characterized the late Ming, but even as early as the Tang, an object as ordinary as a pen was a provocation to literary parody. Drawing from selected readings in performance studies, thing theory, and material culture studies, this course will analyze the representations of things in literature of the pre-modern period, and their role as scriptive things in the lives of their handlers. In this discussion-based seminar, we will read primary texts in translation, including pseudo-biographies, short stories, and drama, as well as secondary literature in the study of the material culture of pre-modern China, covering props, rock collections, clothing, musical instruments, portraits and other ?things'. Pending availability, this class may spend one session as a field trip, examining objects from the collection in the Art Institute."}, {"name": "Learning Objectives", "value": "? Gain familiarity with a variety of genres of pre-modern literature in translation that feature key objects<br/>? Be able to analyze and discuss things (as represented in literature) from the perspectives of contemporary performance studies and thing theory<br/>? Develop a sense of the historical cultures of appreciation that were built up around material objects<br/>? Learn methods for appreciating the material culture of pre-modern China, including the opportunity to examine material objects firsthand.<br/>? Gain research skills in the production of a longer research paper"}, {"name": "Teaching Method", "value": "Discussion/Lecture"}, {"name": "Evaluation Method", "value": "? Weekly short reading responses posted to Canvas<br/>? One shorter mid-term paper integrating and applying methods from performance studies and thing theory to literary analysis<br/>? One longer research paper on a subject of the student's choosing, related to the material culture of pre-modern China. (Part of this grade includes the successful submission of a preliminary bibliography, and an in-class presentation of the research question and initial findings)"}, {"name": "Class Materials (Required)", "value": "? The Peach Blossom Fan. K'ung Shang-jen (Author), Chen Shih-hsiang, Harold Acton, Cyril Birch (translators). New York Review Books, 2015. <br/>ISBN: 978-1-59017-876-8 (paperback)<br/>? Selected readings, made available through Canvas and library reserves."}], "lmod": "12/29/16 6:54 PM (CT)", "subject": "ASIAN_LC"}]