[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Fisk Hall 114"}], "school": "WCAS", "overview_of_class": "In collective memory the shtetl (small Jewish town) has become enshrined as the symbolic space par excellence of close-knit, Jewish community in Eastern Europe; it is against the backdrop of this idealized shtetl that the international blockbuster Fiddler on the Roof is enacted. The shtetl is the central locus and focus of Modern Yiddish Literature; Fiddler on the Roof itself was based on a Sholem Aleichem story. In this seminar we shall explore the spectrum of representations of the shtetl in Yiddish literature from the nineteenth century to the post-Holocaust period. We shall also focus on artistic and photographic depictions of the shtetl: Chagall and Roman Vishniac in particular. The course will include a screening of Fiddler on the Roof followed by a discussion of this film based upon a comparison with the text upon which it is based, Tevye the Milkman.", "qtr": "Fall 2017", "name": "Introduction to Yiddish Culture: Images of the Shtetl", "title": "WCAS JWSH_ST 266-0-2 Introduction to Yiddish Culture: Images of the Shtetl", "lmod": "5/8/17 2:14 AM (CT)", "section": "2", "topic": "", "course": "266-0", "enrl_requirement": "Enrollment Requirements: REASON: Pre-registration is not allowed for this class. Please try again during regular registration.", "descriptions": [{"name": "Overview of class", "value": "In collective memory the shtetl (small Jewish town) has become enshrined as the symbolic space par excellence of close-knit, Jewish community in Eastern Europe; it is against the backdrop of this idealized shtetl that the international blockbuster Fiddler on the Roof is enacted. The shtetl is the central locus and focus of Modern Yiddish Literature; Fiddler on the Roof itself was based on a Sholem Aleichem story. In this seminar we shall explore the spectrum of representations of the shtetl in Yiddish literature from the nineteenth century to the post-Holocaust period. We shall also focus on artistic and photographic depictions of the shtetl: Chagall and Roman Vishniac in particular. The course will include a screening of Fiddler on the Roof followed by a discussion of this film based upon a comparison with the text upon which it is based, Tevye the Milkman."}, {"name": "Learning Objectives", "value": "This class provides the student with a vocabulary for the understanding of Eastern European Jews, their languages, life-style, religion and the controversies surrounding the impact of modernity upon the community. On a more general level, students are taught how to read literary texts critically and writing-skills are improved."}, {"name": "Teaching Method", "value": "Lecture interspersed with discussion of texts/films/images"}, {"name": "Evaluation Method", "value": "Students are expected to take an active part in class discussion (30% of course grade), to write a midterm essay of 3-5 pages (30 %) and a 10 page essay at the end of the term (40%)"}, {"name": "Class Materials (Required)", "value": "The Shtetl: A Creative Anthology of Jewish Life in Eastern Europe, ed. and tr. Joachim Neugroschel (Woodstock NY, 1989)<br/><br/>A Shtetl and Other Yiddish Novellas, ed. by Ruth Wisse (New York, 1986)<br/><br/>The I. L. Peretz Reader, ed. and with an introduction by Ruth Wisse (New York, 1990), pp. 17-77<br/><br/>Sholem Aleichem, Tevye the Dairyman and the Railroad Stories, tr. and with an introduction by Hillel Halkin (New York, 1987)<br/><br/>Isaac Bashevis Singer, In My Father's Court (New York, 1967 and many later editions)<br/><br/>Abraham Joshua Heschel, The Earth is the Lord's (New York 1962 and later editions)<br/><br/>Mark Zborowski and Elizabeth Herzog, Life is with People: the Culture of Shtetl Life (New York 1995)<br/><br/>Steven J. Zipperstein, Imagining Russian Jewy: Memory, History, Identity (University of Washington Press, 1990)"}], "instructor": ["Marcus G Moseley"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "12082", "subject": "JWSH_ST"}]