[{"class_mtg_info": [{"meet_t": "TuTh 2:30PM - 5:30PM", "meet_l": "Swift Hall 210"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Summer 2016", "name": "40444", "title": "WCAS PSYCH 314-0-25 Special Topics in Psychology", "class_attributes": "", "section": "40444", "instructors": [{"instructor_phone": "847/491-3652", "instructor_name": "Sara Cantonia Broaders", "instructor_addr": "Swift 243, 2029 Sheridan Road"}], "topic": "Psychology and Weird Beliefs", "course": "314-0", "descriptions": [{"name": "Overview of class", "value": "Lots of people have beliefs that other people think are just plain weird. Why do people have these beliefs? We'll examine some &quot;weird&quot; beliefs and try to understand what leads people to develop and maintain these beliefs. A complication arises since one person's &quot;weird&quot; belief may be another person's firmly held conviction. From this perspective, we'll also try to understand which beliefs are rational. Among the topics we will cover are: superstition, ESP and parapsychology, ghosts, witchcraft and magic, alien abduction, repressed memories of abuse, and creationism/intelligent design. Students will learn to use a wide variety of academic and popular press resources (including empirical research articles, ethnographic descriptions, philosophical arguments, popular press books, and documentary films) to explore the bases for these beliefs and practices."}, {"name": "Teaching Method", "value": "Teaching Method: discussion and films"}, {"name": "Evaluation Method", "value": "Evaluation Method: Grades will be based on weekly written reaction papers, class participation, and a final paper."}, {"name": "Class Materials (Required)", "value": "Readings:<br/>1. Clancy, S.A. (2005). Abducted: How people come to believe they were kidnapped by aliens. Harvard University Press. ISBN: 0-674-01879-6<br/><br/>2. Gilovich, T. (1991). How we know what isn't so: The fallibility of human reason in everyday life. Free Press. ISBN: 978-0029117064<br/><br/>3. Miller, K.R. (2008). Only a theory: Evolution and the battle for America's soul. Viking Press. ISBN: 978-0143115663<br/><br/>4. Sagan, C. (1996). The demon-haunted world. Ballantine Books. ISBN: 0-345-40946-9<br/><br/>5. Shermer, M. (2011). The believing brain. New York: Henry Holt. ISBN: 978-0-8050-9125-0<br/><br/>6. Wiseman, R. (2010). Paranormality: Why we see what isn't there. ISBN: 978-0-9568756-5-5"}], "lmod": "5/1/16 6:31 PM (CT)", "subject": "PSYCH"}]