[{"class_mtg_info": [{"meet_t": "TuTh 10:00AM - 12:30PM", "meet_l": "University Hall 318"}], "school": "WCAS", "overview_of_class": "AFST 276-0-20 \"African Literature in Translation \" , Summer 2016, Richard Lepine <br/><br/>The course is primarily a survey of African oral verbal arts traditions, with an additional focus on the links between these traditions and African films. The original works of art, the objects of study in the course, are not literature in the strict sense of the term-written verbal art-but rather take form in oral performance or electronic media like film, TV, radio, recorded disks, and web-based digital media. However, in print and in English translation, the course examples from various genres of African oral verbal arts performances (riddles, poetry, proverbs, panegyric, folktales, trickster tales, hero tales, epics) are all experienced as literature for purposes of analysis and interpretation. Four African films will also serve as primary course \"texts\": Wend Kuuni (1982; Gaston Kaboré, dir.; Burkina Faso), Keita: Heritage of the Griot (1995; Dani Kouyaté, dir.; Burkina Faso); La vie est belle/Life Is Rosy (1987; Ngangura Mweze and Bernard Lamy, dirs.; Zaïre [Democratic Republic of Congo]), and Yeelen (Souleymane Cissé, Mali, 1987, 105 min.). A major goal of the course is to explore the analytic approaches employed by scholars Harold Scheub and Robert Cancel, specialists in African oral traditions and their relationships with other arts media.", "qtr": "Summer 2016", "name": "African Literature in Translation", "title": "WCAS AFST 276-0-20 African Literature in Translation", "lmod": "5/1/16 6:30 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "8474912765", "instructor_name": "Richard Marshall   Lepine", "instructor_addr": "620 Library Place, rm. 201"}], "topic": "", "course": "276-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "AFST 276-0-20 &quot;African Literature in Translation &quot; , Summer 2016, Richard Lepine <br/><br/>The course is primarily a survey of African oral verbal arts traditions, with an additional focus on the links between these traditions and African films. The original works of art, the objects of study in the course, are not literature in the strict sense of the term-written verbal art-but rather take form in oral performance or electronic media like film, TV, radio, recorded disks, and web-based digital media. However, in print and in English translation, the course examples from various genres of African oral verbal arts performances (riddles, poetry, proverbs, panegyric, folktales, trickster tales, hero tales, epics) are all experienced as literature for purposes of analysis and interpretation. Four African films will also serve as primary course &quot;texts&quot;: Wend Kuuni (1982; Gaston Kaboré, dir.; Burkina Faso), Keita: Heritage of the Griot (1995; Dani Kouyaté, dir.; Burkina Faso); La vie est belle/Life Is Rosy (1987; Ngangura Mweze and Bernard Lamy, dirs.; Zaïre [Democratic Republic of Congo]), and Yeelen (Souleymane Cissé, Mali, 1987, 105 min.). A major goal of the course is to explore the analytic approaches employed by scholars Harold Scheub and Robert Cancel, specialists in African oral traditions and their relationships with other arts media."}, {"name": "Teaching Method", "value": "Students attend two 150-minute group lecture sessions each week in a University &quot;smart classroom.&quot; All coursework is web-based via a dedicated Canvas LMS site; the required Cancel course text has integrated digitized audio and video. The teaching method consists of the presentation of the artistic and scholarly texts; guidance through the multimedia learning resources connected to the material; classroom question and discussion; ongoing assessment and feedback on individual contributions to collaborative LMS-based projects; and a revisable draft process for the midterm and final compositions. Since a major goal of the course is the development of practical analytic strategies, part of that process involves composing a number of brief writing assignments: graded and ungraded short essays, some done in class, some submitted as homework. Three longer (roughly 5 to 10 page) interpretive studies are required: a wiki contribution posted to to the course's Canvas site as a collaborative project, and two traditional-style research and presentation compositions, one due at midterm and the other in the last week of classes. There is no final examination."}, {"name": "Evaluation Method", "value": "Wiki Project: In examining the oral performance genre of &quot;lyric&quot; (for course purposes, a generic term for all types of spoken and sung poetry) each participant will choose one of the 210 verses which make up the Yoruba divination system known as Sixteen Cowries. The verse the student chooses will then become the subject of a personal interpretation to be presented on a wiki accessed through the course's Canvas site.<br/>Assessment is primarily based on the writing assignments. The three major writing projects (contribution to the collaboratively-built wiki, midterm revisable draft composition, final revisable draft composition) are each worth 30% of the final course grade; the smaller in-class or take-home writings assignments will be averaged for the remaining 10% of the grade."}, {"name": "Class Materials (Required)", "value": "Required texts available at Norris Bookstore: <br/>Sixteen Cowries, William Bascom and Maranoro Salako, Indiana University Press, 1993 or later edition, paper, ISBN 0-253-208475 <br/><br/>Storytelling in Northern Zambia: Theory, Method, Practice and Other Necessary Fictions, Robert Cancel, Open Book Publishers, 2013, paper, ISBN-13: 978-1909254596<br/><br/>There are many additional required and recommended readings, but these will all be posted in pdf format on the course's Canvas site, in designated folders in Course Resources."}], "path": "/class-descriptions/4630/WCAS/AFST/276-0/40053", "instructor": ["Richard Marshall   Lepine"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "40053", "subject": "AFST"}]