[{"class_mtg_info": [{"meet_t": "MoWeFr 12:30PM - 1:50PM", "meet_l": "Swift Hall 107"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "21028", "title": "WCAS ECON 370-0-20 Environmental &amp; Natural Resource Economics", "class_attributes": "", "section": "21028", "instructors": [{"instructor_phone": "", "instructor_name": "Daley Catherine Kutzman", "instructor_addr": ""}], "topic": "", "course": "370-0", "descriptions": [{"name": "Overview of class", "value": "The environment and our natural resources are scarce and their values are quite hard to determine. Furthermore, there are a variety of issues with the incentives to use them well. This course will examine the application of economic tools to environmental and resource issues, illustrating both the power of markets and the problem(s) with markets. Over the quarter, we will study three major reasons for such problems (and their solutions) in the context of the environment: externalities, public goods, and property rights. We will discuss the merits and shortcomings of the valuation methods used by economists and policy-makers to place dollar values on environmental amenities, as these valuations define the tradeoffs faced by individuals, firms, and policy-makers. Once armed with these tools, we will focus on applications to specific markets for environmental goods and natural resources (e.g. pollution, energy, water, land, fisheries and forestry). The course will draw upon material taught in ECON 310-1, 310-2, and 281, with the tools from ECON 310-1 and 281 being absolutely essential."}, {"name": "Registration Requirements", "value": "ECON 281, 310-1, and 310-2"}, {"name": "Teaching Method", "value": "The class will meet twice per week for 80 minutes with lecturing, discussion, and small group work; there is high probability of a TA section on Fridays if a TA is available for the class."}, {"name": "Evaluation Method", "value": "There will be homework, one midterm, and a final exam."}, {"name": "Class Materials (Required)", "value": "Readings will be made available."}], "lmod": "12/29/16 6:57 PM (CT)", "subject": "ECON"}]