[{"class_mtg_info": [{"meet_t": "MoTuWeTh 11:00AM - 11:50AM", "meet_l": "Locy Hall 314"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "22692", "title": "WCAS ARABIC 121-2-20 Arabic II", "class_attributes": "Specific requirements in the language<br/><br/>", "section": "22692", "instructors": [{"instructor_phone": "", "instructor_name": "Asma   Ben Romdhane", "instructor_addr": ""}], "topic": "", "course": "121-2", "descriptions": [{"name": "Overview of class", "value": "This is the second part of a three-quarter course (121) which continues the path of Arabic I (111-1,2,3). This course deals with the next level of essential topics for daily and literary use of the Arabic language. The emphasis of this course will be on training students to read and understand a wider variety of Arabic texts and to work toward more efficient reading, to discuss orally text content and to write short paragraphs and translation (English/Arabic/English). In addition to the textbook used for instruction, there will be other selections for outside reading, predominantly taken from news sources, and use of audio-visual materials."}, {"name": "Registration Requirements", "value": "121-1 or equivalent (for Winter quarter), or instructor consent"}, {"name": "Teaching Method", "value": "Class time is devoted to conversation, reading, translation, structure explanation and drilling. Students may be required to use assigned audio-visual materials at home or in the Multi-Media Learning Center (MMLC)."}, {"name": "Evaluation Method", "value": "Final grade for the course will be based on the following: Attendance and Participation, Midterm, Final, Homework and Quizzes."}, {"name": "Class Materials (Required)", "value": "Al-Kitaab fii Ta callum al-cArabiyya, Third Edition, Part Two, Georgetown University Press - ISBN: 978-1-58901-962-1. <br/>Companion websites ?students will be able to purchase access after the course starts and they have their books. <br/>Arabic-English Dictionary: The Hans Wehr Dictionary of Modern Written Arabic by Hans Wehr, J. M. Cowan (Editor) 4th Edition (January 1993) ISBN: 0879500034."}], "lmod": "12/24/16 6:54 PM (CT)", "subject": "ARABIC"}]