[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Technological Institute AUD"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "35662", "title": "WCAS PSYCH 110-0-20 Introduction to Psychology", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>Attendance at 1st class mandatory<br/><br/>", "section": "35662", "instructors": [{"instructor_phone": "", "instructor_name": "Eli J Finkel", "instructor_addr": ""}], "topic": "", "course": "110-0", "descriptions": [{"name": "Overview of class", "value": "The purpose of this course is to present an overview of the field of psychology. Among the topics we will cover are: perception, memory, thinking and problem solving, motivation, emotion, social influences on behavior, personality, psychological disorders, and the treatment of psychopathology. Class lectures, readings, and laboratory experiences in combination will convey a sense of some of the foundational questions and methods of the science of psychology. Ultimately, the goal of this course is to impart an initial understanding of some fundamentals of human nature and behavior, as well as instill a deeper appreciation for the science of psychology. To this end, 10 hours of laboratory experience are required across the quarter to allow you to have first-hand experience of the way research is conducted in psychology. Alternatively, a paper (requiring roughly the same number of hours outside of class) reviewing primary research articles in psychology may be substituted for the laboratory experience. If you are under the age of 18, you must use the paper requirement to satisfy your laboratory credit."}, {"name": "Teaching Method", "value": "Lecture, demonstration, and discussion."}, {"name": "Evaluation Method", "value": "Grades will be based on two or three comprehensive examinations."}, {"name": "Class Materials (Required)", "value": "Introducing Psychology with Updates on DSM-5, Second Edition 2014<br/><br/>ISBN-10: 1-4641-6350-2<br/>ISBN-13: 978-1-4641-6350-0"}], "lmod": "2/21/17 6:50 PM (CT)", "subject": "PSYCH"}]