[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "Meets in Non-General PurposeRm"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "25467", "title": "WCAS ENGLISH 385-0-20 Topics in Combined Studies", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "25467", "instructors": [{"instructor_phone": "", "instructor_name": "Andrew Way Leong", "instructor_addr": "1897 Sheridan Rd #215"}], "topic": "Cowboys &amp; Samurai", "course": "385-0", "descriptions": [{"name": "Overview of class", "value": "The American cowboy and the Japanese samurai are often held up as mythic embodiments of the &quot;frontier&quot; or &quot;warrior&quot; spirits that define their respective nations. Yet despite their status as icons of national exceptionalism, the cowboy and samurai are surprisingly interchangeable. In the world of film, the Seven Samurai can soon become The Magnificent Seven.<br/><br/>This course explores two complementary genres: the Western and the jidaigeki (period drama). In addition to probing the concept of &quot;genre&quot; itself, we will also examine the problem of &quot;adaptation.&quot; How are elements present in one national, cinematic, or literary context transposed or re-coded to fit within another? What can the various cross-adaptations of samurai and cowboy films tell us about the shifting relations between Japan and the United States? How can generic conventions be &quot;bent&quot; or &quot;queered&quot; through practices of allusion, adaptation, and re-interpretation?"}, {"name": "Teaching Method", "value": "Discussion"}, {"name": "Evaluation Method", "value": "Participation (30%); Writing Statements (10%); Midterm Portfolio (7 pages) (20%); Final Portfolio (15 pages, including revisions of midterm) (40%)."}, {"name": "Class Materials (Required)", "value": "An extensive course reader available at Quartet Digital Printing; Humanity and Paper Balloons (1937, dir. Sadao Yamanaka, 86min); Stagecoach (1939, dir. John Ford, 96 min); Vendetta of a Samurai (1952, dir. Kazuo Hori, 80min); High Noon (1952, dir. Fred Zinnemann, 85min); Rashomon (1950, dir. Akira Kurosawa, 88min); The Outrage (1964, dir. Martin Ritt, 97min); Yojimbo (1961, dir. Akira Kurosawa, 110min); A Fistful of Dollars (1964, dir. Sergio Leone, 99min); Duel in the Sun (1946, dir. King Vidor, 145min) ; Lady Snowblood (1973, dir. Toshiya Fujita, 97min); Red River (1948, dir. Hanks, 133 min); The Tale of Zatoichi (1962, dir. Kenji Misumi, 95 min); Taboo (Gohatto) (1999, dir. Nagisa Oshima, 100min); Brokeback Mountain (2005, dir. Ang Lee, 134min) ; The Twilight Samurai (2002, dir. Y?ji Yamada, 129min); The Last Samurai (2003, dir. Edward Zwick, 131min); Sukiyaki Western Django (2007, dir. Takashi Miike, 121min)."}], "lmod": "1/9/16 6:47 PM (CT)", "subject": "ENGLISH"}]