[{"class_mtg_info": [{"meet_t": "TuTh 1:00PM - 4:50PM", "meet_l": "Technological Institute F246"}], "school": "WCAS", "overview_of_class": "Students will learn to perform statistical analysis, give presentations and write journal articles while producing some of the most important results in modern physics. Students will complete three experiments from a selection that includes Nuclear magnetic resonance, Saturated absorption spectroscopy, Entangled photons, Mossbauer spectroscopy, Muon lifetime, Gamma angular correlations, and the Chaotic pendulum.", "qtr": "Spring 2017", "name": "General Physics Laboratory", "title": "WCAS PHYSICS 360-0-20 General Physics Laboratory", "lmod": "2/24/17 6:52 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Enectali   Figueroa-Feliciano", "instructor_addr": ""}], "topic": "", "course": "360-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Students will learn to perform statistical analysis, give presentations and write journal articles while producing some of the most important results in modern physics. Students will complete three experiments from a selection that includes Nuclear magnetic resonance, Saturated absorption spectroscopy, Entangled photons, Mossbauer spectroscopy, Muon lifetime, Gamma angular correlations, and the Chaotic pendulum."}, {"name": "Registration Requirements", "value": "Prerequisite: 333-1,2 or consent of instructor: 359-1 is not a prerequisite for 360-0."}, {"name": "Learning Objectives", "value": "Students will learn to give technical presentations, write reports in the style of journal articles, and do basic statistical data analysis while performing experiments in modern physics including nuclear and particle physics, atomic physics, quantum physics, condensed matter physics, and chaos."}, {"name": "Teaching Method", "value": "Classes begin with one-hour lectures on statistical data analysis for the first part of the course, and with student presentations on the theory behind the experiments in the lab for the second part of the course. A three hour lab session follows the lecture or presentations. <br/>Each student is to complete three experiments during the course. <br/>Students perform labs in pairs and produce individual lab reports in the style of journal articles. Students have full access to the lab outside of class hours, once safety training requirements are satisfied."}, {"name": "Evaluation Method", "value": "The statistics portion of the course will conclude with an exam on basic statistical data analysis. Students will perform three experiments during the course - for each lab the student will give a 5-minute presentation, complete a short problem set, turn in a lab notebook, and write a lab report in the style of a journal article. Grades are based on the demonstrated understanding of the physics being studied, technical communication technique, correct quantitative data analysis, and success in meeting lab objectives. The final is a 1-hour presentation given to the instructor on one of the labs completed during the course. The final is graded in equal parts on the presentation of physics theory, experimental apparatus/procedure, and results/analysis."}, {"name": "Class Materials (Required)", "value": "Three firmly bound, quadrille ruled notebooks to keep daily records work in the laboratory (one notebook per lab)."}, {"name": "Class Materials (Suggested)", "value": "Statistical Data Analysis by- Glen Cowan, Oxford Press, ISBN: 978-0198501558<br/><br/><br/>Access to a word processing program such as Tex, OpenOffice Writer, or Microsoft Word. Handwritten or typed reports are accepted; however, modifications are much easier and quicker when word processing software is employed."}, {"name": "Class Notes", "value": "Statistical Data Analysis by- Glen Cowan, Oxford Press, ISBN: 978-0198501558<br/> <br/>Access to a computer running LaTeX or some variant thereof for the lab reports. Handwritten or typed reports are not accepted unless explicitly agreed to beforehand with the instructor. <br/>Data processing and word processing software are installed on the computers in the laboratory for the students' use."}], "path": "/class-descriptions/4660/WCAS/PHYSICS/360-0/37080", "instructor": ["Enectali   Figueroa-Feliciano"], "class_attributes": "", "id": "37080", "subject": "PHYSICS"}]