[{"class_mtg_info": [{"meet_t": "Tu 3:30PM - 6:20PM", "meet_l": "Scott Hall 319 ExperimentalLab"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Winter 2017", "name": "22851", "title": "WCAS POLI_SCI 101-6-22 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "22851", "instructors": [{"instructor_phone": "", "instructor_name": "James N Druckman", "instructor_addr": ""}], "topic": "Sports, Politics, and Public Opinion", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "Prof. James Druckman Winter 2017 &quot;Sports, Politics, and Public Opinion&quot;<br/>Sports and politics have become increasingly intertwined over the last half-century. Local, state, and federal governments as well as other governing bodies (e.g., the NCAA) regulate who can participate (e.g., eligibility, equality) and what standards athletes must meet (e.g., drug testing, academic performance). These organizations also oversee economic (e.g., resource distribution) and symbolic (e.g., mascots) issues. Ideally, governing policies would be responsive to the wishes of their constituents (players, owners, voters), but are they? How would we know? How do we gauge their opinions? Alternatively, how do sports affect public opinion? Do citizens prefer politicians who engage in sports? Do media portrayals of sports affect what citizens think about race and/or gender? These are the kinds of questions we will consider in this class. This involves learning the science of public opinion polling and applying it to study opinions about public policies relevant to sports."}, {"name": "Registration Requirements", "value": "must be 1st year"}, {"name": "Teaching Method", "value": "discussion and a bit of lecture"}, {"name": "Evaluation Method", "value": "short assignments and research paper"}, {"name": "Class Materials (Required)", "value": "Various articles will be used."}], "lmod": "12/25/16 7:05 PM (CT)", "subject": "POLI_SCI"}]