[{"school": "WCAS", "overview_of_class": "Marriage is in the news. We hear that it is a fundamental human right, the foundation of civilization, the bulwark of social order, ordained by God, valid between a man and a woman, for reproduction and property transmission. The current controversy over gay marriage is only one in a series of moments in United States history when marriage has been the subject of criticism and debate. Feminists of the 1970s and 80s - as well as feminists of the 1840s and 50s - saw marriage as an instrument of women's oppression. States across the nation outlawed interracial marriage to preserve &quot;racial purity.&quot; Social commentators in the 1910s and 20s worried that the nation would be ruined by a divorce epidemic. Marriage, in short, has been the object of controversy and the source of anxiety, positioned as both the source and solution to the nation's problems. This course will examine not only the controversies over marriage but also the history of marriage in the United States. What kinds of institution is marriage? What purpose and functions does it serve? How has marriage changed over time, and why?", "name": "First-Year Seminar-American History", "section": "20", "topic": "The History of Marriage in the U.S.", "course": "102-6", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4620/WCAS/HISTORY/102-6/33345", "instructor": ["Susan   Pearson"], "id": "33345", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "Who are controversial people and how have their lives been depicted? This course examines seven controversial figures through memoir, biography, news accounts, films, and television series. They include activists like Grace Lee Boggs and Malcolm X, celebrities like Eddie Huang, and historical figures like Cesar Chavez. We will discuss narrative, storytelling, and hidden histories as we study their lives and the stories about their lives.", "name": "First-Year Seminar-American History", "section": "21", "topic": "Controversial Lives", "course": "102-6", "meeting_time": ["MoWe 9:30AM - 10:50AM"], "path": "/class-descriptions/4620/WCAS/HISTORY/102-6/33346", "instructor": ["Ji-Yeon   Yuh"], "id": "33346", "subject": "HISTORY"}]