[{"class_mtg_info": [{"meet_t": "Tu 5:00PM - 8:00PM", "meet_l": "Locy Hall 314"}], "school": "WCAS", "overview_of_class": "Tantric Buddhist art raises fundamental issues of art-making in various ways?theoretical, historical, and ontological.  The use of sculptures and paintings in the system(s) goes well beyond \"devotion\" though that also comes into play.  Consecrated images, books, or installed sets of sculptures do not merely represent the deities, they ARE the deities, and simultaneously the path to them, teaching tools, and the locus of ritual interaction.  Some Esoteric Buddhist texts encourage practitioners to become artists and to paint images with their own blood of the deities whom they meditatively become, dissolving the distinction between subject and object. Issues of the relationship between texts and images come to the fore in Tantric Buddhist art, since at times the visionary aspect (mental and physical) is more fundamental to the creation of objects than the later descriptions, and acts upon the initiate-beholder with greater immediacy.  Using both images and texts (in translation), the course will consider the ways that images are engaged and written about in Indian Tantric contexts, what they convey (rather than \"mean\"), their relationship with those of ?aiva Tantra, and how both visual art and texts provide avenues to map and date the system's development.", "qtr": "Winter 2016", "name": "Studies in Asian Art", "title": "WCAS ART_HIST 480-0-20 Studies in Asian Art", "lmod": "1/9/16 6:43 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Robert Nelson Linrothe", "instructor_addr": ""}], "topic": "Visible Tantra: Indian Esoteric Buddhist Art", "course": "480-0", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "descriptions": [{"name": "Overview of class", "value": "Tantric Buddhist art raises fundamental issues of art-making in various ways?theoretical, historical, and ontological. The use of sculptures and paintings in the system(s) goes well beyond &quot;devotion&quot; though that also comes into play. Consecrated images, books, or installed sets of sculptures do not merely represent the deities, they ARE the deities, and simultaneously the path to them, teaching tools, and the locus of ritual interaction. Some Esoteric Buddhist texts encourage practitioners to become artists and to paint images with their own blood of the deities whom they meditatively become, dissolving the distinction between subject and object. Issues of the relationship between texts and images come to the fore in Tantric Buddhist art, since at times the visionary aspect (mental and physical) is more fundamental to the creation of objects than the later descriptions, and acts upon the initiate-beholder with greater immediacy. Using both images and texts (in translation), the course will consider the ways that images are engaged and written about in Indian Tantric contexts, what they convey (rather than &quot;mean&quot;), their relationship with those of ?aiva Tantra, and how both visual art and texts provide avenues to map and date the system's development."}, {"name": "Teaching Method", "value": "DiscussionReadings"}, {"name": "Evaluation Method", "value": "Class participation: 40%<br/>Paper, final: 40%<br/>Presentations: 20%<br/>"}, {"name": "Class Materials (Required)", "value": "Ronald Davidson, Indian Esoteric Buddhism: A Social History of the Tantric Movement (Columbia University Press, 2003)<br/><br/>Christian Wedemeyer, Making Sense of Tantric Buddhism: History Semiology, and Transgression in the Indian Traditions (Columbia University Press, 2012)<br/>Other readings will be provided in class."}], "path": "/class-descriptions/4610/WCAS/ART_HIST/480-0/22779", "instructor": ["Robert Nelson Linrothe"], "class_attributes": "", "id": "22779", "subject": "ART_HIST"}]