[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "University Hall 018"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "35051", "title": "WCAS ENGLISH 397-0-20 Research Seminar for Literature Majors", "class_attributes": "", "section": "35051", "instructors": [{"instructor_phone": "", "instructor_name": "Katharine Helen Breen", "instructor_addr": ""}], "topic": "Allegory: From Rome to Star Trek", "course": "397-0", "descriptions": [{"name": "Overview of class", "value": "When your high school English teacher praised &quot;rounded&quot; literary characters at the expense of &quot;flat&quot; ones, he or she was praising the novelistic over the allegorical, representing the latter as at best an antiquated literary form and at worst a vehicle for heavy-handed indoctrination. This seminar will challenge such assumptions by investigating allegory as a dynamic and still vital literary form. We will proceed by reading canonical allegorical texts and foundational works of allegorical theory in conjunction with more recent examinations of similar themes: Prudentius' gruesome Psychomachia alongside Paul de Man's &quot;Rhetoric of Temporality&quot; and Joss Whedon's Buffy the Vampire Slayer; Boethius' stately Consolation of Philosophy alongside the American icon Lady Liberty; William Langland's Piers Plowman alongside Ernst Kantorowicz's The King's Two Bodies and Gene Roddenberry's Star Trek; and the morality play Everyman alongside the 1957 and 2007 versions of the western The 3:10 to Yuma. Together, we will produce descriptions of these authors' allegorical practices that take into account their complexity. In what ways are allegory and allegorical personifications useful instruments for thinking? What kinds of reading practices do they seem to allow or encourage? What kinds of work do they do that novelistic characters cannot? These shared texts will provide a rich conceptual background for students' research into an allegorical figure of their own choosing. Working closely with each other as well as the instructor, students will learn to navigate electronic databases, identify and evaluate pertinent critical articles, and produce article abstracts, an annotated bibliography, and a project proposal, culminating in a 12-15 page research paper."}, {"name": "Teaching Method", "value": "Seminar discussions, occasional short lectures."}, {"name": "Evaluation Method", "value": "Regular short writing assignments, including close readings of both texts and images, character analyses, and article abstracts; an annotated bibliography, developed over the course of the quarter; a project proposal; and a final research-based essay."}, {"name": "Class Materials (Required)", "value": "Boethius, The Consolation of Philosophy;<br/>Paul de Man, &quot;The Rhetoric of Temporality&quot;;<br/>Delmer Daves, The 3:10 to Yuma (1957);<br/>William Langland, Piers Plowman;<br/>Kantorowicz, The King's Two Bodies;<br/>James Mangold, The 3:10 to Yuma (2007);<br/>Prudentius, Psychomachia;<br/>Gene Roddenberry, Star Trek;<br/>Joss Whedon, Buffy the Vampire Slayer."}, {"name": "Class Notes", "value": "Post 1830/TTC"}], "lmod": "4/3/16 7:59 PM (CT)", "subject": "ENGLISH"}]