[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:50PM", "meet_l": "Frances Searle Building 1421"}], "school": "SoC", "enrl_requirement": "", "qtr": "Winter 2017", "name": "23436", "title": "SoC COMM_ST 102-0-27 Public Speaking", "class_attributes": "Attendance at 1st class mandatory<br/><br/>Engineering Students Only<br/><br/>", "section": "23436", "instructors": [{"instructor_phone": "", "instructor_name": "Daniel Edward Moser", "instructor_addr": ""}], "topic": "", "course": "102-0", "descriptions": [{"name": "Overview of class", "value": "Theory, composition, delivery, and criticism of public speeches. Public Speaking is a course designed for Communication Studies and Engineering majors but is open to all students at the university. The course has five goals. First, students will learn to participate in public deliberation by analyzing and crafting speeches to persuade fellow citizens regarding matters of policy. Second, the course provides students with an opportunity to develop competencies in research, argumentation, and writing. Third, the course provides students the opportunity to gain confidence and delivery skills as public speakers. Fourth, the course teaches some elements of basic communication theory. Finally, the course incorporates civic engagement through its content and context in an effort to encourage community awareness. Together, these goals will help students to become more adept at public speaking and better prepared for civic participation and leadership. During this course, students will each deliver a variety of speeches, with a minimum of three (3) major speeches during the quarter with additional minor speeches. Students will be assessed with written feedback for each major speech. There will also be a graded component of written work that may include: reflective writing, analysis of a speech, self-critique of a speech, or other appropriate assignments. Participation, feedback on speeches, homework, and other relevant assignments will be part of the formal assessment and constitute 40% or less of the overall grade, with speeches constituting 60% or more of the overall grade. Speeches will increase in percentage value over the course of the class to encourage improvement and the addition of new skills as the course progresses."}, {"name": "Class Materials (Required)", "value": "Required texts may include: <br/>The Essential Guide to Rhetoric. By William Keith and Christian Lundberg. Bedford/St Martin's, 2008<br/>A Pocket Guide to Public Speaking, 4th Edition. By Dan O'Hair, Hannah Rubenstein, and Rob Stewart. Bedford/St Martin's, 2012"}], "lmod": "12/24/16 6:45 PM (CT)", "subject": "COMM_ST"}]