[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "Technological Institute LG76"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-registration -  Reserved for Political Science or International Studies students.", "qtr": "Spring 2017", "name": "35541", "title": "WCAS POLI_SCI 380-0-20 Refugee Crises and Human Rights", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "35541", "instructors": [{"instructor_phone": "", "instructor_name": "Galya Benarieh Ruffer", "instructor_addr": ""}], "topic": "", "course": "380-0", "descriptions": [{"name": "Overview of class", "value": "At the moment when the number of refugees, asylum-seekers and internally displaced people worldwide has, for the first time in the post-World War II era, exceeded 50 million people, countries are closing their borders. In the United States the new Trump Administration has issued Executive Orders suspending refugee admission for four months, banning entry of Syrian refugee entirely until further notice and reducing the country's total refugee admissions for the fiscal year 2017 by more than half. Across Europe the situation for refugees is just as bleak. Through this course you will better understand the legality of these responses, the obligations of signatory states to the Refugee Convention, the role of refugee hosting states, the ways in which the humanitarian system of refugee protection contributes to global cooperation and its shortcomings. More broadly, we will consider the differences in the kinds of refugee situations we have today and learn about what it means to be a refugee."}, {"name": "Learning Objectives", "value": "1. To introduce you to the international framework for the protection of refugees. <br/>2. To learn about and critically assess the implications of the history of the creation of the international regime for addressing refugee crises today. <br/>3. To provide you with case studies and analytical tools to examine and appreciate the responsibilities, challenges and constraints of international cooperation.<br/>4. To learn about and critically assess the organizational structure of human rights protection as a tool for addressing refugee crises<br/>5. To help you think through the ethical concerns of responding to refugee crisis.<br/>6. To help you appreciate and critically analyze multiple perspectives on the themes and topics.<br/>7. To encourage you to develop your own understanding on refugee protection, the challenges of protection and promote human rights and social justice.<br/>8. To help you communicate your ideas, both oral and written, clearly and with confidence."}, {"name": "Teaching Method", "value": "Lecture"}, {"name": "Evaluation Method", "value": "20% Participation includes contributions to class discussion and 4 reading reflections (25points each) (200 points)<br/>25% Midterm (250 points) <br/>25% Refugee Policy Assessment Project (250 points) <br/>30% Final Paper (300 points)"}, {"name": "Class Materials (Required)", "value": "Books are William Maley: What is a Refugee (Oxford University Press, 2016)<br/>ISBN: 978-0190652388<br/>Price: $21.95 paperback"}], "lmod": "2/14/17 6:48 PM (CT)", "subject": "POLI_SCI"}]