[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "Locy Hall 301"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "31180", "title": "WCAS HUM 370-4-21 Special Topics in the Humanities", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "31180", "instructors": [{"instructor_phone": "847/467-0515", "instructor_name": "Anthony S Chen", "instructor_addr": "1808 Chicago Ave., Room 105"}], "topic": "Politics Through Biography", "course": "370-4", "descriptions": [{"name": "Overview of class", "value": "Politics, Society, and Biography in the United States from the New Deal to the Great Recession?<br/> <br/>This course aims to give Northwestern undergraduates a foundation of knowledge and critical reasoning skills that will enable them to develop and refine their own understanding of how and why public policy in the United States has developed historically in the ways that it has?and not in other ways it might have developed. Social policy, industrial relations, health care, fiscal policy, and financial regulation are among the policy areas that we will consider. Why is social spending in the United States relatively stingy? Why is so much of it channeled through the private sector? Why is the unionization rate so low? Why are so many people uninsured? Why have top marginal tax rates for personal income tended to be relatively low since the late-1980s? Why is the regulation of the U.S. financial system so fragmented and decentralized? The course will begin chronologically with the New Deal and end with the Great Recession. The main readings for the course will consist of selected biographies of major social and political figures. These biographies are meant to provide a uniquely valuable window into the policy-making process ? helping students to understand policy developments from the bottom-up as well as the top-down."}, {"name": "Registration Requirements", "value": "There are no prerequisites."}, {"name": "Teaching Method", "value": "Class will consist of a combination of lectures and discussion."}, {"name": "Evaluation Method", "value": "There will be several quizzes covering the readings and lectures as well as a small writing assignment involving one of the required biographies. There will also be a longer writing assignment: In consultation with the instructor, students will have the opportunity to read a biography of an individual of their choosing and write a paper that uses the biography to explore the political development of public policy in the United States."}, {"name": "Class Materials (Required)", "value": "The biographies that will be assigned include the following: Linda Gordon, <em>Dorothea Lange: A Life Beyond Limits.</em> New York: Norton, 2010; Nelson Lichtenstein, <em>The Most Dangerous Man in Detroit.</em> New York: Basic Books, 1995; Wendell E. Pritchett, <em>Robert Clifton Weaver and the American City: The Life and Times of an Urban Reformer.</em> Chicago: University of Chicago Press, 2008; Robert Dallek, <em>Lyndon B. Johnson: Portrait of a President.</em> New York: Oxford University Press, 2005; Donald T. Critchlow, <em>Phyllis Schlafly and Grassroots Conservatism: A Woman's Crusade.</em> Princeton: Princeton University Press, 2008; and Joseph Crespino, <em>Strom Thurmond's America.</em> New York: Hill and Wang, 2012."}], "lmod": "4/3/16 8:08 PM (CT)", "subject": "HUM"}]