[{"school": "JOUR", "overview_of_class": "Shopper Marketing is marketing to consumers who are in a &quot;shopping mode&quot; including being in a retail store. It is comprised of category management, retail display, personal selling, packaging, promotion, research and marketing brought together in retailer-specific programs designed to fit the mutual interests of brands and retailers. The course covers the core practices of shopper marketing, including understanding consumers in a shopping mode, and developing insights that drive the most successful shopper marketing programs. Students learn to deal with the sometimes conflicting interests of retailers and manufacturers in their efforts to influence their shared target consumers. Students identify best practices for executing and measuring the wide variety of in-store, near-store and online tactics and put these practices into use through a course-long shopper marketing project for a sponsoring company.", "name": "Special Topics", "section": "20", "topic": "Shopper Marketing", "course": "490-0", "meeting_time": ["Tu 6:00PM - 8:50PM"], "path": "/class-descriptions/4620/JOUR/IMC/490-0/31193", "instructor": ["April Lynn Carlisle", "Elizabeth T Harris"], "id": "31193", "subject": "IMC"}, {"school": "JOUR", "overview_of_class": "Media Strategy explores how organizations design and allocate media advertising spending. Particular focus is given to the processes and procedures that facilitate media innovation and creativity. A media brief for a new brand launch provided at the start of the course serves as the basis for weekly exercises in media decision-making. After reviewing the appropriate theory and research, students assess media alternatives, decide what is best for the brand and present and discuss their choices in class. A final project will challenge students to pull media decisions together into a cohesive recommendation.", "name": "Special Topics", "section": "21", "topic": "Media Strategy", "course": "490-0", "meeting_time": ["Mo 9:00AM - 11:50AM"], "path": "/class-descriptions/4620/JOUR/IMC/490-0/31194", "instructor": ["Robert Joseph Wisniewski"], "id": "31194", "subject": "IMC"}, {"school": "JOUR", "overview_of_class": "Customer Value Innovation focuses on the uncertain and dynamic nature of innovation in the context of marketing communications and customer experiences. The course addresses key questions about how organizations innovate to create better value to strengthen the relevance of organizations to customers. A key area of emphasis is how organizations improve the way they introduce and nurture continuous value innovation. The course features a hands-on client project in which students develop a strategy for conducting marketing communications to enhance customer value.", "name": "Special Topics", "section": "22", "topic": "Customer Value Innovation", "course": "490-0", "meeting_time": ["Mo 6:00PM - 8:50PM"], "path": "/class-descriptions/4620/JOUR/IMC/490-0/31195", "instructor": ["Jonathan R Copulsky"], "id": "31195", "subject": "IMC"}, {"school": "JOUR", "overview_of_class": "Shopper Marketing is marketing to consumers who are in a &quot;shopping mode&quot; including being in a retail store. It is comprised of category management, retail display, personal selling, packaging, promotion, research and marketing brought together in retailer-specific programs designed to fit the mutual interests of brands and retailers. The course covers the core practices of shopper marketing, including understanding consumers in a shopping mode, and developing insights that drive the most successful shopper marketing programs. Students learn to deal with the sometimes conflicting interests of retailers and manufacturers in their efforts to influence their shared target consumers. Students identify best practices for executing and measuring the wide variety of in-store, near-store and online tactics and put these practices into use through a course-long shopper marketing project for a sponsoring company.", "name": "Special Topics", "section": "23", "topic": "Shopper Marketing", "course": "490-0", "meeting_time": ["Mo 6:00PM - 8:50PM"], "path": "/class-descriptions/4620/JOUR/IMC/490-0/31196", "instructor": ["Timothy M Dorgan"], "id": "31196", "subject": "IMC"}, {"school": "JOUR", "overview_of_class": "Advanced Marketing Models covers building, interpreting and applying predictive models used in marketing communications research. The course explores many of the issues that arise in building such models, e.g., exploratory vs. confirmatory studies, inductive vs. deductive reasoning, multicollinearity, heteroscedasticity, nonlinearity, interactions, model selection, regularization, bias-variance tradeoff, extrapolation, and the curse of dimensionality. You will learn how some linear and nonparametric methods address these issues. Students will understand how and why different methods work, which methods are well-suited for certain situations, and the extent of the conclusions that can be drawn from various models. Students will learn multiple statistical software packages, including R, SAS, SPSS, and the IBM miner. There will be two projects this quarter, and students will work with students from the University of Amsterdam on one of the two.", "name": "Special Topics", "section": "24", "topic": "Advanced Marketing Models", "course": "490-0", "meeting_time": ["Tu 9:00AM - 11:50AM"], "path": "/class-descriptions/4620/JOUR/IMC/490-0/31197", "instructor": ["Edward Carl Malthouse", "Martin Paul   Block"], "id": "31197", "subject": "IMC"}, {"school": "JOUR", "overview_of_class": "Leading Media Organizations helps students develop knowledge and skills to become successful leaders of media companies through a series of readings, assignments, interactive lectures and guest speakers. The course features several media executives, who describe their approaches to leading and organizing media companies. Time is spent in each class discussing the latest news about media companies and their leaders. Students use class frameworks to examine a media company of their choice for the media company analysis assignment. Students also have a unique opportunity to develop their mentoring skills with Northwestern undergraduate students. In sum, students attain a greater understanding of the media industry with a focus on developing skills to effectively lead media companies.", "name": "Special Topics", "section": "25", "topic": "Leading Media Organizations", "course": "490-0", "meeting_time": ["We 12:00PM - 2:50PM"], "path": "/class-descriptions/4620/JOUR/IMC/490-0/37809", "instructor": ["Daniel A Gruber"], "id": "37809", "subject": "IMC"}, {"school": "JOUR", "overview_of_class": "", "name": "Special Topics", "section": "26", "topic": "IMC Leadership", "course": "490-0", "meeting_time": ["TuWeThFrSa 8:00AM - 8:00PM"], "path": "/class-descriptions/4620/JOUR/IMC/490-0/38302", "instructor": ["Tom   Collinger", "Candy   Lee"], "id": "38302", "subject": "IMC"}]