[{"class_mtg_info": [{"meet_t": "Th 6:15PM - 9:15PM", "meet_l": "Wieboldt Hall 415"}], "school": "SCS", "overview_of_class": "his course introduces students to the current tools and technologies used for designing and developing interactive Web sites. Students will explore the basic design principles of page layout and navigation. Students will also learn how to develop Web pages using the Hypertext Markup Language (HTML5), describe page presentation using the Cascading Style Sheet (CSS) language, and develop facility with useful Web development applications such as Adobe Dreamweaver. The primary focus of this course will be on client-side technologies. At the end of the course, students will be familiar with the basic Web page components and structures. Special emphasis will be on understanding the Document Object Model (DOM) used in Web documents and used by the JavaScript language for creating interactive Web pages. Through the use of JavaScript, students will be introduced to programming concepts, event-driven programming, and entry-level object-orientation. Various other Web technologies such as DHTML, XML, XSLT, and Ajax will be also discussed.<br/><br/>This hybrid course combines in-class lecture and discussion on campus with online sessions. In-class meeting dates will be announced.", "qtr": "Fall 2017", "name": "Tools and Technologies of the World Wide Web", "title": "SCS CIS 130-CN-16 Tools and Technologies of the World Wide Web", "lmod": "9/12/17 6:53 PM (CT)", "section": "16", "topic": "", "course": "130-CN", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "his course introduces students to the current tools and technologies used for designing and developing interactive Web sites. Students will explore the basic design principles of page layout and navigation. Students will also learn how to develop Web pages using the Hypertext Markup Language (HTML5), describe page presentation using the Cascading Style Sheet (CSS) language, and develop facility with useful Web development applications such as Adobe Dreamweaver. The primary focus of this course will be on client-side technologies. At the end of the course, students will be familiar with the basic Web page components and structures. Special emphasis will be on understanding the Document Object Model (DOM) used in Web documents and used by the JavaScript language for creating interactive Web pages. Through the use of JavaScript, students will be introduced to programming concepts, event-driven programming, and entry-level object-orientation. Various other Web technologies such as DHTML, XML, XSLT, and Ajax will be also discussed.<br/><br/>This hybrid course combines in-class lecture and discussion on campus with online sessions. In-class meeting dates will be announced."}, {"name": "Registration Requirements", "value": "CIS 110 is recommended but not required."}, {"name": "Learning Objectives", "value": "1. Use HTML5 concepts and format to markup Web page components without resorting to Web authoring tools.<br/>2. Use CSS concepts and format to describe Web page presentation without resorting to tools.<br/>3. Use JavaScript programming techniques and the jQuery library to create interactive and dynamic Web pages.<br/>4. Demonstrate utility with event handling techniques to create dynamic Web pages.<br/>5. Demonstrate utility with the concepts of Document Object Model (DOM), XML, and Web services.<br/>6. Practice XML document format and validation."}, {"name": "Teaching Method", "value": "Case studies<br/>Class participation<br/>Demonstrations<br/>In-class and online Discussions<br/>Team work<br/>Lecture<br/>Online work <br/>Readings<br/>Course project"}, {"name": "Evaluation Method", "value": "Labs 12.5%<br/>Participation/Discussions 10%<br/>Homeworks/Quizzes 27.5%<br/>Midterm Exam 15%<br/>Final Exam 15%<br/>Project 20%"}, {"name": "Class Materials (Required)", "value": "Required Textbook: <br/>There is one required textbook for this course. Reading assignments will be given from the required textbook. From time to time, other reference materials will be used to cover topics that are not present in the required textbook.<br/><br/>1. Internet & World Wide Web: How to Program, 5th Edition, P. J. Deitel and H. M. Deitel; Pearson. ISBN-9780132151399<br/><br/>Recommended Supplemental Textbook:<br/>1. Web Development & Design Foundations with HTML5, 8th edition. T. Felke-Morris. Addison Wesley, 2017. (ISBN-9780134323626)<br/><br/>Software: <br/>? Text Editor such as the freeware Notepad++ or TextPad for Windows or TextWrangler for Mac<br/>? Adobe Dreamweaver<br/>? Exchanger XML Lite from Cladonia"}, {"name": "Class Notes", "value": "This course is a hybrid course. As such, roughly half of the material will be discussed in-class and the rest will be taught online. For in-class sessions and based on previous feedback, the course will put more emphasis on hands-on exercises. Thus, attendance is strongly encouraged. If you miss one class, you miss a good portion of the entire course. To encourage attendance, there will be no make-up class exercise/quiz points if you miss the class. Also I generally do not give \"make-up\" quizzes unless there is a pre-arrangement with me or a proof of extreme medical condition. For the online portion of the material, each student is expected to work on his/her own to complete the assigned work online. The instructor is available to help and team works is strongly encouraged in this course, but most of the work will be done online by each student."}], "instructor": ["Awny M Alnusair"], "class_attributes": "", "id": "17536", "subject": "CIS"}]