[{"class_mtg_info": [{"meet_t": "Tu 6:00PM - 8:50PM", "meet_l": "Kresge 3438 Philosophy Sem. Rm"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: REASON: Pre-registration is not allowed for this class. Please try again during regular registration.", "qtr": "Spring 2017", "name": "33092", "title": "WCAS COMP_LIT 481-0-22 Studies in Literary Theory", "class_attributes": "", "section": "33092", "instructors": [{"instructor_phone": "847/491-5293", "instructor_name": "Penelope L Deutscher", "instructor_addr": "Crowe 1-107"}], "topic": "", "course": "481-0", "descriptions": [{"name": "Overview of class", "value": "Biopolitics After Foucault<br/><br/>This is an interdisciplinary course, drawing on literatures grounded in contemporary French philosophy ? the mid- period work of Michel Foucault ? and its ongoing impact on race, gender and sexuality studies. It considers the contemporary legacy of Michel Foucault in these domains with a focus on figures including Achille Mbembe, Jasbir Puar, Wendy Brown, Judith Butler, Ann Stoler, Lauren Berlant, Sharon Holland, and Alex Weheliye Participants will spend about the first section of the course reviewing Foucault's College de France lectures from 1973- 1979. We will track their impact on the development within post-Foucauldian biopolitics of the concepts of necropolitics, thanatopolitics, and reproductive biopolitics, giving attention on the one hand, to the role within these fields of critiques of Foucault by Esposito and Agamben, and new understandings of the reproductive biopoliticization of both gender and race . In light of the increasing focus in the field of post-Foucauldian theory of necropolitics and thanatopolitics, the courses ends with a focus on a number of new directions after Foucauldian biopolitics: such as vitalism, utopianism, futurism, the reconfiguration of life, or alternatively, the &quot;anti-social thesis.&quot;"}, {"name": "Learning Objectives", "value": "Acquistion of the core fundamentals of contemporary Foucauldian and deconstructive theory. Familiarity with the scholarly reception and discussion of this material from a gender studies, critical race studies and sexuality studies based perspective."}, {"name": "Evaluation Method", "value": "Class presentation, one long and one short paper."}, {"name": "Class Materials (Required)", "value": "course pack"}], "lmod": "2/14/17 6:43 PM (CT)", "subject": "COMP_LIT"}]