[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "TBA"}], "school": "WCAS", "overview_of_class": "Have robots always been queer? What do representations of robots and cyborgs in popular film, sci-fi literature, and cultural anthropology tell us about what it means to be \"human?\" <br/>In this class we will use critical race studies, queer and feminist theory, crip studies, and science and technology studies (STS) to analyze representations of \"cyborg\" bodies in speculative fiction and ethnography. Our case examples explore the politics of the body through narratives of military research, artificial intelligence, sex work, urbanism and segregation, deep space and deep ocean research, prosthetics and athleticism, new reproductive technologies, and more. We will engage with poetry, film, visual art, and speculative fiction to explore how bodies are dreamed, crafted, and represented.", "qtr": "Fall 2017", "name": "Postcolonial Studies and Gender and Sexuality", "title": "WCAS GNDR_ST 363-0-20 Postcolonial Studies and Gender and Sexuality", "lmod": "5/9/17 7:25 PM (CT)", "section": "20", "topic": "Queer Robotics: Cyborgs & Fantasy in Postcolonial", "course": "363-0", "enrl_requirement": "Enrollment Requirements: Reserved for Gender Studies students.", "descriptions": [{"name": "Overview of class", "value": "Have robots always been queer? What do representations of robots and cyborgs in popular film, sci-fi literature, and cultural anthropology tell us about what it means to be \"human?\" <br/>In this class we will use critical race studies, queer and feminist theory, crip studies, and science and technology studies (STS) to analyze representations of \"cyborg\" bodies in speculative fiction and ethnography. Our case examples explore the politics of the body through narratives of military research, artificial intelligence, sex work, urbanism and segregation, deep space and deep ocean research, prosthetics and athleticism, new reproductive technologies, and more. We will engage with poetry, film, visual art, and speculative fiction to explore how bodies are dreamed, crafted, and represented."}, {"name": "Learning Objectives", "value": "Moving from the short stories of Octavia Butler to Donna Haraway's Cyborg Manifesto, to recent films like Ex Machina, students will learn to question, blur, and play with dualist categories, e.g. human/nonhuman, female/male, heterosexual/homosexual, global/local, and natural/cultural. Students will be able to describe how various scholars and artists have conceptualized the agency of human and nonhuman actors. This course will suggest that the \"cyborg\" is an especially useful analytic for looking at the construction of social categories that can deeply impact our daily practices, intimacies, livelihoods, and visions for the future. By the end of the semester students will have an introduction to thinking critically about the relationships between gender, sexuality, race, and knowledge production, technoscience, and categories of identity. We will be dealing with some difficult texts?texts that are visual, tactile, and may be emotionally triggering. Building a community with your classmates is integral. To this end, students will form small groups for the quarter, culminating in a final presentation at the end of the semester. Small groups will meet regularly and discuss the readings and/or films. In addition to attendance, students are expected to be active participants in class and demonstrate proficiency with assigned readings."}, {"name": "Evaluation Method", "value": "Attendance, Preparation, & Participation - 20% <br/>? Attendance is mandatory. If you are unable to attend class, please email me as soon as possible to be excused. Students are allowed two unexcused absences over the semester; after that, your class participation will drop a letter grade for each additional unexcused absence. <br/>? This is a participation-based class and I expect you to actively contribute to discussion and demonstrate proficiency with the assigned readings. I understand there are diverse learning styles, and on my part I will try to provide for multiple ways of participating during class beyond conventional discussion <br/><br/>Weekly Response Memos - 30% <br/>? You will submit a short reading response every Wednesday by 11:59pm. Length: 300-400 words.<br/>? Topic: Some weeks will have directed questions for you to answer in your memo. If no topic questions are assigned, you will provide your own reflection on the readings and films. You may also weave in discussion points from class or your small group meeting.<br/><br/>Final Presentation with Group - 10%<br/> Creative presentation (may take the form of a short sci-fi film or skit)<br/><br/>Outline of Final Paper - 10% <br/> 2 pages single-spaced, plus a bibliography of 10 sources. <br/><br/>Final Paper due Week 10 - 30% <br/> 6-8 pages double-spaced"}, {"name": "Class Materials (Required)", "value": "Required book: Ashby, Madeline. 2012. vN. New York: Angry Robot Press (Penguin Random<br/>House)."}], "instructor": ["Mitali   Thakor"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "10541", "subject": "GNDR_ST"}]