[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "University Hall 102"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24158", "title": "WCAS GNDR_ST 363-0-20 Postcolonial Studies and Gender and Sexuality", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "24158", "instructors": [{"instructor_phone": "", "instructor_name": "Mitali   Thakor", "instructor_addr": ""}], "topic": "Queer Robotics: Cyborgs &amp; Fantasy in Postcolonial", "course": "363-0", "descriptions": [{"name": "Overview of class", "value": "Have robots always been queer? What do representations of robots and cyborgs in popular film, sci-fi literature, and cultural anthropology tell us about what it means to be &quot;human?&quot; <br/><br/>In this class we will use critical race studies, queer and feminist theory, crip studies, and science and technology studies (STS) to analyze representations of &quot;cyborg&quot; bodies in speculative fiction and ethnography. Our case examples explore the politics of the body through narratives of military research, artificial intelligence, sex work, urbanism and segregation, deep space and deep ocean research, prosthetics and athleticism, new reproductive technologies, and more. We will engage with poetry, film, visual art, and speculative fiction to explore how bodies are dreamed, crafted, and represented."}, {"name": "Learning Objectives", "value": "Moving from the short stories of Octavia Butler to Donna Haraway's Cyborg Manifesto, to recent films like Ex Machina, students will learn to question, blur, and play with dualist categories, e.g. human/nonhuman, female/male, heterosexual/homosexual, global/local, and natural/cultural. Students will be able to describe how various scholars and artists have conceptualized the agency of human and nonhuman actors. This course will suggest that the &quot;cyborg&quot; is an especially useful analytic for looking at the construction of social categories that can deeply impact our daily practices, intimacies, livelihoods, and visions for the future. By the end of the semester students will have an introduction to thinking critically about the relationships between gender, sexuality, race, and knowledge production, technoscience, and categories of identity. We will be dealing with some difficult texts?texts that are visual, tactile, and may be emotionally triggering. Building a community with your classmates is integral. To this end, students will form small groups for the quarter, culminating in a final presentation at the end of the semester. Small groups will meet regularly and discuss the readings and/or films. In addition to attendance, students are expected to be active participants in class and demonstrate proficiency with assigned readings."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Attendance, Preparation, &amp; Participation - 20% <br/>? Attendance is mandatory. If you are unable to attend class, please email me as soon as possible to be excused. Students are allowed two unexcused absences over the semester; after that, your class participation will drop a letter grade for each additional unexcused absence. <br/>? This is a participation-based class and I expect you to actively contribute to discussion and demonstrate proficiency with the assigned readings. I understand there are diverse learning styles, and on my part I will try to provide for multiple ways of participating during class beyond conventional discussion <br/><br/>Weekly Response Memos - 10% <br/>? You will submit a short reading response every Wednesday by 11:59pm. Length: 300-400 words.<br/>? Topic: Some weeks will have directed questions for you to answer in your memo. If no topic questions are assigned, you will provide your own reflection on the readings and films. You may also weave in discussion points from class or your small group meeting.<br/><br/>Short Essay due Week 3 - 15% <br/> 5 pages double-spaced<br/><br/>Short Essay due Week 7 - 15% <br/> 5 pages double-spaced<br/><br/>Final Presentation with Group - 10%<br/> Creative presentation (may take the form of a short sci-fi film or skit)<br/><br/>Final Paper due Week 10 - 30% <br/> 12 pages double-spaced for undergraduates; 18 pages for graduate students"}, {"name": "Class Materials (Required)", "value": "BOOKS: <br/><br/>Bacigalupi, Paolo. 2009. The Windup Girl. San Francisco: Night Shade Books. <br/><br/>Bell, David and Barbara Kennedy, eds. 2000. The Cybercultures Reader. New York: Psychology Press. <br/><br/>Haraway, Donna. 2004. The Haraway Reader. New York: Routledge. <br/><br/>Hayles, N. Katherine. 2008 [1999]. How We Became Posthuman: Virtual Bodies in Cybernetics, Literature, and Informatics. Chicago: University of Chicago Press. <br/><br/>Hopkinson, Nalo. 2000. Midnight Robber. New York: Hachette. <br/><br/>ARTICLES/ESSAYS: <br/><br/>Allison, Anne. &quot;Cyborg Violence: Bursting Borders and Bodies with Queer Machines.&quot; Cultural Anthropology 16, no. 2 (2001): 237-265.<br/><br/>Boellstorff, Tom. 2008. &quot;Personhood&quot; and &quot;Intimacy.&quot; In Coming of Age in Second Life: An Anthropologist Explores the Virtually Human. Princeton: Princeton University Press. Pp. 118-178.<br/><br/>Butler, Octavia. 2005 [1995]. &quot;Bloodchild&quot; and &quot;Speech Sounds.&quot; In Bloodchild and Other Stories. New York: Seven Stories Press. <br/><br/>Chun, Wendy Hui Kyong. 2007. &quot;Race and Software.&quot; In Alien Encounters: Popular Culture in Asian America. Mimi Thi Nguyen, Thuy Linh Nguyen Tu, eds. Durham: Duke University Press. <br/><br/>Daggett, Cara. 2015. &quot;Drone Disorientations: How &quot;Unmanned&quot; Weapons Queer the Experience of Killing in War.&quot; International Feminist Journal of Politics 17 (3): 361-379. <br/><br/>Gusterson, Hugh. &quot;Becoming a Weapons Scientist.&quot; In People of the Bomb: Portraits of America's Nuclear Complex. Minneapolis, MN: University of Minnesota Press, 2004, pp. 3-20. ISBN: 9780816638604.<br/><br/>Helmreich, Stefan. 2015. &quot;How Like a Reef&quot; In Sounding the Limits of Life: Essays in the Anthropology of Biology and Beyond. Princeton: Princeton University Press. <br/><br/>Hollinger, Veronica. 2008. &quot;?Something Like a Fiction': Speculative Intersections of Sexuality and Technology.&quot; In Queer Universes: Sexualities in Science Fiction. Wendy Gay Pearson, Veronica Hollinger, and Joan Gordon, eds. Liverpool University Press. <br/><br/>James, Erica. &quot;Haunting Ghosts: Madness, Gender, and Ensekirite in Haiti in the Democratic Era.&quot; In DelVecchio Good, Mary-Jo, Sandra Hyde, Sarah Pinto, and Byron Good. Postcolonial Disorders. Berkeley, CA: University of California Press, 2008, pp. 132-156.<br/><br/>Kolko, Beth E., Lisa Nakamura, and Gilbert B. Rodman. &quot;Race in Cyberspace: An Introduction.&quot; In Race in Cyberspace. New York: Routledge. Pp. 1-13. <br/><br/>Kobayashi, Tamai. 2004. &quot;Panopte's Eye .&quot; In So Long Been Dreaming: Postcolonial Science Fiction &amp; Fantasy, ed. Nalo Hopkinson and Uppinder Mehan, 95-106. Vancouver: Arsenal Pulp Press, 2004.<br/><br/>Magnet, Shoshana. 2013. &quot;Robots and Insects: Gender, Sexuality, and Engagement in &quot;Mixed Societies&quot; of Cockroaches and Robots.&quot; WSQ: Women's Studies Quarterly 41(3 &amp; 4): 38-55. <br/><br/>Melzer, Patricia. &quot;?And How Many Souls Do You Have?': Technologies of Perverse Desire and Queer Sex in Science Fiction Erotica.&quot; In Queer Universes: Sexualities in Science Fiction. Wendy Gay Pearson, Veronica Hollinger, and Joan Gordon, eds. Liverpool University Press. <br/><br/>Messeri, Lisa. 2016. &quot;Visualizing Alien Worlds. &quot; In Placing Outer Space: An Earthly Ethnography of Other Worlds. Durham: Duke University Press. <br/><br/>Nakamura, Lisa. 2002. &quot;Race in the Construct and the Construction of Race.&quot; In Cybertypes: Race, Ethnicity, and Identity on the Internet. London: Routledge. <br/><br/>Nelson, Alondra. 2002. &quot;'Making the Impossible Possible': An Interview with Nalo Hopkinson.&quot; Social Text 71: 97-114.<br/><br/>Slusser, George E. and Eric S. Rabkin. 1987. &quot;Introduction: The Anthropology of the Alien.&quot; In Slusser, George E., and Eric S. Rabkin. Aliens: The Anthropology of Science Fiction. Carbondale, IL: Southern Illinois University Press. <br/><br/>Trouillot, Michel-Rolph. &quot;Anthropology and the Savage Slot: The Poetics and Politics of Otherness.&quot; In Global Transformations: Anthropology and the Modern World. New York, NY: Palgrave, 2003, pp. 7-28.<br/><br/><br/><br/>FILMS: <br/><br/>Blade Runner <br/>Ex Machina <br/>Her"}], "lmod": "12/29/16 6:59 PM (CT)", "subject": "GNDR_ST"}]