[{"class_mtg_info": [{"meet_t": "We 9:00AM - 11:50AM", "meet_l": "Scott Hall 201 Ripton Room"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Fall 2016", "name": "14172", "title": "WCAS RELIGION 471-0-22 Studies in History of Religions", "class_attributes": "", "section": "14172", "instructors": [{"instructor_phone": "", "instructor_name": "Elizabeth S Hurd", "instructor_addr": "Scott, #209"}], "topic": "Religion, Race and Global Politics", "course": "471-0", "descriptions": [{"name": "Overview of class", "value": "This seminar examines critical themes at the intersection of religion, race, and global politics. We will explore how particular constructions of &quot;religion&quot; and &quot;race&quot; inform contemporary scholarship, and authorize national and international legal and governmental practice. These questions will be examined in a variety of contexts ranging from antisuperstition laws in Haiti, to the rise of Christian free enterprise in the aisles of Wal-Mart, to the celebration of &quot;moderate&quot; religion at the US State Department, to the politics of immigration, and beyond. Topics include religion and the rise of the nation-state; the politics of religious establishment and religious freedom; the role of race in the formation of the disciplines of religious studies and international relations; the formation of modern vocabularies of religious exclusion (e.g., &quot;superstition,&quot; &quot;vodou,&quot; &quot;folk religion&quot;); and the role of religiosity and religious affect in neoliberal experience. Our readings will traverse disciplinary boundaries to explore these questions by drawing on new work that draws together the study of international relations, religion, law, anthropology and history."}, {"name": "Registration Requirements", "value": "graduate course; undergraduates only with permission of instructor"}, {"name": "Teaching Method", "value": "discussion seminar"}, {"name": "Evaluation Method", "value": "presentations, book review essay, final paper"}, {"name": "Class Materials (Required)", "value": "Kate Ramsey, The Spirits and the Law: Vodou and Power in Haiti. University of Chicago, 2011. <br/>Robert Vitalis, White World Order, Black Power Politics: The Birth of American International Relations. Cornell, 2015. <br/>Mae M. Ngai, Impossible Subjects: Illegal Aliens and the Making of Modern America. Princeton, 2004. <br/>David Chidester, Empire of Religion. University of Chicago, 2014. <br/>Bethany Moreton, To Serve God and Wal-Mart: The Making of Christian Free Enterprise. Harvard, 2010. <br/>Elizabeth Shakman Hurd, Beyond Religious Freedom. Princeton, 2015. <br/>Jason Ananda Josephson, The Invention of Religion in Japan. University of Chicago, 2012."}], "lmod": "10/30/16 7:09 PM (CT)", "subject": "RELIGION"}]