[{"school": "WCAS", "overview_of_class": "The U.S. 1970s Women's Health Movement demanded everything from safe birth control on demand to an end to for-profit healthcare. Some participants formed research collectives and published D-I-Y guides to medical knowledge such as the Boston Women's Health Collective's Women and Their Bodies or Carol Downer's A New View of a Woman's Body. Some movement members established battered women's shelters, underground abortion referral services, and feminist health clinics. Others formed local committees and national networks, such as the Committee for Abortion Rights and Against Sterilization Abuse (CARASA) and the National Women's Health Network (NWHN), with the goal of transforming contemporary medical protocols and scientific research agendas. Because many of these local and national groups are still in existence, original movement goals continue to define the parameters of a \"women's health\" agenda in the present moment.<br/><br/>On the other hand, the Women's Health Movement was (and is) a heterogeneous movement. Then, as now, groups with competing ideas about the healthcare needs of women as a group identified as part of same movement. Thus, an examination of historical and current debates over \"women's health\" is also a means of assessing several distinct, often competing, paradigms of health and disease. Moreover, how we articulate a \"women's health agenda\" depends on our (often taken-for-granted) ideas about gender, sexuality, and embodiment itself.", "name": "First-Year Seminar", "section": "20", "location": "Parkes Hall 213", "topic": "Our Bodies Ourselves: The Women's Health Movement", "course": "101-6", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4640/WCAS/GNDR_ST/101-6/12219", "instructor": ["Amy Ruth Partridge"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "12219", "subject": "GNDR_ST"}, {"school": "WCAS", "overview_of_class": "Are public spaces inclusive? To explore this question, this course will combine theoretical and fictional readings and films, as well as examinations of particular physical spaces and NU archives. We will query the ways in which different members of the Northwestern university student body experience access to public spaces. By focusing on a particular student building on campus and examining the specificities of access (either the Northwestern Library or the Norris Student Center, tba), the course will cover such deeply-entrenched topics as gender, sexuality, sexual identification, race, class, religion, ethnicity, and ability. The goal of this course is to query how public spaces are politically experienced in non-uniform ways as well as recognize the constructed nature of the concept of \"public space.\" Our localized focus of a campus building will suggest broader ideas, rendering visible the vicissitudes of what constitutes publics and space that might be extended to multiple environments and settings.", "name": "First-Year Seminar", "section": "21", "location": "Norris Center Big Ten Room 104", "topic": "The Politics of Public Space", "course": "101-6", "meeting_time": ["MoWe 9:30AM - 10:50AM"], "path": "/class-descriptions/4640/WCAS/GNDR_ST/101-6/12220", "instructor": ["Jillana B Enteen"], "class_attributes": "", "id": "12220", "subject": "GNDR_ST"}]