[{"school": "WCAS", "overview_of_class": "Lin Manuel Miranda's musical, Hamilton, has become a national sensation, capturing the<br/>imagination of Americans young and old, far and wide, of diverse backgrounds and<br/>ancestries. A hip hop infused musical, Hamilton is widely considered to have revolutionized<br/>the genre of the Broadway musical, just as the American Revolution was also seen as a first<br/>for the world. Miranda, the show's creator, has enjoyed all of the accolades befitting a master<br/>of his craft: a Pulitzer Prize, almost a dozen Tony awards, and a MacArthur Foundation<br/>&quot;Genius&quot; Fellowship. Yet he has been the first to acknowledge that he didn't do it alone,<br/>and he didn't do it overnight. Miranda had collaborators and co-conspirators, including<br/>producers, choreographers, performers. He drew inspiration from generations of composers<br/>and hip hop artists, from Rodgers and Hammerstein to the Notorious B.I.G. He<br/>experimented many times before he found success. Finally, Miranda's seemingly effortless<br/>achievement took the better part of a decade to complete, from conception to opening night.<br/>Miranda, therefore, like Alexander Hamilton himself, represents an amalgam of American<br/>character, that sometimes paradoxical combination of ambition and humility; failure and<br/>success; immigration and nativism; tradition and innovation; individual enterprise and<br/>dependence on community. Hamilton's real genius is that it highlights these tensions that are<br/>fundamental to the American experience.<br/><br/>Students in this course will learn, first, about Hamilton's life and times. Easily among the<br/>most polarizing figures of a famously polarized generation, Hamilton was a Caribbean-born<br/>immigrant who became an American revolutionary, a &quot;bastard brat&quot; who became Treasury<br/>Secretary, a man who helped to lead thirteen of Britain's American colonies in a violent<br/>independence war only to advocate a financial plan and a foreign policy that presented<br/>Britain as a role model. In studying his life and politics, we will also explore early American<br/>notions of honor and masculinity, marriage and infidelity, freedom and slavery.<br/><br/>As we study Hamilton the man, we will also study Hamilton the musical, attempting to<br/>account for its extraordinary contemporary resonance. Why has this past person's life<br/>inspired such interest today, in a nation that looks so different from the one that Hamilton<br/>(and his enemies) knew? Where does the musical diverge from the history, and what does<br/>that say about our memory and use of the past? Does the musical offer an inspiring,<br/>multiethnic vision of U.S. history or, as some have argued, a more haunting and problematic<br/>one? When audiences leave the theater, what do they take away about early America and<br/>America today?and about themselves?", "name": "Latina &amp; Latino History", "section": "1", "topic": "", "course": "218-0", "meeting_time": ["MoWeFr 2:00PM - 2:50PM"], "path": "/class-descriptions/4650/WCAS/LATINO/218-0/24270", "instructor": ["Geraldo L Cadava", "Caitlin Annette Fitz"], "id": "24270", "subject": "LATINO"}]