[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Harris Hall L05"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "25078", "title": "WCAS ENGLISH 205-0-21 Intermediate Composition", "class_attributes": "", "section": "25078", "instructors": [{"instructor_phone": "847/467-5592", "instructor_name": "Kathleen   Carmichael", "instructor_addr": "555 Clark St., #239"}], "topic": "From Story to Argument", "course": "205-0", "descriptions": [{"name": "Overview of class", "value": "This course examines the intersection of story and argument, both to investigate how creative storytelling may provide the inspiration for argument and to examine how effective writers and researchers may be seen to build their arguments (legitimately or otherwise) on the foundation of story. Readings will range from discussions of the graphic novel to considerations of how everyday citizens manipulate social media to tell the stories they desire. We will also look at case studies that illustrate how the ever-widening gulf between the stories told by specialists and non-specialists plays out in the public sphere and the making of public policy. <br/>This course is recommended for students who wish to refine their mastery of the essay form while experimenting with a range of creative approaches to articulating arguments and persuading audiences. Key assignments will require research into a question of the student's own choosing, refined and developed over the course of the quarter. Students are welcome to use this class to deepen their explorations of research problems that they may have begun investigating in other classes or contexts."}, {"name": "Teaching Method", "value": "Discussion and guest lectures. Students will also meet individually with the instructor and as small working groups to discuss their writing."}, {"name": "Evaluation Method", "value": "Two short essay assignments, one in-class final presentation and a final major paper (developed in many drafts over the course of the quarter). The form the final paper takes will be determined on a case-by-case basis. Options include literature reviews, proposals written for research grants (including opportunities sponsored by the Northwestern University Office of the Provost), and drafts of formal papers."}, {"name": "Class Materials (Required)", "value": "Understanding Comics. Scott McCloud. William Morrow Paperbacks; Reprint edition (1994). They Say / I Say. Gerald Graff and Cathy Birkenstein. Norton (2010). Writing With Power. Peter Elbow. Oxford UP (1998). Fields of Reading, Motives for Writing (edition TBD). Comley, Hamilton, et al. (Eds.). Bedford/St. Martin's.<br/>Additional readings will be available online."}, {"name": "Class Notes", "value": "Questions about this course should be directed to: The Bobbie and Stanton Cook Family Writing Program: writing-program@northwestern.edu"}], "lmod": "12/25/16 6:58 PM (CT)", "subject": "ENGLISH"}]