[{"class_mtg_info": [{"meet_t": "MoWe 12:30PM - 1:50PM", "meet_l": "Parkes Hall 223"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "38017", "title": "WCAS ENGLISH 313-0-21 Studies in Fiction", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "38017", "instructors": [{"instructor_phone": "", "instructor_name": "Kelly E Wisecup", "instructor_addr": ""}], "topic": "Protest &amp; the Native American Novel", "course": "313-0", "descriptions": [{"name": "Overview of class", "value": "This course will examine the intersections between Native American novels and protest movements in the twentieth century, by reading established and emerging Native American novelists, from Sherman Alexie and Louise Erdrich to Melissa Tantaquidgeon Zobel and Diane Glancy. When N. Scott Momaday won the Pulitzer Prize for fiction in 1969 for his novel House Made of Dawn, a book that is said to have begun the &quot;Native American Renaissance,&quot; Native activists were occupying Alcatraz. They were followed a few years later by American Indian Movement activists, who occupied Wounded Knee Reservation. More recently, Melissa Tantaquidgeon Zobel published her futuristic novel Wabanaki Blues shortly before water protractors established a camp to protest the Dakota Access pipeline. We will explore the shared histories of Native American protest and novels, examining how literature participates in, is indebted to, and inspires activist movements, from anti-removal novels in the early twentieth century to AIM in the 1960s and 1970s to #noDAPL in the twenty-first century. This course will consider various novelistic genres, from young adult fiction, to speculative fiction, to graphic novels and detective stories."}, {"name": "Class Materials (Required)", "value": "Readings: Sherman Alexie, &quot;Flight&quot;; Louise Erdrich, &quot;The Round House&quot;; N. Scott Momaday, &quot;Way to Rainy Mountain&quot;; Leslie Marmon Silko, selections from &quot;Almanac of the Dead&quot;; Melissa Tantaquidgeon Zobel, &quot;Wabanaki Blues&quot;; Leanne Howe, &quot;Shell Shaker.&quot;"}], "lmod": "2/19/17 6:48 PM (CT)", "subject": "ENGLISH"}]