[{"class_mtg_info": [{"meet_t": "MoWeFr 12:00PM - 12:50PM", "meet_l": "Tech Institute Lecture Room 5"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Engineering Students. Other students can register for this section with permission from the department.", "qtr": "Winter 2017", "name": "20701", "title": "WCAS MATH 234-0-67 Multiple Integration and Vector Calculus", "class_attributes": "Engineering Students Only<br/><br/>", "section": "20701", "associated_classes": [{"component": "DIS", "room": "Technological Institute M120", "meeting_time": "Th 12:00PM - 12:50PM"}, {"component": "DIS", "room": "Lunt Hall 104", "meeting_time": "Th 12:00PM - 12:50PM"}], "topic": "", "course": "234-0", "descriptions": [{"name": "Overview of class", "value": "Cylindrical and spherical coordinates, double and triple integrals, line and surface integrals. Change of variables in multiple integrals; gradient, divergence, and curl. Theorems of Green, Gauss, and Stokes. Students may not receive credit for both 234 and 281-1, 285-3, 290-3, or 291-3. Prerequisite: 230.<br/><br/>THIS COURSE HAS MANDATORY EVENING MIDTERM EXAMINATIONS. PLEASE CHECK THE REGISTRAR'S WEBPAGE FOR DETAILS: http://www.registrar.northwestern.edu/registration/midterms.html<br/><br/>This exam takes precedence over scheduled meetings of other classes, including labs and discussion sections, held at this time, and it is up to the student to make arrangements for handling conflicts arising from such meetings. In special circumstances, arrangements for dealing with other unavoidable conflicts can be made by alerting the course coordinator at least two weeks ahead of time; he/she will decide if your conflict can be accommodated."}, {"name": "Registration Requirements", "value": "Math 230-0 or its equivalent"}, {"name": "Learning Objectives", "value": "Student will learn cylindrical and spherical coordinate systems, double and triple integrals, line and surface integrals, change of variables in multiple integrals; gradient, divergence, and curl, theorems of Green, Gauss, and Stokes."}, {"name": "Teaching Method", "value": "Lecture and discussion sections meet three times a week. Classes are accompanied by discussion sections, which meet one day a week for problem solving and discussion under the supervision of a teaching assistant."}, {"name": "Class Materials (Required)", "value": "For Weinberg Sections:<br/>ISBN: 978-1285131658 Custom Essential Calculus: Early Transcendentals Volume 2 <br/>Stewart James <br/>Cengage<br/><br/>ISBN: 978-1285184210 <br/>Custom Enhanced Web Assign Homework &amp; eBook LOE Instant Access for Multi Term Math &amp; Science, 1st Edition <br/>Stewart James <br/>Cengage<br/><br/>For Engineering Sections: <br/>ISBN: 978-0130339676<br/>Multivariable Calculus, 6th ed <br/>Penney &amp; Edwards <br/>Pearson"}, {"name": "Class Notes", "value": "Students may not receive credit for both 234-0 and any of the following: 281-1, 285-3, 290-3, or 291-3."}], "lmod": "12/25/16 7:03 PM (CT)", "subject": "MATH"}]