[{"class_mtg_info": [{"meet_t": "MoWe 12:30PM - 1:50PM", "meet_l": "University Hall 118"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Spring 2016", "name": "34929", "title": "WCAS ENGLISH 393-S-20 Theory and Practice of Poetry", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "34929", "instructors": [{"instructor_phone": "", "instructor_name": "Rachel J Webster", "instructor_addr": ""}], "topic": "", "course": "393-S", "descriptions": [{"name": "Overview of class", "value": "This selective, yearlong &quot;Sequence&quot; is designed to make students increasingly informed readers and self-sustaining apprentices of poetry. The Fall half of the course begins with summer readingthis year, a host of collections by contemporary poets including Patricia Smith, Cathy Park Hong, Matthew Dickman and Anne Carson. We then begin the quarter by identifying operative modes in poetryincluding description, rhetoric, story and songand connecting contemporary participants with root systems in the tradition. Although it is not possible to present an overview of American poetry in one semester, we sketch the scene by focusing on a few masters and discussing ways they influenced later movements and still charge us to be alert and original. We will study figures including T. S. Eliot, Robert Frost, Muriel Rukeyser, Jean Toomer, Elizabeth Bishop, Gwendolyn Brooks, Sylvia Plath and John Ashbery, and will support our studies with close reading exercises and &quot;imitation&quot; assignments, in which students learn to convert close reading into fodder for original writing. Students will complete at least four papers and four polished poems during the Fall term, and will lead presentations on one chosen poet and one classmate during workshop. In our portion of the Winter term, students will complete a week of &quot;Daily Poems,&quot; thereby drawing on original energy and stamina to bring their work to the next level of accomplishment. Our close reading assignments hone skills in sensitive and critical thinking; our imitation poems will challenge existing habits as they provide students with new tools; our daily poems will exercise agility and confidence; and our workshops will cultivate the openness and humility necessary to serious writing and lifelong learning. Ideally, students complete this course with sustaining writerly habits, a sincere and supportive workshop community, and a portfolio that can be built upon during the Spring semester of the &quot;Sequence in Poetry.&quot;"}, {"name": "Teaching Method", "value": "Seminar discussion."}, {"name": "Evaluation Method", "value": "Based on creative and critical work; class presentations and participation."}], "lmod": "4/3/16 7:59 PM (CT)", "subject": "ENGLISH"}]