[{"school": "DOHA", "overview_of_class": "<p>The relationship between technology and journalism has always attracted a great deal of attention from academics and media professionals, particularly journalists. This is especially true now, as \"digital media\" evolves and enables a procession of emerging storytelling technologies, such as open-source, online multi-media platforms and well-known apps (Snapchat and Instagram, for example). These platforms present extraordinary opportunities for news organizations and freelancers to distribute content, and they also present challenges, which this class explores. As such, the class discusses and examines what these transformations mean for journalism?the profession and its roles in our world; it parses out the themes of \"global\" journalism and narratives; and it delves into both the changing and unchanged aspects of storytelling. This necessarily includes content production, fact gathering, narrative making, activism, audience interactivity, and distribution of journalism content. The class will also introduce design concepts and design production in conversation with current journalism forms?whether online or off. This class is meant to be interactive and instructive. We will have guest lecturers joining the class to offer their experience and insights.</p>", "name": "Special Topics", "section": "70", "location": "Northwestern Qatar Room 1-212", "topic": "Exploring the Future of Digital Journalism", "course": "390-0", "meeting_time": ["MoTuSu 08:30AM - 11:20AM (AST)"], "path": "/class-descriptions/4660/DOHA/JOUR/390-0/30728", "instructor": ["Abraham Naseem Abusharif"], "class_attributes": "", "id": "30728", "subject": "JOUR"}, {"school": "DOHA", "overview_of_class": "<p>This is a survey course dedicated to the simple proposition that sport is a social institution no less than education, religion, family, or the military, and no less important: It makes identities of all kinds, from the national to the deeply personal. Modern sports were born in the early 19th century, at the same time and for the same reasons as modern mass media; the two have ever since been joined at the hip, such that scholars often refer to them as one institution: \"mediasport.\" Today sport is the most valuable, highest-earning media product in the global entertainment industry?indeed for many of us, sport is something we consume, not something we do. And yet the \"right to play\" is?according to the United Nations, the International Olympic Committee, and the European Union?a fundamental human right. So it's big stuff?less than war, but more than a game.In this course, sport is considered from various contexts. We do it through weekly monitoring of sports media, documentary films, student research and writing assignments, and class discussion. Our contexts include commerce and industry, domestic and international politics (including war) gender and sex identities, racial and ethnic relations, religion and spirituality, and popular culture from fashion to video games. How sport became a training ground for \"life\" is uniquely an American story, with analogs in many other places, from China to Canada, from Qatar to Egypt, Brazil to Britain, Kenya to Pakistan.</p>", "name": "Special Topics", "section": "71", "location": "Northwestern Qatar Room 1-245", "topic": "Sports, Media & Society", "course": "390-0", "meeting_time": ["MoWe 12:30PM - 02:20PM (AST)"], "path": "/class-descriptions/4660/DOHA/JOUR/390-0/30729", "instructor": ["Craig Llewellyn   Lamay"], "class_attributes": "", "id": "30729", "subject": "JOUR"}]