[{"school": "JOUR", "overview_of_class": "Goals of the Practicum:  <br/>1.         To observe, record and analyze events and processes in the workplace (on-site participation, daily journals).   <br/>2.         To develop the capacity to make informed responses and to take a proactive role in your current and future organizational experiences (on-site participation, final paper).  <br/>3.         To gain a better understanding of the processes of the federal government - policy and politics, and the role of the media in reporting on them (speakers, readings).", "name": "Special Topics", "section": "20", "location": "Washington, DC Bureau", "topic": "Covering Cybersecurity and Surveillance", "course": "390-0", "meeting_time": ["Th 9:00AM - 11:30AM"], "path": "/class-descriptions/4610/JOUR/JOUR/390-0/26993", "instructor": ["Mary Ellen   Shearer", "Paul Samuel Rosenzweig"], "class_attributes": "", "id": "26993", "subject": "JOUR"}, {"school": "JOUR", "overview_of_class": "Students graduating from Northwestern will be involved in many organizations, from non-profit to government, from start-ups to large, international organizations.   The skills that will be needed include communication, talent development, financial and economic literacy, organizational navigation, and growth objectives.   This course provides frameworks for students to discover how an individual thrives and leads in organizations.  From skill at communication to evaluating business plans, students will actively develop deeper skills for the future.   <br/><br/>Students who complete this course will: <br/>- Communicate ideas orally in presentations <br/>- Participate effectively in organizations as an employee, as a member of a team, as a new thought leader on the path to becoming a leader in an area of the company <br/>- Explore fundamentals of economics, finance and management literacy <br/>- Participate in growth plans for businesses to adapt to the future", "name": "Special Topics", "section": "22", "location": "Fisk Hall 311", "topic": "Leadership Strategies", "course": "390-0", "meeting_time": ["We 3:00PM - 5:50PM"], "path": "/class-descriptions/4610/JOUR/JOUR/390-0/26995", "instructor": ["Candy   Lee"], "class_attributes": "", "id": "26995", "subject": "JOUR"}, {"school": "JOUR", "overview_of_class": "Is Facebook saving or destroying the news industry? Are claims about millennials ?fleeing' from the news true? What type of story structure elicits the most attention from audiences? These are important questions facing today's news industry. They are also empirical questions that can be addressed through systematic data collection and analysis. This class focuses on the foundations of social science research as it relates to the field of journalism. The class is designed to accomplish three inter-related goals: 1) to introduce the basic process, concepts, and techniques of journalism research; (2) to provide a framework for exploring questions about journalism and its effects; and (3) to gain hands-on experience in the process of conducting empirical investigations. While no prior experience in research or statistics is required, the class will involve computing and analyzing basic descriptive statistics and regression models.", "name": "Special Topics", "section": "24", "location": "Fisk Hall 309", "topic": "Statistical Methods in Journalism", "course": "390-0", "meeting_time": ["TuTh 3:00PM - 4:20PM"], "path": "/class-descriptions/4610/JOUR/JOUR/390-0/26997", "instructor": ["Stephanie Lynn Edgerly"], "class_attributes": "No Freshmen<br/><br/>", "id": "26997", "subject": "JOUR"}]