[{"school": "WCAS", "overview_of_class": "Recent headlines give the impression that religion has always been central in the Middle Eastern upheavals.  This course takes a long-term view of social movements, rebellions, and revolutions in the Middle East to contextualize the religious turn.  Sociological concepts and comparison help us in evaluating their changing form in the past century up to the present.  Events in Turkey, Iran, and Arab states provide the basis for exploration.", "name": "Topics in Sociological Analysis", "section": "20", "topic": "", "course": "376-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4610/WCAS/SOCIOL/376-0/23882", "instructor": ["Nader   Sohrabi"], "id": "23882", "subject": "SOCIOL"}, {"school": "WCAS", "overview_of_class": "This course explores the modern American urban street gang. It looks at the long sociological tradition of theory and research on such gangs, much of it conducted right here in Chicago. It looks at the structure and activities of such gangs and the response of local community institutions including the police, and national urban and criminal justice policy with respect to street gangs.", "name": "Topics in Sociological Analysis", "section": "21", "topic": "Gangs", "course": "376-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4610/WCAS/SOCIOL/376-0/23883", "instructor": ["Albert Dale   Hunter"], "id": "23883", "subject": "SOCIOL"}, {"school": "WCAS", "overview_of_class": "This course explores the construction of gender in the Middle East. Drawing on the historical, sociological and anthropological research in the region, the course aims to question stereotypes about the subordination of Muslim women and to offer a systematic reading and an analytical discussion of the political, economic and cultural structures that inform gender relations and sexuality. The course starts with an examination of early Islam and religious sources with regard to women's status, then moves on to nationalist and modernization movements in the 19th and 20th centuries, and finally focuses on women and men's lives in contemporary Egypt, Turkey and Iran. In this framework, special attention is given to Islamist mobilizations, the family, sexuality, neoliberalism, women's labor and LGBT.", "name": "Topics in Sociological Analysis", "section": "22", "topic": "Gendr&amp;SexualityinMidEst", "course": "376-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4610/WCAS/SOCIOL/376-0/23884", "instructor": ["Ayca   Alemdaroglu"], "id": "23884", "subject": "SOCIOL"}, {"school": "WCAS", "overview_of_class": "Since the appearance of a &quot;mysterious new disease&quot; among gay men in the U.S., HIV/AIDS has been closely associated with sexuality. This is true not only because a large percentage of HIV-transmission occurs via sexual contact, but also because of close associations between sexuality and morality and what &quot;kinds&quot; of people and practices are said to be more likely to spread HIV than others. In this course, we draw upon scholarship in the social sciences and humanities to examine the interplay between HIV/AIDS and sexuality, with an emphasis on the role of science and technology.  How did associations between sexuality, disease and morality shape what was known about the spread of HIV early in the epidemic? How have ongoing efforts to know, treat and prevent HIV shaped sexual practices and intimacies, and vice versa? Together, will consider the complex interplay of HIV, sexuality and science across a diverse array of topics, including:  the politics of HIV-risk categorization; HIV-stigma and discrimination; social movements and access to treatment; sexual practices and intimacies; and new frontiers in HIV-prevention, among others.", "name": "Topics in Sociological Analysis", "section": "23", "topic": "Sexuality, Biomedic &amp; HIV/AIDS", "course": "376-0", "meeting_time": ["MoWe 11:00AM - 12:20PM"], "path": "/class-descriptions/4610/WCAS/SOCIOL/376-0/23885", "instructor": ["Aaron Travis Norton"], "id": "23885", "subject": "SOCIOL"}]