[{"school": "WCAS", "overview_of_class": "IN THIS COURSE, STUDENTS WILL BE CHALLENGED TO THINK ABOUT FEMINISM THROUGH THE LENS OF WOMEN COMMITTED TO TRADITIONAL, AT TIMES EVEN FUNDAMENTALIST, RELIGIOUS VALUES. WE WILL INVESTIGATE THE WAYS IN WHICH SUCH WOMEN NEGOTIATE THEIR STATUS AND EXAMINE THE EVOLVING FEMINIST MOVEMENTS THAT HAVE ARISEN WITHIN TRADITIONAL RELIGIOUS LIFE. MORE SPECIFICALLY, WE WILL FOCUS ON A CASE STUDY OF FEMINIST ACTIVISM AMONG ORTHODOX JEWISH WOMEN IN ISRAEL, IN A COMPARATIVE PERSPECTIVE WITH EVANGELICAL WOMEN AND MUSLIM WOMEN IN THE USA. SOME OF THE CENTRAL QUESTIONS WE WILL ENGAGE ARE: HOW ARE THE FORMS OF FEMINIST IDENTITY AND ACTIVISM AMONG WOMEN IN TRADITIONAL RELIGIOUS TRADITIONS SIMILAR? IN WHAT WAYS CAN FEMINIST ACTIVISM WITHIN RELIGIOUS LIFE BE COMPARED WITH SECULAR FEMINIST ACTIVISM?", "name": "Transnational Perspectives on Gender and Sexuality", "section": "20", "location": "Technological Institute M164", "topic": "Women in Trad'l ReligiousMvmts", "course": "341-0", "meeting_time": ["MoWe 12:30PM - 1:50PM"], "path": "/class-descriptions/4620/WCAS/GNDR_ST/341-0/31111", "instructor": ["Yael   Israel-Cohen"], "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "id": "31111", "subject": "GNDR_ST"}, {"school": "WCAS", "overview_of_class": "The relatively recent growth of research on men and masculinities is impressive. The majority of the academic works published in the English-speaking world, however, comes from within the Western world and from Western perspectives. At the same time, East Asian men are becoming increasingly visible in mediated forms around the world, in films, print, and online media. This course tries to bridge the lack of academic explorations of East Asian masculinities with the wealth of material available. Together we will explore the construction of masculinities in East Asian cultures, past and present. We will study men and masculinities in pre-modern and contemporary China, Japan, and Korea, respectively, and also in the dynamic interactions between East Asian cultures. We will read and discuss sources that depict fragile scholars, Shaolin monks, ninjas, boys love, and K-pop stars. Our aim will be to enhance our understandings of East Asian identities and cultures as well as Western conceptions of gender and sexuality.", "name": "Transnational Perspectives on Gender and Sexuality", "section": "21", "location": "Locy Hall 301", "topic": "East Asian Masculinities", "course": "341-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4620/WCAS/GNDR_ST/341-0/31112", "instructor": ["Paola   Zamperini"], "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "id": "31112", "subject": "GNDR_ST"}]