[{"school": "WCAS", "overview_of_class": "What is lyric poetry? What are its roots, and what are its possibilities today? How does it stand in relation to the countless other varieties of rhymed and/or rhythmic language?hymns, pop songs, advertising slogans, campaign mottoes, bumper stickers, and so on?that surround us in our daily life? We will explore these and many other questions by way of examining lyrics past and present, from psalms and hymns to epitaphs, elegies, songs, and love poems. This course will emphasize the varieties of lyric, both in English originals and in translation, with particular attention to the meanings of poetic form and the nature of poetic translation.", "name": "Topics in Genre", "section": "20", "location": "Technological Institute L251", "topic": "What is Lyric Poetry?", "course": "211-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4620/WCAS/COMP_LIT/211-0/30985", "instructor": ["Clare A Cavanagh"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "30985", "subject": "COMP_LIT"}, {"school": "WCAS", "overview_of_class": "This course is devoted to the study of the novel in late imperial Chinese literature. This quarter we will read the English translation of Shuihu zhuan, aka The Water Margins, or The Outlaws of the Marsh. Due to its length, this novel will be the primary focus of the course, though we will include selections from other contemporary and related sources, when relevant to the overall understanding of the text under study. As we read through this text, in translation, uncovering its richness and complexity, we will in turn <br/>address issues such as the place of the novel in traditional Chinese literature; authorship and authority; narrative strategies and plot development; magic and religion; material culture; demons and exorcism; sexuality and adultery; femininity, masculinity and their discontents. In addition to Shuihu zhuan, representative theoretical work in the field of pre-modern Chinese literature will be incorporated as much as possible.", "name": "Topics in Genre", "section": "21", "location": "Locy Hall 318", "topic": "Ming Novel", "course": "211-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4620/WCAS/COMP_LIT/211-0/30986", "instructor": ["Paola   Zamperini"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "30986", "subject": "COMP_LIT"}]