[{"school": "DOHA", "overview_of_class": "<p>This course provides an introduction to American politics and government. We will explore the history of the US constitution, the three branches of government, the news media, public opinion and political participation, and campaigns and elections. We will follow the American elections with interactive blogs, and end with a comparative and critical perspective on US democracy. An introduction to American politics is essential for students to understand American influence and capacity on foreign policies and current events.</p>", "name": "Topics in Political Science", "section": "70", "location": "Carnegie Mellon Room 3046", "topic": "Intro to American Government", "course": "242-0", "meeting_time": ["TuSu 01:30PM - 02:50PM (AST)"], "path": "/class-descriptions/4640/DOHA/POLI_SCI/242-0/10038", "instructor": ["Jocelyn S Mitchell"], "class_attributes": "", "id": "10038", "subject": "POLI_SCI"}, {"school": "DOHA", "overview_of_class": "<p>This course focuses on key political issues in the contemporary Middle East, spanning national issues such as state formation, type of governance, democracy, Islamism, sectarianism, gender, oil politics; and regional issues such Arab-Israeli conflict, Iran-Iraq war as well as international politics of the region. The course provides an introduction to the different political systems in place around the region, and examines the main players. It starts with analysis of the emergence of the new modern states in the region on the eve of decolonisation, and moves on to analyse forms of rising politics. The course attempts to offer a balanced analysis between salient themes, cases studies, national, regional and international politics pertaining to the Middle East.</p>", "name": "Topics in Political Science", "section": "71", "location": "Carnegie Mellon Room 3204", "topic": "Introduction to Middle East Politics", "course": "242-0", "meeting_time": ["MoWe 08:30AM - 09:50AM (AST)"], "path": "/class-descriptions/4640/DOHA/POLI_SCI/242-0/10042", "instructor": ["Khaled   Al Hroub"], "class_attributes": "", "id": "10042", "subject": "POLI_SCI"}, {"school": "DOHA", "overview_of_class": "<p>This class investigates important themes of contemporary Gulf society and politics. The use of oil wealth by the Gulf states has hastened some sociopolitical changes and stagnated others. Studying inclusion and exclusion in citizenship laws and norms gives insight into legal and emotional concepts of national identity and nation building. Exploring the tensions between increased economic and educational opportunities for women and cultural and religious barriers highlights the struggle between modernization and tradition in the region today. Political readings are combined with literature from the Gulf region. Students should end the class with a better understanding of the rapid development and transformation of Gulf society and politics, and the challenges still facing the region.</p>", "name": "Topics in Political Science", "section": "72", "location": "Carnegie Mellon Room 3044", "topic": "Gulf Society and Politics", "course": "242-0", "meeting_time": ["MoWe 01:30PM - 02:50PM (AST)"], "path": "/class-descriptions/4640/DOHA/POLI_SCI/242-0/10043", "instructor": ["Jocelyn S Mitchell"], "class_attributes": "", "id": "10043", "subject": "POLI_SCI"}]