[{"school": "WCAS", "overview_of_class": "In this course we will study the relations among gender, race, and freedom in novels by Toni Morrison. We will pay special attention to the narrative forms and strategies Morrison employs to depict the (im)possibilities of freedom in the post­-civil rights era. While considering how narrative strategies and structures animate depictions of freedom, we will also discuss how the novels themselves enact freedom by transgressing the limits of genre through manipulations of knowledge, space, and time. We will continually address issues of gender, race, and place in relation to African American desires for freedom. Our study will be guided by several questions: What forms does freedom take, both aesthetically and politically, in these novels? What demands do aesthetic forms of freedom, that is, innovative writing, place on the reader, in terms of literacy and ethics? How does Morrison imagine freedom differently across texts and decades and for what purposes? Our discussions will place Morrison's treatment of freedom at the center of contemporary debates over the prospects of a post-racial America, the utility of the history of slavery, and the protocols of racial representation.", "name": "Gender, Sexuality, and Literature", "section": "20", "location": "University Hall 102", "topic": "Toni Morrison and the Form of Freedom", "course": "361-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4640/WCAS/GNDR_ST/361-0/17376", "instructor": ["Shaundra J Myers"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "17376", "subject": "GNDR_ST"}, {"school": "WCAS", "overview_of_class": "The Renaissance is full of cross-gendered and transgendered people, from the cross-dressing boy actor to the female poet labeled a \"hermaphrodite.\" In his English Grammar, Ben Jonson even creates the grammatical category of \"epicene nouns,\" words that may refer to either sex and which allow for more fluidity across male and female genders. This course examines how early modern texts treat gender with a particular focus on gender hybridity, transgender figures, and transvestism. We will begin by considering - through As You Like It - the familiar Shakespearean paradigm in which women briefly cross-dress as young men before they are re-<br/>inscribed into traditional heteronormative relationships (at which point they usually shed their masculine disguises). We will go on to scrutinize plays ranging from The Roaring Girl to Gallathea and Epicene that subvert this popular narrative by denying both heteronormative endings and stable gender identities. The class will investigate how in-between figures are taken up and represented in other literary texts as we think about how the English might have identified with these \"monstrous\" figures even as they marginalized them. <br/>Throughout the class, we will supplement our examination of literary texts with investigations of early modern <br/>gender difference in the medical writings of Galen and Vesalius as well as nonliterary accounts of <br/>hermaphrodites, transvestites, and transgender individuals.", "name": "Gender, Sexuality, and Literature", "section": "21", "location": "University Hall 102", "topic": "The Transgender Renaissance", "course": "361-0", "meeting_time": ["MoWe 12:30PM - 1:50PM"], "path": "/class-descriptions/4640/WCAS/GNDR_ST/361-0/17459", "instructor": ["Whitney Blair Taylor"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "17459", "subject": "GNDR_ST"}]