[{"class_mtg_info": [{"meet_t": "MoWeFr 1:00PM - 1:50PM", "meet_l": "Frances Searle Building 2107"}], "school": "WCAS", "overview_of_class": "As for any other organ, disease and disordered function of the brain can have effects ranging from subtle to devastating. In this course, students will learn about common human brain disorders, their cellular and molecular causes, and treatments. We will cover a variety of neurodegenerative diseases, ADHD, depression, mental illness, mental retardation, and other disorders. Students will synthesize this information to identify common mechanisms underlying brain diseases. We will discuss how the causes of brain disease were discovered and what we don't yet know. Ethical questions in neural medicine will be addressed. Class format will consist of lectures twice a week plus a third weekly session consisting of student presentation and discussion of primary research articles to develop the skills to read and critique current research in the field.", "qtr": "Fall 2017", "name": "Neuroscience of Brain Disorders", "title": "WCAS NEUROSCI 360-0-1 Neuroscience of Brain Disorders", "lmod": "5/11/17 7:35 PM (CT)", "section": "1", "topic": "", "course": "360-0", "enrl_requirement": "Enrollment Requirements: Pre-requisite: Students must have completed NEUROSCIENCE 202 and 206, or BIOL_SCI 302, or BIOL_SCI 311 or gain consent of the instructor to enroll in this course.", "descriptions": [{"name": "Overview of class", "value": "As for any other organ, disease and disordered function of the brain can have effects ranging from subtle to devastating. In this course, students will learn about common human brain disorders, their cellular and molecular causes, and treatments. We will cover a variety of neurodegenerative diseases, ADHD, depression, mental illness, mental retardation, and other disorders. Students will synthesize this information to identify common mechanisms underlying brain diseases. We will discuss how the causes of brain disease were discovered and what we don't yet know. Ethical questions in neural medicine will be addressed. Class format will consist of lectures twice a week plus a third weekly session consisting of student presentation and discussion of primary research articles to develop the skills to read and critique current research in the field."}, {"name": "Registration Requirements", "value": "Pre-requisites: NEUROSCI 202 and 306, or BIOL SCI 302 or 311 or consent of instructor."}, {"name": "Learning Objectives", "value": "A. Define the biological basis of a variety of brain disorders<br/>B. Synthesize material to identify common features, mechanisms, and modulators of diverse brain diseases<br/>C. Link basic research, translational science, and clinical trials and understand the limits of current treatments<br/>D. Critically evaluate the evidence for and against competing hypotheses regarding brain disorders <br/>E. Read, present, and interpret current primary literature relating to a variety of brain disorders <br/>F. Develop an understanding of major ethical issues pertaining to brain disorders and their treatment"}, {"name": "Teaching Method", "value": "The first two lectures of each week will address topics from the textbook while in the third session, one student group per week will present current primary literature expanding on the week's topics."}, {"name": "Evaluation Method", "value": "1 class presentation per student group, participation grade for discussion, 8 weekly microquizzes, 1 midterm, and 1 final."}, {"name": "Class Materials (Required)", "value": "Materials will be freely available online."}, {"name": "Class Notes", "value": "WCAS Distro Area I - Natural Sciences<br/>Enrollment Requirements: Prerequisite: Students must have completed NEUROSCI 202 and 306, or BIOL SCI 302 or 311 or gain consent of the instructor to register for this course."}], "instructor": ["Valerie   Kilman"], "class_attributes": "Natural Sciences Distro Area<br/><br/>", "id": "12390", "subject": "NEUROSCI"}]