[{"class_mtg_info": [{"meet_t": "Tu 6:15PM - 9:15PM", "meet_l": "Kresge Centennial Hall 2-319"}], "school": "SCS", "overview_of_class": "This course is part three of a three-quarter sequence based on the competency (or \"can do\") and the communicative approaches. The course is designed for adults who wish to learn Spanish in a dynamic way and it is designed to help students achieve pragmatic, linguistic and cultural competencies adequate for a beginning level. This is a student-centered course in which the student will learn how to interact in the target language in basic real-life situations, both orally and in writing, as well as to develop the necessary skills to become an independent learner outside of the classroom. The intercultural nature of all the activities and tasks to be completed by the student will also help the student to become more aware of the rich and varied cultures within the Spanish-speaking world. The topics and textbook are aligned with the interests of adult learners. Carries humanities credit (two-course limit for language courses).", "qtr": "Spring 2017", "name": "Elementary Spanish", "title": "SCS SPANISH 101-C-64 Elementary Spanish", "lmod": "2/22/17 6:42 PM (CT)", "section": "64", "instructors": [{"instructor_phone": "847/491-8280", "instructor_name": "Elena   Lanza", "instructor_addr": "1-200 Kresge"}], "topic": "", "course": "101-C", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "This course is part three of a three-quarter sequence based on the competency (or &quot;can do&quot;) and the communicative approaches. The course is designed for adults who wish to learn Spanish in a dynamic way and it is designed to help students achieve pragmatic, linguistic and cultural competencies adequate for a beginning level. This is a student-centered course in which the student will learn how to interact in the target language in basic real-life situations, both orally and in writing, as well as to develop the necessary skills to become an independent learner outside of the classroom. The intercultural nature of all the activities and tasks to be completed by the student will also help the student to become more aware of the rich and varied cultures within the Spanish-speaking world. The topics and textbook are aligned with the interests of adult learners. Carries humanities credit (two-course limit for language courses)."}, {"name": "Registration Requirements", "value": "SPANISH101-A,-B, or equivalent. If you have not taken SPANISH101-A in the fall quarter and/or SPANISH 101-B in the winter quarter, you must contact the instructor before registering in the course to determine if 101-C is the right level for you. It is crucial that only beginners register in this course since having students with higher language levels in the classroom would be detrimental to those students who are correctly placed in this level. Only students who have never taken Spanish before should enroll in this course. Please email the instructor if you need further guidance or if you have any other questions regarding placement."}, {"name": "Learning Objectives", "value": "Course goals:<br/><br/>Talk about health/ healthy habits<br/>Express cause, consequence and finality<br/>Give advice and opinion; suggest; express (dis)agreement <br/>Express certainty and uncertainty<br/>Express wishes and hopes<br/>Order at a restaurant <br/>Talk on the phone"}, {"name": "Teaching Method", "value": "The class will be based on the communicative approach, a methodology that focuses on learning a second language through communication in the target language (Spanish, in this case), as well as on the use of authentic texts and materials, both in and outside the classroom."}, {"name": "Class Materials (Required)", "value": "Texbooks: Alonso, Montserrat and Rocío Prieto. Embarque 1 &amp; 2, Madrid: Edelsa, 2011. Workbooks: Alonso, Montserrat and Rocío Prieto. Embarque 1 &amp; 2, Madrid: Edelsa, 2011. Various websites, newspaper articles and short stories."}, {"name": "Class Notes", "value": "Learning a language requires a different set of techniques than for any other course taught in the student's native language. It is very important that students understand that in order to be successful, they will need to invest an average of 4-6 hours per week (outside of the contact hours in class)."}], "path": "/class-descriptions/4660/SCS/SPANISH/101-C/38078", "instructor": ["Elena   Lanza"], "class_attributes": "", "id": "38078", "subject": "SPANISH"}]