[{"class_mtg_info": [{"meet_t": "Tu 6:00PM - 9:00PM", "meet_l": "University Hall 318"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Summer 2016", "name": "40266", "title": "WCAS ENGLISH 339-0-28 Special Topics in Shakespeare", "class_attributes": "", "section": "40266", "instructors": [{"instructor_phone": "", "instructor_name": "Aaron Lee Greenberg", "instructor_addr": ""}], "topic": "Shakespeare?s Social Networks", "course": "339-0", "descriptions": [{"name": "Overview of class", "value": "Shakespeare's Social Networks Like much of what Shakespeare wrote four centuries ago, Hamlet's famous &quot;To be or not to be&quot; speech?a contemplation of suicide, the afterlife, injustice, and the inability to turn thought into action?has gone viral. While Hamlet intends the speech to be private, Shakespeare stages it for a public audience composed of people from all walks of English society. What appears to be an expression of individuality, then, is also shaped by and for the social networks in which the character and playwright lived. Would Hamlet have spoken differently had he known his words would go viral? Twenty-first century social networks such as Facebook have changed the way we present ourselves to the world, how we interpret and judge the experiences of others, how we define friendship, and how we receive and share information. In this course we will employ perspectives and tools from the digital age as we read a selection of Shakespeare's plays, including Hamlet, The Winter's Tale, Merchant of Venice, Macbeth, Othello, and Henry V. We'll experiment with different kinds of literary analysis, combining old-fashioned &quot;close reading&quot; of language at the sentence-level with newer kinds of &quot;distant reading&quot; that track thematic and rhetorical patterns across multiple plays. We will pay particular attention to similarities and differences between our own social networks and those in Shakespeare's plays and the culture in which they were originally performed."}], "lmod": "5/1/16 6:31 PM (CT)", "subject": "ENGLISH"}]