[{"class_mtg_info": [{"meet_t": "MoWe 9:30AM - 11:20AM", "meet_l": "Garage Workspace Classroom 1"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Fall 2016", "name": "10611", "title": "WCAS ART 390-0-20 Special Topics in Art", "class_attributes": "", "section": "10611", "instructors": [{"instructor_phone": "847/491-3540", "instructor_name": "Malcolm Angus MacIver", "instructor_addr": "Technological Institute, Rm B292, 2145 Sheridan Rd, EV CAMPUS"}, {"instructor_phone": "", "instructor_name": "Michael J Rakowitz", "instructor_addr": ""}], "topic": "Risk", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "Risk (ART 390, DSGN 395) <br/>Monday &amp; Wednesday, 9:30am-11:20am, Location: The Garage (2311 Campus Dr, 2nd floor, in the &quot;Workspace&quot;)<br/><br/>Having experienced [deeply meaningful] work, the student will forever after feel a little ashamed when they design a pretty, sexy toaster.<br/>-Victor Papanek, Design for the Real World<br/><br/>Instructors<br/>Michael Rakowitz, Department of Art Theory and Practice <br/>Malcolm MacIver, Department of Mechanical Engineering, Department of Biomedical Engineering, Department of Neurobiology<br/><br/>Enrollment: By permission of instructors <br/>(maciver@northwestern.edu and m-rakowitz@northwestern.edu)<br/><br/>This class will bring together artists and engineers to do innovative work designed for impact. Our theme is Risk. Humans are exposed to countless dangers on a daily basis and many calls to action. Yet we so often fail to act. How can invisible risk be made visible enough for people to take action? How can we take examples of &quot;great danger&quot; in our media environment and flip the discourse?<br/><br/>Engineering makes risk visible by first quantifying it to then make it disappear (in bridges, anti-lock brakes, etc); design has made safety fashionable (sunglasses, hats, rapidly inflating bike helmets that look like scarves). Art looks to push risk forward as a way of dismantling comfort.<br/><br/>Zones of risk can be areas of power struggle, where marginalized groups at risk try to make the risk visible, while power structures that find this risk inconvenient have tried to make it invisible. We see this in the history of AIDS activism, and more recently, in the Black Lives Matter movement, both of which have had strong ties to the visual arts.<br/><br/>We can view several looming existential threats to humanity as examples where the increase in risk is too shallow to trigger our usual motivated responses, like the parable of the frog in the warming pot of water not ever realizing it was getting too hot to live. The smokestack can be considered an icon of this idea: without a long chimney, people would fight the pollution, but by making pollutants go high into the atmosphere, we put the risk below the threshold of action. Examples of this problem include the rise of CO2, the fall of biodiversity, and increasing inequality.<br/><br/>At the heart of this class is the hope that students will develop an ethical program as individual artists and designers. Students will be asked to approach their research and project in ways that range from countering risk to increasing the gradient of risk so that we must act now. Indeed, sometimes we need better monsters."}, {"name": "Registration Requirements", "value": "Registration: permission of instruction"}], "lmod": "10/30/16 6:58 PM (CT)", "subject": "ART"}]