[{"school": "WCAS", "overview_of_class": "This freshman seminar is designed to expose incoming students to the basic approaches that historians, political scientists, and sociologists use to understanding historical memory. In particular, we examine how reputations are constructed by the public and by historians, and how scandals (including contemporary ones) come to be understood. Our primary focus for this course will be American examples, but the historical range will be broad, covering 1700-present. Given the controversy recently uncovered at Northwestern about the involvement of our founder, John Evans in the Sand Creek Massacre, the most significant genocide of native peoples on United States soil, we will discuss how the university should recall Evans' deeds.", "name": "First-Year Seminar", "section": "20", "topic": "Scandals &amp; Reputations", "course": "101-6", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4640/WCAS/SOCIOL/101-6/14398", "instructor": ["Gary A Fine"], "id": "14398", "subject": "SOCIOL"}, {"school": "WCAS", "overview_of_class": "In this course, we will explore how and why American families have changed since the 1960s. Although there are many topics related to families and family life, the focus of this writing-intensive course will be on marriage and other romantic relationships. We will discuss changes in the ways that people find a romantic partner, the characteristics of their partners, and the duration and types of their relationships. We will examine what these changes mean for the individuals involved and for the broader society. Topics include cohabitation, divorce, non-marital childbearing, and same-sex unions.", "name": "First-Year Seminar", "section": "21", "topic": "Am Fam after Sexual Revolution", "course": "101-6", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4640/WCAS/SOCIOL/101-6/14399", "instructor": ["Christine Marie Percheski"], "id": "14399", "subject": "SOCIOL"}, {"school": "WCAS", "overview_of_class": "This course examines the experiences of young people today and how the experience of being a young person varies greatly by socio-economic status, gender, and race/ethnicity. We will also spend time looking at how life stages associated with youth (such as tween, teenager, and emerging adulthood) have evolved and why the road to adulthood is often longer today. We will also think about how the media shapes societal views of young people and how young people use social media. Finally, we will consider how the lives of young people today (Millenials) compare to earlier generations (including Baby Boomers and Generation X) and we will look at intergenerational interactions at home, in school, and in the workplace.", "name": "First-Year Seminar", "section": "22", "topic": "Teens, Tweens and Adolescents", "course": "101-6", "meeting_time": ["MoWe 11:00AM - 12:20PM"], "path": "/class-descriptions/4640/WCAS/SOCIOL/101-6/14400", "instructor": ["Karrie A Snyder"], "id": "14400", "subject": "SOCIOL"}]