[{"class_mtg_info": [{"meet_t": "We 12:00PM - 2:50PM", "meet_l": "Parkes Hall 215"}], "school": "JOUR", "enrl_requirement": "Enrollment Requirements: Registration is reserved for IMC Certificate students who have completed IMC 303-0.", "qtr": "Winter 2017", "name": "24211", "title": "JOUR IMC 304-0-20 Media and Message Delivery", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "24211", "instructors": [{"instructor_phone": "", "instructor_name": "Judy U Franks", "instructor_addr": ""}], "topic": "", "course": "304-0", "descriptions": [{"name": "Overview of class", "value": "Explores the contemporary media landscape and how brand communications adapt to media technology and usage. Uses current case studies to understand the transition from passive consumption of traditional media to active participation in digital and social media. Focuses on engaging consumers and other audiences and communicating effectively with them through media. Prerequisites: IMC 303, and admission to IMC Certificate Program."}, {"name": "Learning Objectives", "value": "At the end of the course, students will be able to: <br/>1. Understand the transformational role of consumers in the process of Media and Message Delivery:<br/>from &quot;recipient&quot; to &quot;accelerant&quot;<br/>Consumers are, by far, the most potent media channel. In IMC 304, students will learn the various approaches to media targeting (from broad demographic cohorts to discrete behavioral targets) and when to apply each approach in order to maximize opportunities for consumer engagement with the Media and Message Delivery Strategy.<br/>2. See beyond the all the Chaos in the media landscape today, to understand the true forces that will shape media in the foreseeable future. The State of the Media will be explained through Five Global Forces:<br/>a. Convergence<br/>b. Symbiosis<br/>c. Circuits<br/>d. Branding<br/>e. Economics<br/>3. Understand the philosophical underpinnings of various Media and Message Delivery Strategies through the exploration of &quot;Best Practices&quot; exhibited through contemporary case studies.<br/>At the end of IMC 304, students will be able to `reverse engineer' actual in-market cases, and justify their execution from the basis of target, media, and strategy"}, {"name": "Class Materials (Suggested)", "value": "Optional:<br/>Media Generations, Block (author) Schultz (author) BIGresearch (author) Publisher: Prosper Business Development Corporation (February 6, 2009) ISBN-10: 0981941516 ISBN-13: 978-0981941516"}, {"name": "Class Notes", "value": "This course is reserved for IMC certificate students."}], "lmod": "12/24/16 6:44 PM (CT)", "subject": "IMC"}]