[{"class_mtg_info": [{"meet_t": "We 1:00PM - 3:50PM", "meet_l": "Parkes Hall 222"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Sociology/MORS PhD Students", "qtr": "Spring 2017", "name": "36384", "title": "WCAS SOCIOL 476-0-24 Topics in Sociological Analysis", "class_attributes": "", "section": "36384", "instructors": [{"instructor_phone": "847/491-3719", "instructor_name": "Ann Shola   Orloff", "instructor_addr": "1808 Chicago Ave. Rm. 201"}], "topic": "Social Scientific Approaches to Gender and Sexuali", "course": "476-0", "descriptions": [{"name": "Overview of class", "value": "This seminar offers an overview of and introduction to social scientific approaches to gender and sexuality, mostly as it has been practiced in the United States since the 1970s. Work in this area took off in tandem with the feminist and lesbian and gay social movements of the era, inspired by genitive theoretical works by Simone deBeauvoir, Gayle Rubin, Michel Foucault, Sherry Ortner, and many others. The political and intellectual ferment enabled and inspired exciting theoretical and empirical work on gender relations and sexualities across the disciplines. In this seminar, we focus on the work of social scientists, but will also seek, where possible, to situate their scholarship in relation to selected, pivotal texts from the humanities. We will consider present and future directions for theoretical and empirical work on gender relations and sexualities, and will also try to place the unique conundrums and disciplinary orientations behind our own research agendas in fruitful relationship to the claims, trajectories, and debates of feminist theory, theories of sexualities, and various other contemporaneous schools of critical theory. Seminar discussions will constitute the heart of the course, and two critical essays, or a longer paper, will offer each student the opportunity to explore the themes of the seminar with respect to their own disciplinary and research concerns."}, {"name": "Registration Requirements", "value": "Sociology graduate students only. Students from other departments may enroll with instructor permission if space allows.<br/><br/>This seminar fulfills one of the requirements for the Graduate Certificate in Gender &amp; Sexuality Studies. See http://www.gendersexuality.northwestern.edu/graduate/certificate-cluster-requirements.html for further information on the Graduate Certificate."}, {"name": "Teaching Method", "value": "Teaching Method: Seminar symposium style: collective discussion, short presentations"}, {"name": "Evaluation Method", "value": "Evaluation Method:<br/>(a) Seminar presentation/discussion paper (3-5 pp) [25%];<br/>(b) either two mid-length (8-10 pp) papers due mid-term and end of quarter [60%]; or [with permission of instructor] one long paper (20-25 pp) due end of quarter [60%]; and (c) Seminar participation [15%]."}, {"name": "Class Materials (Required)", "value": "Pierre Bourdieu, Masculine Domination (Stanford, CA: Stanford University Press, 2002) ISBN-13: 978-0804738200<br/><br/>Judith Butler, Gender Trouble: Feminism and the Subversion of Identity (second edition) (New York: Routledge, 2006) ISBN-13: 978-0415389556<br/><br/>Toril Moi, What is a Woman? And Other Essays (New York: Oxford University Press, 1999) ISBN-13: 978-0198186755<br/><br/>Carolyn Steedman, Landscape for a Good Woman (New Brunswick, NJ: Rutgers University Press, 1987) ISBN-13: 978-0813512587<br/><br/>Linda Zerilli, Feminism and the Abyss of Freedom (Chicago: University of Chicago Press, 2005) ISBN-13: 978-0226981345"}], "lmod": "2/21/17 6:51 PM (CT)", "subject": "SOCIOL"}]