[{"class_mtg_info": [{"meet_t": "MoWeThFr 11:00AM - 11:50AM", "meet_l": "Technological Institute L211"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Co-Requisite:  Students must also register for Physics 136-2.<br/>Add both classes to the shopping cart and submit together for successful registration.", "qtr": "Winter 2016", "name": "22596", "title": "WCAS PHYSICS 135-2-02 General Physics", "class_attributes": "Natural Sciences Distro Area<br/><br/>", "section": "22596", "instructors": [{"instructor_phone": "847/467-2583", "instructor_name": "Jens   Koch", "instructor_addr": "Technological Institute Building (2145 Sheridan Road), Room F-332, Evanston, IL"}], "topic": "", "course": "135-2", "descriptions": [{"name": "Overview of class", "value": "This is a three-quarter sequence in calculus-based classical physics with an introduction to modern physics in the third quarter. It is intended for science and engineering majors and premedical students. <br/><br/>PHYS135-2 is the second part of the 135 sequence on General Physics intended for science and engineering majors, as well as premedical students. 135-2 deals with electric and magnetic phenomena in their various forms and manifestations. Specific topics include:<br/>Static electric fields, static magnetic fields, DC and AC circuits, time-dependent electric and magnetic fields, Maxwell's equations."}, {"name": "Registration Requirements", "value": "Prerequisites: MATH 220-0, MATH 224-0, and MATH 230-0 or equivalent; MATH 230-0 may be taken concurrently with PHYSICS 135-1. Concurrent registration in the corresponding quarter of PHYSICS 136-1,2,3 (laboratory). Prior physics is not necessary. PHYSICS 135-1,2,3 are sequential prerequisites."}, {"name": "Teaching Method", "value": "Teaching will consist of a combination of lectures, demonstrations, and discussion sections (total of four hours each week; discussion sections will be flexible and not fixed to a particular weekday)."}, {"name": "Evaluation Method", "value": "Grades will be based on performance in online quizzes, problem sets, two midterm exams, and one final exam."}, {"name": "Class Materials (Required)", "value": "Fundamentals of Physics 10th edition, extended version by Jearl Walker<br/>[Possible use of a Student Response System/Turning Account will be announced the first week of classes.]"}], "lmod": "1/9/16 6:52 PM (CT)", "subject": "PHYSICS"}]