[{"class_mtg_info": [{"meet_t": "Th 2:00PM - 4:50PM", "meet_l": "University Hall 018 English"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Winter 2017", "name": "23987", "title": "WCAS ENGLISH 441-0-20 18Th Cent Lit", "class_attributes": "", "section": "23987", "instructors": [{"instructor_phone": "", "instructor_name": "Helen F Thompson", "instructor_addr": ""}], "topic": "Long 18 C Constructions of Race and Gender", "course": "441-0", "descriptions": [{"name": "Overview of class", "value": "This seminar will read travel narratives, natural philosophy, and fiction spanning the late seventeenth through the early nineteenth century. Our primary interest will be these texts' intersecting constructions of gendered and ethno-geographical (hereafter &quot;racial&quot;) difference. To establish our methodological and historical coordinates, we'll read excerpts from Judith Butler's Gender Trouble and Bodies that Matter alongside seventeenth-century natural history to think about the critical stakes of &quot;race&quot; and gender at a time when neither category was essentially fixed. Due to the rise of empirical philosophy and science, which strongly rejected neo-Aristotelian notions of essence, &quot;race&quot; and, to some extent, gender were derived from relations involving performance, sensory perception, environment, and power. However, the relational production of &quot;race&quot; and gender do not divest these attributes of materiality. We will be attentive to how body, rather than a static bearer of qualitative difference, may be implicated in the relational apparition of &quot;race&quot; and gender all the way down. This seminar also functions as an introduction to the rise of the novel, with critical attention to the interplay between novel and travel narrative."}, {"name": "Registration Requirements", "value": "permission of Department required"}, {"name": "Class Materials (Required)", "value": "Tentative list of primary texts includes: <br/>Aphra Behn, Oroonoko; <br/>Daniel Defoe, Robinson Crusoe; <br/>Penelope Aubin, The Noble Slaves; <br/>Hans Sloane, History of Jamaica; <br/>Samuel Richardson, Pamela; <br/>anonymous, The Woman of Colour; <br/>Leonora Sansay, Secret History; or, the Horrors of Saint Domingo; <br/>Jane Austen, Mansfield Park. <br/><br/>Critical texts may include: Srinivas Aravamudan, Eighteenth-Century Orientalism; Karen Barad, Meeting the Universe Halfway; Ian Baucom, Specters of the Atlantic; Linda Colley, Captives; James Delbourgo, &quot;Slavery in the Cabinet of Curiosities: Hans Sloane's Atlantic World&quot;; Michel Foucault, The Order of Things and/ or ?Society' Must Be Defended; Michael Kwass, Contraband; Mary Louise Pratt, Imperial Eyes; Stephanie Smallwood, Saltwater Slavery; Roxann Wheeler, The Complexion of Race. The syllabus will also include shorter readings by Thomas Hobbes, John Locke, Mary Astell, and others."}], "lmod": "12/24/16 6:58 PM (CT)", "subject": "ENGLISH"}]