[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "Harris Hall L06"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "25673", "title": "WCAS HISTORY 300-0-32 New Lectures in History", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "25673", "instructors": [{"instructor_phone": "", "instructor_name": "Ashley Campbell Johnson", "instructor_addr": ""}], "topic": "African Americans, Police, and Prisons in the 20th", "course": "300-0", "descriptions": [{"name": "Overview of class", "value": "Police shootings, protest, and violence have caused arguments on both sides of the political aisle and African Americans are at the heart of this discourse. This course seeks to put this debate over policing, law and order, and black lives into historical perspective. Beginning in the 1930s, students will examine the development of heroin in American cities and lynch laws in the segregated south before moving into the postwar era, when federal housing policies reinforced segregation in America's industrial core. Moving through the 1960s and 1970s, students will analyze the politics of &quot;law and order,&quot; exploring the ways in which the &quot;war on drugs&quot; and the mass media shaped episodes like the Attica Prison Riot, urban rebellions, and the anti-gang policing crackdown that escalated in the 1980s. It will end in the present era, a time when over 500,000 people remain incarcerated for non-violent drug offenses, and two-thirds of these are African American or Latino. By the end of the course, students will understand how incarceration, stop and frisk, and violent law enforcement encounters shape modern debates about prisons and have fueled a growing movement for African American racial justice. The course will draw on historical analyses, primary documents, documentaries, and popular television shows to trace African Americans' complex relationship to policing, crime, and the criminal justice system."}, {"name": "Teaching Method", "value": "DiscussionLecture"}, {"name": "Evaluation Method", "value": "Class participationDiscussion sectionExam, finalPresentations"}, {"name": "Class Materials (Required)", "value": "***Tentative until posted to Norris website***<br/>James Goodwin. Stories of Scottsboro. 9780679761594.<br/>Radley Balko. The Rise of the Warrior Cop. 9781610394574.<br/>Phillip Jenkins. Decade of Nightmares. 9780195341584.<br/>Keeanga-Yamahtta Taylor. From BlackLivesMatter to Black Liberation. 9781608465620.<br/>Ta Nehisi Coates. Between the World and Me. 9780812993547."}, {"name": "Class Notes", "value": "AREA OF CONCENTRATION: Americas"}], "lmod": "12/29/16 6:59 PM (CT)", "subject": "HISTORY"}]