[{"class_mtg_info": [{"meet_t": "Tu 4:00PM - 5:00PM", "meet_l": "Technological Institute AG45"}], "school": "MEAS", "enrl_requirement": "Enrollment Requirements: Pre-req: Students must have completed CIV_ENV 330 to register for this course.<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Winter 2016", "name": "27083", "title": "MEAS CIV_ENV 336-0-03 Project Scheduling", "class_attributes": "Prerequisites apply, see description<br/><br/>", "section": "27083", "associated_classes": [{"component": "LEC", "room": "Tech Institute Lecture Room 5", "meeting_time": "We 6:30PM - 9:20PM"}], "topic": "", "course": "336-0", "descriptions": [{"name": "Overview of class", "value": "COURSE DESCRIPTION / Project planning, scheduling, and control using CPM arrow and precedence networks; resource allocation and leveling; earned-value analysis, linear scheduling; PERT; hands-on experience using computer tools. COURSE OBJECTIVES / To provide students with the ability to prepare a comprehensive project schedule, including bar charts, networks, cost profiles, resource profiles, and contingency analysis; to learn about the importance of time in project management, coordination among stakeholders, and appropriate control measurements."}, {"name": "Registration Requirements", "value": "CIV_ENV 330 or email instructor (a-hadavi@northwestern.edu) for permission number."}, {"name": "Learning Objectives", "value": "areas: 1) Identify activities involved in a construction project and their relationships; 2) Develop arrow and precedence network diagrams and perform schedule computation for PDM networks; 3) Identify the resources required in a project and apply techniques for resource allocation and leveling; 4) Perform cost loading and time-cost trade-offs; 5) Explain concepts and techniques for monitoring, evaluating, and controlling project performance (ie. earned value analysis); 6) Explain contractual and legal issues related to scheduling; and 7) Use a scheduling software."}, {"name": "Teaching Method", "value": "One 3-hour lectures each week; Computer usage &quot;PRIMAVERA&quot; Scheduling Software"}, {"name": "Evaluation Method", "value": "BASIS OF GRADE / Homework 20%; Term Project 25%; Quiz 5%; Mid-Term Exam 20%; Final Exam 25%; participation 5%. / Students will prepare a comprehensive schedule for a construction project with about 190(±10) activities. Weekly lab assignments on preparation of bar charts, network schedules, cost- and resource-loaded schedules, and summary schedules."}, {"name": "Class Materials (Required)", "value": "&quot;Construction Project Scheduling and Control&quot; Saleh Mubarak ISBN # 978-1-118-84600-1 2015 3rd Wiley"}, {"name": "Class Materials (Suggested)", "value": "Handouts from various journals."}], "lmod": "1/9/16 6:34 PM (CT)", "subject": "CIV_ENV"}]