[{"school": "WCAS", "overview_of_class": "In many ways, the subject of the environment is a focal point for any number of disciplines, both in the liberal arts and hard sciences, to come together in the great clearing house we call &quot;the humanities&quot;. This course will offer a balanced approach to the growth and change in literature devoted to the subject of the environment, touching briefly on 19th century foundations (the assigned writers in the reader discussing Muir, Ruskin, Emerson, Thoreau) and moving quickly to the explosion of what may be a genre of literature unto its own.  We will consider contributions from poetry, drama, fiction, and nonfiction, documentary, advocacy journalism, polemic.  We will consider science and philosophy, art and religion, history and politics, all in the way they come to this huge and pressing subject.  In order to further focus a very rich area of literature and art, we will focus especially on the idea of &quot;Living in Nature&quot;: why we want to, what it means, and what are the consequences. We will consider specifically Into the Wild (Krakauer), Derzu the Trapper (Arseniev), Thoreau's Walden, Giono's The Man who Planted Trees, Janet Kauffman's Rot, Junichiro Tanizaki's In Praise of Shadows, and Werner Herzog's documentary &quot;Grizzly Man&quot;.   We will take time to discuss, under this subtopic, hunting and literature (with works by Edward Abbey, Joy Williams, James Swan, and possibly Ted Nugent).", "name": "Residence-Linked Seminar - V (Ethics &amp; Values)", "section": "10", "topic": "Literature &amp; Environment", "course": "280-5", "meeting_time": ["Th 6:15PM - 9:15PM"], "path": "/class-descriptions/4610/WCAS/GEN_LA/280-5/26615", "instructor": ["Brian D Bouldrey"], "id": "26615", "subject": "GEN_LA"}, {"school": "WCAS", "overview_of_class": "&quot;The Seven Deadly Sins as Portrayed in Cinema&quot; aims first to help students distinguish between exploitation and exploration in cinematic art.  It will focus on how cinematic artists have used their art form to explore and try to explain human conduct as well as complex and serious moral, philosophical, social, political, and psychological issues and themes within the context of the seven deadly sins. In addition, it will explore how an analysis of cinematic art can be enhanced by viewing a film through the thematic lens of the deadly sins. The class will examine why this theme has attracted and influenced so many directors and why it persists as a useful means of exploring a layer of meaning in a cinematic work. <br/><br/>In both realistic and expressionistic styles, American as well as international directors have made films influenced by notions of good and evil. While the concept of the deadly sins has its roots in religious beliefs, these notions of sin, punishment, good and evil show their influence on artists and audiences whose belief systems range from the believer to the non-believer. In the hands of serious artists, the films challenge illusions audience hold about morality and social order as well as existence itself. In horror films, the debate is often over which is the monster. In gangster films, the debate is often over who is the worse criminal. In western films, the debate is often what separates the outlaw from the sheriff. Students thus also will observe how the tension in defining the sins themselves continues to reflect and shape cultural, political, social and philosophical conflicts. The course specifically offers students the opportunity to integrate skills and concepts learned in previous courses and to synthesize questions explored in such areas as comparative religion, philosophy, ethics, culture, psychology, political science, history and sociology as well as social justice. The films viewed for this seminar hope to explore how notions of sin, punishment and redemption are complex and elusive. Finally, the course should offer students the opportunity to consider how to evaluate films by how willing they are to challenge the assumptions and deeply held beliefs of the audience.", "name": "Residence-Linked Seminar - V (Ethics &amp; Values)", "section": "11", "topic": "The Seven Deadly Sins as Portrayed in Cinema", "course": "280-5", "meeting_time": ["We 6:00PM - 9:00PM"], "path": "/class-descriptions/4610/WCAS/GEN_LA/280-5/27715", "instructor": ["John Carl   Kupetz Jr"], "id": "27715", "subject": "GEN_LA"}]