[{"class_mtg_info": [{"meet_t": "MoWeFr 4:00PM - 4:50PM", "meet_l": "Technological Institute L158"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "32136", "title": "WCAS BIOL_SCI 164-0-1 Genetics and Evolution", "class_attributes": "Natural Sciences Distro Area<br/><br/>", "section": "32136", "instructors": [{"instructor_phone": "", "instructor_name": "Kyle Patrick Obergfell", "instructor_addr": ""}], "topic": "", "course": "164-0", "descriptions": [{"name": "Overview of class", "value": "Genetics and evolution is an introductory course that provides and overview of the evolutionary process to non-science majors. No college-level background in biology is necessary. In this course we will learn about the topics of Mendelian, molecular and population genetics, as well as the underlying biological processes. Both the basic principles and current commercial and medical applications of genetics and evolution will be explored throughout the course. Students will discuss common ethical issues and public misconceptions surrounding evolution and critically evaluate these ideas in light of scientific evidence."}, {"name": "Learning Objectives", "value": "At the end of the course students will be able to:<br/><br/>- Explain the mechanisms by which genetic information is expressed and an organism's genome is passed on to subsequent generations<br/><br/>- Describe basic genetic principles and their role in evolution and disease<br/><br/>-Integrate basic genetics and evolution findings to critically analyze research presented in the media<br/><br/>- Evaluate whether the scientific method is properly applied"}, {"name": "Teaching Method", "value": "The class will mainly consist of short lectures coupled with a student group activities and class discussions"}, {"name": "Evaluation Method", "value": "Students are required to come to each class prepared by reviewing the assigned materials and being willing to actively participate in class discussion. <br/><br/>Assignments consist of short weekly written media analyses and weekly online quizzes to check for understanding of class content.<br/><br/>Students will complete a final project alone or in groups in lieu of a final exam"}, {"name": "Class Materials (Required)", "value": "No text required"}], "lmod": "4/3/16 7:45 PM (CT)", "subject": "BIOL_SCI"}]