[{"class_mtg_info": [{"meet_t": "Mo 3:00PM - 5:50PM", "meet_l": "Scott Hall 201 Ripton Room"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "34136", "title": "WCAS POLI_SCI 390-0-26 Special Topics in Political Science", "class_attributes": "", "section": "34136", "instructors": [{"instructor_phone": "", "instructor_name": "Susan Sara   Monoson-Berns", "instructor_addr": ""}], "topic": "Satire &amp; Political Theory", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "&quot;Satire and Political Theory: Aristophanes.&quot; Prof. Monoson Spring 2016<br/>How does satire contribute to political discourse? How far do we find substantial contributions to theorizing about politics in that format (as opposed to just clever and provocative expressions of strongly held opinions)? This course considers these questions by way of extended engagement with the work of the ancient Greek comic dramatist, Aristophanes. An Athenian and contemporary of Socrates, his masterful plays deliver blistering satirical depictions of democratic life and politics in during the long Peloponnesian War and into the fourth century BC. The course will start out observing the proliferation of satire in 21st century political discourse and then turn to examine the plays of Aristophanes. We will read all 11 surviving plays in translation but focus on close study in historical context of two ? Clouds and Lysistrata. We will also attend to the reception history of these two plays, that is, how have they been used and reimagined in contemporary times (e.g., the use of Lysistrata in Spike Lee's Chiraq). <br/>This course counts as a Classical Traditions class, pre-approved for the Classics major/minor."}, {"name": "Learning Objectives", "value": "Gain skill in interpretative methods in political science, develop familiarity with the topic area."}, {"name": "Teaching Method", "value": "Seminar with discussion and student presentations."}, {"name": "Evaluation Method", "value": "Regular student presentations of research relevant to each seminar session plus final seminar project (a 15 pp research paper or other approved creative project)."}, {"name": "Class Materials (Required)", "value": "Most readings will be posted to CANVAS. Required book(s) will be posted at a later date."}], "lmod": "4/3/16 8:17 PM (CT)", "subject": "POLI_SCI"}]