[{"class_mtg_info": [{"meet_t": "Mo 6:00PM - 9:00PM", "meet_l": "1813 Hinman"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>Drop Consent: Department Consent Required<br/>", "qtr": "Spring 2016", "name": "34070", "title": "WCAS CFS 397-0-20 Field Studies in Civic Engagement", "class_attributes": "", "section": "34070", "instructors": [{"instructor_phone": "", "instructor_name": "Jesse Stewart Mumm", "instructor_addr": ""}], "topic": "", "course": "397-0", "descriptions": [{"name": "Overview of class", "value": "Social justice is often defined as the just and equal access to resources, privileges, and social status, and involves the recognition of persistent social inequalities, and that work toward social justice involves ongoing structural social change. This course examines social justice as idea and process, in historical perspective and around the world, and through the lens of active social justice movements in Chicago today. We look in particular at the Black Lives Matter movement, struggles against urban gentrification and displacement, and the immigrant rights movement, as case studies offering new internship opportunities. Course readings and meetings emphasize reflection, debate, and constructive critique, as we pay attention to the intersections of race, class, gender, citizenship, and sexuality, but focus especially on the discourses and practices of race and racism that frame social justice struggles."}, {"name": "Registration Requirements", "value": "Must have applied and been accepted to the Chicago Field Studies Program (http://www.internships.northwestern.edu/) and have secured an internship to participate in this class. <br/><br/>Permission numbers will be sent to accepted CFS students after internship placement is confirmed."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Class Materials (Required)", "value": "The Civically Engaged Reader, Adam Davis and Elizabeth Lynn<br/>? ISBN-10: 0945159498<br/>? ISBN-13: 978-0945159490"}, {"name": "Class Notes", "value": "Must have applied and been accepted to the Chicago Field Studies Program (http://www.internships.northwestern.edu/) and have secured an internship to participate in this class."}], "lmod": "4/3/16 7:51 PM (CT)", "subject": "CFS"}]