[{"school": "WCAS", "overview_of_class": "It's no secret that the United States has one of the highest incarceration rates in the world, one that bears down especially hard on minorities. This course explores why that is so. It examines how scholars, journalists, film-makers, and novelists have explained the rise of mass incarceration and other punitive trends?\"zero tolerance\" in schools, for example-in the past half-century of US history. Students will learn how to understand, assess, and compare their explanations and how to speak and write effectively about them. They will encounter more reading than in most 300-level courses that I and others teach.", "name": "New Lectures in History", "section": "22", "location": "University Hall 121", "topic": "Go Directly to Jail: the Punitive Turn in America", "course": "300-0", "meeting_time": ["MoWe 12:30PM - 1:50PM"], "path": "/class-descriptions/4640/WCAS/HISTORY/300-0/12415", "instructor": ["Michael S Sherry"], "class_attributes": "Historical Studies Distro Area<br/><br/>Attendance at 1st class mandatory<br/><br/>", "id": "12415", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "Do you know why the modern computer was invented during World War II? To kill more people more accurately. How did it get from this militarized origin to its contemporary setting of social media, online shopping, algorithmic culture, and the \"Internet of things\"? This course probes the history of the \"computerized society\" and digital culture in the United States since 1945, approaching the topic from multiple angles: not only technological, but also legal, economic, political, and in terms of questions of gender, race, ethnicity, class, region, and ideology. Together, we will examine both the civilizing and the barbaric sides of computers in modern America. Students attend interactive lectures, read broadly and deeply about the topic, view films, participate in discussion, and complete three short and one longer essay for the course.", "name": "New Lectures in History", "section": "24", "location": "University Hall 101", "topic": "US Digital Culture Since WWII", "course": "300-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4640/WCAS/HISTORY/300-0/12416", "instructor": ["Michael J Kramer"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "12416", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "This course examines the histories of Latin American dances and their relationship to developing notions of race and nation in the region. It studies the historical emergence and transformation of categories like \"indigeneity,\" \"blackness,\" and \"whiteness\" and how dance practices became associated with these identifications. It also traces dance developments in relation to nation-state formation and social stratification. In short, it explores a paradox: How did dance serve as a source of local cohesion and division by underscoring shared culture as well as racial, gender, and class hierarchies? Weekly readings move forward chronologically from the fifteenth century to present day.", "name": "New Lectures in History", "section": "26", "location": "University Library Video Theat", "topic": "Dance, Race & Nation in Latin America", "course": "300-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4640/WCAS/HISTORY/300-0/12417", "instructor": ["Elizabeth Bowlsby Schwall"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "12417", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "The 20th century has been marked by upheaval and consequent migration for the people of the Korean peninsula. As a result of these migrations, substantial communities of ethnic Koreans exist in Central Asia, China, Japan, the United States and Canada, South America and Europe. How and why did Koreans go to these places? What kinds of communities and identities did they construct? How do these Koreans fit into the history of Korea, particularly in the context of a country divided into two opposing states? How do they fit into the history of their host countries? By examining the histories of ethnic Koreans outside the Korean peninsula, we will examine issues of migration, diaspora, race relations, and colonialism. We will also take a fresh look at modern Korean history by examining how these \"overseas Koreans\" view and relate to the history and ongoing politics of their divided homeland.", "name": "New Lectures in History", "section": "28", "location": "Frances Searle Building 3220", "topic": "Korean Diaspora", "course": "300-0", "meeting_time": ["MoWe 9:30AM - 10:50AM"], "path": "/class-descriptions/4640/WCAS/HISTORY/300-0/12418", "instructor": ["Ji-Yeon   Yuh"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "12418", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "The theme of the \"end of days\" threatens to overwhelm us in popular media; even the United States government is capitalizing on the obsession with the \"zombie\" apocalypse to encourage emergency preparedness. Apocalypses are not just exciting stories, they have long roots in the Western tradition, particularly in Christianity, science, and the Enlightenment, and they have many uses. They can narrate a great victory for the morally righteous, become a foil for a critique of enlightenment or industrial progress, and unveil the gateway to utopia. Apocalyptic stories also often reinforce previously held assumptions about humans, nature, and human nature, holding within them a regenerative moment when humanity (or some select part of it) could finally get things right. As a result, the end of days not only makes an excellent category of historical analysis, but can help us think through an ominous and looming apocalypse in our own time - global climate change.", "name": "New Lectures in History", "section": "30", "location": "Annenberg Hall G32", "topic": "Apocalypse: Environment, History, Science, and Rel", "course": "300-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4640/WCAS/HISTORY/300-0/17490", "instructor": ["Sheila Two Wille"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "17490", "subject": "HISTORY"}]