[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Kresge Centennial Hall 2-410"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Religion, Asian Languages and Cultures, Middle East and North African Studies, International Studies, or Jewish Studies majors or minors", "qtr": "Spring 2017", "name": "37919", "title": "WCAS RELIGION 309-0-20 Topics in Hinduism", "class_attributes": "", "section": "37919", "instructors": [{"instructor_phone": "", "instructor_name": "Charles Scott Preston", "instructor_addr": ""}], "topic": "Gods, Demons, and their Games of Thrones, The Livi", "course": "309-0", "descriptions": [{"name": "Overview of class", "value": "This course investigates two of India's major epics: the <i>Mahabharata</i> and the <i>Ramayana</i>. We will approach these texts as classic works of literature and as religious texts that play important roles in the lives of practicing Hindus. We will begin by reading parts of the <i>Ramayana</i> paying particular attention to the ideals of kingship, love, good and evil, and the status of women in the text. We will study the differences between various versions of the Ramayana story throughout Asia, including modern televised versions and the animated film &quot;Sita Sings the Blues.&quot; We will also be thinking about this text's role in religious practice as well as South Asian politics. In the second half of the course, we will turn to the <i>Mahabharata's</i> epic tale of battle. Approaching it first from a literary angle, our conversation will focus on the ethical debates within the text, in particular how the <i>Mahabharata</i> raises questions about the ideals of kingship and kinship, the justice of war, and the roles of women in the text. We will then address the religious dimensions of the text and study closely to the famous Bhagavad Gita, attending to that work's philosophy and impact on South Asian religious thought, as well as political thought in the writings of Gandhi. The course reading will include segments of the original texts in translation, a smattering of scholarly articles, and plenty of video clips, photographs, and newspaper articles from South and Southeast Asia that reveal these living epics' enduring legacy."}, {"name": "Registration Requirements", "value": "None."}, {"name": "Learning Objectives", "value": "1. Have a thorough understanding of these two texts, the Ramayana and the Mahabharata, and their significance for Hindu religious practice and thought. <br/>2. Develop a deeper understanding of certain important aspects of Hindu thought, practice, and history.<br/>3. Critically analyze literary/religious texts, and compare different versions and reinterpretations that have evolved in different religious and historical contexts. <br/>4. Consider questions about how religious narratives, particularly these two texts but also in general, shape practice, belief, and identity.<br/>5. Investigate the intersection of religion and politics, and the ambiguity of the myth/history dichotomy, in the case of these two epics."}, {"name": "Teaching Method", "value": "Class participationDiscussionReadingsSeminarWriting assignments<ln/>"}, {"name": "Evaluation Method", "value": "Class participationPapers: 3 papers, 4-5 pages each<br/>Quizzes: 2 mini quizzes<br/>Readings"}, {"name": "Class Materials (Required)", "value": "R.K. Narayan, The Ramayana: A Shortened Modern Prose Version, Penguin Classics ISBN: 978-0143039679<br/><br/>Laurie Patton, The Bhagavad Gita, Penguin Classics, ISBN: 978-0140447903<br/><br/>John Smith, The Mahabharata, Penguin Classics, ISBN: 978-0140446814<br/><br/>All other readings will be scanned."}], "lmod": "2/13/17 6:48 PM (CT)", "subject": "RELIGION"}]