[{"school": "WCAS", "overview_of_class": "Nazi Germany's genocide of European Jewry depended on far more than just members of the National Socialist Party and the country's military. From Vichy France in the West to the occupied Soviet territories in the East, the persecution, expropriation, and murder of millions involved countless civilians and state officials at all levels of government. Many of those who collaborated with the Nazis did so for personal or partisan gain and/or because they were themselves antisemites. Many others, however, were drawn into the process of genocide without necessarily having planned to aid the Germans. This course considers the causes, consequences and limits of complicity in the Holocaust. In particular, we will examine collaboration at the face-to-face level of relations between neighbors and with local officials. We will explore the most vexed questions of complicity among occupied peoples and within ghettos and concentration camps. We will follow these questions up through the end of the war and beyond and explore the measures postwar European states took (or, more commonly, did not take) to identify and punish those who profited from the murder of the continent's Jews.", "name": "First-Year Seminar-European History", "section": "20", "topic": "Collaboration and Resistance", "course": "101-6", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4640/WCAS/HISTORY/101-6/12303", "instructor": ["Benjamin   Frommer"], "id": "12303", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "Through the autumn and winter of 1799 in central France, a naked boy was seen swimming and drinking in streams, climbing trees, digging for roots and bulbs, and running at great speed on all fours. He was captured in January 1800 by local farmers and brought to Paris. This &quot;wild boy&quot; from Aveyron became an overnight sensation, the object of curiosity and endless speculations about the relationship between instinct and intelligence and questions about the differences between humans and animals. The young doctor Jean-Marc-Gaspard Itard, who undertook the task of socializing and educating the wild child, carefully recorded the boy's progress. Itard's work ultimately transformed the treatment of mental retardation and to a revolution in childhood education that is reflected in every preschool program in our time. This course introduces students to the philosophical and attitudinal changes regarding nature, childhood, and family life that enabled society to view the &quot;wild boy&quot; not as a freak or savage, but as a person inherently capable of civility, sensibility, and intelligence. The course material is designed for students interested in intellectual history, psychology and education.", "name": "First-Year Seminar-European History", "section": "21", "topic": "Wild Child: Sep Humans/Animals", "course": "101-6", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4640/WCAS/HISTORY/101-6/12304", "instructor": ["Tessie P Liu"], "id": "12304", "subject": "HISTORY"}]