[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Kresge Centennial Hall 2-425"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24597", "title": "WCAS RELIGION 339-0-20 Topics in Judaism", "class_attributes": "Ethics &amp; Values Distro Area<br/><br/>", "section": "24597", "instructors": [{"instructor_phone": "", "instructor_name": "Joseph Tzvi Ringel", "instructor_addr": ""}], "topic": "Religion and Politics in the State of Israel", "course": "339-0", "descriptions": [{"name": "Overview of class", "value": "This course discusses the relationship between religion and politics in Israel. We will explore the theoretical/ideological background and historical development of that relationship; the advantages and disadvantages of that system; the various religious groups and parties represented in the political system; and how that relationship affects government policies regarding both domestic issues and foreign policy, including a section on religious violence and peace-making. We will likewise delve into broader questions as to the applicability of the Israeli model to other part of the world, to what extent the Israeli model represents broader trends in the Middle East specifically and in the world at large, and the complex nature of the relationship between democracy and religion (or between religion and politics in a democracy). This course will utilize academic literature from a variety of fields, including anthropology, political science, religion, and history, and employs literature from interdisciplinary fields, including Jewish Studies, Islamic Studies, and Middle Eastern and North African studies. By the end of the course, it is hoped that you will understand the ways in which religion and politics in Israel impact each other, the cultural and historical context of how those interactions developed, the impact that relationship has, and how the study of religion and politics in Israel is relevant to our lives in the US.<br/><br/> Note that this course is a 300-level course, and as such, has a heavy writing component, which fits the format and subject of the course better than quizzes or exams. The point is to think about and synthesize the material. The grade will be based on 4 papers, each of which will be do at the end of every second week, as well as class participation. These include 2 response papers (about 5 pp. each), a term paper (about 10 pp.), and a final paper (about 5 pp.). In terms of reading requirements, students will be required to use Robert D. Lee&#39;s Religion and Politics in the Middle East: Identity, Ideology, Institutions, and Attitudes (Boulder, CO: Westview Press, 2014; ISBN:  9780813348735) and to complete the readings listed in the syllabus, which will include articles and relevant sections of books that will be posted on CAESAR/CANVAS. Though there are no registration requirements for this class, newer students not used to the system should keep these requirements in mind. The course will consist of both a lecture as well as ample time for fun interactive learning and class discussion and participation."}, {"name": "Class Materials (Required)", "value": "Robert D. Lee&#39;s Religion and Politics in the Middle East: Identity, Ideology, Institutions, and Attitudes (Boulder, CO: Westview Press, 2014; Print ISBN: 9780813348735)<br/>Price is $44.00 on the Westview Press site, and $25.99 for the Ebook (Ebook ISBN: 9780813348742)."}, {"name": "Class Notes", "value": "Counts towards (RLP) Religion, Law and Politics major concentration."}], "lmod": "12/25/16 7:06 PM (CT)", "subject": "RELIGION"}]