[{"school": "WCAS", "overview_of_class": "Legal St 376-0-20 &quot;HAMILTON: BULLETS, BANKS, AND BROADWAY&quot;, Winter 2017, Prof. Laura Beth Nielsen &amp; Prof. Joanna Grisinger<br/><br/>This interdisciplinary course examines Alexander Hamilton (the founding father) and Hamilton: An American Musical (the Tony, Grammy, and Pulitzer-winning musical) from an interdisciplinary perspective. Taught in Legal Studies, with the help of faculty from Theater, African-American Studies, Communications, Political Science, SESP, and History, the course examines topics including Building a Constitution: Who's Included and Not Included in Story of the Founding; Dueling Culture, Reputation, and Honor in Early America and Today; Founders' Chic: What would Hamilton, Jefferson, Madison, and Washington Think if They Were Alive Today? And Should We Care?; Theater and Social Change: Cultural Output and Adaptation; Hamilton and the Building of the American Economy; and the Law and Economics of the Hip Hop Aesthetic: Sampling, Fan Fiction, and Fair Use. All students enrolled in the course will receive a complimentary ticket to see the show in Chicago on January 12, 2017.", "name": "Topics in Legal Studies", "section": "20", "topic": "Hamilton: Bullets, Banks, &amp; Broadway", "course": "376-0", "meeting_time": ["Th 5:00PM - 7:50PM"], "path": "/class-descriptions/4650/WCAS/LEGAL_ST/376-0/22648", "instructor": ["Laura B Nielsen", "Joanna Lynn Grisinger"], "id": "22648", "subject": "LEGAL_ST"}, {"school": "WCAS", "overview_of_class": "This course examines how individuals' social position permeated their interactions with others and with the law in the United States before the Civil War. In the process, we'll examine how the law reinforced class, gender, and racial boundaries in order to maintain the social and economic status quo.", "name": "Topics in Legal Studies", "section": "21", "topic": "Paupers, Prostitutes, &amp; Politics: Race", "course": "376-0", "meeting_time": ["MoWe 12:30PM - 1:50PM"], "path": "/class-descriptions/4650/WCAS/LEGAL_ST/376-0/22649", "instructor": ["Susan Gaunt Stearns"], "id": "22649", "subject": "LEGAL_ST"}]