[{"class_mtg_info": [{"meet_t": "Mo 3:00PM - 5:50PM", "meet_l": "Kresge 3364 Slavic Seminar Rm"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "25610", "title": "WCAS SLAVIC 361-0-1 Survey of 20th Century Russian Poetry", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "25610", "instructors": [{"instructor_phone": "", "instructor_name": "Ilya   Kutik", "instructor_addr": "1880 Campus Dr. (Kresge) Office 3363"}], "topic": "", "course": "361-0", "descriptions": [{"name": "Overview of class", "value": "This course will focus on the Silver Age of Russian poetry, the great period of poetic experimentation and innovation that runs from about 1890 to 1930. We will examine major poets from the Symbolist, Futurist, and Acmeist movements, along with manifestoes and key critical texts. Graduate students will be expected to do a brief (15 minute) presentation on a secondary reading by a contemporary of the poets under discussion (e.g. Shklovsky, Jakobson, Trotsky, Zhirmunsky, Tynianov, Bukharin, Lunacharsky, etc.). We will examine these poets both in the context of modernism generally, and in the light of the Russian political and cultural upheavals that first shaped and then suppressed their artistic experiments. We will pay particular attention to problems of translation; students may elect to do a translation with commentary for one of their assignments. Poets to be considered include: Briusov, Balmont, Gippius, Blok, Mayakovsky, Khlebnikov, Akhmatova, Mandelstam, Pasternak, Tsvetaeva."}, {"name": "Teaching Method", "value": "Lecture and Discussion"}, {"name": "Evaluation Method", "value": "Attendance and class participation 25%<br/>Take-home exercises 10%<br/>Take home assignments (2-4 pgs) 25%<br/>Final exam ID passages and brief discussion 10%<br/>Final essay (in class or take-home) 30%<br/><br/>PLEASE NOTE: NO make-up exams will be given."}, {"name": "Class Materials (Required)", "value": "Russian Modernist poetry is notoriously difficult. We will be reading all poems in the original, but translations, to be taken with many grains of salt, will be provided whenever possible. We'll discuss the relationship between the original texts and the translations as part of our examination of the poems. You may also want to visit the excellent website created by Ilya Kutik and Andrew Wachtel at www.russianpoetry.net for additional translations and links to readings.<br/><br/>1. Selected Poems of Anna Akhmatova (bilingual edition)<br/>2. The Bedbug and Selected Poetry, Vladimir Mayakovsky (bilingual edition)<br/>3. Aleksandr Blok: Selected Poems, ed. James Woodward (Russian texts and glossary)<br/>4. Cambridge Introduction to Russian Poetry, Michael Wachtel<br/>-Additional readings will be available in the course pack or on blackboard."}], "lmod": "12/29/16 7:05 PM (CT)", "subject": "SLAVIC"}]