[{"school": "WCAS", "overview_of_class": "Prof. Elizabeth Shakman Hurd, Fall 2016 &quot;Religion, Race, &amp; Global Politics&quot;<br/>This seminar examines critical themes at the intersection of religion, race, and global politics. We will explore how particular constructions of &quot;religion&quot; and &quot;race&quot; inform contemporary scholarship, and authorize national and international legal and governmental practice. These questions will be examined in a variety of contexts ranging from antisuperstition laws in Haiti, to the rise of Christian free enterprise in the aisles of Wal-Mart, to the celebration of &quot;moderate&quot; religion at the US State Department, to the politics of immigration, and beyond. Topics include religion and the rise of the nation-state; the politics of religious establishment and religious freedom; the role of race in the formation of the disciplines of religious studies and international relations; the formation of modern vocabularies of religious exclusion (e.g., &quot;superstition,&quot; &quot;vodou,&quot; &quot;folk religion&quot;); and the role of religiosity and religious affect in neoliberal experience. Our readings will traverse disciplinary boundaries to explore these questions by drawing on new work that draws together the study of international relations, religion, law, anthropology and history.", "name": "Special Topics in Political Science", "section": "20", "topic": "Religion, Race, &amp; Global Politics", "course": "490-0", "meeting_time": ["We 9:00AM - 11:50AM"], "path": "/class-descriptions/4640/WCAS/POLI_SCI/490-0/12806", "instructor": ["Elizabeth S Hurd"], "id": "12806", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "Professor Will Reno, Politics of Civil Wars, Fall 2016<br/>This course is about post-World War II conflict primarily within states [&quot;civil wars&quot;]. Readings and discussions will focus on different ways to conceptualize the roles of violence, recruitment, mobilization and ideology in political relationships and formal institutions in causes and processes of warfare, and examine scholarship on conflict mitigation strategies. This approach provides a basis for considering factors such as group identity, social structures, material resources, geography and geo-politics and other international factors that may play roles in civil wars. In addition to learning about current and recent trends in research, students will be encouraged to consider broader questions such as the relationship of violence to historical and contemporary processes of state-building, whether or not the underlying logic of warfare has changed in meaningful ways in recent decades, and to identify promising avenues fr future research.<br/><br/>This course is divided into four sections. <br/><br/>? The first section assumes no prior specialized knowledge of its subject and thus starts at the beginning. This section examines the magnitude of civil war occurrence and looks critically at how scholars collect and code data about civil wars. It considers the historical role of civil wars in state building in Europe and asks whether contemporary civil wars can play such a role. Have wars changed in terms of internal dynamics and impacts, or just differing in degrees from wars past?<br/>? Section II focuses on individual and group-level explanations of causes of civil wars. Do greedy individuals cause civil wars? What is the relationship between organized crime and civil war violence? What role does ethnic identity play in these conflicts? How do natural resource endowments shape how and whether people fight? Is there a place for ideology and grievances in a field of study that focuses on materialist rational choice perspectives? What role does violence play in civil wars? Should violence be studied as an outcome or is it endogenous to a process of shaping the strategies of combatants? <br/>? Section III looks at elite politics and the state in various causal explanations of civil wars and the behavior of actors. How do the defensive or ambitious strategies of elite groups influence these wars? Are contemporary studies of elite strategy smuggling in class analysis? What is the relationship of politics of elite survival and some of the micro-politics that we will study later? <br/><br/>This course is not about international law or global norms and warfare, though these issues are present in many readings. It is not about conflict management and post-conflict reconstruction, although those with such interests will find much of value in the material here. This is not a course about counterinsurgency, although course content can be used to address this issue.", "name": "Special Topics in Political Science", "section": "21", "topic": "Politics of Civil Wars", "course": "490-0", "meeting_time": ["Tu 2:00PM - 4:50PM"], "path": "/class-descriptions/4640/WCAS/POLI_SCI/490-0/17603", "instructor": ["William S Reno"], "id": "17603", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "POLI SCI 490-0-22/SOC 404-0-20, Research design for causal inference, Fall 2016, Prof. Robert Braun<br/><br/>This seminar is intended to help students become better consumers and producers of quantitative, qualitative and mixed methods causal inference. Whereas the former will make you a better colleague to fellow social scientists, the latter improves your job prospects (and get you colleagues to begin with). Based on the potential outcomes framework, this class will introduce students to qualitative and quantitative techniques<br/>that enable researchers to isolate causal effects. It will force students to move beyond &quot;naive&quot; regression and case study designs and explore how &quot;less naïve&quot; combinations of both methods can strengthen our confidence in causal claims. It does this by emphasizing the importance of research design and making explicit the assumptions underlying causal arguments.", "name": "Special Topics in Political Science", "section": "22", "topic": "Research Design for Causal Inference", "course": "490-0", "meeting_time": ["Fr 11:00AM - 1:50PM"], "path": "/class-descriptions/4640/WCAS/POLI_SCI/490-0/17619", "instructor": ["Robert   Braun"], "id": "17619", "subject": "POLI_SCI"}]