[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "University Library 3370"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Spring 2016", "name": "33347", "title": "WCAS HISTORY 103-6-20 First-Year Seminar-Non-Western History", "class_attributes": "WCAS First-Year Seminar<br/><br/>Attendance at 1st class mandatory<br/><br/>Freshmen/Sophomores Only<br/><br/>", "section": "33347", "instructors": [{"instructor_phone": "", "instructor_name": "Sean Allen Hanretta", "instructor_addr": "Harris Hall 310"}], "topic": "African History through Literature and Film", "course": "103-6", "descriptions": [{"name": "Overview of class", "value": "Uses literary and cinematic works as a window into the history of sub-Saharan Africa. Explores the difficulty of using artistic works as historical sources, and the value of art as both a representation of the past and an artifact of the past. The politics of storytelling and art, and the relationship between cultural and social change. Topics include the impacts of colonialism and globalization, Apartheid South Africa, civil wars, urban culture, and corruption. Students will make short blog posts each week to help seed our discussions and will work on oral presentations. In addition, students will complete a final creative project and will have an opportunity for very brief research into films or novels of their choosing."}, {"name": "Teaching Method", "value": "First-Year Seminar"}, {"name": "Evaluation Method", "value": "Blog posts, an oral presentation, participation in discussion and a final creative project."}, {"name": "Class Materials (Required)", "value": "TENTATIVE READING LIST: <br/>John Parker and Richard Rathbone, African History: A Very Short Introduction 978-0192802484<br/>Zakes Mda, The Heart of Redness 978-0312421748 <br/>Chinua Achebe, Things Fall Apart 978-0385474542 <br/>Amadou Hampâté Bâ, The Fortunes of Wangrin (may replace with something else) Chimamanda Ngozi Adichie, Half of a Yellow Sun 978-1400095209 <br/>Boris Diop, Murambi: The Book of Bones 978-0253218520"}, {"name": "Class Notes", "value": "HISTORY AREA OF CONCENTRATION: Africa/Middle East"}], "lmod": "4/3/16 8:03 PM (CT)", "subject": "HISTORY"}]