[{"class_mtg_info": [{"meet_t": "MoWeFr 9:30AM - 10:50AM", "meet_l": "Harris Hall L07"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "35333", "title": "WCAS ECON 350-0-20 Monopoly Competition &amp; Public Policy", "class_attributes": "", "section": "35333", "instructors": [{"instructor_phone": "847/491-8220", "instructor_name": "James Andrew Hornsten", "instructor_addr": "Andersen Hall"}], "topic": "", "course": "350-0", "descriptions": [{"name": "Overview of class", "value": "This course focuses on a particular market failure - monopoly - in the context of antitrust law, public utility regulation, and intellectual property. First, profit-seeking firms may try to reduce competition through price discrimination, resale price maintenance, entry deterrence, predation, horizontal mergers, vertical integration, or cartelization. We will use economic theory and landmark legal cases to study the purpose and development of antitrust law, which is meant to reduce the adverse effects of anti-competitive business practices. Next, large fixed costs of building and maintaining a physical network generate natural monopolies for products such as electric power, cable television, natural gas, and water. We will explore the challenges regulators face when they attempt to apply market controls, e.g., by capping prices so that an essential service remains affordable. We will also ponder the proper role of government in today's digital economy, which features a number of winner-take-all markets, in which bandwagon effects result in convergence to a single operating system, recording technology, or social network. Finally, society might be willing to trade short-term welfare loss for long-term gains by granting temporary monopolies (e.g., patents or copyrights) to provide an incentive to innovate. We will analyze the ideal scope of an artificial monopoly and the natural tension between intellectual property and antitrust law."}, {"name": "Registration Requirements", "value": "ECON 281, 310-1 and 310-2 are required"}, {"name": "Teaching Method", "value": "Two 80-minute meetings per week, which will feature lectures, problem solving, and discussions of how to reconcile our models with current events (e.g., antitrust concerns over monopsonistic behavior). There will also be an enrollment-contingent discussion session, during which the teaching assistant will present some original material, work through practice exercises, and discuss the recent problem set or exam."}, {"name": "Evaluation Method", "value": "Regular problem sets (10% collectively), two midterm exams (20% each), a final exam (30%) and an antitrust project completed by a small team of students (20%)."}, {"name": "Class Materials (Required)", "value": "In lieu of a single required text, we will use a variety of readings (e.g., textbook chapters, economic journal articles, recent articles from the business press, and old teaching materials) that will be posted on Canvas in PDF format."}, {"name": "Class Materials (Suggested)", "value": "Viscusi, Vernon, and Harrington, Jr.'s Economics of Regulation and Antitrust, 4th edition, ISBN 978-0262220750 (MIT Press, 2005). <br/>Kwoka and White's The Antitrust Revolution, 6th edition, ISBN 978-0199315499 (Oxford, 2013)."}], "lmod": "2/6/17 8:40 AM (CT)", "subject": "ECON"}]