[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "University Hall 102"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "32490", "title": "WCAS ASIAN_AM 376-0-1 Advanced Topics in Literary and Cultural Studies", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "32490", "instructors": [{"instructor_phone": "847/497-7114", "instructor_name": "Umayyah Eleanor Cable", "instructor_addr": "Crowe Hall, Room 1121"}], "topic": "Arab American Arts and Cinema", "course": "376-0", "descriptions": [{"name": "Overview of class", "value": "This course focuses on Arab American film, visual art, literature, and performance as a way to examine various political, ideological, and social issues of concern to Arab American communities. At the heart of our inquiry will be an interrogation of the relationship between representation and power. We will begin with a brief overview of how Arab culture has been represented in the US and then move on to examine Arab American arts and cinema as forms of self-representation. Readings in postcolonial theory, women of color feminist theory, and queer of color critique will provide analytical lenses through which to explore the aesthetic and political aspects of Arab American arts and cinema. Note: the midterm assignment will be based on interdisciplinary research conducted at a local Arab American<br/>film festival."}, {"name": "Registration Requirements", "value": "None."}, {"name": "Learning Objectives", "value": "? Gain a general knowledge of the various forms of Arab American cultural productions, including: film, visual art, literature, and performance. ? Understand how the<br/>histories of colonialism, imperialism, war, forced migration, exile, and racial formation inform the cultural politics of Arab American art and cinema. ? Gain a<br/>general understanding of the relationship between representation and power. ? Gain knowledge of postcolonial, women of color feminist, and queer of color theories<br/>and critiques of representation."}, {"name": "Evaluation Method", "value": "Class participation: 20<br/>Paper, final: 30<br/>Paper, mid-term: 25<br/>Presentations: 10<br/>"}, {"name": "Class Materials (Required)", "value": "Attendance at a film festival screening is required as part of the midterm assignment. Anticipated cost is between $10 and $15. All course readings will be made available on Canvas."}, {"name": "Class Notes", "value": "Attendance at first class is mandatory."}], "lmod": "2/6/17 6:40 PM (CT)", "subject": "ASIAN_AM"}]