[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Parkes Hall 212"}], "school": "SoC", "overview_of_class": "This course will discuss the issues (problems, challenges, and opportunities) arising from the confluence of commerce, culture and politics under the current regime of globalization. While there is more to globalization than economics (integration of markets and finances) and technology (mobility and connectivity within the knowledge based and information driven wired/wireless world), one cannot proceed without attending to the techno-economic features of globalization. On the other hand, even though our world driven by technological innovations and economic imperatives is rapidly globalizing, the cross-border differencescultural, political and geographicalstill matter a great deal.  Paying attention to and leveraging those differences is critical for the success of any individual (or any group, corporation, or nation) now compelled to cooperate and compete on the global stage.  Towards that end, this course will explore some, but not all of following topics: diaspora, hybrid identities, time-space compression, stranger sociability; the repositioning (rather than the decline) of nation-state, the rise of the multinational corporations, the emergence of the NGOs (non-governmental organizations), the flat world vs. the slum world; global sources of ethnic and religious conflicts, global media, cultural imperialism, the anti-Americanism and global terrorism.", "qtr": "Winter 2016", "name": "Global Culture and Communication", "title": "SoC COMM_ST 392-0-20 Global Culture and Communication", "lmod": "1/9/16 6:38 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "847/491-5853", "instructor_name": "Dilip P Gaonkar", "instructor_addr": "ANNIE SWIFT, 1920 Campus Drive, 3rd Floor"}], "topic": "", "course": "392-0", "enrl_requirement": "Enrollment Requirements: Reserved for Sophomores, Juniors, and Seniors from every undergraduate school only.", "descriptions": [{"name": "Overview of class", "value": "This course will discuss the issues (problems, challenges, and opportunities) arising from the confluence of commerce, culture and politics under the current regime of globalization. While there is more to globalization than economics (integration of markets and finances) and technology (mobility and connectivity within the knowledge based and information driven wired/wireless world), one cannot proceed without attending to the techno-economic features of globalization. On the other hand, even though our world driven by technological innovations and economic imperatives is rapidly globalizing, the cross-border differencescultural, political and geographicalstill matter a great deal. Paying attention to and leveraging those differences is critical for the success of any individual (or any group, corporation, or nation) now compelled to cooperate and compete on the global stage. Towards that end, this course will explore some, but not all of following topics: diaspora, hybrid identities, time-space compression, stranger sociability; the repositioning (rather than the decline) of nation-state, the rise of the multinational corporations, the emergence of the NGOs (non-governmental organizations), the flat world vs. the slum world; global sources of ethnic and religious conflicts, global media, cultural imperialism, the anti-Americanism and global terrorism."}], "path": "/class-descriptions/4610/SoC/COMM_ST/392-0/26384", "instructor": ["Dilip P Gaonkar"], "class_attributes": "No Freshmen<br/><br/>", "id": "26384", "subject": "COMM_ST"}]