[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "University Hall 121"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "12345", "title": "WCAS HISTORY 333-0-1 The Age of the Renaissance", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "12345", "instructors": [{"instructor_phone": "847/491-3653", "instructor_name": "Edward Wallace   Muir Jr", "instructor_addr": "Harris Hall Room 244"}], "associated_classes": [{"component": "DIS", "room": "University Hall 112", "meeting_time": "Th 12:00PM - 12:50PM"}, {"component": "DIS", "room": "Kresge Centennial Hall 2-319", "meeting_time": "Th 2:00PM - 2:50PM"}, {"component": "DIS", "room": "University Library 3370", "meeting_time": "Th 4:00PM - 4:50PM"}], "topic": "", "course": "333-0", "descriptions": [{"name": "Overview of class", "value": "In 1348 perhaps a third to one half of all Europeans died from a mysterious illness called the Black Death, which was only one of a number of calamities that disrupted normal life. In the wake of these disasters thinkers, artists, and a surprising number of common people began to search for explanations for what had gone wrong by asking questions about their own personal identities, about the obligations of a moral life, about the virtues of civic service, and about the their personal relationship with God. This course explores that search, which is what we now call the Renaissance. It began among the independent city-states of Italy, particularly Florence and Venice, and spread from them to the rest of Europe. The course will compare developments in Italy with those in northern Europe, especially on the political and family structures of the city-states, the culture of the princely courts, the ambitions of the Roman popes, the social and intellectual basis for artistic creativity, the origins of modern political thought and the scientific method, and the constraints and opportunities available to women."}, {"name": "Registration Requirements", "value": "GRADING BASIS: Student option (P/N allowed)"}, {"name": "Teaching Method", "value": "TEACHING METHOD: Lecture and class discussion"}, {"name": "Evaluation Method", "value": "EVALUATION METHOD: Participation in class discussions, two short papers (ca. 5 pages), and a final paper (10-15 pages)"}, {"name": "Class Materials (Required)", "value": "***Tentative until order posted on Norris website<br/>Lauro Martines, Power and Imagination: City-States in Renaissance Italy, ISBN: 978-0801836435Giovanni Boccaccio, The Decameron, ISBN: 978-0451531735Benjamin G. Kohl &amp; Ronald G. Witt, eds., The Earthly Republic: Italian Humanists on Government and<br/>Society, ISBN: 978-0812277524 or 978-0812210972<br/>Steven Greenblatt, The Swerve: How the World Became Modern, ISBN: 978-0393343403Gene Brucker, Giovanni and Lusanna: Love and Marriage in Renaissance Florence, ISBN: 978-<br/>0520244955<br/>Niccolò Machiavelli, The Portable Machiavelli, ISBN: 978-0140150926Judith C. Brown, Immodest Acts: The Life of a Lesbian Nun in Renaissance Italy, ISBN: 978-0195042252The Essential Erasmus, ed. John P. Dolan, ISBN: 978-0452009141"}], "lmod": "10/30/16 7:06 PM (CT)", "subject": "HISTORY"}]