[{"class_mtg_info": [{"meet_t": "Tu 2:00PM - 4:50PM", "meet_l": "Scott Hall 319 ExperimentalLab"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "12802", "title": "WCAS POLI_SCI 410-0-20 American Political Institutions and Behavior", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "12802", "instructors": [{"instructor_phone": "", "instructor_name": "James N Druckman", "instructor_addr": ""}], "topic": "", "course": "410-0", "descriptions": [{"name": "Overview of class", "value": "This course provides an introduction to the evolution and current state of the academic literature on American Politics, although there is a clear focus on classic historic readings. Moreover, the course emphasizes breadth over depth (although time constraints prevent us from examining all areas of American politics). The first part of the course focuses on political behavior, while the second part emphasizes political institutions."}, {"name": "Registration Requirements", "value": "PhD student<br/>Attendance at first class requierd"}, {"name": "Teaching Method", "value": "Lecture and Discussion"}, {"name": "Evaluation Method", "value": "Papers and exam"}, {"name": "Class Materials (Required)", "value": "In addition to many articles, these books:<br/>(PLEASE GET PAPERBACK WHENEVER POSSIBLE)<br/><br/>William, R. Shadish, Thomas D. Cook, and Donald T. Campbell. Experimental and Quasi-Experimental Designs for Generalized Causal Inferences (2002)<br/>ISBN: 0395615569<br/><br/>Larry M. Bartels, Unequal Democracy (2008) Princeton Press ISBN: 0-691-14623-2<br/><br/>Dara Z. Strolovitch, Affirmative Advocacy (2007), U. of Chicago Press ISBN: 0-226-77741-3<br/><br/>David R. Mayhew, Congress: The Electoral Connection (1974)<br/>ISBN: 0-300-01809-6<br/><br/>Daniel Galvin, Presidential Party Building (2010) ISBN: 0-691-13693-6<br/><br/>Madison, James, Alexander Hamilton, and John Jay. 1987. The Federalist Papers. New York: Penguin Books. ISBN: 0-14-044495-5<br/><br/>Schattschneider, E.E. 1960. The Semisovereign People. Hinsdale, IL: The Dryden Press. ISBN: 0-03-013366-1<br/><br/>De Tocqueville Alexis. 1969. (Translated by George Lawrence, edited by J.P. Mayer). Democracy in America. ISBN: 0-06-091522-6<br/><br/>Rosenstone, Steven J., and John Mark Hansen. 1993. Mobilization, Participation, and Democracy in America. New York: MacMillan Publishing Company. ISBN: 0-02-403660-9<br/><br/>Campbell, Angus, Philip E. Converse, Warren E. Miller, and Donald E. Stokes. 1960. The American Voter. Chicago: University of Chicago Press. ISBN: 0-226-09254-2<br/><br/>Iyengar, Shanto, and Donald Kinder. 1987. News That Matters. Chicago: University of Chicago Press. ISBN: 0-22638857-3<br/><br/>Downs, Anthony. 1957. An Economic Theory of Democracy. New York: Harper Collins. ISBN: 0-06-041750-1<br/><br/>Aldrich, John. 1995. Why Parties? The Origin and Transformation of Party Politics in America. Chicago: University of Chicago Press. ISBN: 0-226-01272-7<br/><br/>Olson, Mancur. 1965. The Logic of Collective Action. Cambridge: Harvard University Press. ISBN: 0-674-53751-3<br/><br/>Kernell, Samuel. 2006. Going Public: New Strategies of Presidential Leadership, 4th<br/>ed. Washington DC: CQ Press. ISBN: 1-56802-218-2<br/><br/>McCloskey, Robert G. 1994. The American Supreme Court. 2nd Edition. Chicago: <br/>University of Chicago Press. ISBN: 0-226-55678-6<br/><br/>Green, Donald, Bradley Palmquist, and Eric Schickler. 2002. Partisan Harts &amp; Minds. New Haven: Yale University Press. ISBN: 0-300-09215-6.<br/><br/>Richard F. Fenno, Jr. Home Style: House Members in Their Districts (1978), <br/>2002 edition from the Longman classics series # ISBN-10: 032112183X<br/># ISBN-13: 978-0321121837. <br/><br/>Bernard R. Berelson, Paul F. Lazarsfeld, and William N. McPhee, Voting (1954), <br/># Publisher: University Of Chicago Press (June 15, 1986) # ISBN-10: 0226043509<br/># ISBN-13: 978-0226043500"}], "lmod": "10/30/16 7:09 PM (CT)", "subject": "POLI_SCI"}]