[{"class_mtg_info": [{"meet_t": "Tu 9:30AM - 10:50AM", "meet_l": "Annie May Swift Hall 109"}, {"meet_t": "Th 9:30AM - 11:50AM", "meet_l": "Annie May Swift Hall 109"}], "school": "SoC", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Fall 2016", "name": "14244", "title": "SoC RTVF 202-0-20 First-Year Topics Seminar", "class_attributes": "SOC First-Year Seminar<br/><br/>Freshmen Only<br/><br/>", "section": "14244", "instructors": [{"instructor_phone": "", "instructor_name": "Roberta M Stack", "instructor_addr": ""}], "topic": "Media in the Movies", "course": "202-0", "descriptions": [{"name": "Overview of class", "value": "Fall 2016<br/>RTVF 202-0 Sec. 20 Freshman Topics Seminar: Media in the Movies<br/>T 9:30-10:50, Th 9:30-11:50<br/><br/>Overview: In this course we will view, discuss, and write about films that take a look at other media - at &quot;Stop the presses!&quot; newspaper reporting, authoritative industry magazines, and investigative journalism; at radio news broadcasts, call-in talk shows, and music programs as reflection of an era; at television as a source/maker of news, as an agent of political/social change, and as entertainment; and at dissemination of information via the internet. We will consider the tension revealed in films which present varying perspectives on print, broadcast, and internet media operations. Are the media operating for the common good or ill, to reveal or to hide corruption in business and government, and/or to raise the level of public discourse or pander to the uninformed masses? Especially in this election year, what sources of news do you trust to give you accurate information, and which are manipulating facts to further an agenda or merely to entertain? We will use these films to generate lively class discussions and rich paper topics. <br/><br/>Registration requirements: First years only, priority to RTVF majors<br/><br/>Learning objectives: Acquiring/fine tuning skills in writing college-level analytical and research papers while exploring topics relevant to both historic and current media culture.<br/><br/>Evaluation method: Class participation, in-class writing exercises, 3 papers of varying lengths (done in drafts, one-on-one paper conferences, and revised). No final exam.<br/><br/>Required text: Hacker, Diana, and Nancy Sommers. A Pocket Style Manual, Seventh Edition. New York: Bedford/St. Martin's Press, 2015. ISBN: 978-1-4576-4232-6<br/><br/>Class notes: Most films will be shown in class and several will be viewed streaming from the course's CANVAS site. All films will be available for reviewing online via CANVAS."}], "lmod": "10/30/16 6:50 PM (CT)", "subject": "RTVF"}]