[{"school": "WCAS", "overview_of_class": "Material inequality is central to many contemporary global conflicts, injustices, and political dynamics. The differential distribution of resources, wealth, and access to finance has roots in colonial history and is maintained by a set of powerful governing institutions, ideas, and practices. Extremes disparities in wealth in poverty in the global South and North are at the root of differences in health outcomes, educational opportunity, land ownership, patterns of migration, employment prospects and protections, and environmental impact. Why is our world so unequal? What are the effects of inequality on lived experience, culture, the social and physical environment, and conflict? Is it ethical to live a world with a high degree of material inequality? What can be done to mitigate inequality?", "name": "Integrating Project Seminar", "section": "20", "topic": "Global Inequality", "course": "395-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4640/WCAS/INTL_ST/395-0/13140", "instructor": ["Erin Kay Lockwood"], "id": "13140", "subject": "INTL_ST"}, {"school": "WCAS", "overview_of_class": "In a world of rapidly changing technologies, consumers and their commodities are now central to economic growth in most parts of the world. Consumer spending remains resilient, accounting for the bulk of economic activity in the world's largest economies. Where do the resources come from to sustain such growth? And for whom? What are the conditions that facilitated this current social, political economic climate?<br/>This course will explore different approaches to the study of consumption and the processes that entangle people and objects together on a global scale.<br/>Throughout the course we will examine how consumption practices shape the modern world by emphasizing its impact on individual behaviors, the environment, the economy and public policy. This class will address a wide variety of processes involved in the creation, exchange and consumption of commodities in a global historical context. Special attention will be paid to labor and social identities that are intricately tied to consumer practices and material objects.", "name": "Integrating Project Seminar", "section": "21", "topic": "Consumption &amp; Commodities in a Global Perspective", "course": "395-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4640/WCAS/INTL_ST/395-0/13141", "instructor": ["Khadene Kharla-Ann   Harris"], "id": "13141", "subject": "INTL_ST"}]