[{"school": "WCAS", "overview_of_class": "Students will learn about psychosis, survey popular research approaches, and design research proposals for hypothetical projects. In this class we will learn about major areas of cognitive, emotive, and behavioral dysfunction in schizophrenia as well as related psychotic disorders. We will also survey the most recent developments in the field of intervention, as well as biomarker development in high-risk and premorbid periods. The course will focus heavily on learning about relevant research methodology including eye tracking, motor assessment, psychophysiology, cognitive assessment, and neuroimaging (other modalities will be examined as time permits). This will involve reading about the methodologies and joining the class on a series of field trips to Northwestern Labs (Evanston and Downtown) that are currently employing these approaches.", "name": "Advanced Seminar in Personality, Clinical, or Social Psychology", "section": "20", "location": "Swift Hall 231", "topic": "Research Topics in Schizophrenia", "course": "357-0", "meeting_time": ["Th 9:30AM - 12:20PM"], "path": "/class-descriptions/4640/WCAS/PSYCH/357-0/10215", "instructor": ["Vijay Anand Mittal"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "id": "10215", "subject": "PSYCH"}, {"school": "WCAS", "overview_of_class": "If people did not possess some basic concern for the welfare of others, it would not be possible to develop or sustain the complex societies in which we currently live. However, within these societies, individuals, groups, and corporations often encounter a wide variety of opportunities and temptations to pursue their own personal goals, aspirations and achievements at the expense of the larger social good. What then determines when people will resist versus give into these temptations? Where do people's concerns for others come from in the first place, and what types of experiences nurture versus suppress these concerns? In this course we will explore these questions by reviewing the decades of research on prosocial behavior performed by economists, evolutionary biologists, and social psychologists. Through the reading of primary-source articles, class discussions, and hands-on class exercises and demonstrations we will uncover the fundamental psychological mechanisms responsible for behaviors such as fairness, trust, reciprocity, cooperation, helping, and altruism. Evaluations will be based on preparation of discussion questions, class participation and several written assignments.", "name": "Advanced Seminar in Personality, Clinical, or Social Psychology", "section": "21", "location": "Annenberg Hall G32", "topic": "Cooperation, Helping, and Prosocial Behavior", "course": "357-0", "meeting_time": ["MoWe 9:30AM - 10:50AM"], "path": "/class-descriptions/4640/WCAS/PSYCH/357-0/10216", "instructor": ["Daniel C Molden"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>Prerequisites apply, see description<br/><br/>", "id": "10216", "subject": "PSYCH"}]