[{"class_mtg_info": [{"meet_t": "MoWeFr 9:00AM - 9:50AM", "meet_l": "Norris Center Big Ten Room 104"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "33381", "title": "WCAS HISTORY 345-3-20 History of Russia, 1917-Present", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "33381", "instructors": [{"instructor_phone": "847/491-7172", "instructor_name": "John Starkes   Bushnell", "instructor_addr": "Harris Hall Room 204"}], "topic": "Soviet Union &amp; Successor State", "course": "345-3", "descriptions": [{"name": "Overview of class", "value": "This course covers the complete history of the Soviet Union: from its emergence from the Russian Revolution of 1917 as a radical power that seemed determined to spread revolution to the rest of the world, through hyper-industrialization and hyper-terror under Stalin, its almost single-handed victory over Nazi Germany in WWII, abrupt de-Stalinization under Khrushchev in the 1950s, the sharp deterioration of the Soviet system's vitality under Brezhnev in the 1970s, and finally its collapse under Gorbachev (1985-1991). Every one of these apparently abrupt shifts in direction took observers and scholars by surprise. The goal of the course is not to explain definitively the peculiar life course of the Soviet Union, but to figure out what exactly has to be explained, and what sorts of explanations might work."}, {"name": "Teaching Method", "value": "Discussion. The course will be taught as a seminar, with students discussing primary sources and other readings at all but one or two class meetings."}, {"name": "Evaluation Method", "value": "Discussion and take-home essays. A paper may be substituted for one of the essays."}, {"name": "Class Materials (Suggested)", "value": "READING LIST: Articles and speeches by Lenin, Stalin, Trotsky, Bukharin, Khrushchev, Gorbachev; chunks of memoirs by Khrushchev, Gorbachev, John Scott (an American who worked in an industrializing city in the 1930s) and others; and some fiction."}, {"name": "Class Notes", "value": "No P/N option.<br/><br/>HISTORY AREA OF CONCENTRATION: European"}], "lmod": "4/3/16 8:03 PM (CT)", "subject": "HISTORY"}]