[{"school": "JOUR", "overview_of_class": "Shopper Marketing is the fastest evolving segment of consumer marketing. The changing retail landscape has driven an increased emphasis on the point-of-decision and on all the relevant marketing touch-points that surround it. This, combined with the rapid growth of ecommerce, the ubiquity of digital shopper tactics, the use of retail-generated data and the increased measurability of a wide range of near-purchase promotional techniques, has driven the growing importance that both manufacturers and retailers are placing on Shopper Marketing expertise.<br/><br/>Shopper Marketing is brand marketing in a retail environment. It is driven by compelling insights about shoppers for specific categories in specific retail channels. Its tools consist of digital, social, packaging, promotion and advertising - brought together in retailer-specific programs designed to fit the mutual interests of brands and the channels through which they market. Managed by seasoned professionals with sales, marketing and planning backgrounds, Shopper Marketing is one of the fastest growing marketing disciplines at companies such as Procter & Gamble, Kraft, Unilever and scores of others.<br/><br/>The class lectures and textbook discussions will be augmented by insights from selected guest speakers currently active on the front lines of Shopper Marketing. They will who provide \"real-time\" examples of best practices across all Shopper Marketing disciplines (planning, promotion, digital, analytics). Additionally, you will make weekly use of the assets of the Path To Purchase Institute, the leader in documenting, informing and promoting the practice of Shopper Marketing.<br/><br/>You will then be given the chance to put these best practices to immediate use via a Shopper Marketing campaign project for a \"real world\" client.", "name": "Special Topics", "section": "20", "location": "No Room Needed", "topic": "Shopper Marketing", "course": "490-6", "meeting_time": ["TBA"], "path": "/class-descriptions/4640/JOUR/IMC/490-6/17560", "instructor": ["Timothy M Dorgan"], "class_attributes": "", "id": "17560", "subject": "IMC"}]