[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "University Hall 102"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "34047", "title": "WCAS LEGAL_ST 276-0-20 Introductory Topics in Legal Studies", "class_attributes": "", "section": "34047", "instructors": [{"instructor_phone": "847/467-6850", "instructor_name": "Shana B Bernstein", "instructor_addr": "620 Lincoln #205"}], "topic": "Japanese American 'Internment'", "course": "276-0", "descriptions": [{"name": "Overview of class", "value": "Legal_St 276-0-20 &quot;Japanese American 'Internment'&quot; (also ASIAN_AM 220-3), Shana Bernstein (Spring 2017)<br/><br/>Twice since 9/11 politicians have referred to the World War II imprisonment of Japanese Americans as a possible precedent for policies toward Muslims. Yet many Americans remain ignorant about this important and understudied episode in U.S. history. This seminar-style course examines events leading up to the mass imprisonment of a group of people based on race, the role played by wartime emergency language, the experiences of Japanese Americans, and the consequences of this wartime policy. It focuses on the intersections between race, gender, nation, and law. Readings include secondary and primary sources, including related court cases, executive orders, documentary films, memoirs, and fiction. Note this is a discussion-based class.<br/>Students will be expected to read and participate daily, as well as write three papers throughout the quarter (two approx. 3-5 pages, one 8-10 pages)."}, {"name": "Learning Objectives", "value": "1. Analyze the imprisonment from multiple perspectives, experiences, and primary sources (e.g. including traditional texts, documentary films, memoir, government documents, photographs, art, and other primary sources, as well as fiction). <br/>2. Identify and explain events leading up to the mass imprisonment of a group of people based on race, the role played by wartime emergency language, the experiences of Japanese Americans, and the consequences of this wartime policy. <br/>3. Explore and analyze intersections among race, gender, nation, and the law, both in the context of the treatment of Japanese Americans during World War II as well as in a larger historical context.<br/>4. Understand the role of law in justifying the imprisonment, and in its aftermath.<br/>5. Foster analytical, reading, discussion, and writing skills. <br/>6. Learn to analyze the past using both primary and secondary sources."}, {"name": "Teaching Method", "value": "Seminar/Discussion"}, {"name": "Evaluation Method", "value": "Papers worth 70% of the course grade (20%, 20%, 30%) Discussion worth 30% of the course grade"}, {"name": "Class Materials (Required)", "value": "? Yoshiko Uchida, University of Washington Press, Desert Exile: The Uprooting of a Japanese American Family, 2015, ISBN 9780295994758, paperback<br/>? Mine Okubo, University of Washington Press, Citizen 13660, 2014, ISBN 9780295993546, paperback<br/>? Course Packet (will be available at Quartet)"}], "lmod": "2/8/17 6:44 PM (CT)", "subject": "LEGAL_ST"}]