[{"class_mtg_info": [{"meet_t": "Th 2:00PM - 4:50PM", "meet_l": "Kresge 4354 Art Hist. Sem. Rm."}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Fall 2016", "name": "10572", "title": "WCAS ART_HIST 440-0-1 Studies in Baroque Art", "class_attributes": "", "section": "10572", "instructors": [{"instructor_phone": "", "instructor_name": "Jesus R Escobar", "instructor_addr": ""}], "topic": "", "course": "440-0", "descriptions": [{"name": "Overview of class", "value": "Based from their capital in Madrid, the Spanish Habsburgs ruled over a composite monarchy linked by a network of cities, from Seville to Brussels and from Naples to Mexico City. This seminar explores how ideas about architecture and urbanism took shape across this widespread realm and were used to forge consensus around the monarchy as the guarantor of religious stability and good government. Beginning with the seminal text of Henri Lefebvre, The Production of Space (1974/1991) and an introduction to the expansive geography of the early modern Spanish Habsburg realm, the seminar will consider urban, sacred, and court space employing case studies of key monuments and sites in Iberia as well as southern Italy, the Low Countries, and the Americas. Participants will undertake research on individual monuments or public spaces to be assigned at the outset of the quarter. A reading knowledge of Spanish or Portuguese would be beneficial but is not required for this seminar. Students are expected to read Lefebvre in advance of the first seminar meeting."}, {"name": "Evaluation Method", "value": "Active participation is required and will be taken into account. Assessment will also include the evaluation of an oral presentation and written research paper."}, {"name": "Class Materials (Required)", "value": "Henri Lefebvre, The Production of Space. Trans. Donald Nicholson-Smith (Oxford, 1991).<br/>Thomas DaCosta Kaufmann. Toward a Geography of Art (Chicago, 2004)."}], "lmod": "10/30/16 6:58 PM (CT)", "subject": "ART_HIST"}]