[{"class_mtg_info": [{"meet_t": "Mo 10:00AM - 12:50PM", "meet_l": "Sound Tank Comp Lab - RTVF FSL"}], "school": "SoC", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Winter 2017", "name": "27484", "title": "SoC SAI 401-0-20 Topics in Sound Production", "class_attributes": "Prerequisites apply, see description<br/><br/>", "section": "27484", "instructors": [{"instructor_phone": "", "instructor_name": "Stephan Michael Moore", "instructor_addr": ""}], "topic": "Advanced Sound Production", "course": "401-0", "descriptions": [{"name": "Overview of class", "value": "This course introduces advanced topics in audio production, building on the foundation of SAI 501. We will continue to expand our understanding and repertoire of audio processing techniques, using the software package Max to focus on both the generation of new sounds and the extraction of information from streams of audio in order to create more complex systems of dynamic audio control and generation. Emphasis will be placed on the practical aspects of each technique, highlighting the ways it can be deployed in creative media production."}, {"name": "Learning Objectives", "value": "<ul><br/><li>to gain an appreciation for the technical details of major techniques in audio synthesis, analysis, and processing techniques, connecting the history of their development and use with the ongoing evolution of musical sound and technology.</li><br/><li>to implement these techniques in the Max environment, while introducing the programming of generative and algorithmic audio functions.</li><br/><li>to plan, develop and execute projects that make imaginative use of these tools and techniques.</li><br/></ul>"}, {"name": "Evaluation Method", "value": "3-4 incremental assignments, mid-term project, final project, attendance and participation."}, {"name": "Class Materials (Required)", "value": "USB drive (or other means of storing and transporting data) and any needed studio deposits."}, {"name": "Class Notes", "value": "Prerequisites: This class is exclusively for students enrolled in the Sound Arts and Industries MA program, unless instructor permission is granted."}], "lmod": "12/29/16 6:47 PM (CT)", "subject": "SAI"}]