[{"class_mtg_info": [{"meet_t": "TuTh 5:00PM - 5:50PM", "meet_l": "University Hall 122"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "31162", "title": "WCAS GERMAN 346-0-20 Topics in German Literature and Culture", "class_attributes": "", "section": "31162", "instructors": [{"instructor_phone": "847/467-2966", "instructor_name": "Peter D Fenves", "instructor_addr": "1800 Sherman, Suite 106"}, {"instructor_phone": "847/491-7249", "instructor_name": "Johanngeorg   Rheinberger", "instructor_addr": "1800 Sherman, Suite 106"}], "associated_classes": [{"component": "DIS", "room": "Locy Hall 109", "meeting_time": "Fr 3:00PM - 3:50PM"}, {"component": "DIS", "room": "Annenberg Hall G28", "meeting_time": "Fr 3:00PM - 3:50PM"}], "topic": "", "course": "346-0", "descriptions": [{"name": "Overview of class", "value": "On Historical Epistemology<br/> If the nineteenth century witnessed the rise of positivism, the twentieth century started with a crisis of positivistic thought without a clear response, or even alternative, to the nineteenth-century legacy. It was only slowly, over the course of a century, that a philosophy of science evolved in which epistemology, having been historicized in some manner, began to re-connect the separated contexts of justification and discovery. The organizing thread for this class will be the contribution that different streams of twentieth-century philosophy of science made to this overall process. The class proceeds from the assumption that historicizing epistemology captures the essence of what the past century has added to the philosophy of science. <br/>The class will discuss an array of French-, German-, and English-speaking traditions in which historical thinking is brought into philosophy of science. Readings will include Gaston Bachelard, Georges Canguilhem, Michel Foucault and Jacques Derrida (his reading of Husserl) on the French-speaking part; Ernst Cassirer, Edmund Husserl (especially his late &quot;Crisis&quot; work), and Martin Heidegger on the German-speaking part; and the work of the Polish immunologist and philosopher Ludwik Fleck, Thomas Kuhn, Stephen Toulmin, and Ian Hacking on the English-speaking part. Recent developments in history and philosophy of science will also come under discussion throughout the class."}, {"name": "Teaching Method", "value": "DiscussionLecture"}, {"name": "Class Materials (Required)", "value": "Distributed through Canvas"}], "lmod": "4/3/16 8:02 PM (CT)", "subject": "GERMAN"}]