[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "Fisk Hall 114"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24899", "title": "WCAS STAT 465-0-20 Statistical Methods for Bioinformatics and Computational Biology", "class_attributes": "", "section": "24899", "instructors": [{"instructor_phone": "847.467.6896", "instructor_name": "Jiping   Wang", "instructor_addr": "Department of Statistics, Room 101B, 2006 Sheridan Road, Evanston"}], "topic": "", "course": "465-0", "descriptions": [{"name": "Overview of class", "value": "The goal of this course is to provide an introduction of statistical methodologies in important topices in bioinformatics and computational biology. The course covers statstical methodologies used in two major topics including gene expression data analysis and high-throughput DNA sequence analysis. Statistical theory or methods to be introduced in this course include Z-test, t-test, regression, ANOVA, multivariate data analysis, Bayesian statistics, bootstrap, Monte-Carlo simulation, clustering algorithms, Markov Chain, Hidden Markov Chain, mixture model, etc. Students will learn basic knowledges and programming skills to perform most common bioinformatic analyses of data generated from current molecular biology research.<br/><br/>Students from different majors may benefit differently from this interdisciplinary course. The lectures will cover both priciples of genomics and simple R codes writing to realize the statistical analyses. Therefore students with no background in biology or programming should NOT be intimidated, but must be motivated to learn. In particular, students who are interested in bioinformatic research, gene expression analysis and high throughput sequence data analysis are highly encouraged."}, {"name": "Registration Requirements", "value": "Graduate students from all majors can enroll into this class without permission number. Undergraduate students must get permission number from the instructor to register for this class."}, {"name": "Learning Objectives", "value": "Students are expected to be able to write codes to realized most common statistical analyses in gene expression and DNA sequence analysis."}, {"name": "Teaching Method", "value": "Lecture"}, {"name": "Evaluation Method", "value": "Homework and term project"}, {"name": "Class Materials (Required)", "value": "No textbooks are required. All lectures will be based on published papers and the lecture notes prepared by the instructor."}], "lmod": "12/25/16 7:08 PM (CT)", "subject": "STAT"}]