[{"school": "JOUR", "overview_of_class": "Politics in America is many things - a contest, a drama, a potent and perilous and always imperfect exercise. Just as politics represents the inner workings of democracy, the best political reporting exposes and explains those workings and, on a good day, rescues the republic from folly. Heading toward November 2016 and the election of the next commander in chief, the stakes could hardly be higher. Essential domestic and national security policies are on the table, from Obamacare, guns and voting rights to Middle Eastern conflict, terrorism and the nuclear treaty with Iran. This seminar will draw on Campaign 2016 in real time to explore the connections between the machinery of politics, a polarized electorate and a fast-changing media landscape. Students can choose their own focus at various points in the course, including foreign, domestic, national security, campaign personality, media roles, public opinion, voting rights and electioneering. To make sense of the rolling carnival of fact, fiction and shifting narrative, the class will study film documentaries and candidate profiles; campaign speeches and opinion polls; Web advertising and political commentary from all sides. An essential part of our effort will be focused on understanding not just how journalists see the political world, but how campaign operatives see and use the media. Campaigns race to establish narratives, mindful that various voices in the media will reinforce or challenge those narratives during a hard-fought race. Candidates and political strategists are constantly seeking advantage, using every tool they can muster; that's their job. Journalists must be professionally skeptical, rigorous, smart and fair; that's their job. The audience? Voters. The stakes? The direction of the country. The course encompasses an array of media platforms, aiming to pierce the spin and identify what is true and meaningful, and to whom.", "name": "Special Topics", "section": "20", "topic": "Politics, Partisanship and Foreign Policy in the 2", "course": "490-0", "meeting_time": ["Mo 6:00PM - 8:50PM"], "path": "/class-descriptions/4640/JOUR/JOUR/490-0/11886", "instructor": ["Peter D Slevin"], "id": "11886", "subject": "JOUR"}, {"school": "JOUR", "overview_of_class": "This course will give students without a software development background a hands-on immersion in the toolsets, processes, and programming languages used in the development of web properties.<br/>The goal of the class is to prepare non-developers to work successfully with developers - to learn what they need to know to collaborate with technologists on a day-to-day basis. Working in small teams in an agile software development environment, students will work with version control tools, collaborative programming, front-end web development languages (HTML, CSS, Javascript), and frameworks including SASS, JQuery, React, Ember and Angular. <br/> <br/>Instructor: David Nguyen (chief technology officer, Shmoop.com - https://www.linkedin.com/in/davidthainguyen)<br/>· SCHEDULE: Tuesdays 7-10pm", "name": "Special Topics", "section": "21", "topic": "Mobile Web Development for Media", "course": "490-0", "meeting_time": ["We 6:30PM - 9:30PM"], "path": "/class-descriptions/4640/JOUR/JOUR/490-0/11887", "instructor": ["David Thai Nguyen"], "id": "11887", "subject": "JOUR"}, {"school": "JOUR", "overview_of_class": "This course focuses on imparting methods, theory, and practical experience in the field of design research in order to help define innovative products, services, and businesses in media and journalism. Students will be exposed to interviewing and observational techniques from anthropology, psychology, and sociology; interpretive techniques from literature, psychology, and business strategy; and creative methods and prototyping techniques from engineering, design, marketing, and advertising. By the end of this course, students will have a firm grounding in how to study a small number of people, uncover patterns in their thinking and behavior that point to design opportunities for news media products and services, and understand how to quickly test and improve ideas that solve for these opportunities. This course has roots in, and a similar arc to, fundamental design research courses taught in major design programs, inside major corporations, by influential consultancies, and in the most prominent startup accelerator, Matter Ventures. <br/> <br/>Instructors: Pete Mortensen (associate at Matter Ventures - https://www.linkedin.com/in/morepete) &amp; Hema Padhu (startup marketing consultant - https://www.linkedin.com/in/hemapadhu) <br/>· SCHEDULE: Mondays 6-9pm (tentative - may change)", "name": "Special Topics", "section": "22", "topic": "Design Thinking and Research for Media Products", "course": "490-0", "meeting_time": ["Mo 6:00PM - 9:00PM"], "path": "/class-descriptions/4640/JOUR/JOUR/490-0/11888", "instructor": ["Peter W Mortensen", "Hemalatha   Padmanabhan"], "id": "11888", "subject": "JOUR"}, {"school": "JOUR", "overview_of_class": "Students will work two days a week at a Bay Area media or technology company, working in a professional environment to apply their developing skills in areas such as research, writing, marketing and content strategy. The goal is for students to get the kinds of hands-on experience that help them develop new skills, do deep research, build confidence in their capabilities and learn how innovative companies and products become successful. Our goal will be to match graduate students with sites that offer the kinds of opportunities they need to enhance their skills, versatility and marketability. Students will be expected to fill out a weekly log, receive at least one visit from Medill faculty during the quarter and share their experiences and lessons learned with other students participating in practicums.", "name": "Special Topics", "section": "23", "topic": "Practicum in Media and Technology", "course": "490-0", "meeting_time": ["ThFr 9:00AM - 5:00PM"], "path": "/class-descriptions/4640/JOUR/JOUR/490-0/11889", "instructor": ["Richard   Gordon"], "id": "11889", "subject": "JOUR"}, {"school": "JOUR", "overview_of_class": "Students will explore innovation and business opportunities in the center of the world's technology industry. Starting with business fundamentals in media and technology industries, they will learn to recognize opportunities for disruption, assess the competitive landscape, and evaluate innovation strategies. For the product ideas they are developing, they will identify possible business models that would make them sustainable. The course aims to inspire students to be the force of innovation in media technology companies of any size, from the start-up venture to the conglomerate.<br/> <br/>Instructor: Mary Lou Song (CEO of FuelX - https://www.linkedin.com/in/mlsong) <br/>· SCHEDULE: Tuesdays 2-5pm", "name": "Special Topics", "section": "24", "topic": "The Business of Innovation", "course": "490-0", "meeting_time": ["Mo 2:00PM - 5:00PM"], "path": "/class-descriptions/4640/JOUR/JOUR/490-0/11890", "instructor": ["Mary L Song"], "id": "11890", "subject": "JOUR"}, {"school": "JOUR", "overview_of_class": "", "name": "Special Topics", "section": "25", "topic": "Social Justice", "course": "490-0", "meeting_time": ["Mo 1:30PM - 4:20PM"], "path": "/class-descriptions/4640/JOUR/JOUR/490-0/17412", "instructor": ["Joanna   Petersen"], "id": "17412", "subject": "JOUR"}, {"school": "JOUR", "overview_of_class": "Each quarter, multidisciplinary teams of students, faculty, and professionals come together to collaborate in the Knight Lab to produce cutting-edge digital work, research, thought?innovating across every part of the media-making process. The Student Lab places journalism and computer science students together on teams to work on an important problem for the future of media, rapidly moving beyond conversation and hypothesis to well-reasoned action during the quarter. Each project is scoped for a single quarter but students are encouraged to join the lab for multiple quarters. Students will work closely with faculty and professional mentors along the way. Our process combines research, design thinking, building, user testing, critical and analytical work, storytelling, cutting-edge technology, and experimentation?often within the confines of a single, specific problem. Come to learn, experiment, and create the future of media with us.", "name": "Special Topics", "section": "26", "topic": "Knight Lab", "course": "490-0", "meeting_time": ["TuTh 2:30PM - 4:20PM"], "path": "/class-descriptions/4640/JOUR/JOUR/490-0/19090", "instructor": ["Zach   Wise", "Emily Lauren Withrow"], "id": "19090", "subject": "JOUR"}]