[{"school": "WCAS", "overview_of_class": "Northwestern University is a community, working to set goals, achieve them, defining and striving for excellence, etc.  As such we create a culture and are a speech community using our language to describe and form our culture and identity. This language includes jargon (such as: freshman seminars and advisers, Wildcat, distros, CAESAR, CTECs, DM, ASG, SafeRide, MMLC, and many, many more), as well as slang (such as: rapey, getting raped on an exam, I'm just sayin', LOLOLOL, gotta bounce, and many, many more), etc.  Where interest and ability, bilingual/multilingual versions of the dictionary may also be possible for students to create.  SLAVIC 322/LING 363 concentrates on the language, identity, and heritage of the Northwestern University community. Students will continue to create the digital-born Northwestern e-Dictionary or NeD https://nudictionary.mmlc.northwestern.edu/wiki/index.php/Main_Page<br/>documenting NU's language. Students will learn to conduct, collect, and analyze the language as well as create the dictionary (sociolinguistic fieldwork and lexicography).  Students will also learn about the role, status, and prejudice that book-dictionaries have had in history (drawing on readings from specifically Russianin translationand English language examples) and work to try to avoid such prejudices in the Northwestern Dictionary Project.  Moreover, students will engage in meaningful reflection and discussion on the \"monopoly of the printed book\" in light of emerging, digital forms as represented by dictionaries (printed and digital ones). The Northwestern Dictionary Project is about lexicography, linguistics, identity, culture, and heritage.  It offers a venue for community building as well as a common networking space for meanings of NU's language for students, staff, and faculty", "name": "Making a dictionary: The Northwestern Project", "section": "20", "location": "Parkes Hall 215", "topic": "", "course": "363-0", "meeting_time": ["TuTh 9:30AM - 10:50AM"], "path": "/class-descriptions/4610/WCAS/LING/363-0/23608", "instructor": ["Elisabeth M Elliott"], "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "id": "23608", "subject": "LING"}]