[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "Locy Hall 111"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "21883", "title": "WCAS ASIAN_AM 214-0-1 Introduction to Asian American History", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "21883", "instructors": [{"instructor_phone": "847/491-3981", "instructor_name": "Justin K Tse", "instructor_addr": "Crowe Hall - Room 1125"}], "topic": "", "course": "214-0", "descriptions": [{"name": "Overview of class", "value": "&quot;Asian America&quot; is a composite of ethnic communities formed by migration between the regions of &quot;Asia&quot; and the &quot;Americas.&quot; But how did these disparate groups came to become known as &quot;Asian America&quot;? In this course, we will explore the histories of various Asian American communities (e.g. Chinese American, Japanese American, Korean American, Filipina/o American, Indian American, Native Hawai'ian communities). Our readings will begin with the pre-World War II Asian American experiences of exclusion and community establishment. We will then consider how it is that these different communities became known as an Asian American &quot;community,&quot; especially through the experience of the Second World War. Finally, we will read stories of post-1960s migrations and the ideological and material divisions that have emerged in Asian America."}, {"name": "Registration Requirements", "value": "None."}, {"name": "Learning Objectives", "value": "By the end of the course, students will be expected to: -Be able to sketch the history of Asian American communities -Articulate how disparate Asian American communities form the larger solidarity composite of &quot;Asian America&quot; -Narrate how the history of Asian America relates to contemporary Asian American experiences, as well as the experiences of people of color in the United States"}, {"name": "Teaching Method", "value": "DiscussionLecture"}, {"name": "Evaluation Method", "value": "Class participation: 20%<br/>Exam, final: 30%<br/>Exam, mid-term: 20%<br/>Paper, final: 30%<br/>"}, {"name": "Class Materials (Required)", "value": "Okihiro, Gary Y. American History Unbound: Asians and Pacific Islanders. Berkeley, Los Angeles, and London: University of California Press, 2015. 978-0520274358. $39.95 paper.<br/><br/>Additional readings on Canvas.<br/>?"}, {"name": "Class Notes", "value": "Attendance at first class mandatory."}], "lmod": "12/25/16 6:55 PM (CT)", "subject": "ASIAN_AM"}]