[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "555 Clark 230"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-registration - Reserved for Political Science students.", "qtr": "Spring 2017", "name": "35414", "title": "WCAS POLI_SCI 390-0-22 Special Topics in Political Science", "class_attributes": "", "section": "35414", "instructors": [{"instructor_phone": "", "instructor_name": "Jaime   Dominguez", "instructor_addr": ""}], "topic": "Diversity in American Cities", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "POLI SCI 390-0-22 Spring 2017 &quot;Diversity in American Cities&quot; Prof. Jaime Dominguez<br/>U.S. cities have traditionally been centers of diversity, in terms of race, ethnicity, religion, nationality, socioeconomic status, and lifestyle choices. In the last thirty years, major cities have undergone profound demographic changes. With these changes has come a new pattern of population diversity. Traditionally, the study of urban context has been placed in a black-white paradigm. But, it is this diversity that challenges political scientists and other scholars to rethink the future of urban politics. The course will focus on the changing political terrain, institutional context and leadership in urban spaces."}, {"name": "Registration Requirements", "value": "Attendance at first class required. Major or minor; junior standing"}, {"name": "Learning Objectives", "value": "This class is intended to assist students to expand their awareness and understanding of the different social, political and racial and ethnic context in America's largest cities. Through class readings, discussions, projects and writing assignments, the students will: (1) learn how institutional and structural changes affect participation and opportunities in urban spaces; (2) critically analyze the various paths of power and the role of organizational capacity and parties in designing public policy (3) explore the intersection of race and ethnicity and its effects on coalition politics; (4) examine and debate key public policies that have been introduced to promote social justice and equal opportunity."}, {"name": "Teaching Method", "value": "Lecture; student presentations; group discussion"}, {"name": "Evaluation Method", "value": "Participation 15%; Book responses 25%; Midterm 25%; Final Exam 35%"}, {"name": "Class Materials (Required)", "value": "&quot;Raphael J. Sonenshein. 2004. The City at Stake: Succession, Reform, and the Battle for Los Angeles. Princeton University Press.<br/><br/>Arnold R. Hirsch. 1998. Making the Second Ghetto: Race and Housing in Chicago, 1940-1960. University of Chicago Press. <br/><br/>Victor M. Valle &amp; Rodolfo D. Torres. 2000. Latino Metropolis. Minneapolis: University of Minnesota Press. <br/><br/>William J. Grimshaw. 1992. Bitter Fruit: Black Politics and the Chicago Machine 1931-1991. Chicago: University of Chicago Press. <br/> <br/>Eric Klinenberg. 2002. HeatWave: A Social Autopsy of Disaster in Chicago. Chicago: The University of Chicago Press.<br/>&quot;"}], "lmod": "2/8/17 6:45 PM (CT)", "subject": "POLI_SCI"}]