[{"school": "WCAS", "overview_of_class": "\"This is the best class I have taken at NU! First of all, you are with two of the best professors at NU. Secondly, you learn to think as you address really interesting big questions. This class is why I'm glad to be at NU!\"<br/><br/>\"Insightful class! Must take to complete your Northwestern career.\"<br/><br/>This course offers a cross-disciplinary approach to the concept of alternatives and choices. At any given moment, how many alternatives are possible? Is there really such a thing as chance or choice? On what basis do we choose? How does our understanding of the past affect the future? Can we predict the future? Professor Gary Saul Morson, a specialist in literature, and Professor Morton Schapiro, a labor economist specializing in the economics of higher education, will themselves offer alternative approaches to these questions based on the presuppositions of their respective disciplines. If you enjoyed reading The Signal and the Noise and want to dig into topics and questions like uncertainty, prediction, modelling, and judgment, this class is the perfect complement.<br/><br/>\"VERY SPECIAL CLASS. Few people anywhere will ever have the incredible opportunity this class offers to students. Morson and Schapiro genuinely challenge you intellectually and engage with complex issues and ideas with a nuance that is so rare in today's world. This class changes your perspective on EVERYTHING.\"<br/><br/>Space in this extremely popular course is limited to 80 students. To secure your spot in this challenging but rewarding course, please review last year's syllabus on canvas, and compose a 150-word essay answering either 1) how have your studies up until now prepared you for this course? Or 2) how do you expect this course to contribute to your ongoing studies? Application essays should be submitted in a word or pdf document to humanities260@gmail.com by November 21st at 5pm. (NOTE: THIS IS A NEW DEADLINE!)<br/>Remember to include your name, email and student ID number on your essay!<br/><br/>President Schapiro and Professor Morson will read your applications and select the cohort of students in this class. Those selected will be contacted directly about registration.", "name": "Humanities Explorations", "section": "20", "location": "Harris Hall L07", "topic": "Alternatives: Modeling Choice", "course": "260-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4650/WCAS/HUM/260-0/24196", "instructor": ["Gary S Morson", "Morton O Schapiro"], "class_attributes": "Interdisciplinary Distro - See Rules<br/><br/>Literature &amp; Fine Arts Distro Area<br/><br/>Ethics &amp; Values Distro Area<br/><br/>See Class Details for Important Registration Info<br/><br/>", "id": "24196", "subject": "HUM"}]