[{"school": "WCAS", "overview_of_class": "Disease knows no borders. Both pathogens and lifestyles move around the world and the people of every country share the risks.   The responsibility for ensuring the public health rests with governments at local, national and international levels.   Public health interventions require cooperation and partnerships at each level and with civil society organizations, corporations, businesses and individuals.  Advances in technology can significantly reduce the burden of disease and improve the quality of health and life.  To effectively address global health challenges, technology must be integrated into health systems in ways that are both appropriate and sustainable.  These interventions are affected by public policies, availability of resources and theories of public health and disease.  Existing health organizations are increasingly challenged by the scope and magnitude of the current and future threats to public health such as the AIDS pandemic; the emergence of new and more virulent infectious diseases; the threats of bio-terrorism; growing resistance to antibiotics; lack of basic infrastructure of water, sanitation and inadequate access to drugs in developing countries; and overabundance of foods and complications from affluence, leading to health problems such as diabetes in higher income countries.  <br/>This course will examine the global epidemiology of these diseases and threats to the populations of the world, and the current technological and organizational strategies that have been established to respond.  A series of diseases and geographical regions will be analyzed to consider how the international community uses technology and organizes its response to current problems in global public health.  Special attention will be given to examples of effective technologies and intervention strategies.<br/><br/>Guest speakers to be determined. Special event: February 29, 2016-Global Health Volunteer Resource Fair", "name": "Special Topics in Global Health", "section": "21", "topic": "Managing Global Health Challenges", "course": "390-0", "meeting_time": ["Mo 6:00PM - 9:00PM"], "path": "/class-descriptions/4610/WCAS/GBL_HLTH/390-0/24754", "instructor": ["Michael W Diamond"], "id": "24754", "subject": "GBL_HLTH"}, {"school": "WCAS", "overview_of_class": "This course draws on perspectives from anthropology and related social scientific fields to provide a critical overview of contemporary medical humanitarianism in historical, cultural, and socioeconomic context. Key questions that we will consider include: How and why has the health of individuals and communities adversely affected by poverty, marginalization, war, and disaster become the object of a wide range of contemporary discourses and practices of international intervention? What are the politics, historical roots, and cultural specificities of today's boom in interest in medical humanitarian work and institutions? How does medical humanitarianism relate to and diverge from other modes of international aid and development? How is it connected to today's global political economy, and what political, social, and institutional effects, for good or for ill, do medical humanitarian projects leave in their wake?<br/> <br/>Through close readings of classic and contemporary social theory, ethnographic accounts, and research on health-focused aid and development initiatives from across the social sciences, this course will encourage you to build your own critical perspective on medical humanitarian thinking and practice anchored in the history of the field and in engagement with the complexities of real-world situations. Case studies explore the work of organizations like Doctors Without Borders; post-war/disaster interventions in Haiti and elsewhere; and the global response to the Ebola epidemic in West Africa.", "name": "Special Topics in Global Health", "section": "22", "topic": "Health and Humanitarianism", "course": "390-0", "meeting_time": ["Th 9:30AM - 12:20PM"], "path": "/class-descriptions/4610/WCAS/GBL_HLTH/390-0/24755", "instructor": ["Peter Andrew Locke"], "id": "24755", "subject": "GBL_HLTH"}, {"school": "WCAS", "overview_of_class": "This upper-level seminar in medical anthropology examines the role of social markers of difference including race, class, nationality, gender, sexuality, age and religion in current debates and challenges in the theory and practice of global health. We will explore contemporary illness experiences and therapeutic interventions in sociocultural and historical context through case studies from the US, Brazil, and South Africa. Students will be introduced to key concepts such as embodiment, medicalization, structural violence, the social determinants of health, and biopolitics. Central questions of the seminar include: How do social categories of difference determine disease and health in individuals and collectivities? How is medical science influenced by economic and political institutions and by patient mobilization? How does social and economic inclusion/exclusion govern access to treatment as well as care of the self and others?<br/> <br/>The course will provide advanced instruction in anthropological and related social scientific research methods as they apply to questions of social inequality and public health policy in both the United States and in emerging economic powers. The course draws from historical accounts, contemporary ethnographies, public health literature, media reports, and films.", "name": "Special Topics in Global Health", "section": "23", "topic": "The Social Determinants of Health", "course": "390-0", "meeting_time": ["Tu 9:30AM - 12:20PM"], "path": "/class-descriptions/4610/WCAS/GBL_HLTH/390-0/24756", "instructor": ["Peter Andrew Locke"], "id": "24756", "subject": "GBL_HLTH"}, {"school": "WCAS", "overview_of_class": "Most recent class description: This course explores challenges and politics surrounding HIV/AIDS in Africa. It considers four major themes: the historical and contemporary methodologies and debates surrounding HIV/AIDS research and intervention in Africa; the experience of living in the context of HIV/AIDS (including issues of gender, emotion, sexuality, diverse ideas about healing); the politics of HIV/AIDS; and HIV/AIDS and health infrastructures. Questions considered during the course will include: what are the trends in research methodologies relating to HIV/AIDS in Africa? What is known or well understood about HIV/AIDS in Africa, and what as yet is not well understood? What are the politics of the disease? How have large externally-funded programs shaped the ways that the disease is thought about, treated, and experienced? What does it mean to live in the context of HIV/AIDS, whether afflicted or affected by it? How do issues such as gender roles, love, ideas about health, desires for the future, and daily livelihood struggles shape how people think about HIV/AIDS in their daily lives? Overall, students will be asked to move beyond the statistics and epidemiology of the epidemic, and adopt a critical lens in order to understand the complexities of HIV/AIDS programs and experiences in Africa, and the politics of global health interventions more generally.", "name": "Special Topics in Global Health", "section": "24", "topic": "HIV/AIDS in Africa", "course": "390-0", "meeting_time": ["Tu 9:30AM - 12:20PM"], "path": "/class-descriptions/4610/WCAS/GBL_HLTH/390-0/27201", "instructor": ["Noelle   Sullivan"], "id": "27201", "subject": "GBL_HLTH"}]