[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "Scott Hall 212"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores<br/>Add Consent: Department Consent Required<br/>Drop Consent: Department Consent Required<br/>", "qtr": "Fall 2016", "name": "12678", "title": "WCAS POLI_SCI 101-6-23 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "12678", "instructors": [{"instructor_phone": "847/491-8916", "instructor_name": "Jeffrey   Rice", "instructor_addr": "1908 Sherman Ave"}], "topic": "?Hunger Games? The Politics of Famine", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "&quot;Hunger Games&quot;: The Politics of Famine, Prof. Jeff Rice, Fall 2016, first-year seminar<br/>People starving is something that regularly appears on the news. Often described as a natural disaster it pulls at the hearts of people with food on their table. But what happens when it turns out that famines are not natural disasters but are the results of either incompetence or deliberate policies on the part of the state? How do we deal with this knowledge. How do we balance the concept of drought as distinct from the concept of famine? This class will address this issue beginning with the assumption that famines are not mere natural disasters about which little or nothing can be done. We will look into the mechanics of famine, the relationship between famine and war, famines and international aid (international aid and state reinforcement) as well as the 'marketing' of famines. In no way will this knowledge diminish the severity or brutality of famines but will, instead, explain them with more complexity. Examples will likely be Ireland, Ethiopia, and Bengal."}, {"name": "Registration Requirements", "value": "first-year students only"}, {"name": "Learning Objectives", "value": "There are two simple goals for this class: to get the students to examine a topic they think they know how to think about and to think about it as a social scientist; and to learn how to write about what they think. As such, some attention will be paid to methods as well as content asking what kind of data authors use and how do they use it as well as what the comparative method looks like to draw out more and more nuanced conclusions."}, {"name": "Teaching Method", "value": "Discussion"}, {"name": "Evaluation Method", "value": "Three papers, two of which will be re-written after one on one tutorials with the instructor. First paper = 25%, second = 30%, third = 35% and participation =10%."}, {"name": "Class Materials (Required)", "value": "Tentative book list: <br/>Cormac O' Grada: &quot;Black '47 and Beyond&quot; Princeton U.P. (out of print, used copies will be available)<br/>Peter Gill: &quot;Famine and Foreigners&quot; Oxford UP 0199644047<br/>Janam Mukherjee: &quot;Hungry Bengal&quot; Oxford UP 0190209887<br/>Thomas Keneally: &quot;Three Famines&quot; Public Affairs Press 161039187X"}], "lmod": "10/30/16 7:08 PM (CT)", "subject": "POLI_SCI"}]