[{"class_mtg_info": [{"meet_t": "MoWeFr 11:00AM - 12:20PM", "meet_l": "University Hall 122"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "21025", "title": "WCAS ECON 349-0-20 Industrial Economics", "class_attributes": "", "section": "21025", "instructors": [{"instructor_phone": "847/491-8220", "instructor_name": "James Andrew Hornsten", "instructor_addr": "Andersen Hall"}], "topic": "", "course": "349-0", "descriptions": [{"name": "Overview of class", "value": "Between the polar extremes of monopoly and perfect competition lies the realm of imperfect competition, often inhabited by a small number of interdependent firms with varying degrees of market power. Industrial economics (or industrial organization) explores the wide range of possible market structures and the competitive and cooperative strategies employed by profit-maximizing firms when there are few sellers, entry barriers, differentiated products, or imperfect information. We will review and expand the building blocks of the theory of the firm (cost and demand functions) and analyze the conduct and performance of monopolies, particularly through a variety of pricing schemes. We will use game theory to study oligopolistic firm behavior in a variety of scenarios, ranging from simple forms of static competition (e.g., Bertrand, Cournot and Hotelling models) to complex dynamic games involving strategic behavior (e.g., committing to an entry deterrence strategy or deciding whether to join a cartel). Although the problem we solve are mostly theoretical, we will discuss many real world applications."}, {"name": "Registration Requirements", "value": "This course covers advanced material on pricing, monopoly, oligopoly and game theory - topics introduced in ECON 310-1 and 310-2, the two important prerequisites."}, {"name": "Teaching Method", "value": "Two 80-minute meetings per week, which will feature lectures, problem solving, and discussions of how to reconcile our models with current events (e.g., the effects of e-book technology on traditional booksellers, and antitrust concerns over e-book pricing). There will also be a discussion session, during which the teaching assistant will present some original material, work through practice exercises, or discuss the recent exam."}, {"name": "Evaluation Method", "value": "Three unit exams (25% each) and an Evanston product market analysis project completed by a small team of students (25%)."}, {"name": "Class Materials (Suggested)", "value": "In lieu of a single required text, we will use a variety of readings (e.g., textbook chapters, economic journal articles, antitrust cases, recent articles from the business press, and old teaching materials) that will be posted on Canvas in PDF format. Those who prefer a standard textbook should obtain Industrial Organization: Contemporary Theory and Empirical Applications by Pepall, Richards &amp; Norman, 5th edition (ISBN: 978-1118250303)"}], "lmod": "12/24/16 6:57 PM (CT)", "subject": "ECON"}]