[{"school": "WCAS", "overview_of_class": "Archaeology and nationalism have been closely intertwined at least since the idea of the nation-state emerged in the wake of the French Revolution. Archaeology offers nationalist agendas the possibility of filling in national historical records and extending the past into prehistory; its results can be displayed in museums or at entire sites, potentially reaching a new audience outside the written word. In turn, nationalism contributed significantly to the emergence of archaeology as a modern discipline.<br/><br/>Drawing on new critical approaches and examples selected from a wide geographical range, this course explores the role of archaeology in the creation and elaboration of national identities. Issues include the institutionalization of archaeology; the development of museums and practices of display and interpretation; the creation of archaeological sites as national monuments and tourist destinations; cultural property legislation and repatriation of artifacts; and archaeology and monuments under totalitarian regimes.", "name": "Special Topics in the Humanities", "section": "20", "topic": "Archaeology and Nationalism", "course": "370-4", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4650/WCAS/HUM/370-4/24203", "instructor": ["Ann C Gunter"], "id": "24203", "subject": "HUM"}, {"school": "WCAS", "overview_of_class": "This course examines the recent history of U.S.-Latin American relations through the lens of dance, starting with the 1898 U.S. intervention in the Cuban war of independence against Spain and moving through present day. This history has been filled with intimacy, fascination, and integration, on the one hand, and estrangement, exploitation, and misunderstanding, on the other. Dancing bodies both reflected and shaped the complex relationship between the United States and Latin America. Weekly readings include primary documents, secondary sources, and audiovisual materials featuring famous performers in grand theatres and films, social dancers in clubs, ethnographers moving among dancing faithful, frolicking Disney cartoons, and Latin American dancers in Chicago.", "name": "Special Topics in the Humanities", "section": "21", "topic": "Dancing U.S.-Latin Amer. Relations", "course": "370-4", "meeting_time": ["MoWe 9:30AM - 10:50AM"], "path": "/class-descriptions/4650/WCAS/HUM/370-4/24204", "instructor": ["Elizabeth Bowlsby Schwall"], "id": "24204", "subject": "HUM"}]