[{"class_mtg_info": [{"meet_t": "MoWeFr 3:00PM - 3:50PM", "meet_l": "Technological Institute LG66"}], "school": "MEAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24279", "title": "MEAS MAT_SCI 331-0-20 Soft Materials", "class_attributes": "", "section": "24279", "instructors": [{"instructor_phone": "", "instructor_name": "Jiaxing   Huang", "instructor_addr": ""}], "topic": "", "course": "331-0", "descriptions": [{"name": "Overview of class", "value": "Course Objectives: <br/>To develop an understanding of the relationships between processing, structure and properties as applied to polymeric materials, and other materials that are dominated by relatively weak bonding between the constituent molecules or particles. <br/><br/>Course Outcomes: (Things students should be able to accomplish after completing the course) <br/><br/>1. Given the chemical structure of a common polymer, students will be able to draw the chemical structures of the monomer(s) from which it was made. <br/><br/>2. Given the chemical structure of a monomer (or monomers), students will be able to draw the chemical structure polymers that can be synthesized from it (or them). <br/><br/>3. Students will be able to differentiate between crystallization and glass formation in polymeric materials. <br/><br/>4. Given the relative sizes of the molecular components, students will be able to apply regular solution theory to determine the phase behavior of liquid/liquid mixtures. <br/><br/>5. Students will be able to calculate the modulus of an elastomer, given the molecular weight between crosslinks. <br/><br/>6. Students will be able to calculate diffusion coefficients and settling velocities for spherical particles in Newtonian liquids. <br/><br/>7. Students will be able to describe in physical terms the effect of electric charge, grafted water soluble polymer and non-grafted insoluble polymer on the interactions between surfaces that are immersed in a fluid. <br/><br/>8. Students will be able to interpret phase diagrams of liquid crystalline systems, describing how electric field and temperature affect the order parameter. <br/><br/>Relationship to Department Outcomes:(http://www.matsci.northwestern.edu/mission.html) <br/>Supports 1, 2, 3, 5, 6"}, {"name": "Registration Requirements", "value": "MAT SCI 201 or equivalent, and MAT SCI 314 or Chemistry 342-1"}, {"name": "Teaching Method", "value": "Homeworks: 25% <br/>Midterm I: 30% <br/>Midterm II: 30% <br/>Project paper or presentation: 15%"}, {"name": "Class Materials (Required)", "value": "Ian W. Hamley, Introduction to Soft Matter: Synthetic and Biological Self-Assembling Materials, Revised edition, Wiley, 2007. <br/>ISBN 978-0-470-51610-2"}, {"name": "Class Materials (Suggested)", "value": "Multimedia text: http://shullgroup.northwestern.edu/multimedia <br/>Painter and Coleman, Fundamentals of Polymer Science, 2nd Ed., Technomic, 1997"}], "lmod": "12/29/16 6:42 PM (CT)", "subject": "MAT_SCI"}]