[{"class_mtg_info": [{"meet_t": "MoWeFr 11:00AM - 11:50AM", "meet_l": "Fisk Hall 217"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Prerequisite: Students must have completed Chem 102 or 172 to register for this course.", "qtr": "Winter 2017", "name": "21288", "title": "WCAS BIOL_SCI 219-0-21 Cell Biology", "class_attributes": "Natural Sciences Distro Area<br/><br/>", "section": "21288", "instructors": [{"instructor_phone": "847/491-7034", "instructor_name": "Eric L Weiss", "instructor_addr": "HOGAN 2205 Tech Drive, Suite 2100"}], "associated_classes": [{"component": "DIS", "room": "Fisk Hall 217", "meeting_time": "We 7:00PM - 8:50PM"}], "topic": "", "course": "219-0", "descriptions": [{"name": "Overview of class", "value": "This course is part of the four-course introductory biology sequence. The cell biology course covers mechanisms the cell uses to compartmentalize and transport proteins, to move, to regulate growth and death, and to communicate with their environments."}, {"name": "Registration Requirements", "value": "Prerequisites: CHEM 102 or 172"}, {"name": "Learning Objectives", "value": "By the end of the class, a student is expected to be able to:<br/>1. Explain the importance of membrane function as well as the role of membrane lipids, protein components and membrane organization in eukaryotic cells.<br/>2. Explain how cellular components are targeted and distributed to different regions and compartments of a cell.<br/>3. Explain how cellular components of the cytoskeleton support a variety of cell functions, such as cell shape, division, movement, sensing the environment, and cell-cell communication.<br/>4. Explain how cell send, receive, and respond to signals from their environment, including other cells.<br/>5. Explain how cells coordinate and regulate cell division. <br/>6. Explain how an imbalance or mutation in normal cell processes can lead to cancer and other disease states."}, {"name": "Teaching Method", "value": "Class participation, Active learning exercises, Lecture, online work"}, {"name": "Evaluation Method", "value": "Multiple quizzes, 2 exams, class participation, short homework questions"}, {"name": "Class Materials (Required)", "value": "Essential Cell Biology by Alberts et al., 4th edition, 2013 edition, Garland publishers, ISBN - 9780815344544"}], "lmod": "12/29/16 6:54 PM (CT)", "subject": "BIOL_SCI"}]