[{"school": "WCAS", "overview_of_class": "The American cowboy and the Japanese samurai are often held up as mythic embodiments of the &quot;frontier&quot; or &quot;warrior&quot; spirits that define their respective nations. Yet despite their status as icons of national exceptionalism, the cowboy and samurai are surprisingly interchangeable. In the world of film, the Seven Samurai can soon become The Magnificent Seven.<br/><br/>This course explores two complementary genres: the Western and the jidaigeki (period drama). In addition to probing the concept of &quot;genre&quot; itself, we will also examine the problem of &quot;adaptation.&quot; How are elements present in one national, cinematic, or literary context transposed or re-coded to fit within another? What can the various cross-adaptations of samurai and cowboy films tell us about the shifting relations between Japan and the United States? How can generic conventions be &quot;bent&quot; or &quot;queered&quot; through practices of allusion, adaptation, and re-interpretation?", "name": "Topics in Combined Studies", "section": "20", "topic": "Cowboys &amp; Samurai", "course": "385-0", "meeting_time": ["MoWe 11:00AM - 12:20PM"], "path": "/class-descriptions/4610/WCAS/ENGLISH/385-0/25467", "instructor": ["Andrew Way Leong"], "id": "25467", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "Until a couple of centuries ago, scholars made no distinction between Science and Literature, or Science and Art. Science, scientia, was the word for knowledge in the broadest sense?all subjects of inquiry. Poets wrote scientific treatises?Chaucer was known as a master of alchemy as well as the &quot;fadir of Englyshe poesie&quot; and figures we think of today as hard-core scientists, like Johannes Kepler, were practitioners of the creative arts, writing science fiction as well as scientific treatises.<br/><br/>What would it be like to revive this older paradigm, to reintegrate these supposedly disparate ways of thinking about thinking into a single classroom? Can the varied intellectual explorations of Thought from neuroscientific, literary, and artistic perspectives be harnessed and collectively brought to bear on the core issues that interest those seeking scholarly understanding of the human experience??namely, perception, memory, emotions, ethics, knowledge and madness? As we raise these core questions, we will explore readings that present different perspectives on what constitutes thought, what free will is and isn't, and what tools we have for making sense of feelings, logic, perception, and memory.", "name": "Topics in Combined Studies", "section": "21", "topic": "Though Experiments", "course": "385-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4610/WCAS/ENGLISH/385-0/27446", "instructor": ["Indira M Raman", "Susan E Phillips"], "id": "27446", "subject": "ENGLISH"}]