[{"school": "WCAS", "overview_of_class": "This course explores the realities, expectations, and discontents of \"modernity\" in the West through the political theories of Hegel, Marx, Tocqueville, Mill, Nietzsche, and Freud. Our inquiries track two very general questions that distinguish modernity's consciousness of itself and preoccupy us still. The first question: What are the means and the possibilities for real human emancipation, social and political equality, and personal fulfillment in the modern world? The second: How might we \"moderns\" strive for freedom while coping with the loss of foundations (tradition, religion, monarchism) on the one hand and the emergence of new regimes and forms of domination (social, political, cultural, familial, psychological) on the other? The theorists and texts we're reading are by no means in agreement about the answers to these questions. What they share, however, is the urge to get us to think critically and diagnostically about the threats, the dangers, and the promises peculiar to modernity that link to these questions. For Marx, the problem is the exploitation and alienation of the working class under capitalism; for Tocqueville it's democracy's potential to give way to the soft and tutelary despotism of the state; for Mill it's the threat that mass culture, the tyranny of Society, and patriarchy pose to individuality and the active expression of liberty; for Nietzsche it's the manifestation of a herd animal \"morality\" (the same for all!) that stifles the will to life; for Freud it's the internalized guilt, repressions, and despairs that accompany all the purported achievements of modern progress and \"civilization.\" Amid the gloom of these discontents we'll also consider how the thinkers and texts we're reading open up possibilities for thinking, with and against modernity in the present, about politics, citizenship, democracy, equality, freedom, power, and the care of and for ourselves and the world. Texts include Reason in History (Hegel); Manifesto of the Communist Party; Economic & Philosophic Manuscripts; German Ideology; Capital (selections, Marx); Democracy in America, (selections, Tocqueville); On the Genealogy of Morals (Nietzsche); Civilization and its Discontents (Freud).", "name": "Modernity and Its Discontents", "section": "20", "location": "University Hall 102", "topic": "", "course": "303-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4620/WCAS/POLI_SCI/303-0/34094", "instructor": ["Mary Golden Dietz"], "class_attributes": "Ethics &amp; Values Distro Area<br/><br/>Attendance at 1st class mandatory<br/><br/>", "id": "34094", "subject": "POLI_SCI"}]