[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "Parkes Hall 223"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-registration - Reserved for English students.", "qtr": "Spring 2017", "name": "33288", "title": "WCAS ENGLISH 344-0-20 18th-Century Fiction", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "33288", "instructors": [{"instructor_phone": "", "instructor_name": "Vivasvan   Soni", "instructor_addr": ""}], "topic": "Jane Austen Judges the 18th Century", "course": "344-0", "descriptions": [{"name": "Overview of class", "value": "This course will examine a number of Jane Austen's novels (Emma, Persuasion, Mansfield Park and possibly Sense and Sensibility) in the context of a &quot;crisis of judgment&quot; that plagues the eighteenth-century novel. Working against the seductions of eighteenth-century sentimentality and the romance plot which threaten a reader's capacity for judgment, Austen designs narratives that compel her readers to engage in a sophisticated practice of judgment and evaluation. Some of Austen's most distinctive narrative strategies, such as &quot;free indirect discourse,&quot; are in the service of a pedagogy of judgment that is at the heart of her novelistic project. We will begin by exploring the crisis of judgment as it emerges in the eighteenth century, in the writings of Locke, Shaftesbury, Adam Smith and others. Reading examples of eighteenth-century sentimental fiction and romance, where the failures of judgment are clearly on display, will allow us to appreciate in a new light some of Austen's remarkable contributions to the history of the novel. The supple and attentive strategies of judgment she honed in her novels are as relevant today against a reductive scientism and disoriented aestheticism as they were when Austen first penned them."}, {"name": "Teaching Method", "value": "The course will be conducted as a seminar in which all members of the class are expected to participate actively."}, {"name": "Evaluation Method", "value": "Class participation (30%), midterm paper 6-8pp (30%), final paper 7-9pp (40%)."}, {"name": "Class Materials (Required)", "value": "Austen, Emma; Austen, Persuasion; Austen, Mansfield Park; Austen, Sense and Sensibility; Locke, Essay (selections); Shaftesbury, Characteristics (selections); Richardson, Pamela; Fielding, Joseph Andrews."}, {"name": "Class Notes", "value": "Pre 1830"}], "lmod": "2/6/17 6:42 PM (CT)", "subject": "ENGLISH"}]