[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "University Hall 122"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "34385", "title": "WCAS HISTORY 300-0-34 New Lectures in History", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "34385", "instructors": [{"instructor_phone": "", "instructor_name": "Abram J Lewis", "instructor_addr": ""}], "topic": "", "course": "300-0", "descriptions": [{"name": "Overview of class", "value": "Over the last few months, the complex politics of race, gender, and sexuality in the U.S. have been thrown to the forefront of national attention. Many of the issues that have marked the new presidential administration, however?like immigration, crime, sexual assault, and Islamophobia?have been intensifying in popular discourse for the last several years. Since 2013, Black Lives Matter has demanded redress for the ongoing state violence faced by African Americans. In the same years, high profile Supreme Court rulings established same-sex marriage as the law of the land while eroding reproductive rights and rolling back legislative gains of the Civil Rights Movement. Additionally, public backlash against transgender issues has thrown new light on the uneven successes of mainstream LGBT activism.<br/><br/>This course takes up two questions that have grown increasingly urgent in many of our minds: How did we get here? And what do we do now? We will do this by way of historicizing the politics of race, sexuality, and social movements in the U.S. since the post-Civil Rights period. Major topics include Black Power, women's, and gay liberation movements of the 1960s - 70s; women of color feminism of the 1970s - 80s; the emergence of the prison industrial complex; AIDS activism; and the cultural politics of neoliberalism. By highlighting traditions of resistance against racism, sexism, and heterosexism, we will work to better understand and formulate possible responses to our contemporary political moment."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Short Papers &amp; Final Project"}, {"name": "Class Materials (Required)", "value": "TBD"}], "lmod": "2/21/17 6:47 PM (CT)", "subject": "HISTORY"}]