[{"class_mtg_info": [{"meet_t": "Tu 2:00PM - 4:50PM", "meet_l": "Scott Hall 107 Burdick Room"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "22908", "title": "WCAS POLI_SCI 395-0-25 Political Research Seminar", "class_attributes": "", "section": "22908", "instructors": [{"instructor_phone": "", "instructor_name": "Ana Maria Arjona", "instructor_addr": "Scott Hall, Room 237"}], "topic": "Civilians in War", "course": "395-0", "descriptions": [{"name": "Overview of class", "value": "Civilians in war, Prof. Ana Arjona Winter 2017<br/>This seminar explores the behavior of civilians in contexts of civil war. Why do they join one of the warring sides, including rebels, paramilitaries or regular armies? Why do they resist against the presence of these groups in their territory? Why do they support rebels or incumbents? Why do they leave their hometowns to become refugees or internally displaced? How do they change their decisions regarding economic activities, social relations, and family dynamics? We approach these questions through both theoretical and empirical pieces (including case studies, comparative analyses, and human rights reports)."}, {"name": "Registration Requirements", "value": "Must be a junior or senior"}, {"name": "Learning Objectives", "value": "(i) Students will acquire a critical understanding of the situation of civilians in contexts of war as well as their choices.<br/>(ii) Students will acquire a critical understanding of the dynamics of civil war.<br/>(iii) Students will improve their analytical skills for studying political and social phenomena. In particular, they will improve their capacity to evaluate statements about causality.<br/>(iv) Students will improve their analytical skills for studying public policy. In particular, they will improve their capacity to evaluate normative and positive statements and the links between them."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Active discussion; a few short reading responses; paper."}, {"name": "Class Materials (Required)", "value": "&quot;* Jann K. Kleffner, 2007. &quot;From ?belligerents' to ?fighters' and civilians directly participating in hostilities - On the principle of distinction in non-international armed conflicts one hundred years after the Second Hague Peace Conference.&quot; Netherlands International Law Review, 54, pp. 316-336.<br/>? Kalyvas, Stathis, 2006. &quot;A Theory of Irregular War I: Collaboration.&quot; In The Logic of Violence in Civil War. Cambridge University Press. Pp. 87-110. <br/>? Stathis Kalyvas, &quot;The Ontology of Political Violence,&quot; Perspectives on Politics, 2003, 1(3), pp. 475-494. <br/>? Wood, Elisabeth. &quot;The social processes of civil war: The wartime transformation of social networks&quot;. Annual Review of Political Science Vol. 11: 539-561.<br/>? Kalyvas, Stathis. &quot;A Theory of Irregular War II: Control.&quot; In The Logic of Violence in Civil War, pp. 111-145.<br/>? Arjona, Ana. &quot;Social Order in Civil War.&quot; Book manuscript. Chapters 1 and 2.<br/>? Kalyvas, Stathis. &quot;Intimacy&quot; In The Logic of Violence in Civil War, pp. 330-363.<br/>? Lubkemann, Stephen, 2005. &quot;Migratory Coping in Wartime Mozambique: An Anthropology of Violence and Displacement in 'Fragmented Wars'.&quot; Journal of Peace Research, vol. 42, no. 4, 2005, pp. 493-508.<br/>? Diana Dumitru, and Carter Johnson, &quot;Constructing Interethnic Conflict and Cooperation: Why Some People Harmed Jews and Others Helped Them during the Holocaust in Romania,&quot; World Politics, 63(1), 2011, pp. 1-42.<br/>? Daniel Jonah Goldhagen, 1996. Hitler's Willing Executioners: Ordinary Germans and the Holocaust. Knopf. Pp. 1-24.<br/>? Scott Straus, 2012. &quot;Retreating from the Brink: Theorizing Mass Violence and the Dynamics of Restraint,&quot; Perspectives on Politics, 10 (2), pp. 343-362.<br/>? Wood, Elisabeth, 2003. Insurgent Collective Action and Civil War in El Salvador. Pp. 1-30 &amp; 226-256.<br/>? Humphreys, Macartan and Jeremy Weinstein. &quot;Who Fights? The Determinants of Participation in Civil War&quot;. American Journal of Political Science (April 2008). <br/>? Kalyvas, Stathis, 2008. &quot;Ethnic defection in civil war.&quot; Comparative Political Studies, vol. 41 no. 8, pp. 1043-1068.<br/>? Parkinson, Sarah, 2013. &quot;Organizing Rebellion: Rethinking High-Risk Mobilization and Social Networks in War.&quot; American Political Science Review vol. 107 (03) p. 418-432.<br/>? Ana Arjona, 2013. &quot;Recruitment in Civil War: An Institutionalist Approach.&quot; Working paper.<br/>? Finkel, Evgeny, 2013. &quot;Political Identities and Resistance to Oppression: Ghetto Uprisings during the Holocaust.&quot; Unpbulished paper. Pp. 1-36.<br/>? Schubiger, Livia, 2011. &quot;Civil War Violence and Counterinsurgent Mobilization in Peru.&quot; Unpublished paper.<br/>? Kaplan, Oliver, 2013. &quot;Protecting civilians in civil war: The institution of the ATCC in Colombia.&quot; Journal of Peace Research 50: 351, pp. 351-367.<br/>? Starn, Orin, 1995. &quot;To Revolt against the Revolution: War and Resistance in Peru's Andes.&quot; Cultural Anthropology, Vol. 10, No. 4, pp. 547-580.<br/>? Engel, Stefanie and Ana M. Ibañez, 2007. &quot;Displacement Due to Violence in Colombia: A Household-Level Analysis.&quot; Economic Development &amp; Cultural Change, January, Vol. 55 Issue 2, pp. 335-365.<br/>? Steele, Abbey, 2009. &quot;Seeking Safety: Avoiding Displacement and Choosing Destinations in Civil Wars.&quot; Journal of Peace Research, Vol. 46, No. 3, pp. 419-429.<br/>? Bateson, Regina, 2012. &quot;Crime Victimization and Political Participation.&quot; The American Political Science Review, 106, 3, pp. 570-587. <br/>? Bellows, John and Edward Miguel, 2009. &quot;War and local collective action in Sierra Leone.&quot; Journal of Public Economics 93, pp. 1144-1157.<br/>? Voors, Maarten J., Eleonora E. M. Nillesen, Philip Verwimp, Erwin H. Bulte, Robert Lensink, and Daan P. van Soest. 2012. &quot;Violent Conflict and Behavior:AFieldExperiment in Burundi.&quot; American Economic Review 102 (2): 941-64.<br/>? Gáfaro, Margarita, Ana M. Ibañez and Patricia Justino, 2013. &quot;Institutions and Armed Group Presence in Colombia.&quot; Working paper.<br/>? Justino, Patricia, 2006. &quot;On the Links between Violent Conflict and Chronic Poverty: How Much Do We Really Know?&quot; CPRC Working Paper 61. Pp. 1-21.<br/>? Akresh, Richard, Philip Verwimp and Tom Bundervoet, 2011. &quot;Civil War, Crop Failure, and Child Stunting in Rwanda.&quot; Economic Development and Cultural Change vol. 59 (4) p. 777-810.<br/>? Chamarbagwala, Rubiana and Hilcías Morán, 2011. &quot;The human capital consequences of civil war: Evidence from Guatemala.&quot; Journal of Development Economics 94, pp. 41-61.<br/>? Blattman, Christopher and Jeannie Annan, 2010. &quot;The consequences of child soldiering.&quot; Review of Economics &amp; Statistics. vol. 92 (4) p. 882-898."}], "lmod": "12/24/16 7:06 PM (CT)", "subject": "POLI_SCI"}]