[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "RCMA 1-172"}], "school": "MUSIC", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Winter 2017", "name": "26496", "title": "MUSIC GEN_MUS 101-6-20 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "26496", "instructors": [{"instructor_phone": "", "instructor_name": "Bernard J Dobroski", "instructor_addr": "bjdobroski@northwestern.edu"}], "topic": "A Journey From First Rehearsal to Final Performanc", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "This seminar is designed for the general campus student. Students with a music major, or a dual degree with music, are not permitted to register for this seminar. The course is designed to provide opportunities for music aficionados to experience music and music theater events from the inside-out. The only prerequisite for the course is a love of the performing arts - you don't have to read, perform, or understand music notation to succeed. However, you have to be prepared to spend a lot of time attending rehearsals and concerts (minimally six to eight hours a week), outside of the two required class sessions. During and outside of classroom sessions, the instructor and invited guests will attempt to nurture a heightened awareness of the challenges that conductors, opera and music theater directors and musicians/actors face when preparing for a performance. Through a series of observations, presentations, interviews, and interactive discussions/seminars, you will be better prepared to listen, observe, and critically analyze performing arts events on and off campus - during this academic quarter, and hopefully for the rest of your life. After Week One's introduction to the course and the music library, the Week Two class sessions will concentrate on conducting lessons and video observations of concerts and rehearsals. In these initial sessions, you will learn many of the techniques needed to lead the world's greatest instrumental and choral ensembles (of course, with many additional years of practice). Course participants, using their required conductor's baton and music CDs will learn a variety of conducting techniques - mastering beat patterns, the expressive use of the left hand, and using the conducting gesture to communicate interpretation, phrasing, dynamic shading. You may never conduct a major ensemble, but after meeting the requirements of the class you should have the knowledge and understanding to critically analyze conductors during your future career as a member of audiences for classical and popular music concerts."}], "lmod": "12/24/16 6:31 PM (CT)", "subject": "GEN_MUS"}]