[{"class_mtg_info": [{"meet_t": "Th 2:00PM - 4:50PM", "meet_l": "Scott Hall 212"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "22904", "title": "WCAS POLI_SCI 390-0-26 Special Topics in Political Science", "class_attributes": "", "section": "22904", "instructors": [{"instructor_phone": "", "instructor_name": "Ana Maria Arjona", "instructor_addr": "Scott Hall, Room 237"}], "topic": "Nonstate Armed Groups", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "Non-state armed groups Prof. Ana Arjona Winter 2017<br/>This seminar explores different aspects of non-state armed groups including insurgents, terrorist groups, criminal organizations and gangs. The course discusses theories and evidence on the origins and behavior of these groups as well as on the consequences of their presence on local communities, governments and markets."}, {"name": "Registration Requirements", "value": "At least one previous course in political science"}, {"name": "Learning Objectives", "value": "(i) Students will acquire a critical understanding of different aspects of the behavior of non-state armed actors.<br/>(ii) Students will improve their analytical skills for studying political and social phenomena. In particular, they will improve their capacity to evaluate statements about causality.<br/>(iii) Students will improve their analytical skills for studying public policy. In particular, they will improve their capacity to evaluate normative and positive statements and the links between them."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Short reading responses or memos and a final paper."}, {"name": "Class Materials (Required)", "value": "o Kalyvas, Stathis N. 2003. &quot;New' and ?Old' Civil Wars: A Valid Distinction?&quot; World Politics 54, no.1: 99-118. <br/>o Bates, Robert H. (2008). &quot;The Logic of State Failure: Learning from Late?Century Africa.&quot; Conflict Management and Peace Science 25(4): 297?314.<br/>o Andrew Kydd and Barbara Walter, &quot;The Strategies of Terrorism,&quot; International Security, 2006, 31(1), pp. 49-80. <br/>o Wolf, Sonja, 2011. &quot;The street gangs of El Salvador.&quot; In In Bruneau, Dammert and Skinner (Eds.), Maras: Gang violence and security in Central America, University of Texas Press (pp. 43-70). <br/>o Jeremy Weinstein, Inside Rebellion. Introduction and chapters 1 and 2 (pp. 1-95) <br/>o Dora Costa and Matthew Kahn, 2003. &quot;Cowards and Heoroes: Group Loyalty in the American Civil War&quot;. The Quarterly Journal of Economics, May.<br/>o Jeremy Weinsten, 2007. Inside Rebellion. Chapter 3 (pp. 96-123).<br/>o Humphreys, Macartan and Jeremy Weinstein. &quot;Who Fights? The Determinants of Participation in Civil War&quot;. American Journal of Political Science (April 2008). <br/>o Viterna, Joycelin. &quot;Pulled Pushed, and Persuaded: Explaining Women's Mobilization into the Salvadoran Guerrilla Army&quot;. American Journal of Sociology 112(1): 1-45. <br/>o Arjona, Ana, 2013. &quot;Rebel recruitment: an institutionalist approach&quot;. Unpublished paper.<br/>o Verwimp, Philip. 2005. &quot;An economic profile of peasant perpetrators of genocide: Micro-level evidence from Rwanda.&quot; Journal of Development Economics 77 (2): 297-323.<br/>o Jeremy Weinstein, Inside Rebellion. Chapter 6, pp. 198-259.<br/>o Balcells, Laia. 2013. Rivalry and Revenge. The Politics of Violence in Civil War. Unpublished book manuscript. (chapter 2) <br/>o Wood, Elisabeth Jean. 2009. &quot;Armed Groups and Sexual Violence: When is Wartime Rape Rare?&quot; Politics and Society 37 (1): 131-161.<br/>o Steele, Abbey. 2009. &quot;Seeking Safety: Displacement and Targeting in Civil Wars.&quot; Journal of Peace Research 46 (3): 419-429.<br/>o De la Calle, Luis, 2007. &quot;Fighting for Local Control: Street Violence in the Basque Country.&quot; International Studies Quarterly, Vol. 51, No. 2, pp. 431-455<br/>o Lyall, Jason. 2009. &quot;Does Indiscriminate Violence Incite Insurgent Attacks? Evidence from Chechnya.&quot; Journal of Conflict Resolution 53 (3): 331-362.<br/>o Kalyvas, Stathis, 2004. &quot;The Paradox of Terrorism in Civil War.&quot; The Journal of Ethics, Vol. 8, No. 1, pp. 97-138<br/>o Wickham-Crowley, Timothy, 2013. &quot;Del Gobierno de Abajo al Gobierno de Arriba ? and Back: Transitions to and from Rebel Governance in Latin America, 1956-1990.&quot; In Arjona, Ana, Nelson Kasfir and Zachariah Mampilly (Eds.) Rebel Governance. Book manuscript under review.<br/>o Weinstein, J. 2006. Inside rebellion: The Political Economy of a Rebel Organization. Cambridge University Press. &quot;Governance&quot;. Chapter 5: 163-197. <br/>o Mampilly, Zachariah 2011. Rebel Rulers. Chapters 3 and 7 (pp. 48-92 &amp; 209-231).<br/>o Anderson, Jon Lee, 2009. &quot;A reporter at large. Gangland: Who controls the streets of Rio de <br/>Janeiro? The New Yorker, October 5, pp. 47-57. <br/>o Shah, Saubhagta, 2008. &quot;Revolution and reaction in the Himalayas: Cultural resistance and the Maoist &quot;new regime&quot; in western Nepal&quot;. American Ethnologist, Vol. 35, No. 3, pp. 481-499."}], "lmod": "12/24/16 7:06 PM (CT)", "subject": "POLI_SCI"}]