[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Kresge Centennial Hall 2-343"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-requisite: Reserved for students who have taken and passed AAL 105-2 or Arabic 111-2.", "qtr": "Winter 2017", "name": "22702", "title": "WCAS ARABIC 114-0-20 Conversation and Culture in the Arab World", "class_attributes": "", "section": "22702", "instructors": [{"instructor_phone": "", "instructor_name": "Fadia M Antabli", "instructor_addr": ""}], "topic": "Levantine Arabic", "course": "114-0", "descriptions": [{"name": "Overview of class", "value": "A Levantine Arabic course is open to both undergraduate and graduate students, and to students with some background in Arabic. The course is introduced on one quarter during an academic year. <br/>This course is an in-depth introduction to conversation and culture in the Arab World with concentration on developing speaking and communication skills in spoken Levantine colloquial Arabic. Recognizing that students may have somewhat different backgrounds, the course aims to ensure that each individual student progresses in speaking and comprehension across the quarter, relative to his/her initial level. Please note, this course does not count toward the WCAS Foreign Language requirement and does not replace Arabic 111-3."}, {"name": "Registration Requirements", "value": "Successful completion of Arabic 111-2 with grade &quot;B&quot; or higher, or instructor consent."}, {"name": "Teaching Method", "value": "Speaking, listening and reading through multiple media selections, workbook pages, and films on various topics are also drawn from different sources. Samples of classical Arabic literature are brought in for cultural enrichment, but contemporary Arabic writing (newspapers, literature) is also included to support building strong communicative skills. These include Class discussion, participation in role-play scenarios, reinforced in-class dialogs and listening to audio selections. Classes will meet for 3 hours weekly."}, {"name": "Evaluation Method", "value": "Assessment of progress will be done by means of Attendance and participation, presentations, and final oral speaking exam."}, {"name": "Class Materials (Required)", "value": "&quot;Shou fi ma fi?&quot;: Intermediate Levantine Arabic by Chouairi, Rajaa. <br/><br/>Ordering information are as follows, you can also find the book on Amazon.<br/>Published by: Yale University Press<br/>Publish Date: April 1, 2010<br/>Edition: 1<br/>eBook ISBN 13: 9780300153910<br/>Print ISBN 13: 9780300153910<br/>Product ID: 875718<br/>Language: Arabic"}], "lmod": "12/24/16 6:54 PM (CT)", "subject": "ARABIC"}]