[{"class_mtg_info": [{"meet_t": "Mo 10:00AM - 11:50AM", "meet_l": "Annie May Swift Hall 109"}, {"meet_t": "We 10:00AM - 12:50PM", "meet_l": "Helmerich Auditorium"}], "school": "SoC", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Fall 2016", "name": "14326", "title": "SoC RTVF 551-0-20 Documentary Techniques", "class_attributes": "", "section": "14326", "instructors": [{"instructor_phone": "847/467-1758", "instructor_name": "Debra K Tolchinsky", "instructor_addr": "1920 Campus Dr. Room 211"}], "topic": "", "course": "551-0", "descriptions": [{"name": "Overview of class", "value": "RTVF 551 MFA in Documentary Media: Documentary Techniques <br/>Fall 2016<br/><br/>Meeting times: <br/>Mon 10-11:50 AMS 109 <br/>Wed 10-12:50 AMS Helmerich Aud<br/><br/>Instructor: Debra Tolchinsky<br/>debtolchinsky@northwestern.edu<br/><br/>Course Description and Objectives<br/>In this course, students will be introduced to traditional small-crew documentary filmmaking through the process of directing their own short 6 to 8 minute project. Students will get hands on experience shooting, interviewing, recording sound and editing. Topics touched upon will include audience engagement, documentary innovation, and ethics. <br/><br/>Class time will be divided between watching and critiquing peer generated work, guest filmmaker visits and screenings/discussions of influential documentary films. By speaking with filmmakers and viewing documentaries by directors such as Sarah Polley, Werner Herzog, Frederick Wiseman and Joshua Oppenheimer students will wrestle with: What kinds of documentaries are relevant today? What are the ethical obligations of a documentarian? How do budgetary restrictions determine stylistic choice? How does stylistic choice interact with content? <br/><br/>Requirements: A series of written exercises including a one-page examination of the ethical considerations in a TBA documentary film, a project proposal, an on-camera interview, a rough cut, and a finished 6-8 minute documentary. <br/><br/>Required Text:<br/>1. Directing The Documentary, 6th edition, Michael Rabiger, ©2014 Focal Press <br/>Approximately $45 without shipping<br/><br/>2. The Documentary Film Makers Handbook, 2nd edition: The Ultimate Guide to<br/> Documentary Filmmaking, Genevieve Jolliffe and Andrew Zinnes, ©2012 <br/>Continuum International Publishing Group Inc.<br/>Approximately $26 without shipping<br/><br/>Additional handouts will be distributed in class or posted on Canvas <br/><br/>Additional Supplies/Equipment<br/>You will need to purchase a 1 to 2 TB hard drive (specs to be discussed in class)"}], "lmod": "10/30/16 6:50 PM (CT)", "subject": "RTVF"}]