[{"class_mtg_info": [{"meet_t": "Tu 1:00PM - 3:50PM", "meet_l": "Annenberg Hall 345"}], "school": "SESP", "enrl_requirement": "", "qtr": "Winter 2016", "name": "26683", "title": "SESP LOC 211-0-20 Intro to Organization Theory &amp; Practice", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "26683", "instructors": [{"instructor_phone": "", "instructor_name": "Gail Ann Berger", "instructor_addr": ""}], "topic": "", "course": "211-0", "descriptions": [{"name": "Overview of class", "value": "Introduction to Organization Theory and Practice is an introductory course taught within the context of the School of Education and Social Policy as part of its Learning and Organizational Change (LOC) concentration. A basic premise of the course is that a fundamental process for improving people's lives and the institutions in which they live and work is the creation and sharing of knowledge. Learning is mediated by the context in which it occurs. This course pays special attention to organizations as a context and analyzes this context through different lenses of organizational theory. Throughout the course students will learn multiple frameworks for observing and analyzing organizations. Using these frameworks, the course will provide students with social science tools needed to analyze organizational problems and influence the actions of individuals, groups and organizations. Students will begin to understand how to best organize and motivate the human capital of the firm, manage social networks and alliances, and execute strategic change. This will be accomplished through knowledge of competitive decision-making, reward system design, team building, strategic negotiation, political dynamics and corporate culture."}, {"name": "Learning Objectives", "value": "1. You will understand more about the nature of complex organizations by using different theoretical frameworks for analyzing organizational issues and scenarios.<br/>2. You will increase your ability to think about and use theories as tools for analysis.<br/>3. You will deepen your understanding of the role of knowledge in organizations.<br/>4. You will demonstrate your skill in recognizing organizational issues by assessing organizational effectiveness as well as making recommendations to improve it."}, {"name": "Evaluation Method", "value": "Your final grade is composed of:<br/>1. Course Contribution 15% <br/>2. Framework Analysis 10% <br/>3. Case Analysis 15%<br/>4. Exam 25%<br/>5. Team Project - Organizational Analysis 20%<br/>6. Team Project - Presentation 10% <br/>7. Team Project - Peer Evaluations 5%<br/><br/>Unless you will be absent on the day that an assignment is due, hard copies of all assignments should be submitted in class. <br/>Late assignments will be automatically reduced by 5% each day past the due date."}, {"name": "Class Materials (Required)", "value": "Reframing Organizations: Artistry, Choice, and Leadership, 5th Edition"}], "lmod": "1/9/16 6:40 PM (CT)", "subject": "LOC"}]