[{"school": "WCAS", "overview_of_class": "In this course, we will draw upon literature in the social sciences and humanities to consider the central role that science (broadly conceived) has played both in categorizing people based upon sexual desires, practices, and identity, and in challenging how we have come to understand those very categories. We then consider how debates over how to define sexuality intersect with struggles for LGBT rights as well as alternative approaches to improving the lives of those who may not fit neatly within established categories. Key topics will include: the pathologization and de-pathologization of homosexuality; same-sex marriage; fixed vs. fluid sexual desire; efforts to change sexual orientation; and the relevance of disputes over the nature of sexuality to trans people's claims to legal recognition, among others.", "name": "Topics in Sociological Analysis", "section": "20", "topic": "Sexuality, Soc Sci, &amp; LGBT", "course": "376-0", "meeting_time": ["MoWe 11:00AM - 12:20PM"], "path": "/class-descriptions/4620/WCAS/SOCIOL/376-0/34425", "instructor": ["Aaron Travis Norton"], "id": "34425", "subject": "SOCIOL"}, {"school": "WCAS", "overview_of_class": "How does family life vary around the globe? This class will consider marriage, childrearing, intergenerational relationship, and household organization in a comparative perspective. These topics will be explored in a seminar format with the focus on discussion of recently published scholarly books and articles. Throughout the quarter, students will conduct independent research on family life in a country of their choice, and they will present their findings at the end of the term.", "name": "Topics in Sociological Analysis", "section": "21", "topic": "Families: A Global Approach", "course": "376-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4620/WCAS/SOCIOL/376-0/34426", "instructor": ["Christine Marie Percheski"], "id": "34426", "subject": "SOCIOL"}, {"school": "WCAS", "overview_of_class": "This course aims to give Northwestern undergraduates a foundation of knowledge and critical reasoning skills that will enable them to develop and refine their own understanding of how and why public policy in the United States has developed historically in the ways that it has?and not in other ways it might have developed. Social policy, industrial relations, health care, fiscal policy, and financial regulation are among the policy areas that we will consider. Why is social spending in the United States relatively stingy? Why is so much of it channeled through the private sector? Why is the unionization rate so low? Why are so many people uninsured? Why have top marginal tax rates for personal income tended to be relatively low since the late-1980s? Why is the regulation of the U.S. financial system so fragmented and decentralized? The course will begin chronologically with the New Deal and end with the Great Recession. The main readings for the course will consist of selected biographies of major social and political figures. These biographies are meant to provide a uniquely valuable window into the policy-making process ? helping students to understand policy developments from the bottom-up as well as the top-down.", "name": "Topics in Sociological Analysis", "section": "22", "topic": "Politics Through Biography", "course": "376-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4620/WCAS/SOCIOL/376-0/34427", "instructor": ["Anthony S Chen"], "id": "34427", "subject": "SOCIOL"}, {"school": "WCAS", "overview_of_class": "In this course, students will be challenged to think about feminism through the lens of women committed to traditional, at times even fundamentalist, religious values. We will investigate the ways in which such women negotiate their status and examine the evolving feminist movements that have arisen within traditional religious life. More specifically, we will focus on a case study of feminist activism among Orthodox Jewish women in Israel, in a comparative perspective with Evangelical women and Muslim women in the USA. Some of the central questions we will engage are: how are the forms of feminist identity and activism among women in traditional religious traditions similar? In what ways can feminist activism within religious life be compared with secular feminist activism?", "name": "Topics in Sociological Analysis", "section": "23", "topic": "Women in Trad'l Religious Mvmts", "course": "376-0", "meeting_time": ["MoWe 12:30PM - 1:50PM"], "path": "/class-descriptions/4620/WCAS/SOCIOL/376-0/34428", "instructor": ["Yael   Israel-Cohen"], "id": "34428", "subject": "SOCIOL"}, {"school": "WCAS", "overview_of_class": "This course explores historical formation of cities and citizenry in the Middle East since the 19th century. It studies urban development, economy, social classes and politics in Egypt and Turkey with a focus on two world-historical cities, Cairo and Istanbul. Drawing mostly on readings in history, anthropology and sociology, it examines how urban space in Egypt and Turkey was reconfigured through histories of colonialism, nationalism, developmentalism and globalization with a particular attention to the following topics: urban immigration, informality, gendered places, consumption, urban regeneration, local politics and branding the city. Throughout the course, these topics are studied in relation to two main questions: How do spatial changes engender new social practices and redefine cultural difference and vice versa?; How do power struggles at the intersection of local and global interests shape urban change? The course is designed for history, sociology, anthropology, political science and urban studies majors.", "name": "Topics in Sociological Analysis", "section": "24", "topic": "Cities and Citizens in the Middle East", "course": "376-0", "meeting_time": ["Tu 10:00AM - 1:00PM"], "path": "/class-descriptions/4620/WCAS/SOCIOL/376-0/34429", "instructor": ["Ayca   Alemdaroglu"], "id": "34429", "subject": "SOCIOL"}, {"school": "WCAS", "overview_of_class": "What are the social and political dimensions of environmental problems? What kinds of social responses to environmental challenges and crises have emerged worldwide? This course examines connections between the natural environment, politics, and society across the global North and South. We will begin with theories of environment-society relations and central questions about how the natural environment is defined and valued by different actors, the limits and possibilities of environmental governance, the tensions between environmental considerations and economic development, and the relationship between the environment and socioeconomic inequality. We will then consider social and political responses to environmental problems, paying special attention to grassroots mobilization around environmental justice, organized social movements and expert NGOs working on the politics of the environment, community inaction in the face of toxic risks, and changing patterns of individual consumption. We will read and analyze case studies based in Chicago, other parts of the United States, and international sites to examine how people contribute to, are affected by, and try to shape contemporary environmental problems.", "name": "Topics in Sociological Analysis", "section": "25", "topic": "Environment, Politics, and Society", "course": "376-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4620/WCAS/SOCIOL/376-0/34430", "instructor": ["Maria   Akchurin"], "id": "34430", "subject": "SOCIOL"}, {"school": "WCAS", "overview_of_class": "", "name": "Topics in Sociological Analysis", "section": "26", "topic": "Southeast Asian American Experience", "course": "376-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4620/WCAS/SOCIOL/376-0/34431", "instructor": ["Jennifer A Huynh"], "id": "34431", "subject": "SOCIOL"}]