[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "Fisk Hall 114"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-registration is reserved for students majoring or minoring in Asian Languages &amp; Cultures, Asian Studies, or International Studies.", "qtr": "Spring 2017", "name": "32520", "title": "WCAS ASIAN_LC 290-0-20 Introductory Topics in Asian Languages and Cultures", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "32520", "instructors": [{"instructor_phone": "", "instructor_name": "Anne Elizabeth Rebull", "instructor_addr": "Kresge Hall, 1880 Campus Drive, 4-520"}], "topic": "Reinventing the Chinese Stage in the 20th Century", "course": "290-0", "descriptions": [{"name": "Overview of class", "value": "Model operas, civilized plays, xiqu, avant-garde theater, musicals, spoken drama?the theatrical world of the 20th century in China saw many different incarnations and experimentations over the course of the century. From the star culture surrounding the female impersonators of the Republican era through xiqu reform and the model operas of the Cultural Revolution to the emergence of a director's theater in the post-Maoist era, the picture of modern Chinese theater is a complex web of evolving forces between audiences, actors, directors, playwrights, and the state. Entangled in this image are different reflections of the role of theater in marking or creating social change, not just with class revolution but in considering and redefining gender categories. In this course, we will explore significant plays of different genres from throughout the 20th century that highlight the key creators and turning points of modern Chinese theater. Among the topics we will consider are the myriad ways theater interacts with political forces, including mass mobilization, censorship, regulations of gender, representations of history, and interactions on the world stage."}, {"name": "Learning Objectives", "value": "Students will become familiar with developments in the modern history of Chinese theater, including both traditional opera (xiqu) and spoken drama, by examining theatrical literature, filmed productions and writings about theater history. The hybrid, synthesized nature of sung theatrical arts require a complex set of analytical skills; students will become capable of articulating critical observations not just about dramatic content, but also productions, including music, choreography, and costume and set design. Part of this entails developing a sensitivity to the theatrical context: the theater venues, stages, audiences and patrons of the theater, as well as the performance conventions for actors. In addition to honing their interpretive critical apparatus, students will also incorporate knowledge gained from writings about theater by contemporaries and by historical figures from China, in order to produce a more nuanced assessment of theatrical practice in China."}, {"name": "Teaching Method", "value": "discussion-based seminar"}, {"name": "Evaluation Method", "value": "Research-based, analytical theater review article 30%<br/>Screening Responses 25%<br/>Performance Review 20%<br/>Presentation 15%"}, {"name": "Class Materials (Required)", "value": "1. Joshua Goldstein, Drama Kings: Players and Publics in the Re-creation of Peking Opera 1870-1937. (available online through library)<br/>2. Rudolf Wagner, The Contemporary Chinese Historical Drama: Four Case Studies. (available online through the library)<br/>3. Jin Jiang, Women Playing Men. Seattle: University of Washington Press, 2009. (available online through the library)"}], "lmod": "2/13/17 6:41 PM (CT)", "subject": "ASIAN_LC"}]