[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "Kresge 3438 Philosophy Sem. Rm"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Winter 2017", "name": "22724", "title": "WCAS PHIL 109-6-20 First-Year Seminar in Philosophy", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "22724", "instructors": [{"instructor_phone": "8474912550", "instructor_name": "Cristina   Lafont", "instructor_addr": "Crowe 1-127"}], "topic": "Rethinking Democ After Globalization", "course": "109-6", "descriptions": [{"name": "Overview of class", "value": "This seminar focuses on the future of democracy under current conditions of globalization. Since the end of the Cold War it has become apparent that individual countries cannot achieve the democratic ideal of a society of free and equal citizens in isolation. Current threats such as global warming, terrorism, global economic crises require global solutions that no individual country can provide on its own. Thus the main political challenge of the 21st Century is to figure out whether necessary conditions for democracy, such as citizens' political equality and participation, public deliberation, etc. can be reproduced at the global level. Can citizens have a say on political decisions that affect them even if they are reached outside the domestic borders of their own society? Is it possible to design a new international order in which global political decisions are made in a democratic way? In the seminar we will analyze this difficult set of questions by discussing some interesting recent proposals for a new international order with a focus on how they handle issues of international human rights standards, the global economic order, world poverty, etc."}, {"name": "Learning Objectives", "value": "The goals of the seminar are (1) to analyze contemporary proposals for a more democratic international order, (2) to explore their prospects to help solve global problems and (3) to enhance the student's critical thinking, oral debate and writing skills."}, {"name": "Teaching Method", "value": "PresentationsSeminar"}, {"name": "Evaluation Method", "value": "Presentations and participation in class discussion (25%), two reaction papers (25%), final paper (50%)"}, {"name": "Class Materials (Required)", "value": "Books <br/>Rawls, J., The Law of Peoples, Cambridge, MA: Harvard University Press, 1999. ISBN 9780674005426<br/>Pogge, T., World Poverty and Human Rights, 2nd edition, Polity Press, 2008. ISBN 9780745641447<br/><br/>Course Pack <br/>Gutmann, A. and D. Thompson, Why Deliberative Democracy? Princeton: Princeton University Press, 2004, 1-63.<br/>Held, D. and McGrew, A., Globalization/Anti-globalization. Beyond the great divide, 2nd edition, Cambridge: Polity Press, 2007, 1-10, 185-205.<br/>The United Nations Universal Declaration of Human Rights (December 10, 1948), translated to English by United Nations Department of Public Information, www.unhchr.ch/udhr/lang/eng.htm<br/>Wenar, L., &quot;Property Rights and the Resource Curse,&quot; Philosophy &amp; Public Affairs 36/1 (2008), 2-32.<br/>Habermas, J., &quot;A Political Constitution for the Pluralist World Society?&quot; in Between Naturalism and Religion, Cambridge, MA: MIT Press, 2008, 312-352."}], "lmod": "12/29/16 7:03 PM (CT)", "subject": "PHIL"}]