[{"school": "WCAS", "overview_of_class": "The past year marked the centennial of the outbreak of WWI, inspiring various conferences, exhibitions, seminars and other public events commemorating a global war that had started as a small conflagration in Southeast Europe.  This seminar will focus on an aspect of the Great War that has largely been ignored in popular histories, namely, its impact on the Middle East/North Africa region.  Going beyond the romantic image of Lawrence leading the Bedouins against Ottoman domination, this seminar will explore how WWI shaped the Middle East as we know it.  The imposition of colonial/mandate borders at the war's end is a well-known aspect of this history, but we will also explore the deep impact of the war on society.  Our focus will be on the Ottoman Empire, the only Middle Eastern state that entered the war as an independent entity.  We will discuss the war experience of soldiers and common people; the changing gender dynamics; social and ethnic engineering policies; and the international context for post-war settlements.", "name": "Research Seminar", "section": "30", "location": "Locy Hall 314", "topic": "World War I in the Middle East", "course": "395-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4610/WCAS/HISTORY/395-0/24970", "instructor": ["Ipek Kocaomer Yosmaoglu"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "id": "24970", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "The Arabian Nights are the most popular example of Arabic literature in the western world. They inspired playwrights during the heyday of print culture, and filmmakers as recently as Walt Disney's Aladdin. From the historian's perspective, they are a collection of stories compiled during the Middle Ages in such cities as Cairo and Damascus. They reflect traditions that are much older, and draw upon legends widely repeated in such diverse regions as China, India, Iran and Turkey. Analysts of pre-modern societies in the Islamic world now recognize The Arabian Nights as a major literary source that sheds light on many types of colorful people whose antics enlivened the scene in great Islamic cities of pre-modern times, but who remain largely invisible in more formal sources. The Nights also raise issues of cultural practice that contrast with formal strictures imposed by such sacred texts as the Koran itself. The fact that the stories were allegedly told by a woman conniving to stave off vengeance killings by a ruler raises intriguing questions about male-female relations. We will consider these issues in the context of various translations that themselves reveal biases of modern-day writers, who may have reveled in the worlds of counter-culture or pornography.", "name": "Research Seminar", "section": "31", "location": "Fisk Hall 114", "topic": "Arabian Nights Counter Culture or Pornography", "course": "395-0", "meeting_time": ["MoWe 12:30PM - 1:50PM"], "path": "/class-descriptions/4610/WCAS/HISTORY/395-0/24971", "instructor": ["Carl Forbes   Petry"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "id": "24971", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "This course will explore recurrent attempts to define, explain, and ameliorate poverty in England and the United States from the 18th century to the late 20th.  Topics include: the relationship between poverty and the commercial/industrial revolution; the place of poverty in Enlightenment and Utilitarian thought; changing (and unchanging) ideas about the connections between poverty and moral character, education, unemployment, gender, and ethnic/racial inheritance; the periodic emergence of poverty as a political issue; the concept of an \"underworld\" or \"underclass;\" and the shifting rhetoric of sympathy and fear. We will begin with selections from Jacob Riis, How the Other Half Lives (1890).  After that initial discussion, the class will move back to the 18th century, to examine the ideological, political, and economic bases of later discussions about poverty.  We will then move on to a consideration of 20th century changes (and continuities) in the nature of poverty and its place in English and American thinking.", "name": "Research Seminar", "section": "32", "location": "University Hall 412", "topic": "Problems of Poverty in Anglo-American Culture", "course": "395-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4610/WCAS/HISTORY/395-0/24972", "instructor": ["Henry Claxton   Binford"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "id": "24972", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "The United States folk music revival is typically thought of as an antimodern, even a Luddite, movement. To study it through digital means, however, reveals important connections between the history of the revival and issues of technology, culture, and poltiics in the modern world. In this research seminar, we examine the history of the US folk music revival through readings, audio listening, documentary films, seminar discussions, and extensive digital analysis to investigate these connections. Working in platforms such as Omeka and WordPress, we use the archives of the Berkeley Folk Music Festival, the Old Town School of Folk Music (in Chicago and online), and the Alan Lomax Collection (online) to probe what was at stake in the folk revival in relation to American culture and politics; questions of race, class, gender, age, and region; and the strange workings of music-making, memory, and power. As we do so, we ask how digital technologies might help us to interpret history more meaningfully; simultaneously, we explore how both the folk revival itself and the methods of historical study might be crucial to understanding our contemporary digital moment more effectively. Each student will be evaluated based on class participation, weekly digital mini-project experiments, presentations, and a final multimedia interpretive digital history podcast project that is the multimedia equivalent of a 15-20 page analytic essay based on original research. For students with advanced digital media/programming skills or musical training, the course presents an opportunity to connect that background to deep historical study; for students interested in acquiring digital or musical skills, the seminar offers an excellent introductory pathway to these areas of knowledge.", "name": "Research Seminar", "section": "33", "location": "1801 Hinman Ave 2225", "topic": "Digitizing Folk Music History", "course": "395-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4610/WCAS/HISTORY/395-0/24973", "instructor": ["Michael J Kramer"], "class_attributes": "", "id": "24973", "subject": "HISTORY"}]