[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Kresge Centennial Hall 4-410"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "33861", "title": "WCAS FRENCH 380-0-20 Political &amp; Social Thought in France", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "33861", "instructors": [{"instructor_phone": "847/491-8255", "instructor_name": "Doris L Garraway", "instructor_addr": "1860 S. Campus Drive, Crowe Hall #2-134"}], "topic": "How to Change the World", "course": "380-0", "descriptions": [{"name": "Overview of class", "value": "How did France become a secular republic whereas it began as a divine-right monarchy? How did former slaves overthrow colonial slavery and become leaders of nations? In short, how do you change the world? In this course, we examine the ideas and discourses that shaped the most significant social, cultural, and political transformation in the history of France and the Francophone world, which occurred in the &quot;Age of Revolution.&quot; Changing the course of France and its colonies, the French Revolution departed from a new understanding of the human in order to institute a radically revised notion of citizenship and reinvent or throw out entirely age-old understandings of sovereignty, the law, God, religion, time, the calendar, the nation, and the family. At the same time, the revolutionaries sought to transform much of the rest of the world in its own image, exporting the revolution to create a universal French nation. We will trace key ideas and cultural practices of both the French and Haitian Revolutions, with special attention to the potentialities and limits of the rhetoric of freedom and notions of universality they advanced. At the same time, we examine the reactions they engendered both within and outside of the French-speaking world, which gave rise to modern conservative thought. Works by Montesquieu, Rousseau, Sieyès, Assemblée nationale, Robsepierre, Olympes de Gouges, Toussaint Louverture, Jean-Jacques Dessalines, De Vastey, De Maistre, and others."}, {"name": "Teaching Method", "value": "Short lectures and discussion."}], "lmod": "2/19/17 6:48 PM (CT)", "subject": "FRENCH"}]