[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Locy Hall 301"}], "school": "WCAS", "overview_of_class": "Modernity has dramatically changed the profile of western civilization and had a major impact on European Jewry. The course will take students from French Revolution that started integrating the Jews into the fabric of European society through the establishment of the State of Israel. It will highlight the plurality of models of Jewish integration and acculturation, the formation of new Jewish identities, the split of the traditional community under the impact of Haskalah (Jewish Enlightenment), the rise of Liberal and Orthodox trends within Judaism, and the spread of Jewish political movements such as socialism and nationalism. Based on a plethora of English-language documents, the course will introduce students to those problems of interaction between the general society and the Jewish minority that pointed toward the twentieth century transformation of modernity.  In sum, the course will explore the fascinating response of Jews to modernity on political, societal, theological, and cultural levels.", "qtr": "Winter 2016", "name": "Jewish History 1789-1948", "title": "WCAS HISTORY 203-3-20 Jewish History 1789-1948", "lmod": "1/9/16 6:48 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "847/467-3399", "instructor_name": "Yohanan   Petrovsky-Shtern", "instructor_addr": "Harris Hall 317"}], "associated_classes": [{"component": "DIS", "room": "Locy Hall 106", "meeting_time": "Fr 10:00AM - 10:50AM"}, {"component": "DIS", "room": "Locy Hall 106", "meeting_time": "Fr 11:00AM - 11:50AM"}, {"component": "DIS", "room": "University Hall 312", "meeting_time": "Fr 3:00PM - 3:50PM"}], "topic": "", "course": "203-3", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Modernity has dramatically changed the profile of western civilization and had a major impact on European Jewry. The course will take students from French Revolution that started integrating the Jews into the fabric of European society through the establishment of the State of Israel. It will highlight the plurality of models of Jewish integration and acculturation, the formation of new Jewish identities, the split of the traditional community under the impact of Haskalah (Jewish Enlightenment), the rise of Liberal and Orthodox trends within Judaism, and the spread of Jewish political movements such as socialism and nationalism. Based on a plethora of English-language documents, the course will introduce students to those problems of interaction between the general society and the Jewish minority that pointed toward the twentieth century transformation of modernity. In sum, the course will explore the fascinating response of Jews to modernity on political, societal, theological, and cultural levels."}, {"name": "Registration Requirements", "value": "No P/N option, attendance at first class is mandatory; all readings must be done before the date they are assigned"}, {"name": "Teaching Method", "value": "DiscussionLecture"}, {"name": "Evaluation Method", "value": "Class participationPaper, finalPapersThree response papers and active participation in class discussions (60%) and a final paper (40%)"}, {"name": "Class Materials (Required)", "value": "PDF formatted articles available on the Course Canvas<br/>Reading list includes Course Pack and The Jew in the Modern World ISBN 978-0195389067(available for purchase at Norris Center)"}, {"name": "Class Notes", "value": "No P/N option, attendance at first class is mandatory; all readings must be done before the date they are assigned<br/>HISTORY AREA OF CONCENTRATION: Europe"}], "path": "/class-descriptions/4610/WCAS/HISTORY/203-3/24988", "instructor": ["Yohanan   Petrovsky-Shtern"], "class_attributes": "Historical Studies Distro Area<br/><br/>Attendance at 1st class mandatory<br/><br/>", "id": "24988", "subject": "HISTORY"}]