[{"class_mtg_info": [{"meet_t": "We 2:00PM - 4:50PM", "meet_l": "Norris Center Big Ten Room 104"}], "school": "WCAS", "overview_of_class": "OVER a decade ago the New York Times magazine featured an article, the \"Opt -Out Revolution.\"  This revolution was made up of women with Ivy-League MBAs, JDs, and PhDs, women who decided to call it quits when they became mothers.  Expressing no regret over their decision to forsake career for motherhood, these women stuck to their guns about the \"feminist\" aspect of their decisions. Around the same time, another article proclaimed that 60% of polled Yale female undergraduates expected to pursue a career until age of 30 and then become full time parents.  Many claimed that they had witnessed the failure of a generation of feminist women (ie their mothers) to \"have it all.\"  Considering the cottage industry of \"back to the home\" and \"DIY\" books?novels, nonfiction, manuals, cookbooks, how-to kits, blogs, websites, etc.?notions of motherhood have changed in the wake of neo-liberalism. How can we understand these changes? Positioning the current debate about women, caregiving, parenthood, and career alongside its earlier waves, this course will examine what some have called the crisis in care work.  Paying close attention to the rhetoric of \"choice\" as it has informed feminist work engaged with this debate, our course will trace the genealogy of motherhood debates from its 1950s instantiation to the present.  Reading such classic second-wave authors as Betty Friedan, Gloria Steinem, Susan Brownmiller, Germaine Greer, Sylvia Plath, and Kate Millet, our course will offer an historical, sociological, literary, and economic background for the resurfacing of \"motherhood\" as an unmediated ideal. Key to our discussions will be the peripheralization of race and sexuality in these debates, and the correctives offered to this by the intervening years of 1970s black feminist scholarship. Our examination will of necessity include an investigation of masculinity and its corresponding invisibility in early discussions of parenting.", "qtr": "Winter 2016", "name": "Topics in Gender and Sexuality Studies", "title": "WCAS GNDR_ST 390-0-2 Topics in Gender and Sexuality Studies", "lmod": "1/9/16 6:48 PM (CT)", "section": "2", "instructors": [{"instructor_phone": "", "instructor_name": "Kate A Baldwin", "instructor_addr": ""}], "topic": "Motherhood and its Discontents", "course": "390-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "OVER a decade ago the New York Times magazine featured an article, the &quot;Opt -Out Revolution.&quot; This revolution was made up of women with Ivy-League MBAs, JDs, and PhDs, women who decided to call it quits when they became mothers. Expressing no regret over their decision to forsake career for motherhood, these women stuck to their guns about the &quot;feminist&quot; aspect of their decisions. Around the same time, another article proclaimed that 60% of polled Yale female undergraduates expected to pursue a career until age of 30 and then become full time parents. Many claimed that they had witnessed the failure of a generation of feminist women (ie their mothers) to &quot;have it all.&quot; Considering the cottage industry of &quot;back to the home&quot; and &quot;DIY&quot; books?novels, nonfiction, manuals, cookbooks, how-to kits, blogs, websites, etc.?notions of motherhood have changed in the wake of neo-liberalism. How can we understand these changes? Positioning the current debate about women, caregiving, parenthood, and career alongside its earlier waves, this course will examine what some have called the crisis in care work. Paying close attention to the rhetoric of &quot;choice&quot; as it has informed feminist work engaged with this debate, our course will trace the genealogy of motherhood debates from its 1950s instantiation to the present. Reading such classic second-wave authors as Betty Friedan, Gloria Steinem, Susan Brownmiller, Germaine Greer, Sylvia Plath, and Kate Millet, our course will offer an historical, sociological, literary, and economic background for the resurfacing of &quot;motherhood&quot; as an unmediated ideal. Key to our discussions will be the peripheralization of race and sexuality in these debates, and the correctives offered to this by the intervening years of 1970s black feminist scholarship. Our examination will of necessity include an investigation of masculinity and its corresponding invisibility in early discussions of parenting."}], "path": "/class-descriptions/4610/WCAS/GNDR_ST/390-0/23333", "instructor": ["Kate A Baldwin"], "class_attributes": "", "id": "23333", "subject": "GNDR_ST"}, {"class_mtg_info": [{"meet_t": "Tu 2:00PM - 4:50PM", "meet_l": "2122 Sheridan Rd Classroom 231"}], "school": "WCAS", "overview_of_class": "", "qtr": "Winter 2016", "name": "Topics in Gender and Sexuality Studies", "title": "WCAS GNDR_ST 390-0-3 Topics in Gender and Sexuality Studies", "lmod": "1/9/16 6:48 PM (CT)", "section": "3", "instructors": [{"instructor_phone": "", "instructor_name": "Katherine Anne Dugan", "instructor_addr": ""}], "topic": "Women and Religion in the U.S.", "course": "390-0", "enrl_requirement": "", "descriptions": [], "path": "/class-descriptions/4610/WCAS/GNDR_ST/390-0/27415", "instructor": ["Katherine Anne Dugan"], "class_attributes": "", "id": "27415", "subject": "GNDR_ST"}]