[{"school": "WCAS", "overview_of_class": "POLI SCI 395-0-20 Spring 2017 \"Race, Place, and Space in Democratic Politics\" Prof. Thomas Ogorzalek<br/>Racial and ethnic politics in the U.S. (and elsewhere) have often been understood in terms of spatial dynamics and composition: Does local diversity heighten or soften intergroup tension? What kinds of diversity create the most challenges for governance? These kinds of questions have become even more salient under conditions of demographic change and deepening political polarization. This seminar will encourage students to critically engage with and contribute to current debates and research on the relationship between political geography and intergroup relations, especially in the U.S.", "name": "Political Research Seminar", "section": "20", "location": "Scott Hall 107 Burdick Room", "topic": "Race, Place, and Space in Democratic Politics", "course": "395-0", "meeting_time": ["We 9:30AM - 12:20PM"], "path": "/class-descriptions/4660/WCAS/POLI_SCI/395-0/35421", "instructor": ["Thomas Kenneth Ogorzalek"], "class_attributes": "Department Majors Only<br/><br/>Juniors/Seniors Only<br/><br/>", "id": "35421", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "POLI SCI 395-0-21 Spring 2017 \"Environmental Justice\" Prof. Kimberly R. Marion Suiseeya<br/>As the global community has struggled to address global environmental problems including climate change, forest loss and degradation, and biodiversity loss, they have increasingly recognized the need for just solutions?solutions that not only recognize the disproportionate impacts that environmental policies may have on diverse stakeholders but solutions that actively seek to prevent and mitigate injustice. In other words, justice is increasingly understood as a necessary condition for effective environmental governance. <br/><br/>The course specifically considers the intersection of global environmental governance, international politics, and justice in the context of the global commons. With a particular focus on Indigenous Peoples, we will examine the production of justice and injustice across multiple scales of governance, including an assessment of the role of regimes, states, non-state actors, and transnational advocacy networks in response to global environmental challenges. The course is divided into three main parts: first, we begin with an examination of the problem of justice in global environmental governance drawing from empirical studies primarily in the political ecology literature. Then we move on to examining the institutions, actors, and architecture in global environmental governance that seek to address global environmental challenges from global to local contexts. In the third section of the course, we examine the explanations for and responses to justice and injustice in global environmental governance. Throughout the course we will direct our attention to these dynamics within two global commons: forests and biodiversity?commons that transcend scales of governance and are integral to the livelihoods of more than one billion people in the Global South. We draw from the literature in global environmental politics, conservation and development, and environmental justice.<br/><br/>Requirements include active class participation, short assignments, and an independent research project.", "name": "Political Research Seminar", "section": "21", "location": "Scott Hall 212", "topic": "Environmental Justice", "course": "395-0", "meeting_time": ["We 2:00PM - 4:50PM"], "path": "/class-descriptions/4660/WCAS/POLI_SCI/395-0/35422", "instructor": ["Kimberly Ruggles Marion Suiseeya"], "class_attributes": "", "id": "35422", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "POLI SCI 395-0-24 Spring 2017 \"Democacy, Autocracy, and Disorder: A New Global Era\" Prof. Richard Joseph <br/>This course will explore the evolution from the \"democratic euphoria\" of the early 1990s to critical analyses of democratization. It will examine debates on the \"democratic recession\" and upsurge of authoritarianism, and draw on analyses of various regions, especially Africa, Eastern Europe, and the Middle East.<br/>After the Cold War, the number of democracies in the world increased significantly. In recent years, that number has stagnated and, by some accounts, declined. The aim of the course is to achieve a deeper understanding of these dynamics and their implications. It will be achieved by reading and discussing the works of leading scholars of these processes. Students will write a research paper on a country or region of their choice, apply these frameworks of analysis, and probe further the questions raised in the readings and in class.<br/>The first course reading is a comprehensive article by Michael J. Boyle, \"Illiberalism Ascendant: Obama's Tragic Legacy.\" (Current History, Jan. 2017) It captures the travails of western democracy and the \"liberal international order\". These commitments ebbed and flowed during the last century and are now more contested.<br/>The collapse of the Soviet Union led to several years of Western ideological hegemony. The spread of jihadist insurgencies, the 9/11 destruction of the World Trade Center, prolonged wars in Iraq, Afghanistan, and Syria, and violent conflicts in many areas have shifted global priorities. Counter-terrorism, and the strengthening of political order and security, are now ascendant. Nationalist authoritarianism in China and Russia, the rise and collapse of the \"Arab Spring\", mass migrations, and religious sectarianism have contributed to a sense of \"global disarray\".<br/>In recent years, scholars such as Christopher Walker debated the \"renewed struggle between democracy and authoritarianism worldwide\" (Journal of Democracy, 2016). They acknowledged the reversal of trends just decades old now reflected in the rise of Illiberal regimes. They explored if liberal democracy was being eclipsed by new forms of authoritarianism, and whether the liberal international order was losing ground to an illiberal global order.<br/>The upsurge of authoritarian \"populist\" nationalism in the West is apparent in a number of countries. Political parties based on such movements are altering the composition of governments, including in \"Old Europe\". The Brexit vote in Britain, the election of Donald Trump as U.S. president, the defeat of a constitutional amendment and a reformist Prime Minister in Italy, and prospects of political upheavals in France and Germany signal the fracturing of the liberal democratic consensus.<br/>This course will also trace the commitment to \"democracy promotion\" from the presidency of George W. Bush to that of Barack Obama. It will examine how the dysfunction, and \"failure to deliver\", of western democracies have contributed to the erosion of their popular support. Essentials of political thought and practice, regarding democracy and autocracy, are again contested. Students will deepen their knowledge of these developments and, in their individual research, examine the ramifications in specific countries.", "name": "Political Research Seminar", "section": "24", "location": "Scott Hall 107 Burdick Room", "topic": "Democracy, Autocracy, & Disorder: The New Global E", "course": "395-0", "meeting_time": ["Mo 9:00AM - 11:50AM"], "path": "/class-descriptions/4660/WCAS/POLI_SCI/395-0/35423", "instructor": ["Richard A Joseph"], "class_attributes": "Juniors/Seniors Only<br/><br/>", "id": "35423", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "POLI SCI 395-0-25 Spring 2017 \"A Right to the Good Life? The Politics of Social Welfare\" Prof. Martha Wilfahrt<br/>For much of the 20th century, citizens have been understood as having a right to government-provided social services, such as schools, healthcare and roads. Yet this has not always been the case in the West and, elsewhere in the world, states have often failed to provide robust social services. As the extent of government service provision become increasingly contested in America and elsewhere, this seminar takes a global and historical perspective to the politics of social welfare. Why did states begin providing social services to their citizens and why has this been increasingly contested in recent years? What motivates politicians to deliver services across continents and regime type and what impact does this have not only for citizens' quality of life, but also their political engagement?<br/><br/>This seminar answers these questions in three parts, drawing on theoretical and empirical evidence from around the world. We will begin by evaluating the rise of the welfare state in Europe and North America and the ways in which this model has been challenged in recent decades. We will then look elsewhere in the world: why have alternative models arisen in some areas while elsewhere no welfare regime emerges at all, with services increasingly provided by private actors? Finally, the course will turn to how service provision is negotiated between citizens, politicians and informal actors across different regime types. The course concludes with a discussion of the intended and unintended political consequences of social welfare provision.", "name": "Political Research Seminar", "section": "25", "location": "University Hall 118", "topic": "A Right to the Good Life? The Politics of Social W", "course": "395-0", "meeting_time": ["Mo 3:30PM - 6:20PM"], "path": "/class-descriptions/4660/WCAS/POLI_SCI/395-0/35424", "instructor": ["Martha Anne Wilfahrt"], "class_attributes": "Juniors/Seniors Only<br/><br/>", "id": "35424", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "POLI SCI 395-0-26 Spring 2017 \"Political Violence\" Prof. Ana Arjona<br/>This seminar explores contemporary research on various forms of political violence, including civil war, ethnic conflict, terrorism, and genocide. The main goal of the course is to think critically about key questions on political violence such as the following: Why do people participate in civil wars? Why do insurgent organizations kill civilians? Why do citizens support violent political groups?Why do states kill their own citizens?Why do riots often happen before elections? By thinking about political violence students will learn how to ask questions about political phenomena, what is the role of theory, and how we rely on empirical evidence to make inferences. The seminar will emphasize the importance of critically examining the internal consistency of arguments as well as what can (and cannot) be inferred based on available evidence.", "name": "Political Research Seminar", "section": "26", "location": "Scott Hall 201 Ripton Room", "topic": "Political Violence", "course": "395-0", "meeting_time": ["Th 9:30AM - 12:20PM"], "path": "/class-descriptions/4660/WCAS/POLI_SCI/395-0/36764", "instructor": ["Ana Maria Arjona"], "class_attributes": "Juniors/Seniors Only<br/><br/>", "id": "36764", "subject": "POLI_SCI"}]