[{"class_mtg_info": [{"meet_t": "MoWe 12:30PM - 1:50PM", "meet_l": "University Hall 121"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "33393", "title": "WCAS HISTORY 381-1-20 History of Modern China: Late Imperial China, 1600-1911", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "33393", "instructors": [{"instructor_phone": "", "instructor_name": "Mary B Young", "instructor_addr": ""}], "associated_classes": [{"component": "DIS", "room": "TBA", "meeting_time": "TBA"}], "topic": "", "course": "381-1", "descriptions": [{"name": "Overview of class", "value": "History 381-1 is a survey of Chinese history from the &quot;second commercial revolution&quot; (sixteenth through eighteenth centuries) to the fall of the imperial order in 1912. The course nevertheless focuses primarily on the late eighteenth and the nineteenth centuries. The course is basically chronological, but within this framework we will explore the themes of commercialization, social transformation, and the challenges of European, American, and Japanese imperialism. We also will study several &quot;modern transformations&quot; which begin to occur during the late imperial period: the transformation of the local elite, of traditional women's lives, of political culture, and of industrial production."}, {"name": "Teaching Method", "value": "Lecture (with discussion)"}, {"name": "Evaluation Method", "value": "Participation in discussion; one short, analytical essay; one midterm exam with short essay questions; and one cumulative final essay examination."}, {"name": "Class Materials (Required)", "value": "READING LIST:<br/>Jonathan D. Spence, The Search for Modern China (Third Edition), ISBN-13: 978-0393934519<br/>Jonathan D. Spence, The Death of Woman Wang (Penguin Books; Reprint Edition, 1998), ISBN-13: 978-0140051216<br/>Philip A. Kuhn, Soulstealers: The Chinese Sorcery Scare of 1978 (Harvard, 2006), ISBN-13: 978-0674821521<br/>Benjamin I. Schwartz, In Search of Wealth and Power: Yen Fu and the West (Harvard East Asian Series, 1964), ISBN-13: 978-0674821521<br/>Paul Cohen, History in Three Keys: The Boxers as Event, Experience, and Myth (Columbia, 1997), ISBN-13: 978-0231106511"}, {"name": "Class Notes", "value": "HISTORY AREA OF CONCENTRATION: Asia/Middle East"}], "lmod": "4/3/16 8:03 PM (CT)", "subject": "HISTORY"}]