[{"class_mtg_info": [{"meet_t": "MoWeFr 9:00AM - 9:50AM", "meet_l": "Technological Institute L158"}], "school": "MEAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "30445", "title": "MEAS BMD_ENG 395-0-20 Topics in Biomedical Engineering", "class_attributes": "", "section": "30445", "instructors": [{"instructor_phone": "847/491-7849", "instructor_name": "Tai Te   Wu", "instructor_addr": "Tech Institute, Room E348"}], "topic": "EngDsgn Therapeutic Antibodies", "course": "395-0", "descriptions": [{"name": "Overview of class", "value": "Following the development of genetic engineering, protein engineering takes a step further to improve the functions of existing human proteins and enzymes by selective modification of their active sites. Therapeutic antibodies illustrate this engineering process in detail. They are approved by FDA mostly for the treatment of cancers and autoimmune diseases. Mouse antibodies are first modified by protein engineering to give rise to chimeric therapeutic antibodies. They are then further improved to produce humanized mouse therapeutic antibodies. Finally complete human therapeutic antibodies are engineered. Detailed understanding of protein folding is essential.<br/><br/>The vast amount of information contained in the amino acid and nucleotide sequences of all organisms remains to be thoroughly analyzed. Simple engineering analysis has provided the information to locate the active sites of antibodies. They are known as complementarity determining regions consisting of six short segments of peptides. Passive immunization with designed therapeutic antibodies can thus selectively attack specific cancer cells. The first of such FDA approved antibodies is against a surface molecule CD20 on B cell lymphomas. This approach of immunotherapy has prolonged live expectancies of these cancer patients. Although only about thirty therapeutic antibodies have been approved by FDA, several hundred of them are in the pipeline of development.<br/><br/>Juniors and seniors in biomedical engineering take it. This course is appropriate for all students, both undergraduate and graduate, interested in the application of engineering methods to biological problems with ultimate use in the medical field."}, {"name": "Learning Objectives", "value": "FDA approved list of therapeutic antibodies<br/> Structures of antibodies<br/> Functional sites of antibodies<br/> Location of complementarity determining regions<br/> Construction of chimeric therapeutic antibodies<br/> Construction of humanized mouse therapeutic antibodies<br/> Production of completely human therapeutic antibodies<br/> Detailed protein folding of complementarity determining regions"}, {"name": "Class Notes", "value": "Please check the BME course page."}], "lmod": "2/9/17 6:34 PM (CT)", "subject": "BMD_ENG"}]