[{"class_mtg_info": [{"meet_t": "Tu 2:00PM - 5:20PM", "meet_l": "Annie May Swift Hall 109"}], "school": "SoC", "overview_of_class": "This class explores textual analysis in relation to screen studies.  We examine the development of ideas about texts, textuality, and analysis in the context of Euro-American?especially French?cine-semiotics in the 1970s; the methodological self-consciousness of early textual analysis; and the limits and possibilities of an \"anti-interpretive\" analytic position.  We also consider the vicissitudes of textual analysis in relation to questions of media history, theory, ideology, and reception.  Some of the guiding questions for the class:  What was textual analysis?  What is it (or could it be) now?  What is the object of analysis in textual analysis?  How do you do things with texts?", "qtr": "Winter 2016", "name": "Textual Analysis", "title": "SoC RTVF 422-0-20 Textual Analysis", "lmod": "1/9/16 6:39 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Miriam B White", "instructor_addr": ""}], "topic": "", "course": "422-0", "enrl_requirement": "Enrollment Requirements: Reserved for RTVF Graduate Students<br/>Add Consent: Instructor Consent Required<br/>", "descriptions": [{"name": "Overview of class", "value": "This class explores textual analysis in relation to screen studies. We examine the development of ideas about texts, textuality, and analysis in the context of Euro-American?especially French?cine-semiotics in the 1970s; the methodological self-consciousness of early textual analysis; and the limits and possibilities of an &quot;anti-interpretive&quot; analytic position. We also consider the vicissitudes of textual analysis in relation to questions of media history, theory, ideology, and reception. Some of the guiding questions for the class: What was textual analysis? What is it (or could it be) now? What is the object of analysis in textual analysis? How do you do things with texts?"}, {"name": "Class Materials (Required)", "value": "Required Texts: Roland Barthes S/Z; (many) other required readings will be available as a reading packet."}], "path": "/class-descriptions/4610/SoC/RTVF/422-0/22329", "instructor": ["Miriam B White"], "class_attributes": "", "id": "22329", "subject": "RTVF"}]