[{"class_mtg_info": [{"meet_t": "Tu 3:30PM - 6:20PM", "meet_l": "Scott Hall 212"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "37927", "title": "WCAS POLI_SCI 424-0-20 Public Opinion, the Media, and Democracy", "class_attributes": "", "section": "37927", "instructors": [{"instructor_phone": "847 4912638", "instructor_name": "Benjamin I Page", "instructor_addr": "601 University Place"}], "topic": "", "course": "424-0", "descriptions": [{"name": "Overview of class", "value": "This course is concerned with public opinion, the mass media, and the role of the public in making U.S. foreign and domestic policy. Topics include the micro foundations of public opinion, the nature of collective public opinion (especially policy preferences), the influence of public opinion on policy, leadership or manipulation of opinion, and the quality of political information made available to the public through the media, including any systematic biases or deficiencies. Most readings deal with the United States but the ideas are intended to be more widely applicable. Research papers concerning any country or locality are welcome. <br/>The course is taught as a research seminar, involving extensive literature review and a substantial research paper on any relevant topic of the student's choice. This paper should be of sufficient quality to lead to publication and/or to become part of a 2nd year paper, thesis, or dissertation. Coordination with work for other classes is encouraged. Two very short (500 word) papers on the readings are also required, as is active participation in class discussion based on careful reading of the course materials. At the first session students will volunteer to help lead three or four future class discussions, which may be related to their main research papers. No examinations are given."}, {"name": "Class Materials (Required)", "value": "Tentative:<br/>Erikson and Tedin, American. Public Opinion <br/>Bishop, The Illusion of Public Opinion <br/>Page and Shapiro, The Rational Public <br/>Bartels, Unequal Democracy<br/>Bennett, Lawrence &amp; Livingston, When the Press Fails <br/>Graber (ed.), Media Power in Politics (&quot;MPIP&quot; in syllabus)<br/>Page and Gilens, &quot;Democracy in America? What Has Gone Wrong and What We Can Do About It&quot; (Draft copies will be available in Scott Hall for Page/Gilens book) 9It cannot be purchased at the bookstore; will not be published until Fall 2017"}], "lmod": "2/9/17 6:45 PM (CT)", "subject": "POLI_SCI"}]