[{"school": "SoC", "overview_of_class": "", "name": "Topics in Film/Video/Audio Production", "section": "20", "location": "Block Pick-Laudati Auditorium", "topic": "True Crime Production", "course": "379-0", "meeting_time": ["TuTh 1:00PM - 2:50PM"], "path": "/class-descriptions/4660/SoC/RTVF/379-0/34654", "instructor": ["Spencer W Parsons"], "class_attributes": "Prerequisites apply, see description<br/><br/>", "id": "34654", "subject": "RTVF"}, {"school": "SoC", "overview_of_class": "-Overview of class (Generally describe the class here. Include assignment and project information, if desired.)<br/>Students will collectively produce a sitcom that was written in a fall writing course. This course is by permission only and students were selected through a crew petition held by the student executive producers of the sitcom. All students are members of the crew.<br/><br/>-Registration Requirements (Pre-Reqs)<br/>RTVF 190<br/><br/>-Learning Objectives<br/>The successful production of the pilot episode of a new student-written series.<br/><br/>-Teaching Method<br/>Screenings, discussion, and in-class workshop of films.<br/><br/>-Evaluation Method<br/>Students will be graded on professionalism and the strength of the finished episode.", "name": "Topics in Film/Video/Audio Production", "section": "22", "location": "Annie May Swift Hall 109", "topic": "Sitcom Production", "course": "379-0", "meeting_time": ["We 9:00AM - 11:50AM"], "path": "/class-descriptions/4660/SoC/RTVF/379-0/34656", "instructor": ["Erik Steven Gernand"], "class_attributes": "Prerequisites apply, see description<br/><br/>", "id": "34656", "subject": "RTVF"}, {"school": "SoC", "overview_of_class": "RTVF 379 Fractured/Anti-/Alternative Narratives<br/><br/>An introduction to various narrative forms (e.g. modernist, art-cinema, minimalist, fractured tandem, parallel, micro-fiction, episodic, environmental, ensemble, et al) that scramble notions of traditional \"hero centered\" three-act structure and posit alternate world views to narrative causality. The class will view and analyze a range of representative films with accompanied readings (e.g. Julie Dash's Daughters of the Dust, Jean Luc Godard's Hail Mary, Luis Bunuel's Un Chien Andalou, Lindsay Anderson's The White Bus, Leos Carax's Holy Motors, Michael Haneke's Code Unknown, Jane Campion's Peel, Ingmar Bergman's Persona, Lynne Ramsay's Small Deaths, Apichatpong Weerasethakul's Tropical Malady, Barry Jenkin's Moonlight, et al). Students will then write and create final short film projects positing their own narrative strategies working either as individuals or in pairs. <br/><br/>Warning: Please research the list of sample films before taking the class. Most films screened are counter-cultural works which were designed to provoke a strong emotional response. Many contain what might be for some sensitive viewers disturbing depictions of violence and sexual content. Most are chosen because they are recognized by the field as exceptional works for narrative experimentation. You are encouraged to respond and critique each filmmaker's approach to discover more about your personal voice as an artist.<br/><br/>Evaluation Method<br/><br/>Attendance/discussion participation, one short written director's manifesto, one short script and final completed short film.<br/><br/>Registration Requirements<br/><br/>RTVF 190<br/><br/>Class Materials (Required)<br/><br/>Alternative Scriptwriting: Beyond the Hollywood Formula by Ken Dancyger and Jeff Rush, Focal Press, ISBN-13 978-0240522463 Edition <br/><br/>Media production expendables necessary for completion of dramatic or documentary project, should include hard drive for your media. A small stipend will be provided for this class by the RTVF department.", "name": "Topics in Film/Video/Audio Production", "section": "23", "location": "Helmerich Auditorium", "topic": "Fractured/Anti/Alternative Narratives", "course": "379-0", "meeting_time": ["Tu 1:00PM - 2:50PM", "Th 1:00PM - 2:50PM"], "path": "/class-descriptions/4660/SoC/RTVF/379-0/34657", "instructor": ["Kyle Richard Henry"], "class_attributes": "Prerequisites apply, see description<br/><br/>", "id": "34657", "subject": "RTVF"}]