[{"class_mtg_info": [{"meet_t": "Mo 3:00PM - 5:50PM", "meet_l": "Sound Tank Comp Lab - RTVF FSL"}], "school": "SoC", "enrl_requirement": "Enrollment Requirements: Pre-requisite: Students must have taken, be currently enrolled, or concurrently registered for RTVF 190 for the upcoming quarter.", "qtr": "Fall 2016", "name": "14329", "title": "SoC RTVF 373-0-20 Topics in Sound", "class_attributes": "Prerequisites apply, see description<br/><br/>", "section": "14329", "instructors": [{"instructor_phone": "", "instructor_name": "Stephan Michael Moore", "instructor_addr": ""}], "topic": "Interactive Sound for Live Events", "course": "373-0", "descriptions": [{"name": "Overview of class", "value": "This class will explore strategies for the live creation and performance of electronic sound &amp; music, with a focus on the software environment Ableton Live. Topics include sampling, beat programming, basic audio effects manipulation and creation (using Max for Live), basic algorithmic composition, live audio production concepts, performance techniques, and collaborative performance. The course will collaborate with Eric Patrick's class &quot;Video Mixing for Live Events&quot; throughout the quarter to create a final showcase of work.<br/>Prerequisite 190 or permission of instructor<br/><br/>Learning Objectives:<br/>Upon completion of the course, students should have a top-to-bottom understanding of how to construct, prepare and execute a performance of improvised or structured electronic sound &amp;/or music, applicable to a number of contexts: solo performances, work in dance or theater productions, in conjunction with live visual performers, and a range of novel collaborative situations. <br/><br/>Evaluation method:<br/>Class participation, 3 to 5 smaller assignments, mid-term in-class performance, and final collaborative performance.<br/><br/>Class notes:<br/>Prerequisite: 190 or permission of instructor<br/>Required materials: USB drive, deposit required for studio keys"}], "lmod": "10/30/16 6:50 PM (CT)", "subject": "RTVF"}]