[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "Kresge Centennial Hall 2-410"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "22650", "title": "WCAS LEGAL_ST 394-0-20 Professional Linkage Seminar", "class_attributes": "", "section": "22650", "instructors": [{"instructor_phone": "", "instructor_name": "Seth Adam Meyer", "instructor_addr": "seth.meyer@kirkland.com"}], "topic": "", "course": "394-0", "descriptions": [{"name": "Overview of class", "value": "Legal Studies 394-0-20 &quot;Lawyering: Education and Practice&quot;, Seth Meyer, Winter 2017<br/><br/>Attorneys are central to American life and popular culture, but the profession is undergoing dramatic change. For years, the supply of lawyers has vastly outstripped the demand for legal jobs and the resulting lawyer bubble has grown. Meanwhile, those who land law jobs have different challenges: recent surveys report many attorneys' growing disenchantment with their work and dissatisfaction with their lives. This seminar will examine the profession's multidimensional crisis. What changes occur in attorneys, both individually and systemically, emerging from law schools and finding their roles in the legal realm? Why is working within the most lucrative big firms now regarded by many as the pinnacle of private practice? What other options are available? It will explore life after law school, examining the disparate places law graduates might find themselves. The course invites prospective law students to consider their potential places, as individual lawyers, in what remains a noble profession. It also invites those students in other undergraduate disciplines who may be curious about trajectories open to them in this post-graduate academic and, ultimately, career field."}, {"name": "Learning Objectives", "value": "By the end of the course, students will be expected to have context about the legal profession and the place of lawyers in American society. They will be expected to know about the education and training lawyers experience, and about the diverse"}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "The course grade is based on three short papers, reading responses, and class discussion. Because efforts to improve always matter, each paper will carry increasingly greater weight as the quarter progresses: 15% for the first; 25% for the second; 30% for the third. Class discussion will count for 20% of the final grade; here, too, improvement always helps. Each student should arrive at class fully prepared to discuss the assigned readings, videos, and films for the day. To encourage the full preparedness of reading and visual material for each lecture, reading responses will be distributed in class four times throughout the quarter. Students will be asked to write a short reading response (approximately a page) about the assigned material; collectively, these reading responses will constitute the final 10% of the course grade, at 2.5% apiece."}, {"name": "Class Materials (Required)", "value": "? Steven J. Harper, The Lawyer Bubble - A Profession in Crisis (Basic Books, 2013) <br/>? Scott Turow, One L (2010 Penguin trade paperback edition)"}], "lmod": "12/25/16 7:02 PM (CT)", "subject": "LEGAL_ST"}]