[{"class_mtg_info": [{"meet_t": "Th 9:30AM - 12:20PM", "meet_l": "Annenberg Hall G29"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "24755", "title": "WCAS GBL_HLTH 390-0-22 Special Topics in Global Health", "class_attributes": "No Freshmen<br/><br/>", "section": "24755", "instructors": [{"instructor_phone": "", "instructor_name": "Peter Andrew Locke", "instructor_addr": "1812 Hinman Avenue"}], "topic": "Health and Humanitarianism", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "This course draws on perspectives from anthropology and related social scientific fields to provide a critical overview of contemporary medical humanitarianism in historical, cultural, and socioeconomic context. Key questions that we will consider include: How and why has the health of individuals and communities adversely affected by poverty, marginalization, war, and disaster become the object of a wide range of contemporary discourses and practices of international intervention? What are the politics, historical roots, and cultural specificities of today's boom in interest in medical humanitarian work and institutions? How does medical humanitarianism relate to and diverge from other modes of international aid and development? How is it connected to today's global political economy, and what political, social, and institutional effects, for good or for ill, do medical humanitarian projects leave in their wake?<br/> <br/>Through close readings of classic and contemporary social theory, ethnographic accounts, and research on health-focused aid and development initiatives from across the social sciences, this course will encourage you to build your own critical perspective on medical humanitarian thinking and practice anchored in the history of the field and in engagement with the complexities of real-world situations. Case studies explore the work of organizations like Doctors Without Borders; post-war/disaster interventions in Haiti and elsewhere; and the global response to the Ebola epidemic in West Africa."}, {"name": "Registration Requirements", "value": "No freshmen allowed. Pre-registration for Global Health Studies Minor only. Registration open to other students after pre-registration."}, {"name": "Class Materials (Required)", "value": "Haiti After the Earthquake; Medical Humanitarianism: Ethnographies of Practice (Paul Farmer)<br/>The Idealist: Jeffrey Sachs and the Quest to End Poverty (Nina Munk)<br/>Regarding the Pain of Others (Susan Sontag)"}], "lmod": "1/9/16 6:47 PM (CT)", "subject": "GBL_HLTH"}]