[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Parkes Hall 223"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "33444", "title": "WCAS ENGLISH 387-0-20 Studies in Literature and Commerce", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "33444", "instructors": [{"instructor_phone": "", "instructor_name": "Hosanna Grace Krienke", "instructor_addr": ""}], "topic": "Bodies at Work: Lit &amp; the Econ in 19th C Brit", "course": "387-0", "descriptions": [{"name": "Overview of class", "value": "Witnessing the massive economic and cultural changes caused by the Industrial Revolution, the Victorians grappled with several paradigm shifts surrounding how human bodies perform labor. Many modern Western norms of work were negotiated (and hotly contested) in this period, including the regulation of factory working-hours, the rise of paid sick leave and leisure time, and the influx of middle-class women into the workforce. In this course, you will learn how to analyze narrative in order to describe how nineteenth-century conceptions of labor functioned as a form, that is, as a structure that actively shaped how Victorians apprehended their own bodies, minds, and lifespans. We will ask: How do patterns of work form (or deform) bodies and environments? What kinds of labor were considered appropriate or &quot;healthy&quot; for different kinds of bodies? And, how do we as readers interact with themes of labor when these novels were designed to be read for leisure? You will also have the opportunity to explore how this history informs current labor controversies such as minimum wage, parental leave, and right-to-work legislation. By the end of this course, you will learn to discuss such topics with an interdisciplinary attention to narrative form, historical precedents, and theories of embodiment."}, {"name": "Teaching Method", "value": "Seminar Discussion."}, {"name": "Evaluation Method", "value": "Class participation, two papers, and one formal presentation on a modern labor controversy."}, {"name": "Class Materials (Required)", "value": "Elizabeth Gaskell's Mary Barton (1848), Charles Dickens, Great Expectations (1860-61), George Moore's Esther Waters (1894), Thomas Hardy's Jude the Obscure (1895), and essays by Thomas Carlyle, William Morris, John Ruskin, and Charles Engel."}], "lmod": "2/21/17 6:46 PM (CT)", "subject": "ENGLISH"}]