[{"class_mtg_info": [{"meet_t": "We 2:00PM - 4:50PM", "meet_l": "Swift Hall 210"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Prerequisite: Students must complete Psych 205-0 before taking this course.", "qtr": "Winter 2017", "name": "25593", "title": "WCAS PSYCH 381-0-20 Children &amp; the Law", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>Attendance at 1st class mandatory<br/><br/>", "section": "25593", "instructors": [{"instructor_phone": "847/491-3652", "instructor_name": "Sara Cantonia Broaders", "instructor_addr": "Swift 243, 2029 Sheridan Road"}], "topic": "", "course": "381-0", "descriptions": [{"name": "Overview of class", "value": "This course will address a variety of issues pertaining to children's involvement in the legal system in roles such as decision-makers, witnesses, victims, and perpetrators. Among the topics we may cover are:<br/>? the legal status, rights, and responsibilities of juveniles<br/>? children and custody proceedings<br/>? physical and sexual abuse of children <br/>? children as witnesses<br/>? juvenile culpability as perpetrators<br/>? development of criminal behavior<br/>? the juvenile justice system and developmental psychology<br/>? treatment and punishment of juvenile offenders"}, {"name": "Registration Requirements", "value": "Psych 205-Research Methods in Psychology AND Psych 218-Developmental Psychology"}, {"name": "Teaching Method", "value": "Discussion-based seminar, some very short lectures, films, group presentations"}, {"name": "Evaluation Method", "value": "Participation in discussion, weekly written discussion questions, finding and summarizing empirical research studies, and one 10-15 page independent research proposal with literature review."}, {"name": "Class Materials (Required)", "value": "We will use a variety of journal articles, law review articles, legal cases, and book chapters from the fields of psychology and law. <br/><br/>Students will most likely need to purchase two books in addition to the assembled readings: <br/>1.) Ayers, W. (1997). A kind and just parent: The children of juvenile court. Boston, MA: Beacon. [ISBN: 0807044032, approximate cost $17.00] <br/><br/>2.) Scott, E.S., &amp; Steinberg, L. (2008). Rethinking juvenile justice. Cambridge, MA: Harvard. ISBN: 978-0-674-05746-3."}], "lmod": "12/25/16 7:06 PM (CT)", "subject": "PSYCH"}]