[{"school": "WCAS", "overview_of_class": "This seminar explores theoretical approaches to the problems of embodiment/materiality/affect. One aim of the course is to examine various methodological approaches to embodiment, materiality and affect, making use of sociology and philosophy (Pierre Bourdieu, Maurice Merleau-Ponty, Spinoza, Massumi). The second and closely related aim is to situate bodies in time and place, that is, in history. Here we look to the particular circumstances that shaped the manner in which historical actors experienced their bodies in the Christian west (Peter Brown, Caroline Bynum, Mary Carruthers, Michel de Certeau, Michel Foucault). Ultimately, we will be examining theoretical tools while we put them to work. The goal: how to use these thinkers to write more dynamic, creative, interesting scholarship?", "name": "Topics in Gender Studies", "section": "20", "location": "Harris Hall L40", "topic": "Studies in the History of Religions: Embodiment/Ma", "course": "490-0", "meeting_time": ["Mo 11:00AM - 1:50PM"], "path": "/class-descriptions/4640/WCAS/GNDR_ST/490-0/12229", "instructor": ["J Michelle   Molina"], "class_attributes": "", "id": "12229", "subject": "GNDR_ST"}, {"school": "WCAS", "overview_of_class": "This discussion-oriented seminar will provide introductory insights into some of the many intersections between music and ideas of gender and sexuality during the late sixteenth-, seventeenth- and early eighteenth centuries. We will consider late twentieth- and early twenty-first century histories and theories of gender and sexuality, particularly of the periods in question, as well as key ideas that are especially applicable to early modern constructs of the body, selfhood, and gender identity, such as cross-dressing, castration, and forms of desire. The course is open to any graduate student with previous course work on the early modern era OR gender & sexuality studies, in any subject or department. In true seminar style, class meetings will consist of discussion of shared material plus presentations by individual students based on their particular interests within each set of topical parameters. It is hoped that, collectively, we can answer some of the open questions about gender and sexuality of the early modern era by using musical evidence, one of the fields most likely to be overlooked by professional scholars of the histories of gender and sexuality. Other evidence will come from the histories of philosophy and medicine, visual arts, religious history, and material culture, especially as they intersect with early modern ideas of music.", "name": "Topics in Gender Studies", "section": "21", "location": "RCMA 1-176", "topic": "Music and Gender in the Early Modern Era", "course": "490-0", "meeting_time": ["We 2:00PM - 4:50PM"], "path": "/class-descriptions/4640/WCAS/GNDR_ST/490-0/12230", "instructor": ["Linda P Austern"], "class_attributes": "", "id": "12230", "subject": "GNDR_ST"}, {"school": "WCAS", "overview_of_class": "This course addresses a series of debates in anthropology about ?nature' and legitimacy in a variety of contexts that tend to be overlaid by heavy regulatory, if not bureaucratic, structures: sociocultural, political, biological, technological, legal, religious, economic. For this complex set of issues, there could be no better focus than the reproduction of society, especially that of children, across time and place. An explicit focus on reproduction and regulation makes clear connections to the core of the classic sociocultural anthropology canon. However, its application to contemporary debates in areas such as the technologies of birth control and assisted/biogenetic reproduction, international migration and ?integration,' human rights legislation, and the conveyance legitimacy across nations, generations and monetary currencies - all these offer rich new promise.", "name": "Topics in Gender Studies", "section": "22", "location": "ANTHRO Sem Rm 104 - 1810 Hinmn", "topic": "Reproduction & It's Regulation Across Time", "course": "490-0", "meeting_time": ["Tu 6:30PM - 9:00PM"], "path": "/class-descriptions/4640/WCAS/GNDR_ST/490-0/17136", "instructor": ["Caroline H Bledsoe"], "class_attributes": "", "id": "17136", "subject": "GNDR_ST"}]