[{"class_mtg_info": [{"meet_t": "Tu 6:15PM - 9:15PM", "meet_l": "Wieboldt Hall 417"}], "school": "SCS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "27539", "title": "SCS BIOL_SCI 318-CN-14 Advanced Human Physiology", "class_attributes": "", "section": "27539", "instructors": [{"instructor_phone": "", "instructor_name": "Charles Neil Rudick", "instructor_addr": ""}], "topic": "", "course": "318-CN", "descriptions": [{"name": "Overview of class", "value": "Advanced human physiology builds on the concepts covered in BIOL SCI 217, focusing on the body as an integrated set of systems. Our task will be to construct a global view of the body, its systems, and the many processes that keep the systems working. The course emphasizes an integrated approach to studying all major organ systems including neural, autonomic/somatic motor, endocrine, cardiovascular, respiratory, renal, digestive, immune, and reproductive physiology. In addition to integration, each lecture will focus on the clinical relevance of the organ system that will include abnormal function, disease states and medications used to bring the system back to normal functioning. The course will be a mixture of seven in-class sessions and four online sessions where the students will study the session material at home. <br/><br/>This course was formerly BIOL SCI 335-B: Human Physiology II. Students who have taken BIOL SCI 335-B should not register for this course."}, {"name": "Registration Requirements", "value": "Prerequisite: BIOL SCI 210-C, 217, or 335-A"}, {"name": "Learning Objectives", "value": "At the end of this course, students will be able to:<br/>? Identify the homeostatic relationship between organ systems and the communication strategies used to maintain homeostasis within the system and human body.<br/>? Understand the physiologic mechanisms of homeostatic compensation specific to the organ system and interactions with other organ systems.<br/>? Describe how failed attempts to maintain homeostasis can lead to abnormal function and disease states.<br/>? Recognize the medications used to restore normal function and alleviate disease state"}, {"name": "Teaching Method", "value": "This course consists of a three-hour lecture. The lecture portion will consist of some lecture, some discussion, some group problems/activities, and some video segments. Class meetings will emphasize important and difficult concepts in physiology or will be used as a venue for discussion, and thus will cover the most important part of the material you are expected to learn."}, {"name": "Evaluation Method", "value": "Final exam, midterm exam, quizzes, presentation, class participation, attendance."}, {"name": "Class Materials (Required)", "value": "Human Physiology: an integrated approach <br/>7th edition, copyright 2015<br/>Author: Dee Unglaub Silverthorn<br/>ISBN-13: 978-0321750075<br/>Publisher: Pearson"}], "lmod": "12/29/16 6:49 PM (CT)", "subject": "BIOL_SCI"}]