[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Technological Institute M166"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-requisite: Students must have completed Neuroscience 202 or Biological Sciences 311 to enroll in this course or instructor consent.<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Winter 2016", "name": "20876", "title": "WCAS NEUROSCI 322-0-1 Systems and Computational Neuroscience", "class_attributes": "", "section": "20876", "instructors": [{"instructor_phone": "847/467-0475", "instructor_name": "Daniel A Dombeck", "instructor_addr": "2409 Pancoe"}], "topic": "", "course": "322-0", "descriptions": [{"name": "Overview of class", "value": "Have you ever wondered how networks of neurons in the brain process and store information? How can seemingly simple network units, like single neurons, combine with each other to form small groups capable of rich computations and behaviors such as integration, feature detection, self-organization, and information storage? We will take a computational approach to answering these questions. We will cover experimental results and then develop computational models that can reproduce the complex phenomenon and provide a more detailed understanding of them. By modeling single neurons as network units and then connecting the units together in specific patterns, we will show how complex activity patterns can arise. The course will begin with a short introduction reviewing the basics of neuroscience, we will then learn the Matlab programming language and review basic mathematical principles as they relate to modeling neural networks. Then we will apply these tools to model and understand the following phenomena: reflex responses, insect flight central pattern generator (CPG), Hebbian learning networks, memory recall (and forgetting)."}, {"name": "Registration Requirements", "value": "Prerequisites: 202 or BIOL SCI 311 or consent of instructor; some programming experience preferred."}, {"name": "Learning Objectives", "value": "1. Obtain a basic understanding of the structure and function of single neurons.<br/>2. Learn to use Matlab. <br/>3. Learn how to model groups of connected neurons in Matlab.<br/>4. Understand how systems of simple units/neurons, when connected together in interesting ways, can perform complex computations.<br/>5. Use your understanding of neural systems to appreciate specific examples of current systems neuroscience research and understand current experimental approaches that are being used to test computational models of neural systems."}, {"name": "Teaching Method", "value": "Lecture"}, {"name": "Evaluation Method", "value": "Midterm, Final"}, {"name": "Class Materials (Required)", "value": "Tutorial on Neural Systems Modeling by T. Anastasio. Sinauer Publishing, ISBN: 978-0-87893-339-6"}, {"name": "Class Notes", "value": "WCAS Distro Area I - Natural Sciences"}], "lmod": "1/9/16 6:51 PM (CT)", "subject": "NEUROSCI"}]