[{"class_mtg_info": [{"meet_t": "Tu 3:00PM - 5:20PM", "meet_l": "University Library 4722"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "12207", "title": "WCAS FRENCH 393-0-20 Foreign Language Teaching: Theory and Practice", "class_attributes": "", "section": "12207", "instructors": [{"instructor_phone": "847/467-3685", "instructor_name": "Patricia L Scarampi", "instructor_addr": "1860 Campus Drive, Crowe Hall #2-117"}], "topic": "", "course": "393-0", "descriptions": [{"name": "Overview of class", "value": "The course provides a foundation in approaches, methods, and materials for the teaching of French from the perspectives of Second Language Acquisition research. The theoretical background will be applied to the teaching of the four skills such as speaking, listening, reading and writing and the teaching of culture to help students develop their own philosophy of foreign language teaching. Students will acquire the pedagogical tools and metalinguistic awareness that they need to become successful language instructors."}, {"name": "Registration Requirements", "value": "Senior and/or 300 level advanced class or consent of instructor"}, {"name": "Learning Objectives", "value": "For both graduate and undergraduate students:<br/>- think critically about current research in Second Language Acquisition and Applied Linguistics<br/>- gain an understanding of the current context of second-language teaching <br/>- examine the processes involved in learning a second language and its cultures<br/>- identify and analyze well designed language learning activities that engage the learners in communicative language learning tasks <br/>- develop detailed lesson plans<br/><br/>For graduate students:<br/>- reflect about themselves as learners and teachers<br/>- use the rationale behind current methods and teaching practices to inform their own teaching practice <br/>- convey to others a coherent and well-articulated theory based teaching philosophy"}, {"name": "Teaching Method", "value": "Lecture, discussion and students presentations."}, {"name": "Evaluation Method", "value": "Participation, assignments and presentations."}, {"name": "Class Materials (Required)", "value": "Brandl, Klaus. (2008) Communicative Language Teaching in Action: Putting Principles to Work. Prentice Hall."}], "lmod": "10/30/16 7:05 PM (CT)", "subject": "FRENCH"}]