[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "University Hall 122"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "33913", "title": "WCAS GNDR_ST 341-0-21 Transnational Perspectives on Gender and Sexuality", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "33913", "instructors": [{"instructor_phone": "", "instructor_name": "Mitali   Thakor", "instructor_addr": ""}], "topic": "Risky Borders: Sex, Race, and Techniques of Border", "course": "341-0", "descriptions": [{"name": "Overview of class", "value": "This course critically analyzes the power dynamics of migration in the 21st century. Class texts will explore ?risk' through case studies of militarization and refugees; child trafficking and forced migration; the politics of commercial surrogacy; and international development and labor exploitation. Drawing on readings from the anthropology of development, international studies, and feminist technoscience studies, students will discuss and question discourses of ?globalization' that imagine a world of easy connections and flows, digitally and physically. We engage with multiple media forms, from academic texts, to films like Children of Men and the poetry of Warsan Shire, to explore how migration stories are gendered and racialized, with particular agencies and vulnerabilities, perils and pleasures. By understanding the techniques and technologies of bureaucracy, through examples like airport facial recognition software, so-called ?smart border walls,' and US counter-terrorism initiatives, students will also assess expert cultures dictating migration and development futures."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "AttendanceClass participationGroup projectPaper, finalWriting assignmentsBy the end of the semester students will be able to think critically about the relationships between migration policies, border control technologies, and gender, sexuality, race, and knowledge production.<br/>Students will be evaluated based on the following criteria: <br/>Attendance, Preparation, &amp; Participation - 20% <br/>Weekly Response Memos - 30% <br/>Group Presentation - 10%<br/>Rough Draft of Final Paper - 10% <br/>Final Paper - 30%"}, {"name": "Class Materials (Required)", "value": "Required for Purchase: Mahdavi, Pardis. (2011) Gridlock: Labor, Migration, and Human Trafficking in Dubai. Stanford: Stanford University Press."}], "lmod": "2/16/17 6:46 PM (CT)", "subject": "GNDR_ST"}]