[{"class_mtg_info": [{"meet_t": "Th 2:00PM - 4:50PM", "meet_l": "University Hall 018 English"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Spring 2017", "name": "33422", "title": "WCAS ENGLISH 481-0-20 Studies in Literary Theory and Criticism", "class_attributes": "", "section": "33422", "instructors": [{"instructor_phone": "", "instructor_name": "Vivasvan   Soni", "instructor_addr": ""}], "topic": "Theories of Play", "course": "481-0", "descriptions": [{"name": "Overview of class", "value": "At least since Kant's Critique of Judgment and its notion of the &quot;free play of the faculties,&quot; play has become crucial to understanding aesthetic appreciation and the strange structure of interpretive work in the humanities (the play of meaning, etc.). Our task in this class will be twofold. First, we will ask why the importance of play is only recognized so late in the history of aesthetic thought. Is it because of a new attention to childhood in the eighteenth century (Locke, Rousseau, Romanticism)? Is it because of the emergence of a new commercial economy and the rise of a leisure class? Are there specific political ideals embedded in the model of aesthetic play proposed by Kant? In fact, from Schiller to William Morris and Herbert Marcuse, the notion of play has become a paradigm for unalienated labor and free activity, but there are significant problems with the way that freedom is envisioned in these texts (as pure potentiality, not oriented towards any ends). Are there alternatives to this notion of &quot;free play&quot; that would preserve the freedom of play without losing the orientation towards ends. (I have been working on how &quot;games&quot; might serve as an alternative to this notion of play, rather than being encompassed within it.) Second, we will examine how the concept of play developed by Kant has been seminal in a number of academic disciplines in the twentieth century. We will encounter play from a variety of disciplinary perspectives, including history (Huizinga), sociology (Caillois), anthropology (Turner), philosophy (Gadamer, Wittgenstein on language games), literary criticism (Derrida), cybernetics/economics (game theory) and contemporary psychology (Stuart Brown), so you can be exposed to a multiplicity of different approaches to the concept and its value for thinking about literature and the origin of culture. Indeed, many of the theories we will consider locate the development of culture in the capacity for play, though recent work on the play of animals raises questions about this too-easy account of the nature-culture split. <br/><br/>In a final turn, we will also look at some of the contemporary literature on the culture of gaming, primarily video games but also sports, board games and other contemporary cultural expressions. There is a growing doxa within this literature that games have displaced literature and the other arts as the primary form of &quot;culture&quot; within contemporary society. We will interrogate this claim skeptically. Is it true that the preponderance of cultural production occurs in the realm of games? Is it simply a quantitative question, or is there a fundamental shift in orientation? If there is some truth in this claim, then it will be important to ask what the consequences are of the shift from activities like reading and museum going to activities like gaming. Are the latter more active, participatory, democratic, or the converse? What happens to the possibilities for reflection under such conditions? Does the notion of &quot;free play&quot; still have any purchase in this context?"}, {"name": "Class Materials (Required)", "value": "Immanuel Kant, Critique of Judgment<br/>Friedrich Schiller, Letters on Aesthetic Education<br/>William Morris, News from Nowhere<br/>Jan Huizinga, Homo Ludens<br/>Roger Caillois, Man, Play and Games<br/>Walter Benjamin, Work of Art in the Age of Mechanical Reproduction (first and second editions)<br/>Hans Georg Gadamer, Truth and Method (selections on play)<br/>Ludwig Wittgenstein, Philosophical Investigations<br/>Victor Turner, From Ritual to Theater: The Human Seriousness of Play<br/>Jacques Derrida, &quot;Structure, Sign and Play in the Human Sciences&quot; and Dissemination<br/>Stuart Brown, Play: How it Shapes the Brain, Opens the Imagination and Invigorates the Soul<br/>Vivasvan Soni, &quot;Playing at Judgment: Aporias of Liberal Freedom in Kant's Critique of Judgment&quot;<br/>Elias, Garfield and Gutschera, Characteristics of Games<br/>Miguel Sicart, Play Matters<br/>Alex Galloway, Gaming: Essays on Algorithmic Culture"}, {"name": "Class Materials (Suggested)", "value": "John Locke, Some Thoughts Concerning Education<br/>Jean-Jacques Rousseau, Emile<br/>Johann Wolgang von Goethe, Wilhelm Meister's Apprenticeship<br/>Marcuse, Eros and Civilization<br/>Brian Sutton-Smith, Ambiguity of Play<br/>Brian Upton, Aesthetics of Play<br/>Salen and Zimmerman, Rules of Play"}], "lmod": "2/21/17 6:46 PM (CT)", "subject": "ENGLISH"}]