[{"school": "WCAS", "overview_of_class": "This is a class about the relationships between feeling and politics. We will consider dimensions of feeling - emotions, sensations, visceral experiences - and ask what they have to do with structures like racism, capitalism, heteropatriarchy, empire, and ableism. In recent years, these questions have grown increasingly prominent in queer and feminist scholarship. This turn to feeling?or more precisely, affect?is associated with a move away from critical theory's traditional emphasis on language, and towards an interest in materiality, embodiment, the nonhuman, and other things that can't be easily reduced to symbols or ideas.<br/><br/>This class provides an introduction to the recent \"affective turn\" of gender and sexuality studies, but it also traces a longer history of affect theory through feminism, psychoanalysis, cultural Marxism, and other intellectual traditions. We will use theoretical texts to take seriously questions like: What does capitalism feel like? Or: what does the afterlife of slavery feel like? The class will explore affect as a tool for understanding some of the most devastating effects of oppression, but also its intensely ordinary and mundane workings. To this end, scholarly readings will be paired with a range of other materials, including poetry, memoir, YouTube videos, video games, and short fiction.", "name": "Topics in Gender and Sexuality Studies", "section": "20", "topic": "Queer Feelings: Gender, Sexuality and the Politics", "course": "390-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4650/WCAS/GNDR_ST/390-0/24144", "instructor": ["Abram J Lewis"], "id": "24144", "subject": "GNDR_ST"}, {"school": "WCAS", "overview_of_class": "This course provides an overview and critical analysis of psychological research on gender. One emphasis is sex differences and similarities in cognition, attitudes, personality, and social behavior and the causes of these<br/>differences and similarities. Other topics include close relationships, leadership, career success, and mental<br/>health and happiness. Various theories of gender are considered.", "name": "Topics in Gender and Sexuality Studies", "section": "21", "topic": "Psychology of Gender", "course": "390-0", "meeting_time": ["MoWe 9:30AM - 10:50AM"], "path": "/class-descriptions/4650/WCAS/GNDR_ST/390-0/24145", "instructor": ["Alice H Eagly"], "id": "24145", "subject": "GNDR_ST"}]