[{"school": "SoC", "overview_of_class": "", "name": "Topics in Media Writing", "section": "20", "topic": "Writing Stand-up", "course": "360-0", "meeting_time": ["Mo 12:00PM - 2:50PM"], "path": "/class-descriptions/4650/SoC/RTVF/360-0/24488", "instructor": ["Zina Adrienne Camblin"], "id": "24488", "subject": "RTVF"}, {"school": "SoC", "overview_of_class": "REQUIRED book is:Good in a Room by Stephanie Palmer<br/> <br/>This course will focus on how to sell yourself as a writer and how to talk about your ideas by doing hands on practice sessions, talking to various professionals in the industry, and putting together a strong pitch package that students can use as they transition to the professional world.", "name": "Topics in Media Writing", "section": "21", "topic": "Pitching", "course": "360-0", "meeting_time": ["Tu 12:00PM - 2:50PM"], "path": "/class-descriptions/4650/SoC/RTVF/360-0/24489", "instructor": ["Zina Adrienne Camblin"], "id": "24489", "subject": "RTVF"}, {"school": "SoC", "overview_of_class": "Writing the Dramedy Pilot<br/><br/>A popular style of modern television writing (Transparent, High Maintenance, Atlanta), the &quot;dramedy,&quot; has the strong character components of a comedy while combining the engaging story components of a drama. In this class, we will respond to essays, watch video examples and study the art and craft of the dram-com approach. Students will also examine the process of developing, outlining, and writing a dramedy television series, building their own dynamic characters and locations through the making of a final original script.<br/><br/>Evaluation method: Class participation, in-class writing exercises, television treatment and thirty page teleplay.<br/> <br/>Class materials: none<br/><br/>Class notes: All script examples will be available via CANVAS and all video examples will be shown in class or be available for viewing online via CANVAS.", "name": "Topics in Media Writing", "section": "22", "topic": "Writing the Dramedy Pilot", "course": "360-0", "meeting_time": ["Tu 12:00PM - 2:50PM"], "path": "/class-descriptions/4650/SoC/RTVF/360-0/24490", "instructor": ["Brett Louis Neveu"], "id": "24490", "subject": "RTVF"}, {"school": "SoC", "overview_of_class": "Course Description: Students will study character, story, plot, dialogue, scene structure and screenplay format across various genres. The course will include reading, screening and discussion of feature films with the goal of a creating logline, treatment, character biography and generating the first half of a feature film for critique and feedback.<br/>Learning Objectives<br/>To understand the process of developing a story for the visual medium<br/>To understand the importance of character in relation to plot<br/>To strengthen the necessary elements of screenwriting (action, dialogue, etc.)<br/>To understand traditional and alternative screenplay structures and form.<br/>Appreciate the script's contribution to a successful film.<br/>Teaching Method<br/>Lectures, discussions, screenings, class reading, and writing assignments<br/>Evaluation Method<br/>Attendance, discussions, class participation, written assignments<br/>Class Materials (Required)<br/>Various electronic handouts<br/>Various Screenplays (TBA)<br/>Class Materials (Suggested)<br/>Screenplay - Syd Field<br/>Alternative Screenwriting - Ken Dancyger &amp; Jeff Rush<br/>The Hollywood Standard - Christopher Riley<br/>An Actor Prepares - Constantin Stanislavski<br/>Notes<br/>Most of the written work will be read out loud in class, including screenplay scenes. This is a vital component of the class, to better understand the written (and unwritten) words, as they move the story forward.", "name": "Topics in Media Writing", "section": "23", "topic": "Writing the Feature Film", "course": "360-0", "meeting_time": ["Th 12:00PM - 2:50PM"], "path": "/class-descriptions/4650/SoC/RTVF/360-0/24491", "instructor": ["Adam Lindsey Joyce"], "id": "24491", "subject": "RTVF"}, {"school": "SoC", "overview_of_class": "TVF 360 - 24 Passing the Bechdel-Wallace Test: Writing Significant Roles for Women<br/>Tuesdays 12:00 - 2:50 pm<br/><br/>Enrollment:  Prerequisite: RTVF 260 Foundations of Screenwriting or permission of the instructor.  Enrollment is limited to 12 students. Attendance at the first class is mandatory.<br/><br/>Contact info: r-gilman@northwestern.edu<br/><br/>Description:<br/>In her 1985 cartoon, Dykes to Watch Out For, Alison Bechdel illustrated a test for films that came to her by way of her friend, Liz Wallace. Wallace told Bechdel that she would only see a movie if it satisfied three basic requirements. First, the movie had to have at least two women in it. Second, those two women had talk to each other. And third, that conversation had to be about something besides a man. These requirements have come to be known as the Bechdel-Wallace Test - a test which many films, television shows, and plays routinely fail. (In 2015, women accounted for only a third of speaking characters in films, and comprised only 22% of protagonists.) In this class we will aim to write scripts with leading roles for women - roles that are complicated, unique, and significant. We will do so by first examining traditional representations of women in all three media. We will then compare those representations to more contemporary portrayals and ask two essential questions: how far have we come in writing roles for women and how far do we have to go? The class will include screenings of films, televisions shows and readings of plays that co-opt genre (Meek's Crossing, Bridesmaids), challenge gender norms (Women Eating Salad Alone and Laughing), and expand traditional definitions of what it is to be a woman (Broad City, Girls, The Wolves, Orange is the New Black). The class will also include readings of essays and criticism from canonical and contemporary feminist theorists, as well as exercises in how to create rich characterizations.<br/><br/>These readings, lectures, discussion, screenings, and short writing assignments will lead to the development of a final project: <br/>? Undergraduate students will be required to write the first 30 pages and a complete outline of a full-length screenplay, play, or original pilot. <br/>? Graduate students will be required to complete a full-length screenplay, play, or pilot and show bible. <br/><br/>Required texts:<br/>Crimes of the Heart, by Beth Henley Dramatists Play Service ISBN: 978-0822202509<br/>Milk Like Sugar, by Kirsten Greenidge Samuel French ISBN: 978-0573700361<br/><br/>All films and television shows will be screened via Canvas.<br/>All other texts will be handouts.", "name": "Topics in Media Writing", "section": "24", "topic": "Passing the Bechdel Test", "course": "360-0", "meeting_time": ["Tu 12:00PM - 2:50PM"], "path": "/class-descriptions/4650/SoC/RTVF/360-0/24492", "instructor": ["Rebecca C. Gilman"], "id": "24492", "subject": "RTVF"}, {"school": "SoC", "overview_of_class": "Learning objectives: In this<br/>course, students will learn to use improvisation as a tool to generate ideas, develop written material, and enrich a writing practice. Students<br/> will learn core tenets of improv performance as developed in Chicago-based theaters, and will have the chance to test experimental techniques based in physical theatre, clown, and Neo-Futurism.<br/>Through in-class performance exercises, this course will explore how to build character, dialogue, and environment<br/> through improv, as well as how to refine scenes and develop story structure in an existing script.<br/>Fostering an atmosphere of collaboration and spontaneity, students will learn how improvisational techniques can be applied professionally<br/> in a writer's room setting. <br/><br/><br/>Evaluation method: Students will be graded on participation, short<br/> writing assignments, written response to least one recommended show, and a final project: the substantial progress (30 to 40 pages) or completion of an original<br/> play, screenplay, or teleplay. <br/><br/><br/>Class materials: Napier, Mick. Improvise: Scene from the Inside<br/> Out. Meriwether Publishing Ltd: Second Edition. ISBN-13: 978-1566081986<br/><br/>Additional weekly handouts and readings (TBD) will be distributed in class and available via CANVAS.", "name": "Topics in Media Writing", "section": "25", "topic": "Writing with Improv", "course": "360-0", "meeting_time": ["Th 3:00PM - 5:50PM"], "path": "/class-descriptions/4650/SoC/RTVF/360-0/24493", "instructor": ["Lillian Grace Mooney"], "id": "24493", "subject": "RTVF"}, {"school": "SoC", "overview_of_class": "Topics in Media Writing: Writing the Short Play<br/>RTVF 360-0 Sec. 26<br/><br/>Instructor: Mickle Maher <br/>mahermickle@gmail.com<br/><br/>This workshop will explore the underlying mechanics that have made plays tick for the last 2,500 odd years, from Euripedes to Shakespeare to Büchner, Caryl Churchill, Amiri Baraka, and Will Eno, etc. Students will be asked to shamelessly steal those playwrights' tricks and techniques (if they're found useful), and employ them in the creation of their own pieces. Designed for playwrights at any level (beginning or advanced), the workshop's primary goals will be to develop a personal sense of what &quot;works&quot; on stage within the context of what's worked in the past, and to generate one rehearsal-ready ten minute play, and one short one act play, start to finish. <br/><br/>Learning objectives: acquiring a basic understanding of playwriting techniques and terms, and developing an ear and voice for the language and structures of the stage, with a focus on the short play. <br/><br/>Evaluation method: Class participation, completion of reading assignments, 2 plays (one ten minute, one short one act). <br/><br/>Class materials: 6 books:<br/><br/>Georg Buchner - Complete Plays, Lenz and Other Writings<br/>ISBN-10: 0140445862<br/>Penguin<br/><br/>Pornography, by Simon Stephens <br/>Series: Student Editions<br/>Publisher: Bloomsbury Methuen Drama (February 27, 2014)<br/>ISBN-10: 1408179857<br/><br/>Thom Paine (based on nothing), by Will Eno<br/>ISBN: 978-0-8222-2076-3<br/>Dramatists Play Service<br/><br/>A Number, by Caryl Churchill<br/>ISBN-10: 1559362251<br/>Theatre Communications Group (May 1, 2003)<br/><br/>Dutchman and The Slave: Two Plays, by LeRoi Jones<br/>ISBN-10: 0688210848<br/>Harper Perennial<br/><br/>Plays: Maria Irene Fornes<br/>ISBN-10: 0933826834<br/>Series: PAJ Books", "name": "Topics in Media Writing", "section": "26", "topic": "Writing the Short Play", "course": "360-0", "meeting_time": ["Th 12:00PM - 2:50PM"], "path": "/class-descriptions/4650/SoC/RTVF/360-0/24494", "instructor": ["Michael Brandt Maher"], "id": "24494", "subject": "RTVF"}, {"school": "SoC", "overview_of_class": "This class will provides the opportunity to learn how to television comedy. Students will examine existing shows to parse out what is successful and what is not and then will craft their own half-hour comedy, including series concept, written pitch, outline and first draft. As much time as possible will be spent in a workshop setting, solving problems that arise at each step of the process.", "name": "Topics in Media Writing", "section": "27", "topic": "Writing the Comedy Pilot", "course": "360-0", "meeting_time": ["We 12:00PM - 2:50PM"], "path": "/class-descriptions/4650/SoC/RTVF/360-0/27478", "instructor": ["Barbara   Wallace"], "id": "27478", "subject": "RTVF"}]