[{"school": "WCAS", "overview_of_class": "This seminar focuses on the future of democracy under current conditions of globalization. Since the end of the Cold War it has become apparent that individual countries cannot achieve the democratic ideal of a society of free and equal citizens in isolation. Current threats such as global warming, terrorism, global economic crises require global solutions that no individual country can provide on its own. Thus the main political challenge of the 21st Century is to figure out whether necessary conditions for democracy, such as citizens' political equality and participation, public deliberation, etc. can be reproduced at the global level. Can citizens have a say on political decisions that affect them even if they are reached outside the domestic borders of their own society? Is it possible to design a new international order in which global political decisions are made in a democratic way? In the seminar we will analyze this difficult set of questions by discussing some interesting recent proposals for a new international order with a focus on how they handle issues of international human rights standards, the global economic order, world poverty, etc.", "name": "First-Year Seminar in Philosophy", "section": "20", "topic": "Rethinking Democ After Globalization", "course": "109-6", "meeting_time": ["TuTh 9:30AM - 10:50AM"], "path": "/class-descriptions/4650/WCAS/PHIL/109-6/22724", "instructor": ["Cristina   Lafont"], "id": "22724", "subject": "PHIL"}, {"school": "WCAS", "overview_of_class": "This course will be taught by Prof. Guy Elgat, a visiting scholar and NU PhD Philosophy graduate. We will debate the original ideas of the nineteenth century German philosopher Friedrich Nietzsche. According to Nietzsche, morality, justice, divinity, even the self are deceptive human inventions. His diagnosis of humanity was partly pessimistic: humans, he thought, are cunning creatures that love their idols and ideals too well, seethe with a resentment of which they may be unaware, and follow the herd. But he was also an optimistic philosopher, encouraging humans to cultivate a ?great health' and to become otherwise. We'll look at some of the ideas, and even mention the forms of music and drama that Nietzsche thought were positive stimulants to life, and other, depressant forms he thought should be avoided. After considering Nietzsche's bracing evaluation of us, we will turn the tables and evaluate Nietzsche- what are the advantages and disadvantages of his ideas?", "name": "First-Year Seminar in Philosophy", "section": "21", "topic": "Nietzsche", "course": "109-6", "meeting_time": ["TuTh 5:00PM - 6:20PM"], "path": "/class-descriptions/4650/WCAS/PHIL/109-6/22725", "instructor": ["Guy   Elgat"], "id": "22725", "subject": "PHIL"}, {"school": "WCAS", "overview_of_class": "We will discuss a range of classic philosophical texts, presenting different kinds of realism or idealism (in metaphysics, politics, ethics). We will consider questions such as: what does it mean to be an \"idealist\" or a \"realist\"? is mind or matter, both or neither the truly real? What would it mean to claim that the world does not (really) exist? Why would it be an insult - or not - to be called a political \"idealist\"? Or: if you are a criminal in virtual reality, are your crimes real, or not?", "name": "First-Year Seminar in Philosophy", "section": "22", "topic": "Idealism and Realism", "course": "109-6", "meeting_time": ["TuTh 9:30AM - 10:50AM"], "path": "/class-descriptions/4650/WCAS/PHIL/109-6/22726", "instructor": ["Rachel E Zuckert"], "id": "22726", "subject": "PHIL"}]