[{"class_mtg_info": [{"meet_t": "MoWe 9:30AM - 10:50AM", "meet_l": "University Hall 121"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-registration - Reserved for English students.", "qtr": "Spring 2017", "name": "33294", "title": "WCAS ENGLISH 369-0-20 Studies in African Literature", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "33294", "instructors": [{"instructor_phone": "", "instructor_name": "Evan M Mwangi", "instructor_addr": ""}], "topic": "Form in African Writing", "course": "369-0", "descriptions": [{"name": "Overview of class", "value": "This course studies the formal properties in select Anglophone African texts and relates aesthetic choices to identity politics. It considers debates in African writing (e.g., what language the literatures should be written in and who is qualified to respond to it) in the context of 21st-century transnational realities. Important will be the relationship between folkloric devices and modern forms and the use of experimentation to not only generate aesthetic pleasure but also to shield texts from possible censorship. Paying attention to plot, syntax, lexis, and various semantic deviations used to foreground (or underground) aspects of the text, we will read creative works by Chimamanda Ngozi Adichie, Ayi Kwei Armah, Nadine Gordimer, Ngugi wa Thiong'o, among other writers, alongside theoretical materials on African literature and on literary form."}, {"name": "Teaching Method", "value": "Interactive lectures, debates, role play, one-on-one meetings, and small group discussions."}, {"name": "Evaluation Method", "value": "Two 6-page papers, weekly Canvas postings, regular self-evaluation, peer critiques, class participation, take-home exam, pop quizzes (ungraded), and 1-minute papers (ungraded)."}, {"name": "Class Materials (Required)", "value": "Chimamanda Ngozi Adichie, Americanah, New York: Alfred A. Knopf, 2013. ISBN-10: 0307455920; ISBN-13: 978-0307455925; Ayi Kwei Armah, The Beautyful Ones Are Not Yet Born. 1969. London: Heinemann, 1972. ISBN-10: 0435905406ISBN-13: 978-0435905408; J.M. Coetzee, Elizabeth Costello: New York: Viking, 2003. ISBN-10: 0142004812ISBN-13: 978-0142004814; Teju Cole, Open City. New York: Random House, 2012. ISBN-10: 0812980093; ISBN-13: 978-0812980097; Nadine Gordimer, Burger's Daughter. New York: Viking Press, 1979. SBN 10: 0670194751 ISBN 13: 9780670194759; Emmanuel Ngara, Ideology &amp; form in African poetry. Portsmouth, N.H.: Heinemann, 1990. ISBN: 0435080458; Ng?g? wa Thiong?o. Decolonising the Mind: The Politics of Language in African Literature. London: J. Currey; N.H Portsmouth: Heinemann, 1986. ISBN-10: 0852555016; ISBN-13: 978-0852555019; Daria Tunca, Stylistic Approaches to Nigerian Fiction. Houndmills: Palgrave Macmillan, 2014. ISBN-10: 1137264403; ISBN-13: 978-1137264404."}, {"name": "Class Notes", "value": "The above course is combined with COMP_LIT 304-0. If the ENGLISH side of the course is full, you may register for the course under the co-listed department and receive the same credit toward your English major."}], "lmod": "2/8/17 6:42 PM (CT)", "subject": "ENGLISH"}]