[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "University Library 3722"}], "school": "WCAS", "overview_of_class": "This is a high intermediate level course in Modern Standard Arabic. Our goal is to enhance the student's ability to read, write, understand and discuss Arabic writings utilizing Al-Kitab II and a variety of newspaper, magazine, journal articles, short stories and other relevant material to the students' field of study. In addition to focusing on developing reading and writing skills, a special emphasis is placed on listening and speaking.", "qtr": "Winter 2017", "name": "Arabic III", "title": "WCAS ARABIC 211-2-20 Arabic III", "lmod": "2/5/17 6:41 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "8474670927", "instructor_name": "Ragy H Ibrahim Mikhaeel", "instructor_addr": ""}], "topic": "", "course": "211-2", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "This is a high intermediate level course in Modern Standard Arabic. Our goal is to enhance the student's ability to read, write, understand and discuss Arabic writings utilizing Al-Kitab II and a variety of newspaper, magazine, journal articles, short stories and other relevant material to the students' field of study. In addition to focusing on developing reading and writing skills, a special emphasis is placed on listening and speaking."}, {"name": "Registration Requirements", "value": "Passing Arabic 211-1 with a C- and/or instructor's approval."}, {"name": "Learning Objectives", "value": "Listening:<br/>Improve your listening comprehension of: authentic audio/video texts both in Ammiya and MSA. By the end of this quarter I expect you to comprehend more than the main points / ideas when listening to an authentic Arabic conversation or watching Al-Jazeera. By the end of the school year ( the three class sequence of 211), I expect you to understand thoroughly the more familiar topics and recognize main ideas of news bulletins.<br/><br/>Speaking:<br/>You will have enough spoken and MSA Arabic vocab and idioms that make you able to hold conversations with native Arabic speakers on basic topics and some cultural topics. By the end of the course you will have improved your pronunciation ( clarity and intonation ) as well. You will also be more proficient with the differences between the formal settings of using MSA as spoken Arabic and everyday spoken Arabic dialects."}, {"name": "Teaching Method", "value": "Language of instruction and conversation in class is entirely in Arabic. In the event that student does not understand, he/she should try to ask clarifying questions in Arabic. Personalized goals for improving writing and speaking skills of each student will be developed on individual basis based on each student's level of mastery of writing and speaking strengths and weaknesses. The course will also use examples from Arab media and both basic and advanced topics on &quot;Arabic in everyday life&quot;."}, {"name": "Evaluation Method", "value": "Midterm and Final in class exams, Take home writing exams, term papers, assignments based on weekly readings and class participation."}, {"name": "Class Materials (Required)", "value": "1) Kristen Brustad, Mahmoud Al-Batal and Abbas al-Tonsi, Al-Kitaab fii Ta?allum al-?Arabiyya with DVDs: Part Two. 3rd edition. [ISBN: 9781589019669]<br/><br/>2) Companion website for 1.) ?students will be able to purchase access after the course starts and they have their books. <br/><br/>Other resources covering media news and short stories and other literary genre will be provided by the instructor prior to class."}], "path": "/class-descriptions/4650/WCAS/ARABIC/211-2/22695", "instructor": ["Ragy H Ibrahim Mikhaeel"], "class_attributes": "", "id": "22695", "subject": "ARABIC"}]