[{"class_mtg_info": [{"meet_t": "We 2:00PM - 4:50PM", "meet_l": "Scott Hall 212"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "35422", "title": "WCAS POLI_SCI 395-0-21 Political Research Seminar", "class_attributes": "", "section": "35422", "instructors": [{"instructor_phone": "847/491-8985", "instructor_name": "Kimberly Ruggles Marion Suiseeya", "instructor_addr": ""}], "topic": "Environmental Justice", "course": "395-0", "descriptions": [{"name": "Overview of class", "value": "POLI SCI 395-0-21 Spring 2017 &quot;Environmental Justice&quot; Prof. Kimberly R. Marion Suiseeya<br/>As the global community has struggled to address global environmental problems including climate change, forest loss and degradation, and biodiversity loss, they have increasingly recognized the need for just solutions?solutions that not only recognize the disproportionate impacts that environmental policies may have on diverse stakeholders but solutions that actively seek to prevent and mitigate injustice. In other words, justice is increasingly understood as a necessary condition for effective environmental governance. <br/><br/>The course specifically considers the intersection of global environmental governance, international politics, and justice in the context of the global commons. With a particular focus on Indigenous Peoples, we will examine the production of justice and injustice across multiple scales of governance, including an assessment of the role of regimes, states, non-state actors, and transnational advocacy networks in response to global environmental challenges. The course is divided into three main parts: first, we begin with an examination of the problem of justice in global environmental governance drawing from empirical studies primarily in the political ecology literature. Then we move on to examining the institutions, actors, and architecture in global environmental governance that seek to address global environmental challenges from global to local contexts. In the third section of the course, we examine the explanations for and responses to justice and injustice in global environmental governance. Throughout the course we will direct our attention to these dynamics within two global commons: forests and biodiversity?commons that transcend scales of governance and are integral to the livelihoods of more than one billion people in the Global South. We draw from the literature in global environmental politics, conservation and development, and environmental justice.<br/><br/>Requirements include active class participation, short assignments, and an independent research project."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Discussion, presentations, research paper"}], "lmod": "2/21/17 6:50 PM (CT)", "subject": "POLI_SCI"}]