[{"class_mtg_info": [{"meet_t": "MoWeFr 12:00PM - 12:50PM", "meet_l": "1801 Hinman Ave 2225"}], "school": "WCAS", "overview_of_class": "Anton Chekhov was born into a family of former serfs, worked his way through medical school while supporting his parents and siblings, and became one of the most admired story-tellers in the modern world. He represents a profound departure from his Russian context and pioneered modernist literary form, yet his work is also rooted in the culture of late imperial Russia. This course introduces significant elements of Chekhov's biography and his Russian context, and follows the trajectory of his development, from the early short stories to mature prose.  No previous background in Russian literature or Chekhov is required.", "qtr": "Winter 2016", "name": "Chekhov", "title": "WCAS SLAVIC 314-0-1 Chekhov", "lmod": "1/9/16 6:53 PM (CT)", "section": "1", "instructors": [{"instructor_phone": "", "instructor_name": "Susan McReynolds   Oddo", "instructor_addr": ""}], "topic": "", "course": "314-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Anton Chekhov was born into a family of former serfs, worked his way through medical school while supporting his parents and siblings, and became one of the most admired story-tellers in the modern world. He represents a profound departure from his Russian context and pioneered modernist literary form, yet his work is also rooted in the culture of late imperial Russia. This course introduces significant elements of Chekhov's biography and his Russian context, and follows the trajectory of his development, from the early short stories to mature prose. No previous background in Russian literature or Chekhov is required."}, {"name": "Teaching Method", "value": "Lecture: Lecture and discussion<br/>"}, {"name": "Evaluation Method", "value": "Quizzes, Midterm, and Final; option of essays and/or creative writing to replace exams"}, {"name": "Class Materials (Required)", "value": "Norton Critical Edition of Short Stories of Anton Chekhov, ed. Cathy Popkin"}], "path": "/class-descriptions/4610/WCAS/SLAVIC/314-0/26910", "instructor": ["Susan McReynolds   Oddo"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "26910", "subject": "SLAVIC"}]