[{"school": "WCAS", "overview_of_class": "This is the first quarter of a three-quarter, algebra-based physics course. Physics is the most basic of the sciences, dealing with the behavior and structure of matter. Lectures illustrate physical principles: mechanics, motion, momentum and energy, and fluids. Continues as PHYSICS 130-2, 3. Students taking this course must also enroll concurrently in Physics Lab 136-1. Actual demonstrations of many physical principles will be shown in the lecture when ever possible. The goal of the course is for the student to gain an understanding of the nature of the physical principles which govern the world around us and the universe beyond, through models which draw on our everyday experiences. <br/><br/>Topics:<br/>1. Motion in One Dimension<br/>2. Vectors<br/>3. Motion in a Plane<br/>4. Particle Dynamics<br/>5. Work and Energy<br/>6. Conservation of Energy<br/>7. Conservation of Linear Momentum<br/>8. Collisions<br/>9. Rotational Kinematics<br/>10. Rotational Dynamics and Conservation of Angular Momentum<br/>11. Oscillations<br/>12. Fluids", "name": "College Physics", "section": "01", "topic": "", "course": "130-1", "meeting_time": ["MoWeFr 12:00PM - 12:50PM"], "path": "/class-descriptions/4640/WCAS/PHYSICS/130-1/13944", "instructor": ["Michael F Smutko"], "id": "13944", "subject": "PHYSICS"}, {"school": "WCAS", "overview_of_class": "This is the first quarter of a three-quarter, algebra-based physics course with lecture. Physics is the most basic of the sciences, dealing with the behavior and structure of matter. Lectures illustrate physical principles: mechanics, motion, momentum and energy, and fluids. Continues as PHYSICS 130-2, 3. Students taking this course must also enroll in a Physics Lab 136-1. Actual demonstrations of many physical principles will be shown in the lecture when ever possible. Weekly quizzes emphasize problem solving. The goal of the course is for the student to gain an understanding of the nature of the physical principles which govern the world around us and the universe beyond, through models which draw on our everyday experiences. <br/><br/>Topics:<br/>1. Motion in One Dimension<br/>2. Vectors<br/>3. Motion in a Plane<br/>4. Particle Dynamics<br/>5. Work and Energy<br/>6. Conservation of Energy<br/>7. Conservation of Linear Momentum<br/>8. Collisions<br/>9. Rotational Kinematics<br/>10. Rotational Dynamics and Conservation of Angular Momentum<br/>11. Oscillations<br/>12. Fluids<br/><br/>Laboratory Exercises:<br/>1. Kinematics I: Uniform Acceleration. The study of an object sliding down a frictionless incline.<br/>2. Kinematics II: Acceleration-deceleration. The study of the interrelation between displacement, velocity, and acceleration for an object with changing acceleration.<br/>3. Newton's 2nd Law. Study of the relationship of mass and acceleration<br/>4. Conservation of Energy. Study of the transformation of energy from one form to another.<br/>5. Conservation of Momentum. Conservation of momentum and energy is verified for an elastic collision.<br/>6. Conservation of Momentum in 2-D. Conservation of momentum and energy is verified for an elastic collision in a plane.<br/>7. Rotation of a Rigid Body around a Fixed Axis I. Study of the relationship between torque, force, and moment of inertia.<br/>8. The Pendulum. The simple pendulum and the physical pendulum are compared.", "name": "College Physics", "section": "02", "topic": "", "course": "130-1", "meeting_time": ["MoWeFr 2:00PM - 2:50PM"], "path": "/class-descriptions/4640/WCAS/PHYSICS/130-1/13945", "instructor": ["Arthur Gerard   Schmidt"], "id": "13945", "subject": "PHYSICS"}]