[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Harris Hall L28"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "22404", "title": "WCAS ASIAN_LC 390-0-20 Advanced Topics in Asian Languages and Cultures", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "22404", "instructors": [{"instructor_phone": "847/467-5829", "instructor_name": "Daniel Joseph Majchrowicz", "instructor_addr": "1880 Campus Drive, Kresge Hall, Office 4-423"}], "topic": "Travel Writing and Modern India", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "How do we know what we know about India? How do residents of India themselves know what they know about the vast land they inhabit, with its various sub-cultures and ethnic groups? As a perennially popular literary genre, travel writing has played a prominent role in the production of this knowledge. In this course, we will read travel writing on and from South Asia to ask how it produces representations of India and offers it to readers for consumption. Course materials will include both historical travel writing from authors like Mark Twain, Rabindranath Tagore and Queen Sikandar Begum, as well as more contemporary works like Eat, Pray, Love as well as representations of travel in other media, such as the like Queen (2013). By the end of the course, students should have a clear understanding of the place of travel writing in modern literature on India, and how this genre has helped structure the way we know this region today."}, {"name": "Learning Objectives", "value": "? To become familiar with travel writing traditions in and on South Asia.<br/>? To develop skills in critically analyzing literary and cultural texts.<br/>? To refine analytical and writing skills."}, {"name": "Teaching Method", "value": "Lecture and discussion."}, {"name": "Evaluation Method", "value": "Participation; assignments; presentations; final paper."}, {"name": "Class Materials (Required)", "value": "Materials will be available on Canvas."}], "lmod": "12/29/16 6:54 PM (CT)", "subject": "ASIAN_LC"}]