[{"school": "DOHA", "overview_of_class": "<p>Alternative media in the Middle East is a seminar course examining the diversity of ethnic, political, social, economic, and cultural contexts that often produce media through pirate radio, underground press, independent film, Internet, mobile technologies, and other forms.</p>", "name": "Undergraduate Seminar", "section": "70", "topic": "Alternative Media in the Middle East", "course": "398-0", "meeting_time": ["Su 10:00AM - 11:50AM (AST)", "Tu 10:00AM - 11:50AM (AST)"], "path": "/class-descriptions/4640/DOHA/MIT/398-0/10014", "instructor": ["Joseph F Khalil"], "id": "10014", "subject": "MIT"}, {"school": "DOHA", "overview_of_class": "<p>This course will explore some of the most potent, groundbreaking, funny, inspiring, and thought-provoking international documentaries directed by women. Social justice, autobiographical, cinema verite, hybrid, and traditional forms of documentary are featured to examine topics such as gender, race, art, history, philosophy, and the environment. Arab, Asian, American, Latin American, European, and African women filmmakers are included. From Academy-Award winners, to a girl with a toy camera - you'll find them all in this course. This lecture course requires no production skills. Final projects may be either a research paper, or a digital project.</p>", "name": "Undergraduate Seminar", "section": "71", "topic": "Women &amp; Documentary", "course": "398-0", "meeting_time": ["Mo 08:30AM - 11:50AM (AST)", "We 10:30AM - 11:50AM (AST)"], "path": "/class-descriptions/4640/DOHA/MIT/398-0/10021", "instructor": ["Danielle M Beverly"], "id": "10021", "subject": "MIT"}, {"school": "DOHA", "overview_of_class": "<p>Media Law &amp; Ethics takes a comparative approach, using American jurisprudence as a foundation, to introduce student to the legal and ethical principles needed to engage in responsible communication. In addition to learning the fundamental theories of freedom of expression, students will immerse themselves in the law of defamation, intellectual property and privacy through case studies and in-class exercises that emphasize the application of those principles in a global setting. Throughout the course, attention will be paid to reading primary source materials, including Qatari laws that regulate the media. Using the legal and ethical principles they've learned, students will complete a content production project that explores a legal or ethical topic of their choosing at the conclusion of the semester.</p>", "name": "Undergraduate Seminar", "section": "72", "topic": "Media Law &amp; Ethics", "course": "398-0", "meeting_time": ["TuSu 08:30AM - 09:50AM (AST)"], "path": "/class-descriptions/4640/DOHA/MIT/398-0/10056", "instructor": ["Amy Kristin Sanders"], "id": "10056", "subject": "MIT"}, {"school": "DOHA", "overview_of_class": "", "name": "Undergraduate Seminar", "section": "73", "topic": "Media Law &amp; Ethics", "course": "398-0", "meeting_time": ["TuSu 10:00AM - 11:20AM (AST)"], "path": "/class-descriptions/4640/DOHA/MIT/398-0/10057", "instructor": ["Amy Kristin Sanders"], "id": "10057", "subject": "MIT"}]