[{"class_mtg_info": [{"meet_t": "Mo 2:00PM - 4:50PM", "meet_l": "Annie May Swift Hall 110"}], "school": "SoC", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Spring 2017", "name": "34801", "title": "SoC SAI 400-0-21 Topics in Sound Studies", "class_attributes": "", "section": "34801", "instructors": [{"instructor_phone": "", "instructor_name": "Shayna Mei Silverstein", "instructor_addr": "shayna.silverstein@northwestern.edu"}], "topic": "Sound Ethnography", "course": "400-0", "descriptions": [{"name": "Overview of class", "value": "What does the study of human(s) in specific historical contexts sound like? How does situated listening help us to better understand the ways in which social relations are constituted through sound? This seminar integrates experiential learning with readings and discussions to develop ethnographic skills in listening, recording, editing and representing what John Blacking famously called &quot;humanly organized sound.&quot; If the ethnographic process consists of gathering, interpreting and analyzing, and representing ethnographic material, we look at various case studies that analyze field recordings, oral histories, sound archives, listening practices, and commodified sounds as their primary object of study. We ask how sonic phenomena can be used to address key anthropological issues, including but not limited to sensory studies, space and place, historical ethnography, political economy, and the sonic relations of bodies and technologies. Students will be asked to design and conduct an ethnographic project that we will workshop over the course of the term."}, {"name": "Learning Objectives", "value": "<ul><br/><li>to understand ethnography as a concept, method, and approach employed by the social sciences, humanities, and non-academic research industries</li><br/><li>to be able to understand the role of sound in diverse modes of communication, situate these communicative encounters in specific societal contexts, and develop ethnographic insights into the relations of self, society, and sound</li><br/><li>to develop skills in analyzing the representation and performance of social difference in society, and attend to the ways in which the politics of difference operates worldwide</li><br/><li>to approach ethnography as a collaborative and co-performative mode of conducting research</li><br/><li>to develop skills in ethnographic methods, including but not limited to oral histories, field recordings, soundwalks, digital data collection, and participant-observation</li><br/><li>to read, listen, analyze, synthesize, and discuss a range of literature that discusses fieldwork conducted worldwide</li><br/><li>to communicate ideas and experiences effectively through oral, written, and sound media</li><br/></ul>"}, {"name": "Evaluation Method", "value": "<ul><br/><li>2-3 response papers assigned throughout the term</li><br/><li>1 in-class presentation</li><br/><li>1 ethnographic project to be carried out, in stages assigned by the instructor, over the course of the term</li><br/><li>participation in peer assessment of ethnographic projects, at various stages</li><br/> </ul>"}, {"name": "Class Materials (Required)", "value": "<ul><br/><li>books, articles, and sound media will be available through course reserves, Canvas, or for purchase</li><br/><li>field recording equipment will be available through the SAI program</li><br/><li>editing equipment (as needed) will be available through the SAI program</li><br/></ul>"}], "lmod": "2/19/17 6:41 PM (CT)", "subject": "SAI"}]