[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "ANTHRO Sem Rm 104 - 1810 Hinmn"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Spring 2017", "name": "32238", "title": "WCAS ANTHRO 101-6-21 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "32238", "instructors": [{"instructor_phone": "847/467-1648", "instructor_name": "Mark William Hauser", "instructor_addr": "1812 Hinman Ave., Room #205, EV Campus"}], "topic": "Fantastic Archaeology: Science and Pseudoscience i", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "Did astronauts from another planet establish ancient civilizations on Earth? Were the Americas discovered by Columbus, a Ming dynasty fleet or by Vikings much earlier? Did the Maya Aztec build their pyramids to resemble those of dynastic Egypt? Television is replete with stories of ancient aliens and archaeological mysteries. The impact of such alternative realities on society and history cannot be discounted. They have been used to support nationalistic agendas, racial biases, and religious movements, all of which can have considerable influence on contemporary society.<br/> <br/>In this course, we will study &quot;fantastic&quot; stories, puzzles, hoaxes, imaginative worlds and alternative theories. We will learn when, how and what kinds of evidence these alternative theories have used to fascinate the public and illustrate their hoaxes. We will question such theories by using critical thinking and analytical tools to diagnose what is fact and fiction. We will utilize the surviving evidence that archaeologists find to understand cultural contact and interactions."}, {"name": "Learning Objectives", "value": "- to provide students with a wide-ranging introduction to archaeological methods and scientific inquiry through the entertaining lens of cult archaeology<br/>- develop critical thinking skills and analytical tools to evaluate evidence and &quot;diagnose&quot; pseudoarchaeology and pseudoscience when they see it?skills that will be useful to them throughout their academic career<br/>- to engage with larger questions about uses and meanings of history and the evolution of political and religious ideologies that are built on historical and archaeological ideas"}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Attendance and Participation<br/>3 Writing Assignments"}, {"name": "Class Materials (Required)", "value": "Feder, Kenneth. Frauds, myths, and mysteries. McGraw-Hill Higher Education, 2013.<br/>978-0078035074"}], "lmod": "2/16/17 6:43 PM (CT)", "subject": "ANTHRO"}]