[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "555 Clark B03"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "22844", "title": "WCAS ASIAN_LC 390-0-22 Advanced Topics in Asian Languages and Cultures", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "22844", "instructors": [{"instructor_phone": "", "instructor_name": "Andrew Way Leong", "instructor_addr": "1897 Sheridan Rd #215"}], "topic": "Asia as Method", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "Asia as Method: A Research Workshop: If you wish to pursue some combination of gainful employment, political activism, or academic research, you will need three fundamental abilities: 1) the ability to understand how knowledge has been produced in the past, 2) the ability to develop methods for producing knowledge on your own and with others, and 3) the ability to communicate that knowledge to future audiences. This course offers an intensive training program in these three abilities, a program geared towards students in Asian and comparative literary studies who wish to pursue independent research projects (and thereby demonstrate the higher-level research skills prized by employers, granting agencies, and graduate admissions committees). <br/>At the most basic level, this is a classic research methods course, where you will strengthen the skills necessary to complete a full, ten-week research project. Through short weekly exercises, we will break down and workshop each component of the research process?e.g., how to convert an area of interest into a specific topic, how to apply for research funding, how to write an abstract, how to compile a bibliography, etc. These exercises will culminate in a twelve-page research paper (or its equivalent in other formats). Our work in research methods will provide a springboard for readings and discussion about how we can critique or change existing methods for producing knowledge. Such questions include: How do problems of orientation provide the basis for making the Orient an object of knowledge and power? How do different media exert and distribute &quot;soft&quot; and &quot;hard&quot; power? What kinds of knowledge production have supported colonialism and imperialism? And what alternatives exist for decolonizing or democratizing knowledge?<br/> <br/>Note: As a class of this kind has not been offered in DALC before, students interested in reading evaluations of a similar course in English may wish to consult the instructor's CTECs for English 397."}, {"name": "Learning Objectives", "value": "The student will be able to define a research topic; refine a research topic into a specific set of research questions; collect manuscript, print, and digital sources; compile an annotated bibliography; provide effective feedback to peers; and present research in oral and written form."}, {"name": "Teaching Method", "value": "Discussion of readings and workshopping of student assignments."}, {"name": "Evaluation Method", "value": "Class participation; for-credit weekly research exercises; graded rough draft, oral presentation, and final draft of a research paper (~15 pages)."}, {"name": "Class Materials (Required)", "value": "1) A course reader of short weekly readings (in English) from such writers as B.R. Ambedkar, Wayne Booth, Christopher Bush, Eileen Chang, Kuan-Hsing Chen, Kandace Chuh, Rey Chow, Michel Foucault, Mahatma Gandhi, Eric Hayot, François Jullien, Elaine Kim, Susan Koshy, Nayoung Aimee Kwon, Lydia Liu, Lisa Lowe, Joseph Nye, Lu Xun, Chandra Mohanty, Natsume S?seki, Edward Said, Haun Saussy, and Yi Sang.<br/><br/>2) Booth, Wayne, et. al. The Craft of Research (Third Edition). (Chicago: U. Chicago, 2008).<br/><br/>3) Hayot, Eric. The Elements of Academic Style: Writing for the Humanities. (New York: Columbia, 2014)."}], "lmod": "1/9/16 6:43 PM (CT)", "subject": "ASIAN_LC"}]