[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "Locy Hall 303"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24599", "title": "WCAS RELIGION 359-0-20 Topics in Islam", "class_attributes": "Ethics &amp; Values Distro Area<br/><br/>", "section": "24599", "instructors": [{"instructor_phone": "", "instructor_name": "William Eugene Caldwell", "instructor_addr": ""}], "topic": "Histories of Islam in the US", "course": "359-0", "descriptions": [{"name": "Overview of class", "value": "This course will explore the overlapping histories of Islam in the United States from the presence of enslaved African Muslims in the original colonies to present day debates over the place of Islam in secular society. Special attention will be paid to the role of Muslims in the African diaspora as an enduring social, cultural, and political force shaping this history. Students will therefore learn especially about the routes of Islam through plantation slavery and slave rebellion, as well as twentieth-century Pan-African organizing, the Civil Rights movement, and hip hop. We will also connect this history to more recent trends in immigration, the &quot;War on Terror,&quot; and state surveillance of mosques. There are no prerequisites, though it is highly recommended that students arrive with an understanding of the basic terminology of Islamic studies, and a keen interest in exploring the Islam's connection to issues of American race, religion, colonialism, and secularism."}, {"name": "Teaching Method", "value": "DiscussionLectureSeminarWriting assignments<ln/>"}, {"name": "Evaluation Method", "value": "AttendanceClass participationPaper, finalPresentationsReadingsWriting assignments"}, {"name": "Class Materials (Required)", "value": "Kambiz GhaneaBassiri, A History of Islam in America. ISBN: 0521614872<br/><br/>Richard Brent Turner, Islam in the African American Experience. ISBN: 0253216303<br/><br/>Edward Curtis, The Columbia Sourcebook of Muslims in the United States. ISBN: 0231139578"}, {"name": "Class Notes", "value": "Counts toward (RLP) Religion, Law and Politics major concentration."}], "lmod": "12/24/16 7:07 PM (CT)", "subject": "RELIGION"}]