[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "Harris Hall L06"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "34232", "title": "WCAS HISTORY 303-1-1 American Women's History, to 1865", "class_attributes": "Historical Studies Distro Area<br/><br/>Attendance at 1st class mandatory<br/><br/>", "section": "34232", "instructors": [{"instructor_phone": "847/491-3744", "instructor_name": "Susan   Pearson", "instructor_addr": "Harris Hall - Room 338"}], "topic": "", "course": "303-1", "descriptions": [{"name": "Overview of class", "value": "This course is a survey of U.S. women's history from colonial settlement through 1865. It focuses not only women's experiences and activities in the past but also on how constructions of gender have been critical to American political and economic development. <br/><br/>There are different ways of doing women's history and this course includes examples of many of them. In some versions of women's history, we simply add women to the events of the past - asking, for example: how did women contribute to the American Revolution? In other versions, we show how adding women to history changes fundamentally our understanding of the past. Still more radical, we consider not women's roles and activities in the past, but instead how gender as an ideology has structured our thought and been used to organize the way we distribute power, money, work, responsibility.<br/><br/>Concretely, we begin our study with the arrival of Europeans in the &quot;new world&quot; and we end with the Civil War. As we march through time we will survey not only different ways of thinking about women and gender in the past, but we will also pay attention to how the category of &quot;woman&quot; has been fractured by the differences in status and experience that result from divisions of class, race, region, religion, and ethnicity."}, {"name": "Teaching Method", "value": "Lecture"}, {"name": "Evaluation Method", "value": "Attendance, Participation, Short Response Papers, &amp; Two Essays (5 pgs. each)"}], "lmod": "2/16/17 6:47 PM (CT)", "subject": "HISTORY"}]