[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Harris Hall L28"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "33426", "title": "WCAS HISTORY 300-0-24 New Lectures in History", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "33426", "instructors": [{"instructor_phone": "", "instructor_name": "Lina M Britto", "instructor_addr": "Harris Hall 302"}], "topic": "Making Drugs in the Americas", "course": "300-0", "descriptions": [{"name": "Overview of class", "value": "To understand how and why narcotrafficking became one of the most profitable and violent industries in the hemisphere, this course examines the history of production, commercialization, consumption and criminalization of mind-altering drugs in the Americas. We consider the late colonial history of the export of tropical commodities as stimulants; the repression of domestic consumption and its connection to the formation of national identities; the correlation between liberal reforms and the emergence of transnational illegal networks; the construction of the &quot;drug problem&quot; during the period after World War II; the rise of the cartels along circuits of immigration; the implementation of the &quot;war on drugs&quot; as an essential component of Cold War in Latin America; the role of violence and masculinity in the drug trade; and the most recent debates on decriminalization and legalization in North and South America. We address these topics in an interdisciplinary manner, reading history, anthropology, sociology, political science and journalism, and watching and analyzing critically featured films and documentaries."}, {"name": "Teaching Method", "value": "Lecture"}, {"name": "Evaluation Method", "value": "Attendance and participation, in-class quizzes, response papers, and final paper."}, {"name": "Class Materials (Required)", "value": "READING LIST: <br/>Sidney Mintz, &quot;The Forefathers of Crack,&quot; NACLA Report on the Americas 22, no. 6, (1989); Paul B. Stares, <br/>Global Habit: The Drug Problem in a Borderless World (1996); Paul Gootenberg, Andean Cocaine. The Making of a Global Drug (2008); Eduardo Sáenz Rovner, The Cuban Connection. Drug Trafficking, Smuggling and Gambling in Cuba from the 1920s to the Revolution (2008); Isaac Campos, Home Grown. Marijuana and the Origins of Mexico's War on Drugs (2012); Kathleen J. Frydl, The Drug Wars in America, 1940-1973 (2013); Peter Andreas, Smuggler Nation: How Illicit Trade Made America (2013); Suzanna Reiss, We Sell Drugs. The Alchemy of US Empire (2014)."}, {"name": "Class Notes", "value": "Attendance and participation are evaluated. No lap-top use in classroom. Special cases will be considered. Electronic devices should be silenced or turned off.<br/><br/>HISTORY AREA OF CONCENTRATION: Americas"}], "lmod": "4/3/16 8:03 PM (CT)", "subject": "HISTORY"}]