[{"school": "WCAS", "overview_of_class": "In settler societies, Indigenous peoples must be recognized by the state as sufficiently authentic in order to have rights as legitimate Indigenous peoples. This constitutes a structural dilemma in which Indigenous people face considerable pressure to embody external stereotypes and racial expectations. In this seminar, we will engage with recent scholarship in Native American and Indigenous Studies that addresses indigeneity as a political status, a supposed biological category and frozen temporal/geographic state, and a social experience. Our readings will also engage feminist and queer perspectives on the problem of authenticity and we will devote attention to the appropriation of Indigenous culture by non-Indigenous people. Our primary focus will be on Anglophone settler states, especially the United States and Canada, but we will occasionally draw upon examples elsewhere in the world. Moreover, we will discuss indigeneity as a source of global affinity among colonized peoples and as a human rights framework within the United Nations.", "name": "Special Topics in the Humanities", "section": "20", "location": "University Hall 101", "topic": "Real Indians: Indigeneity & the Authenticity Probl", "course": "370-4", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4660/WCAS/HUM/370-4/33947", "instructor": ["Douglas   Kiel"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "33947", "subject": "HUM"}, {"school": "WCAS", "overview_of_class": "Griffins, sphinxes, and other fabulous creatures, along with imaginary animals, appear frequently in the art of ancient Egypt, Mesopotamia, and the Mediterranean world. They stand at the intersection of the normal and abnormal, the natural and unnatural. Why did these images become such favorite subjects for artistic representations, and what do they tell us about the cultures that produced them? Can we connect the invention of supernatural creatures composed from multiple species with key moments in human social and cognitive development, such as the emergence of urban society? Drawing on new perspectives from multiple disciplines, including art history, history, and archaeology, this course explores the phenomenon of the monstrous in ancient art.", "name": "Special Topics in the Humanities", "section": "21", "location": "University Hall 112", "topic": "Monsters, Art, & Civilization", "course": "370-4", "meeting_time": ["TuTh 9:30AM - 10:50AM"], "path": "/class-descriptions/4660/WCAS/HUM/370-4/33948", "instructor": ["Ann C Gunter"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "33948", "subject": "HUM"}, {"school": "WCAS", "overview_of_class": "In this course, we will conceptualize Native peoples as nations, not merely racial/ethnic minorities. Students will learn about the unique legal landscape in Indian Country by charting the historical development of tribal governments and the ever-changing body of U.S. law and policy that regulates Indian affairs. We begin by studying Indigenous legal traditions, the European doctrine of discovery, and diplomatic relations between Native nations and European empires. We then shift our focus to treaty-making, the constitutional foundations of federal Indian law, 19th century U.S. Supreme Court decisions, and the growth of the federal bureaucracy in Indian Country. The course devotes considerable attention to the expansion of tribal governmental authority during the 20th century, the contemporary relationship between Indian tribes and the federal/state governments, and the role of federal Indian law as both a tool of U.S. colonial domination and a mechanism for protecting the interests of Indigenous communities.", "name": "Special Topics in the Humanities", "section": "30", "location": "Parkes Hall 224", "topic": "Development of American Indian Law & Policy", "course": "370-4", "meeting_time": ["MoWe 11:00AM - 12:20PM"], "path": "/class-descriptions/4660/WCAS/HUM/370-4/33949", "instructor": ["Douglas   Kiel"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "33949", "subject": "HUM"}]