[{"class_mtg_info": [{"meet_t": "MoWeFr 10:00AM - 10:50AM", "meet_l": "University Library 5746"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "37931", "title": "WCAS PORT 121-3-1 Intermediate Portuguese", "class_attributes": "", "section": "37931", "instructors": [{"instructor_phone": "847/491-8127", "instructor_name": "Raquel   Amorese", "instructor_addr": "1-205 Kresge"}], "topic": "", "course": "121-3", "descriptions": [{"name": "Overview of class", "value": "Portuguese 121-3 is the last course of the intermediate level in Portuguese. Based on the communicative approach, this course helps students to achieve the intermediate language level of proficiency through furthering development of listening, speaking, reading and writing skills. Emphasis will be given to linguistic functions. Grammar, vocabulary and pronunciation of Brazilian Portuguese will continue to be developed through meaningful cultural contexts. The course also offers insights into the history and culture of the Portuguese speaking countries in Europe, Africa and America. Focusing on the mastery of the language, it is important to emphasize that Portuguese is the language spoken for instruction and interaction among students."}, {"name": "Registration Requirements", "value": "Prereq: Portuguese 121-2 or Placement. <br/><br/>There is no P/N allowed. First class is mandatory"}, {"name": "Learning Objectives", "value": "To emphasize the development of spoken Brazilian Portuguese as the foundation for advanced training in oral expression, comprehension, as well as reading and writing.<br/>To offer insights into the history and culture of the Portuguese speaking countries of Europe, Africa and America.<br/>To achieve an Intermediate language skill level (based upon on the ACTFL Proficiency Guidelines, 2012) that will focus on development of linguistic functions including verbs in all tenses and moods.<br/>To develop an active vocabulary appropriate to an Intermediate level language course.<br/>To further develop the Portuguese language reading and writing skills <br/>To further develop fluency and accuracy essential to interaction and communication in Portuguese. <br/>Topics covered: Health, Sports and Society."}, {"name": "Teaching Method", "value": "Class participation<br/>Discussion<br/>Group work<br/>Lab<br/>Listening exercises<br/>Online work <br/>Presentations<br/>Problem sets<br/>Readings<br/>Simulation / role-play<br/>Writing assignments"}, {"name": "Class Materials (Required)", "value": "Portuguese 121-3 Course Packet. This material is available for purchase at QUARTET DIGITAL PRINTING (875 Clark Street, Evanston, IL)."}, {"name": "Class Materials (Suggested)", "value": "Portuguese Concise Dictionary. HarperCollins, 3rd ed. 2010.<br/>The Oxford New Portuguese Dictionary. Berkley, 2008.<br/>Modern Brazilian Portuguese Grammar: A Practical Guide. John Whitlam. New York: Routledge, 2011.<br/>Dicionário WordReference Português-Inglês<br/>(Free online version: http://www.wordreference.com/enpt/)"}], "lmod": "2/16/17 6:49 PM (CT)", "subject": "PORT"}]