[{"school": "WCAS", "overview_of_class": "Humans display great variation in many aspects of their biology, particularly in terms of physical growth and development, nutrition, and disease patterns. These differences are produced by both current ecological and environmental factors as well as underlying genetic differences shaped by our evolutionary past. It appears that many diseases of modern society, such as obesity, diabetes, cardiovascular disease, and various cancers, have resulted from change to a lifestyle that is quite different from that of our ancestors. These diseases thus reflect an imbalance between modern life conditions and those which shaped most of our evolutionary history. This course will explore the evolutionary dimensions of variation in health and disease pattern among humans. We will first review key concepts in evolutionary biology, and their application to human evolution. We will then examine bio-cultural and evolutionary models for explaining variation in specific human diseases.", "name": "Topics In Anthropology", "section": "22", "topic": "Evolutionary Medicine", "course": "390-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4620/WCAS/ANTHRO/390-0/31958", "instructor": ["Christopher W Kuzawa"], "id": "31958", "subject": "ANTHRO"}, {"school": "WCAS", "overview_of_class": "Did you know that all the microbes on and in your body weigh as much as your brain? And they can influence your body almost as much as your brain? They can determine how much weight you gain on a certain diet or whether you develop the symptoms of an autoimmune disease, and they can even affect your mood and behavior. Although we have long known the importance of microbes in the context of disease, recent advances in technology have opened up an entirely new field of research that is transforming perspectives on human health. In this course, we will explore the human microbiome beginning with an overview of different types of microbes and the methods we use to study them. Following that, the majority of the course will be dedicated to exploring new research on the microbes of the skin, mouth, gut, and uro-genital tract and their impacts on human health. We will also consider the influence of geography, politics, social structures, and culture on global patterns in the human microbiome and health.", "name": "Topics In Anthropology", "section": "23", "topic": "The Human Microbiome &amp; Health", "course": "390-0", "meeting_time": ["MoWe 12:30PM - 1:50PM"], "path": "/class-descriptions/4620/WCAS/ANTHRO/390-0/31953", "instructor": ["Katherine Ryan Amato"], "id": "31953", "subject": "ANTHRO"}, {"school": "WCAS", "overview_of_class": "From Chernobyl and Bhopal to Deep Water Horizon and Flint, Michigan toxicity looms as a persistent, uncertain, and often-intangible hazard throughout the world. The production and use of infrastructure, warfare, energy, agriculture, and everyday commodities present the potential for both massive chemical disasters as well as daily, long-term toxic exposure or what scholars refer to as &quot;slow violence.&quot; This seminar examines the commodity chains, political controversies, fraught science, social movements, racial discrimination, and economic inequalities connected to the toxins we live with. Our ethnographic and historical case studies will cover diverse regions and contexts including: mining in Latin America and Indonesia, the Bhopal and Chernobyl disasters, nuclear energy and warfare, oil extraction and fracking, urban lead exposure in Michigan and Chicago, pesticides in the Caribbean, industrial runoff in Japan, work place exposures in the US and more.", "name": "Topics In Anthropology", "section": "24", "topic": "Toxicity, Politics, and Slow Violence", "course": "390-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4620/WCAS/ANTHRO/390-0/31954", "instructor": ["Stefanie Toney Graeter"], "id": "31954", "subject": "ANTHRO"}, {"school": "WCAS", "overview_of_class": "WCAS ANTHRO 390-0-23: Topics In Anthropology: Globalizing India: Beyond 'Modernity' &amp; Tradition'. <br/><br/>Overview of class<br/>In urban India, malls and McDonalds stand side by side with centuries-old temples and illegal squatter settlements. In rural hinterlands, tribal communities use the internet to organize global protests against industrial schemes that will drown and destroy their villages, while farmers commit suicide after crops forced on them by Monsanto fail to yield a profit. How can we grasp the complex processes of globalization in India without resorting to tired tropes of tradition and modernity? With the aid of popular fiction and film as well as scholarly articles and ethnographies, students in this course will consider globalization in India as a historical, economic, and sociocultural process that is transforming the way Indians experience and think about themselves, their cities, their nation, and everyday life.", "name": "Topics In Anthropology", "section": "25", "topic": "Globalizing India", "course": "390-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4620/WCAS/ANTHRO/390-0/31955", "instructor": ["Meredith L McGuire"], "id": "31955", "subject": "ANTHRO"}, {"school": "WCAS", "overview_of_class": "Native Americans experience significant disparities in health and in access to health care. This course introduces students to Native American health by exploring the social, cultural, political, and environmental determinants influencing Native health both historically and today. This course is designed as a reading intensive, discussion-based seminar, drawing upon research and contributions from a variety of disciplines including American Indian studies, anthropology, history, psychology, public health, and medicine.", "name": "Topics In Anthropology", "section": "26", "topic": "Native American Health", "course": "390-0", "meeting_time": ["Tu 3:00PM - 5:50PM"], "path": "/class-descriptions/4620/WCAS/ANTHRO/390-0/31956", "instructor": ["Margaret Ellen Pollak"], "id": "31956", "subject": "ANTHRO"}, {"school": "WCAS", "overview_of_class": "Topics in Ethno-Biology.<br/><br/>This class will introduce and cover topics in Ethno-biology which is the scientific study of dynamic relationships among peoples, biota, and environments. As a multidisciplinary field, ethnobiology integrates archaeology, geography, systematics, population biology, ecology, mathematical biology, cultural anthropology, ethnography, pharmacology, nutrition, conservation, and sustainable development. This class will cover theory and practice, ethnobotany; ethnozoology; and culturally and community based practices and solutions to ecosystem, agriculture, and land management. We will look at case studies from across the globe ranging from mulberry groves and Sufi musicians in Central Asia; the relationships of beavers, wolves, bison, and people in Yellowstone and Chernobyl; traditional plant harvesting on Mt. Rainer in Washington State; and emerging urban and community forestry practices within Chicago American Indian community. <br/><br/>AREA OF CONCENTRATION: <br/>Anthropology, Sociology, Environmental Science, Botany, Zoology, Agricultural Sciences, Land Management, Native American and Indigenous Studies, Forestry, Ecology,", "name": "Topics In Anthropology", "section": "27", "topic": "Topics in Ethno-Biology", "course": "390-0", "meeting_time": ["MoWe 11:00AM - 12:20PM"], "path": "/class-descriptions/4620/WCAS/ANTHRO/390-0/37695", "instructor": ["Eli S Suzukovich III"], "id": "37695", "subject": "ANTHRO"}]