[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "University Library 5722"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "33434", "title": "WCAS HISTORY 393-0-20 Approaches to History", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "33434", "instructors": [{"instructor_phone": "", "instructor_name": "Lina M Britto", "instructor_addr": "Harris Hall 302"}], "topic": "Oral Hist &amp; Terror Archives in Latin Amer", "course": "393-0", "descriptions": [{"name": "Overview of class", "value": "This course helps students understand oral history as part of a political battlefield in Latin America in which popular political consciousness, collective identities, and social movements are made. We will unpack the concepts and practices of oral history by discussing the theoretical and methodological challenges that professional historians and social scientists confronted when doing oral history in the region and beyond. Then, we will study the &quot;archives of terror&quot; of the Dirty Wars of Central and South America (1960s-1990s), in which various forms of orality (i.e. documentary film, testimony, life histories, interviews, and truth commissions) helped victims of violence as well as perpetrators to intervene in the peace processes and/or democratic transitions seeking justice, reparation, forgiveness, forgetfulness, amnesty, and immunity. We will analyze the political, epistemological, ethical, and aesthetical limitations of these efforts to heal the wounds of state-led violence, dictatorship, genocide, and guerrilla warfare. The overarching goal of the course is to understand oral history as a prism that reflects and refracts oral and written forms of making sense of the past, and to understand why it has played such a fundamental role in the definition of the &quot;historical truth&quot; in the turbulence of Latin America at the end of the twentieth century and the beginning of the twenty-first."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Attendance and participation, oral presentations, response papers, and final paper."}, {"name": "Class Materials (Required)", "value": "TENTATIVE READING LIST: <br/>Rigoberta Menchú, I, Rigoberta Menchú. An Indian Woman in Guatemala (1984); Ronald J. Grele, <br/>Envelopes of Sound. The Art of Oral History (1991); Thomas Abercrombie, Pathways of Memory and Power. Ethnography and History Among an Andean People (1998); Peter Kornbluh, The Pinochet File. A Declassified Dossier on Atrocity and Accountability (2003); María Eugenia Vásquez Perdomo, My Life as a Colombian Revolutionary. Reflections of a Former Guerrilla (2005); Robert Perks, ed., The Oral History Reader (2006); Paula Hamilton and Linda Shopes, eds., Oral History and Public Memories (2008); Kirsten Weld, Paper Cadavers. The Archives of Dictatorship in Guatemala (2014)."}, {"name": "Class Notes", "value": "Attendance and participation are evaluated. No lap-top use in classroom. Special cases will be considered. Electronic devices should be silenced or turned off.<br/><br/>HISTORY AREA OF CONCENTRATION: Americas"}], "lmod": "4/3/16 8:04 PM (CT)", "subject": "HISTORY"}]