[{"class_mtg_info": [{"meet_t": "We 1:00PM - 3:50PM", "meet_l": "Parkes Hall 222"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Fall 2016", "name": "14508", "title": "WCAS SOCIOL 400-0-20 Introduction to Statistics &amp; Statistical Software", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "14508", "instructors": [{"instructor_phone": "", "instructor_name": "Quincy Thomas Stewart", "instructor_addr": ""}], "associated_classes": [{"component": "LAB", "room": "University Lib B182 - Comp Cla", "meeting_time": "We 9:00AM - 9:50AM"}], "topic": "", "course": "400-0", "descriptions": [{"name": "Overview of class", "value": "Social scientists use quantitative methods to explore and test hypotheses, describe patterns in survey and census data, analyze experimental findings, and dynamically model social relations among individuals and groups. The aim of this course is to introduce students to the basic concepts of quantitative methods as they relate to social research, and lay the foundation for more advanced graduate-level courses in multiple regression, regression models for categorical dependent variables, event-history analysis, etc."}, {"name": "Learning Objectives", "value": "Students in the course will learn to: use graphs, tables, and measures of central tendency and spread to summarize data; explain random sampling using probability concepts; explain what a sampling distribution is and give a rudimentary explanation of its role in inferential statistics; calculate and explain confidence intervals; test hypotheses about means, proportions, and pairs of means and proportions; test the hypothesis of independence in a contingency table; compute and interpret correlations and regressions for pairs of variables; and use Stata statistical software to perform basic statistical analysis."}, {"name": "Teaching Method", "value": "Lecture"}, {"name": "Evaluation Method", "value": "Homework assignments; quizzes; final program."}, {"name": "Class Materials (Required)", "value": "This is a tentative booklist. Please confirm all books before purchase. <br/><br/><br/>Agresti, Alan and Barbara Finlay. 2009. Statistical Methods for the Social Sciences. 4th Edition. New York: Prentice Hall.<br/><br/><br/>Alan C. Acock. 2010. A Gentle Introduction to Stata, 3rd Edition. College Station, Texas: Stata Press. Provides an introduction to Stata and serves as a compact Stata manual."}], "lmod": "10/30/16 7:10 PM (CT)", "subject": "SOCIOL"}]