[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:50PM", "meet_l": "Wirtz Center STRUB"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24266", "title": "WCAS LATINO 393-0-20 Topics in Latina and Latino Text and Representation", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "24266", "instructors": [{"instructor_phone": "847.491.3157", "instructor_name": "Henry Dominic Godinez", "instructor_addr": "Theatre and Interpretation Center 1949 Campus Drive, Evanston"}], "topic": "", "course": "393-0", "descriptions": [{"name": "Overview of class", "value": "This course is designed to introduce the student to a cross-section of contemporary Latino plays, a general history of Latino theatre in the U.S. and current trends in Latino Theatre. The course will provide an overview of the state of professional Latino theatre and its impact on and place in the broader American professional theatre field. The class is partly the reading of dramatic literature, along with critical analysis and discussion, and some performance. There will generally be one play assigned per class, with each play assigned one student presenter. The student presenters are responsible for introducing the play in class, initiating discussions, capturing thematic issues, and identifying pivotal scenes, which will generally be read in class. The professor will support the student presenters as needed but it is the student presenters' responsibility to organize the discussions and readings as they see fit, according to how their particular play moves them and impacts their imaginations. The class will culminate in final scene and monologue performances, and a critical/creative paper that engages a shared theme across two plays from the reading list of the students' choice."}, {"name": "Learning Objectives", "value": "The objective of this course is to introduce students of all cultural and ethnic backgrounds to the wealth of contemporary Latino plays in the United States and to provide them the opportunity as students/actors to live inside a culture that is possibly different from their own. The goal of this class is to have the student gain a considerable knowledge of the state of contemporary Latino theatre in the United States by investigating a cross-section of plays that represent the diversity of communities and experiences represented under the term &quot;Latina/o&quot;. Through the reading, analyzing and discussion of plays, and the rehearsal and performance of monologues, the student actor will have the opportunity of exploring the diversity of Latina/o culture within a safe and inclusive creative space. While acting experience is not required and &quot;talent&quot; is viewed as relative, 100% investment is always an expectation."}, {"name": "Teaching Method", "value": "LectureReadingsInstruction will come from a combination of lecture, designed to complement the leadership and initiative of the student presenters assigned to each play, along with some cold reading of the dramatic literature. Student presenters will also be responsible for some general biographical information on the playwrights and brief production history, both of which should be easily available on-line and complimented by the professor. Students will be responsible for selecting monologues and scenes, although the professor reserves the right to make suggestions. Final scenes and monologues will be fully memorized and staged. In order to provide as broad a spectrum of material as possible, some critical articles may also be assigned prior to class, and portions of plays may be read out loud in class."}, {"name": "Evaluation Method", "value": "AttendancePapersPresentationsSimulation / role-playAll students will be graded according to their level of commitment, participation, discipline, growth/progress and attendance. In this class students are encouraged to take risks and maintain a serious willingness to fail because only through risk-taking and failure can a student actor truly learn and grow. A good sense of humor is strongly recommended. Attendance is strictly enforced and is a representation of your commitment to learning."}, {"name": "Class Materials (Required)", "value": "Latino Theatre course packets available at Quartet Copies are required. <br/>Some additional biographical material, historical background, and related articles may be provided by the professor during the course of the session."}], "lmod": "12/29/16 7:01 PM (CT)", "subject": "LATINO"}]