[{"school": "SoC", "overview_of_class": "RTVF 380 - Lighting and Cinematography<br/> <br/>Course Description & Learning Objectives<br/>This is one of the cornerstone classes of your production experience in the film department at NU. You'll be introduced to Super 16mm film via the Arri SRII. You will learn the bulk of the lighting and grip equipment in the cage. You will learn basics of light, color, lenses, emulsion, and film stocks.<br/> <br/>In addition to the technical side of cinematography, you will begin to explore the artistic side of this craft. You will expand on your work in RTVF 190 by examining framing and composition, light and shadow, and color as they apply to the moving image. You will work rigorously on your ability to translate meaning, story, and idea into image. Finally, you will gain invaluable experience in the collaborative process of filmmaking.<br/> <br/>Evaluation Method<br/>Attendance and Participation<br/>Compete Three Production Projects<br/>Practical Exam<br/>Written Exam<br/> <br/>Class Materials:<br/> <br/>Text:<br/>Blain Brown, Cinematography: Theory and Practice 3rd Ed. New York: Focal Press, 2016 <br/>($55 new, $22 rented)<br/> <br/>Required Supplies:<br/>Each student is required to make a modest investment in a grip/ assistant camera kit. Most of these items are available at the local hardware store, or online (filmtools.com, studiodepot.com, bhphotovideo.com)<br/>?Required:<br/>Leather work gloves to handle lights (these cannot be made of cloth, or rubber)<br/>1/4\" or 3/8\" flat head screwdriver OR multi-tool (e.g. Leatherman)<br/>Roll of 1-inch black gaffer tape<br/>Roll of 1-inch white gaffer tape<br/>Lens paper, or microfiber camera cloth AND lens cleaning solution<br/>Can of compressed air AND air puffer/ lens brush<br/>Flashlight (Maglite, or LED)<br/>Vis-à-vis marker<br/>Orangewood sticks<br/>(estimated total supply cost $50)", "name": "Lighting and Cinematography", "section": "20", "location": "Louis Hall 106", "topic": "", "course": "380-0", "meeting_time": ["Tu 3:00PM - 4:50PM", "Th 3:00PM - 4:50PM"], "path": "/class-descriptions/4660/SoC/RTVF/380-0/34658", "instructor": ["Christopher R Jensen"], "class_attributes": "Prerequisites apply, see description<br/><br/>", "id": "34658", "subject": "RTVF"}]