[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "Technological Institute L251"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-requisite: Students must have completed BIOL_SCI 302-0 or BIOL_SCI 311 to register for this course.<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Winter 2017", "name": "21157", "title": "WCAS BIOL_SCI 304-0-1 Developmental Neurobiology", "class_attributes": "Prerequisites apply, see description<br/><br/>", "section": "21157", "instructors": [{"instructor_phone": "847/467-0478", "instructor_name": "Jianhua   Cang", "instructor_addr": "Pancoe 2-115"}], "topic": "", "course": "304-0", "descriptions": [{"name": "Overview of class", "value": "The diverse functions of the nervous system depend on precise wiring of connections between neurons. This course will cover cellular and molecular processes of how neuronal connections are established during development, including the role of activity-dependent plasticity. Diseases resulting from failures of these processes will be discussed. This course will also introduce research methods and technology, and encourage students to develop skills to appreciate historical context and logical rationale of contemporary research."}, {"name": "Registration Requirements", "value": "This is an advanced undergraduate level course. Basics of genetics, molecular and cell biology are required. Students taking the course must be willing to devote extra hours per week, outside of the classroom, prepare presentation/discussion for the course.<br/><br/>Prerequisites: 302 or 311"}, {"name": "Teaching Method", "value": "The course is taught with the combination of lectures and student presentations/discussions."}, {"name": "Evaluation Method", "value": "Students are required to read relevant chapters in the textbook and assigned papers of contemporary research. Each student will give a 20-30 min oral presentation of a scientific article in a journal club format and write a short report on another article. There will be a midterm and a final exam. Participation of paper presentation/discussion sections is mandatory. The final grade will be determined by performance from midterm (25%), paper presentation (10%) and discussion (10%), written report (15%) and final exam (40%)."}, {"name": "Class Materials (Required)", "value": "Required textbook: Development of the Nervous System, (Sanes, Reh and Harris) ISBN: 978-0-12-374539-2<br/>Assigned articles of contemporary research"}, {"name": "Class Materials (Suggested)", "value": "Optional textbook: Neuroscience: Exploring the Brain, 4th Ed., by Mark F. Bear. Lippincott Williams &amp; Wilkins. ISBN: 9780781778176."}], "lmod": "12/29/16 6:54 PM (CT)", "subject": "BIOL_SCI"}]