[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "University Hall 218"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "23146", "title": "WCAS ENGLISH 105-0-20 Expository Writing", "class_attributes": "", "section": "23146", "instructors": [{"instructor_phone": "847/491-4560", "instructor_name": "Jeanne Elizabeth   Herrick", "instructor_addr": "555 Clark St., 237"}], "topic": "", "course": "105-0", "descriptions": [{"name": "Overview of class", "value": "Expository writing is designed for any student who wants a strong introductory course in college-level writing. While all students will further develop their ability to write analytical and persuasive essays, students who are non-native writers of English will have the opportunity to focus on further developing their ability to write these academic essays in English. Because all students will meet regularly with the instructor in individual conferences, non-native English speakers will get individualized attention on writing grammatically correct English prose.<br/><br/>PROJECTS:<br/><br/>Students write three or four extended pieces of expository writing, developing each through a process of planning, drafting, revising, and editing. Students also complete several briefer exercises in which they experiment with specific writing techniques or use informal writing as a tool for exploring ideas."}, {"name": "Teaching Method", "value": "Class discussion, in-class writing exercises, writing workshops, and individual conferences with instructor."}, {"name": "Evaluation Method", "value": "Students will be graded on their progress as well as their proficiency in writing essays in English as demonstrated in three major papers and in-class writing exercises. This will account for 75% of students' course grade. The remaining 25% will be based on students' preparation for and participation in class discussions, writing workshops, and writing conferences."}, {"name": "Class Notes", "value": "Registration for this course is not handled by the English department. Questions about this course should be directed to The Cook Family Writing Program: writing-program@northwestern.edu"}], "lmod": "1/9/16 6:46 PM (CT)", "subject": "ENGLISH"}]