[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Technological Institute LG72"}], "school": "MEAS", "enrl_requirement": "Enrollment Requirements: REASON: Pre-registration is not allowed for this class. Please try again during regular registration.", "qtr": "Spring 2017", "name": "31761", "title": "MEAS EECS 395-0-22 Special Topics in Electrical Engineering and Computer Science", "class_attributes": "", "section": "31761", "instructors": [{"instructor_phone": "", "instructor_name": "Nikolaos   Hardavellas", "instructor_addr": ""}], "topic": "Adv Top: Comp Architect", "course": "395-0", "descriptions": [{"name": "Overview of class", "value": "CATALOG DESCRIPTION: The course discusses modern processor architectures, the constraints that limit their design and programmability, and promising techniques to mitigate these constraints.<br/><br/>DETAILED COURSE TOPICS: The course will have a seminar format. The students will present papers in the class, write paper reviews, and discuss each paper in depth during class meetings. The class will cover recent research in various topics:<br/><br/>* Memory and caches (e.g., NUCA caches, prefetching and streaming, 3D-die stacking, phase-change memory)<br/>* On-chip interconnects<br/>* Programmability (e.g., transactional memory, enforcing sequential consistency)<br/>* Speculative threading and parallelization<br/>* Debugging/monitoring support<br/>* Power/thermal management<br/>* Reliability and fault tolerance<br/>* Process variability<br/>* Unconventional/specialized architectures"}, {"name": "Registration Requirements", "value": "PREREQUISITES: EECS 361 or instructor's consent. EECS 358, EECS 452, and EECS 453 are useful but not required."}, {"name": "Learning Objectives", "value": "COURSE OBJECTIVES: The course aims to offer a firm background for research in computer architecture. The students that successfully complete the course will be exposed to a variety of cutting-edge research topics, be able to read and critique research publications in computer architecture, perform conference-quality paper reviews, perform research presentations, write research reports, and gain familiarity with state-of-the-art tools for research in computer architecture. Along with providing technical<br/>knowledge, the course also aims to develop the student's ethos as researchers and research referees, and sharpen the students team-participation skills."}, {"name": "Evaluation Method", "value": "Class participation: class participation 20%,<br/>Homework: homework assignments 20%<br/>Presentations: presentation 20%<br/>Project, final: project 40%<br/>"}, {"name": "Class Materials (Required)", "value": "REQUIRED TEXTS: None; we'll draw material from seminal and recent publications in top conferences."}], "lmod": "2/14/17 6:36 PM (CT)", "subject": "EECS"}]