[{"school": "WCAS", "overview_of_class": "This course will introduce students to research methods in psychology.  Through lecture and lab sections, students will learn about both research design and data analysis.  This course will include several group research projects as well as individual written assignments.  Primary goals for the course include (1) improvement of scientific writing, (2) development of skills in research design (experimental and non-experimental), (3) learning basics of data analysis (using a statistical software package), and (4) development of critical thinking skills.  By the end of the class students should be better able to conduct their own research and critically interpret the results of others' research.", "name": "Research Methods in Psychology", "section": "20", "topic": "", "course": "205-0", "meeting_time": ["TuTh 6:30PM - 7:50PM"], "path": "/class-descriptions/4610/WCAS/PSYCH/205-0/20926", "instructor": ["Christopher Ryan Schmader"], "id": "20926", "subject": "PSYCH"}, {"school": "WCAS", "overview_of_class": "This course will introduce students to methods used in psychological research. Through readings, lectures, discussion, and hands-on activities (specifically the handling of a statistics program used for data collection and analyses), students will learn about the scientific approach to research designs and about the analysis and interpretation of data. They will participate in novel research projects and will write a report on each in the style used by research psychologists.<br/><br/>Primary goals are for students to learn (1) testing hypotheses, including data collection and statistical analyses, (2) writing effectively about research plans and findings, and (3) critically evaluating psychological research done by other people.", "name": "Research Methods in Psychology", "section": "21", "topic": "", "course": "205-0", "meeting_time": ["MoWeFr 10:00AM - 10:50AM"], "path": "/class-descriptions/4610/WCAS/PSYCH/205-0/20927", "instructor": ["Benjamin J Gorvine"], "id": "20927", "subject": "PSYCH"}, {"school": "WCAS", "overview_of_class": "This course provides an introduction to designing, conducting, evaluating, and presenting psychological research.  Among the topics to be covered are: experimental and non-experimental research; statistical analyses; writing psychological reports; ethics in research; and utilizing library resources.  Students will collect and analyze data for three research projects during the quarter and write a report on each in the style used by research psychologists.", "name": "Research Methods in Psychology", "section": "22", "topic": "", "course": "205-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4610/WCAS/PSYCH/205-0/20928", "instructor": ["Sara Cantonia Broaders"], "id": "20928", "subject": "PSYCH"}, {"school": "WCAS", "overview_of_class": "Psychological science allows us to make observations about the world and then empirically test them using the scientific method. The main purpose of this course is to provide you with the framework and mindset to think like a social scientist and the tools to study psychological questions. The focus of this course will be on critical thinking skills and analytical skills, each applied to the question of how to advance science incrementally. Although most examples in the course will be drawn from social psychology, the skills taught in this class are not content-specific and can be applied to any course within psychology. Students will learn about the social science approach to conducting research, including ethical standards, methods employed, and communicating science to a variety of audiences from peers to non-academics.", "name": "Research Methods in Psychology", "section": "23", "topic": "", "course": "205-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4610/WCAS/PSYCH/205-0/20929", "instructor": [""], "id": "20929", "subject": "PSYCH"}]