[{"class_mtg_info": [{"meet_t": "Mo 3:30PM - 6:20PM", "meet_l": "University Hall 118"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "35424", "title": "WCAS POLI_SCI 395-0-25 Political Research Seminar", "class_attributes": "", "section": "35424", "instructors": [{"instructor_phone": "", "instructor_name": "Martha Anne Wilfahrt", "instructor_addr": ""}], "topic": "Politics of Service Provision", "course": "395-0", "descriptions": [{"name": "Overview of class", "value": "POLI SCI 395-0-25 Spring 2017 &quot;A Right to the Good Life? The Politics of Social Welfare&quot; Prof. Martha Wilfahrt<br/>For much of the 20th century, citizens have been understood as having a right to government-provided social services, such as schools, healthcare and roads. Yet this has not always been the case in the West and, elsewhere in the world, states have often failed to provide robust social services. As the extent of government service provision become increasingly contested in America and elsewhere, this seminar takes a global and historical perspective to the politics of social welfare. Why did states begin providing social services to their citizens and why has this been increasingly contested in recent years? What motivates politicians to deliver services across continents and regime type and what impact does this have not only for citizens' quality of life, but also their political engagement?<br/><br/>This seminar answers these questions in three parts, drawing on theoretical and empirical evidence from around the world. We will begin by evaluating the rise of the welfare state in Europe and North America and the ways in which this model has been challenged in recent decades. We will then look elsewhere in the world: why have alternative models arisen in some areas while elsewhere no welfare regime emerges at all, with services increasingly provided by private actors? Finally, the course will turn to how service provision is negotiated between citizens, politicians and informal actors across different regime types. The course concludes with a discussion of the intended and unintended political consequences of social welfare provision."}, {"name": "Registration Requirements", "value": "Attendance at 1st class mandatory; Juniors/Seniors Only"}, {"name": "Learning Objectives", "value": "Students will (i) acquire a critical understanding of the politics of social welfare and be able to theorize why this has varied across time and space; (ii) students will improve their capacity to read and analyze political science research, with particular emphasis on evaluating how readings draw on a range of evidence to make causal arguments; (iii) writing an original paper, students will develop their ability to articulate and answer strong research questions; and finally, (iv) in-class work will help students develop their presentational and speaking skills."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Discussion, in-class presentations, final research paper"}, {"name": "Class Materials (Required)", "value": "Course Reader"}], "lmod": "2/6/17 8:43 AM (CT)", "subject": "POLI_SCI"}]