[{"class_mtg_info": [{"meet_t": "We 2:00PM - 4:50PM", "meet_l": "Scott Hall 201 Ripton Room"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "12755", "title": "WCAS POLI_SCI 395-0-20 Political Research Seminar", "class_attributes": "Auditing not permitted<br/><br/>Juniors/Seniors Only<br/><br/>", "section": "12755", "instructors": [{"instructor_phone": "847 4671147", "instructor_name": "Laurel Harbridge Yong", "instructor_addr": "601 University Place # 311"}], "topic": "Party Polarization", "course": "395-0", "descriptions": [{"name": "Overview of class", "value": "Prof. Laurel Harbridge, Party Polarization in American Politics, Fall 2016<br/>Is the American public polarized? What about political elites? What do we mean by party polarization and what does this phenomenon mean for issues of representation, government productivity, and civic engagement? This research seminar explores these and other questions related to polarization in American politics, including timely new topics related to the Tea Party and House Freedom Caucus, gridlock in politics, and the current election. Using the knowledge and skills that they gain in the course, students will each put together a research paper of their own that answers a question of their own choosing."}, {"name": "Registration Requirements", "value": "Junior or Senior"}, {"name": "Learning Objectives", "value": "By the end of the course, students will be able to:<br/>1) Assess the degree of polarization in the public and among elites.<br/>2) Critically evaluate claims about polarization in politics.<br/>3) Explain empirical evidence in scholarly works and assess the strength of this evidence.<br/>4) Differentiate normative and positivist arguments."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Attendance and participation; in-class debates, research paper and presentation"}, {"name": "Class Materials (Required)", "value": "REQUIRED BOOK:<br/>MCCARTY, NOLAN, KEITH POOLE, AND HOWARD ROSENTHAL. 2016. POLARIZED AMERICA: THE DANCE OF IDEOLOGY AND UNEQUAL RICHES. CAMBRIDGE, MA: MIT PRESS. 2nd EDITION<br/>ISBN: 978-0262528627"}], "lmod": "10/30/16 7:09 PM (CT)", "subject": "POLI_SCI"}]