[{"class_mtg_info": [{"meet_t": "Th 5:00PM - 7:50PM", "meet_l": "University Hall 112"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "23091", "title": "WCAS ANTHRO 390-0-26 Topics In Anthropology", "class_attributes": "", "section": "23091", "instructors": [{"instructor_phone": "847/491-4825", "instructor_name": "Caroline H Bledsoe", "instructor_addr": "1810 Hinman Ave., Room 201, EV Campus"}], "topic": "Obstetrics in Cultural Perspective", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "Childbearing is often described as the most &quot;natural&quot; human function. While the subject of &quot;nature&quot; has drawn much anthropological attention, surprisingly little has been written on the importance for social theory that preventive medicine and public health strategies surrounding this most apparently &quot;natural&quot; function hold. Because reproduction is so strongly associated with in our society, viewing it through a cultural lens poses significant challenges to some of our most basic tenets. Tensions arise in questions of agency vs. control, nature vs. culture, identity construction, reproducing under varying conditions, and so on. Among all the topics in reproduction, obstetrics, the technical study and practice of childbirth, offers one of the most fascinating applications of anthropology. Close scrutinies of the work of physicians, midwives, bureaucracies, and households point to to unexpected routes through which our views of childbearing and (more broadly) health come about.<br/><br/>Using an abundance of materials (medical textbooks and archives, history, architecture, cinematography, popular media), we will exploit the cultural and historical distance that this subject permits, to think more broadly about fertility, the body, the history of science, and social action. Relevant disciplines will include anthropology, history, medicine, and demography."}, {"name": "Teaching Method", "value": "The course format will be exploratory, with topics laid out initially but moving to more specific directions that students identify as their research progresses. Classes will be in seminar style, going over weekly readings, and with students doing presentations and writing a research paper."}, {"name": "Evaluation Method", "value": "Grading will be based on the quality of informed, critically thinking class participation, and on the paper: its depth, rigor, and success in defining and pursuing an original problem."}, {"name": "Class Materials (Required)", "value": "Readings:<br/><br/>1) Judith Waltzer Leavitt - Brought to Bed: Childbearing in America, 1750-1950 Reprint Edition - 1988<br/>https://www.amazon.com/Brought-Bed-Childbearing-America-1750-1950/dp/0195056906<br/>? ISBN-10: 0195056906 <br/>? ISBN-13: 978-0195056907<br/><br/>2) Barbara Ehrenreich (Author), Deirdre English (Author). Witches, Midwives, and Nurses: A History of Women Healers. <br/>Paperback - Second ed, July 1, 2010 <br/>CUNY Press (Feminist press).<br/>? ISBN-10: 1558616616 <br/>? ISBN-13: 978-1558616615<br/><br/>3) Stefan Timmermans and Mara Buchbinder<br/>Saving Babies? The Consequences of Newborn Genetic Screening. University of Chicago Press. 2015. Paperback<br/>ISBN: 9780226273617 <br/><br/>4) 2009. Christine McCourt, ed. Childbirth, Midwifery and Concepts of Time. Oxford: Berghahn. PAPERBACK<br/>? ISBN10 184545586X <br/>? ISBN13 9781845455866"}], "lmod": "12/29/16 6:53 PM (CT)", "subject": "ANTHRO"}]