[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "Annenberg Hall G32"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "21885", "title": "WCAS ASIAN_AM 350-0-1 Asian American Religions", "class_attributes": "Interdisciplinary Distro - See Rules<br/><br/>Social &amp; Behavioral Sciences Distro Area<br/><br/>Ethics &amp; Values Distro Area<br/><br/>", "section": "21885", "instructors": [{"instructor_phone": "847/491-3981", "instructor_name": "Justin K Tse", "instructor_addr": "Crowe Hall - Room 1125"}], "topic": "", "course": "350-0", "descriptions": [{"name": "Overview of class", "value": "If there's anything for which Asian Americans are usually exoticized and Orientalized, it's usually their traditions of religion and spirituality. What is strange, though, is that Asian American religions are seldom discussed in Asian American studies. In this course, we will try to use the topic of religion to think through Asian American studies. In the first part of the course, we will examine the way that religion has been framed in American public spheres in relation to Asia and discuss ways that Asian Americans have performed religion to disrupt this orientalizing framework, especially in literature, film, and art. In the second part of the course, we will look more closely at the lived religious practices of Asian Americans and their communities; this will include field trips to sites in Chicago and Evanston. Assignments will include weekly reading reflections, a novel/film/artistic review, and a community immersion project. This course should be of interest to students in Asian American studies, American and contemporary religions, and Global Asias."}, {"name": "Registration Requirements", "value": "None."}, {"name": "Learning Objectives", "value": "? Unpack how American public spheres are constituted by portrayals of Asian and Asian American religions ? Critically assess popular portrayals of Asian American religions ? Critique the orientalizing dimensions of the term &quot;religion&quot; ? Describe how Asian Americans have performed their religious traditions ? Discuss the place of religion in Asian American communities ? Make connections between the global dissemination of the concept of &quot;Asia&quot; and the making of &quot;Asian America&quot; through the topic of religion"}, {"name": "Teaching Method", "value": "DiscussionLecture"}, {"name": "Evaluation Method", "value": "Attendance: 20%<br/>Other: 35% Final project<br/>Paper, mid-term: 30%<br/>Presentations: 15%<br/>"}, {"name": "Class Materials (Required)", "value": "Fadiman, Anne. The Spirit Catches You and You Fall Down: A Hmong Child, Her American Doctors, and the Collision of Two Cultures. New York: Farrar, Strauss, and Giroux, 1997. ISBN 978-0374533403. $15 (paper). Iwamura, Jane Naomi. Virtual Orientalism: Asian Religions and American Popular Culture. New York: Oxford University Press, 2011. ISBN 9780199738618. $115 (cloth), $26.95 (paper), $13.85 (ebook)."}, {"name": "Class Notes", "value": "Attendance at first class mandatory."}], "lmod": "12/29/16 6:54 PM (CT)", "subject": "ASIAN_AM"}]