[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Kresge Centennial Hall 4-410"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "22013", "title": "WCAS HISTORY 392-0-30 Topics In History", "class_attributes": "", "section": "22013", "instructors": [{"instructor_phone": "847/467-2670", "instructor_name": "Daniel A Stolz", "instructor_addr": "Harris Hall - Room 235"}], "topic": "Technology &amp; Society  MidEast", "course": "392-0", "descriptions": [{"name": "Overview of class", "value": "From the building of railroads and telegraphs in the nineteenth century, to the so-called &quot;Facebook<br/>revolutions&quot; of 2009-2011, life in the Middle East during the last two centuries has been marked by<br/>intense engagement with new technologies. This course will explore the history of such technologies<br/>from the perspective of &quot;ordinary&quot; people, who have used them to travel, communicate, organize, pray,<br/>dress, have children (or not), seek entertainment, and more. Which technologies have played a major<br/>role in modern Middle Eastern societies? How have gender, class, and religion shaped the production and use of technology? How have familiar objects - telephones, sewing machines, computers - worked<br/>differently in different places? Exploring such questions will enable us to further our understanding of<br/>the transformation of the Middle East since the beginning of the region's industrialization, and to think<br/>more broadly and critically about the role of technology in history."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Paper, final: (research paper)<br/>Papers: (two short papers)<br/>"}, {"name": "Class Materials (Required)", "value": "***Tentative until posted to Norris website***<br/>On Barak. On Time: Technology and Temporality in Modern Egypt. 9780520276147.<br/>Wael Ghonim. Revolution 2.0: The Power of the People is Greater than the People in Power: A Memoir. 9780547867090."}, {"name": "Class Notes", "value": "AREA OF CONCENTRATION: Asia/Middle East"}], "lmod": "12/25/16 7:00 PM (CT)", "subject": "HISTORY"}]