[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "Harris Hall L05"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores<br/>Add Consent: Department Consent Required<br/>Drop Consent: Department Consent Required<br/>", "qtr": "Fall 2016", "name": "14399", "title": "WCAS SOCIOL 101-6-21 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>Attendance at 1st class mandatory<br/><br/>", "section": "14399", "instructors": [{"instructor_phone": "", "instructor_name": "Christine Marie Percheski", "instructor_addr": "1812 Chicago Avenue, Rm. 208"}], "topic": "Am Fam after Sexual Revolution", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "In this course, we will explore how and why American families have changed since the 1960s. Although there are many topics related to families and family life, the focus of this writing-intensive course will be on marriage and other romantic relationships. We will discuss changes in the ways that people find a romantic partner, the characteristics of their partners, and the duration and types of their relationships. We will examine what these changes mean for the individuals involved and for the broader society. Topics include cohabitation, divorce, non-marital childbearing, and same-sex unions."}, {"name": "Teaching Method", "value": "Discussion, writing assignments, class participation"}, {"name": "Evaluation Method", "value": "Class participation, Writing assignments, Final paper"}, {"name": "Class Materials (Required)", "value": "This is a tentative reading list. Please confirm all books before purchase.<br/>Bailey, Beth L. 1988. From the Front Porch to Back Seat: Courtship in Twentieth-Century America. ISBN: 0801839351 <br/>Cherlin, Andrew. 2009. The Marriage-Go-Round: The State of Marriage in America Today. ISBN: 0307386384<br/>Edin, Kathryn and Maria Kefalas. 2005. Promises I Can Keep: Why Poor Women Put Motherhood Before Marriage. ISBN: 0520248198<br/>Rosenfeld, Michael. 2009. The Age of Independence: Interracial Unions, Same-Sex Unions, and the Changing American Family. ISBN: 0674034902"}], "lmod": "10/30/16 7:10 PM (CT)", "subject": "SOCIOL"}]