[{"school": "SoC", "overview_of_class": "The course addresses the interactions of family members as they confront and manage members' health issues. We will examine: (1) family theories that apply to such interactions, (2) family communication patterns that emerge around certain health-related issues, and (3) explore new directions in this new area. The concept of \"health\" will be broadly interpreted, including physical and psychological health. Topics will include cancer (childhood & adult), genetic disorders, addictions, mental illness and confronting death. The effect of family members' views of illness will be considered through the lenses of age, ethnicity and culture, and religion.", "name": "Topics in Communication Studies", "section": "21", "location": "Frances Searle Building 1483", "topic": "Family Communication About Hea", "course": "395-0", "meeting_time": ["Th 2:00PM - 4:50PM"], "path": "/class-descriptions/4620/SoC/COMM_ST/395-0/35184", "instructor": ["Kathleen Galvin   Wilkinson"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "id": "35184", "subject": "COMM_ST"}, {"school": "SoC", "overview_of_class": "Fan interest in sports has never been more intense or widespread. The sports industry is now a $762 billion business with many organizations generating record revenues from ticket sales, broadcast rights agreements, and corporate sponsorships. At the same time, teams and leagues are facing an increasing amount of domestic and foreign competition, as well as new threats to traditional revenue streams, even as the costs of doing business continue to rise. Complicating matters further, the 24-hour sports news cycle is dominated by issues of ethics and corruption, forcing athletes, teams, and leagues to constantly defend and justify their actions in the face of ongoing crises. This includes innovations in social media and mobile technologies that are allowing teams and leagues to increase the frequency and intensity of interactions with different audiences. <br/><br/>Unprecedented challenges are making it more difficult for organizations to meet their objectives. The course will examine how best practice strategies impact areas such as brand identity, digital communication, revenue generation, crisis management, managing the narrative, and place marketing. Students will be evaluated on a midterm and final paper related to developing sports strategies.", "name": "Topics in Communication Studies", "section": "22", "location": "COMM_ST Sem Rm 207 - 1815 CH", "topic": "Crisis and Sports Management", "course": "395-0", "meeting_time": ["Tu 2:00PM - 4:50PM"], "path": "/class-descriptions/4620/SoC/COMM_ST/395-0/35186", "instructor": ["Irving Jacob   Rein"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "id": "35186", "subject": "COMM_ST"}, {"school": "SoC", "overview_of_class": "In this course we will examine children's communication across development. This course will provide an overview of the complex ways in which children and adolescent engage in interpersonal communication with peers and family members as well as the interactions that children have with and in the context of media technology. To study these interpersonal and mass communication patterns in children we will read handbook chapters and empirical research articles.", "name": "Topics in Communication Studies", "section": "23", "location": "Annenberg Hall G32", "topic": "Children's Communication", "course": "395-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4620/SoC/COMM_ST/395-0/35185", "instructor": ["Alexis Re Lauricella"], "class_attributes": "", "id": "35185", "subject": "COMM_ST"}, {"school": "SoC", "overview_of_class": "There is a growing interest in using media (TV) and technology (video games) to inform children about health issues, such as counteracting obesity or improving hygiene, or using technology to help children manage a chronic illness (such as asthma). Sesame Street has a long history of working internationally to address children's health issues. This course will review studies and literature on how media have been and can be used to improve children's health around the world.", "name": "Topics in Communication Studies", "section": "24", "location": "Frances Searle Building 3220", "topic": "Children, Health, and the Media", "course": "395-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4620/SoC/COMM_ST/395-0/35187", "instructor": ["Ellen Ann Wartella"], "class_attributes": "Undergraduate Students Only<br/><br/>", "id": "35187", "subject": "COMM_ST"}, {"school": "SoC", "overview_of_class": "The Advanced Public Speaking course allows students with a basic understanding of public speaking to extend their abilities through theory and practice while focusing on civic persuasion. Classes consist of theory lecture followed by speeches. Students develop research and organizational skills necessary for clear, concise, and engaging presentations. Students will also improve their individual public speaking delivery style by studying public speaking skills as both a speaker and an observer.", "name": "Topics in Communication Studies", "section": "25", "location": "Locy Hall 301", "topic": "Advanced Public Speaking", "course": "395-0", "meeting_time": ["We 6:00PM - 9:00PM"], "path": "/class-descriptions/4620/SoC/COMM_ST/395-0/35188", "instructor": ["Ryan S Lauth"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "id": "35188", "subject": "COMM_ST"}]