[{"class_mtg_info": [{"meet_t": "Tu 3:00PM - 5:50PM", "meet_l": "University Hall 112"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Freshmen may not register for this course.", "qtr": "Spring 2017", "name": "34275", "title": "WCAS HISTORY 395-0-28 Research Seminar", "class_attributes": "", "section": "34275", "instructors": [{"instructor_phone": "847/467-4038", "instructor_name": "Kenneth L Alder", "instructor_addr": "Harris Hall 110"}], "topic": "American Technology", "course": "395-0", "descriptions": [{"name": "Overview of class", "value": "In this research seminar on the history of American technology, students write the social biography of an artifact of their choice. Our collective readings and discussions will focus on how we can re-write the social and political history of the U.S. by tracking debates over the objects that Americans design, make, buy, own, and use. This will involve reading some exemplary &quot;social histories of artifacts&quot; from the American Revolution to the Computer Revolution: from Colt revolvers and Raggedy Ann dolls, to the safety bicycle and electric grid, to the Macintosh computer and the Internet of Things. And it will mean learning some intellectual tools to set such objects in their historical context, including: network analysis, systems theory, attention to gender and race, the theory of affordances, evolutionary theory, social constructionism, and technological determinism. Then, in the latter portion of the course, we will work-shop our own histories-in-progress, as we learn to conduct historical research using primary sources, both in archives and with printed materials."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Participation, Presentations, Short Preparatory Essays, &amp; Final Research Paper (15-25 pgs.)"}, {"name": "Class Materials (Required)", "value": "Selections from such books as: Robert Friedel. Zipper! An Exploration in Novelty. 9780393313659. Steven Levy. Insanely Great: The Life and Times of Macintosh. 9780140291773.<br/>Ruth Schwartz. Cowan. More Work for Mother: The Ironies Of Household Technology From The Open Hearth To The Microwave. 9780465047321. Don Norman. Emotional Design: Why We Love (or Hate) Everyday Things. 9780465051359."}], "lmod": "2/9/17 6:43 PM (CT)", "subject": "HISTORY"}]