[{"school": "SoC", "overview_of_class": "", "name": "Theatre in Context", "section": "20", "topic": "Jewish American Performance", "course": "140-2", "meeting_time": ["MoWe 8:30AM - 9:50AM"], "path": "/class-descriptions/4610/SoC/THEATRE/140-2/24069", "instructor": ["Grace Kessler Overbeke"], "id": "24069", "subject": "THEATRE"}, {"school": "SoC", "overview_of_class": "Students in this section will critique new media adaptations of canonical plays (i.e., Shakespeare, Greek/Roman drama, etc.). In addition to exploring &quot;authenticity,&quot; students will link production choices from the adaptation to foundational moments in the source text's production history. We will investigate the power dynamics that contribute to a canonical text becoming considered as such, and how this canonicity is leveraged in the choice to adapt. Students will advance (or begin) the necessary skills of navigating archival material and developing a coherent, scholarship-backed argument.", "name": "Theatre in Context", "section": "21", "topic": "Old Stuff Remix: New Media Adaptations of Canonica", "course": "140-2", "meeting_time": ["WeFr 3:30PM - 4:50PM"], "path": "/class-descriptions/4610/SoC/THEATRE/140-2/24070", "instructor": ["Elizabeth Bradley Hunter"], "id": "24070", "subject": "THEATRE"}, {"school": "SoC", "overview_of_class": "This course examines the historical practice and contemporary process of theatrical adaptation. Engaging with various theories and definitions of adaptation, appropriation, and intertextuality, class content will focus on the interconnectedness between various texts and genres (from script to stage, to screen, to choreography, etc.).  From Shakespeare's Romeo and Juliet to Jerome Robbin's West Side Story, students will examine the issues and ideologies that fuel adaptation and its reception.  Through readings and viewings (both live and recorded), other course content will include case studies in fiction, poetry, musical theater, dance theater, film, and various digital media.  Like all Theatre 140-2 courses, this course introduces students to university-level research-paper writing that incorporates performance analysis and secondary sources. Using resources available in the library and techniques discussed in class, students will design, research, and complete a final paper concerning theatrical adaptation.", "name": "Theatre in Context", "section": "22", "topic": "Theatrical Adaptation: From Script to Stage, Dance", "course": "140-2", "meeting_time": ["TuTh 8:30AM - 9:50AM"], "path": "/class-descriptions/4610/SoC/THEATRE/140-2/24071", "instructor": ["Elizabeth Fischel Leopold"], "id": "24071", "subject": "THEATRE"}, {"school": "SoC", "overview_of_class": "This course will study practices of theatre history and performance critique by mapping reception of the theatrical event as a global phenomenon for the Western World.  As writers of theatre history and performance critique, how do we construct our audiences?  Over the course of the quarter we will address canonical moments in the formation of a global theatre history, asking how contemporary concepts of audience formation influence discourses on the theatrical event.  Culminating in a student-designed research project, this course mixes lectures, discussion, and in-class writings to explore methods for theatre history performance critique.", "name": "Theatre in Context", "section": "23", "topic": "Critical Reflection: The Audience", "course": "140-2", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4610/SoC/THEATRE/140-2/24072", "instructor": ["Dwayne Keith Mann"], "id": "24072", "subject": "THEATRE"}, {"school": "SoC", "overview_of_class": "This course will study practices of theatre history and performance critique by mapping reception of the theatrical event as a global phenomenon for the Western World.  As writers of theatre history and performance critique, how do we construct our audiences?  Over the course of the quarter we will address canonical moments in the formation of a global theatre history, asking how contemporary concepts of audience formation influence discourses on the theatrical event.  Culminating in a student-designed research project, this course mixes lectures, discussion, and in-class writings to explore methods for theatre history performance critique.", "name": "Theatre in Context", "section": "24", "topic": "Remember me: Theatre and Ghosts", "course": "140-2", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4610/SoC/THEATRE/140-2/24073", "instructor": ["Tara Alexa Rodman"], "id": "24073", "subject": "THEATRE"}]