[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "University Hall 112"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores<br/>Add Consent: Department Consent Required<br/>", "qtr": "Fall 2016", "name": "14761", "title": "WCAS ENGLISH 105-6-25 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "14761", "instructors": [{"instructor_phone": "847/491-4560", "instructor_name": "Jeanne Elizabeth   Herrick", "instructor_addr": "555 Clark St., 237"}], "topic": "The Edible Word: Reading &amp; Writing about Food", "course": "105-6", "descriptions": [{"name": "Overview of class", "value": "This is a course for people who love food: eating it, cooking it, growing it, and going to restaurants. We will explore the connection between food and love, food and culture, food and religion, and food and family. We will also explore how the commercialization of food and agribusiness has changed what and how we eat. We'll watch some famous movies on food: The Big Night, Jiro loves Sushi, and the important documentary, Food, Inc. Students will be encouraged to follow a food interest of their own as a topic for the writing assignments. We will also look at the two latest trends in food: molecular chemistry and foraging."}, {"name": "Teaching Method", "value": "The primary method of teaching will be class discussions. Students will prepare for these discussions by writing some summaries and response papers. Students will also participate in writing workshops."}, {"name": "Evaluation Method", "value": "Writing will account for 80% of the course grade; while the remaining 20% will be based on students' demonstrated engagement in the course through participation in class discussions, workshops, and exercises. <br/><br/>Students will write three papers, revising each at least twice. Essay One: 4-6 pages. Essay Two: 5-7 pages. Essay Three: 6-8 pages (based on outside research).<br/><br/>There will be no final exam. In addition to the three formal papers, students will write several one or two page summaries and/or responses to readings and a few writing exercises, some which will be written in class."}, {"name": "Class Materials (Suggested)", "value": "We will read some classics about food, including excerpts from Fast Food Nation, Anthony Bourdain's Kitchen Confidential, Malcolm Gladwell's famous essay on why no one has been able to create better ketchup than Heinz, and Adam Gropnik's essay on how and why restaurants first began in France immediately before the French Revolution. Other authors will include Ruth Reichel and Mary Roach. Readings will be compiled in a course pack of selections from larger works, rather than having any textbook."}], "lmod": "10/30/16 7:04 PM (CT)", "subject": "ENGLISH"}]