[{"school": "WCAS", "overview_of_class": "In 1972, there were 300,000 Americans in prison. Today there are 2.3 million. This six-week seminar investigates how Americans have defined criminal behavior and shaped punishment practices. How did America begin the twentieth century as a nation with a small penal population and become a global outlier in mass incarceration one hundred years later? The class is organized chronologically, and draws on scholarly literature, court cases, investigative journalism, and prison memoirs. We will analyze how race, gender, and class operated in the criminal justice system and interacted with political objectives (e.g. order, authority, justice, freedom). By the end of the quarter, students will have a sophisticated understanding of how politics and culture influenced crime and punishment in America.", "name": "Topics In History", "section": "26", "topic": "", "course": "392-0", "meeting_time": ["MoWe 2:00PM - 4:30PM"], "path": "/class-descriptions/4630/WCAS/HISTORY/392-0/40322", "instructor": ["Bonnie Louise Ernst"], "id": "40322", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "Through literature, African writers of fiction critique their societies and imagine their pasts. How can their works help us understand the African past? This course will explore how the most iconic works of modern African literature are informed by history. The novels we will read are all written by African authors, and in many cases are about a historical experience to which they were or are connected. These novels are a form of historical imagination about ?how it was' living in particular cities and regions of Africa and experiencing particular events in African history (such as the Rwandan genocide, apartheid in South Africa, or European colonial conquest). Although literature shares with history an attention to narrative and imagination, it departs from history in not being bound by evidence or fidelity to sources. We will explore how this is both the strengths and weakness of using literature to understand the past. How do fictional treatments of historical events differ as well as overlap with how historians understand the past?<br/><br/>No background in African history is required for the course.", "name": "Topics In History", "section": "28", "topic": "", "course": "392-0", "meeting_time": ["TuTh 5:00PM - 6:45PM"], "path": "/class-descriptions/4630/WCAS/HISTORY/392-0/40323", "instructor": ["Nathaniel Luke Mathews"], "id": "40323", "subject": "HISTORY"}]