[{"class_mtg_info": [{"meet_t": "Mo 6:15PM - 9:15PM", "meet_l": "TBA"}], "school": "SCS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "38062", "title": "SCS ECON 361-CN-12 International Trade", "class_attributes": "", "section": "38062", "instructors": [{"instructor_phone": "", "instructor_name": "Karl Tan Muth", "instructor_addr": ""}], "topic": "", "course": "361-CN", "descriptions": [{"name": "Overview of class", "value": "This is a rigorous course that deals with difficult concepts in macroeconomics, some of which are &quot;undecided&quot; even among top scholars in this field, including advisors to heads of state and faculty members at Northwestern and elsewhere. I do my best to provide information on alternate theories of macroeconomic mechanisms as well as my own position so that students can appreciate and debate various viewpoints presented by academics, businesspeople, journalists, and policymakers. The &quot;chalkboard mathematics&quot; I present in this course intermittently (but infrequently) exceeds the bounds of basic calculus, but occasionally will include game theory exercises in an actor-counterparty net-gains framework (e.g. Kaldor-Hicks models) and conceptualizations of advanced modeling (at the level of MATH 234 Vector Calculus). There will be no graded &quot;chalkboard math&quot; or proofs on the exam; no graded work exceeds MATH 230 (Differential Calculus with Multivariable Functions). You are graded on your conceptual understanding of the underlying mathematics; this is not a &quot;quant whiz&quot; class. Statistical knowledge at the level of STAT 202 is highly recommended and considered a minimum."}, {"name": "Registration Requirements", "value": "ECON 281, 310-A, -B, 311. STAT 202 or introductory level statistics experience is highly recommended."}, {"name": "Learning Objectives", "value": "-The student will be able to use basic models to describe trade relationships between countries and cartels.<br/>-The student will be able to recognize common bilateral trade dynamics and describe them mathematically and graphically. <br/>-The student will be able to describe, in a historical and economic context, the importance of various trade frameworks. <br/>-The student will be able to recognize flawed trade policies and explain their weaknesses or unintended consequences."}, {"name": "Teaching Method", "value": "This is a lecture course with a discussion component. Students should be prepared for a conversational classroom and to field questions from the instructor on a regular basis."}, {"name": "Evaluation Method", "value": "There are midterm and final exams in this course."}, {"name": "Class Materials (Required)", "value": "Texts and materials will be made available by the instructor on Canvas and through online resources."}, {"name": "Class Notes", "value": "This is a brand new syllabus for ECON 361 and I am excited to teach it. My background in development economics means I will be focusing both on the OECD (&quot;developed world&quot;) and the challenges that developing countries face. We will also explore persistent questions about globalization, the Austrian viewpoint, what &quot;free trade&quot; means, and how the Trump administration may reframe the trade conversation. Note this course features a take-home midterm exam, so there is no class on May 9."}], "lmod": "2/21/17 6:41 PM (CT)", "subject": "ECON"}]