[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Fisk Hall 114"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "31183", "title": "WCAS HUM 370-6-21 Special Topics in the Humanities", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "31183", "instructors": [{"instructor_phone": "", "instructor_name": "Peter B Erickson", "instructor_addr": ""}], "topic": "Shakespeare In Our Time", "course": "370-6", "descriptions": [{"name": "Overview of class", "value": "In the context of the 400th anniversary of Shakespeare's death, this course undertakes close reading of selected plays divided into three distinct sections, each of which raises a different set of questions and thus presents a different vantage point. The first cluster of plays focuses on examples of &quot;Performing Race in Shakespeare.&quot; The second group on &quot;Shakespeare's Women&quot; explores the range and variety of the roles and identities available to female characters. The third section examines how &quot;Shakespeare's Endings&quot; are constructed in generic forms from comedy to tragedy and inquires to what extent these conclusions resolve the problems that have emerged over the course of an individual drama.<br/><br/>Ultimately our goal will be to combine these three perspectives as overlapping approaches that lead to a comprehensive discussion of the complexities of Shakespeare's work. <br/><br/>Finally, the title &quot;Shakespeare in Our Time&quot; asks us to reflect on our contemporary position with regard to Shakespeare as an author who is located in both past and present. How can the two points?1616 and 2016?on the long historical timeline be linked without being simply equated?"}, {"name": "Registration Requirements", "value": "No prerequisites"}, {"name": "Teaching Method", "value": "Primary emphasis on group discussion involving detailed interpretation of the text."}, {"name": "Evaluation Method", "value": "Active participation in class discussion; three relatively short papers"}, {"name": "Class Materials (Required)", "value": "The Norton Shakespeare (complete version), Stephen Greenblatt, General Editor:<br/>2nd edition 2008 (ISBN: 978-0-393-92991-1<br/>-OR-<br/>3rd edition 2016; ISBN 978-0-393-93499-1<br/><br/><br/>Please note: recommended but not required if you already have another complete volume of Shakespeare's works."}], "lmod": "4/3/16 8:08 PM (CT)", "subject": "HUM"}]