[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Technological Institute M152"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "34455", "title": "WCAS NEUROSCI 324-0-1 Neurobiology of Biological Clocks and Sleep", "class_attributes": "", "section": "34455", "instructors": [{"instructor_phone": "847/467-6512", "instructor_name": "Fred W Turek", "instructor_addr": "Cook Hall, Room 2-141"}], "topic": "", "course": "324-0", "descriptions": [{"name": "Overview of class", "value": "This course will examine the general properties of sleep and circadian rhythms and will analyze how sleep and the circadian clock regulate a number of diverse activities at the level of the cell, the organ, as well as the organism. Special emphasis will be placed on the neural and genetic basis for the generation of sleep and circadian rhythms. The importance of sleep and biological rhythms for human health and disease will be covered in this course mainly through a series of student presentations. Much of this course will involve the analysis and discussion of classic, as well as recent experiments, that have been carried out on the study of biological clocks and sleep."}, {"name": "Registration Requirements", "value": "Pre-requisite: NEUROSCI 202."}, {"name": "Teaching Method", "value": "Lectures and discussion of classic and current research being carried out in the field in addition to short student presentations."}, {"name": "Evaluation Method", "value": "Midterm - 30%<br/>Combination of Class Presentations and Term Paper - 30%<br/>Final Exam - 40%"}, {"name": "Class Materials (Required)", "value": "Chronobiology: Biological Timekeeping by Dunlap, Loros and DeCoursey, Sinauer Publishers, ISBN - 0-87893-149-X, List Price: $92.95.<br/> <br/>Additional readings from original articles will be assigned."}, {"name": "Class Notes", "value": "Pre-requisite: Students must have completed NEUROSCI 202 or obtain permission of the instructor to register for this course."}], "lmod": "2/7/17 6:45 PM (CT)", "subject": "NEUROSCI"}]