[{"class_mtg_info": [{"meet_t": "MoWe 9:30AM - 10:50AM", "meet_l": "Frances Searle Building 3220"}], "school": "WCAS", "overview_of_class": "The 20th century has been marked by upheaval and consequent migration for the people of the Korean peninsula. As a result of these migrations, substantial communities of ethnic Koreans exist in Central Asia, China, Japan, the United States and Canada, South America and Europe. How and why did Koreans go to these places? What kinds of communities and identities did they construct? How do these Koreans fit into the history of Korea, particularly in the context of a country divided into two opposing states? How do they fit into the history of their host countries? By examining the histories of ethnic Koreans outside the Korean peninsula, we will examine issues of migration, diaspora, race relations, and colonialism. We will also take a fresh look at modern Korean history by examining how these \"overseas Koreans\" view and relate to the history and ongoing politics of their divided homeland.", "qtr": "Fall 2016", "name": "Studies in Diaspora", "title": "WCAS ASIAN_AM 370-0-1 Studies in Diaspora", "lmod": "10/30/16 6:58 PM (CT)", "section": "1", "instructors": [{"instructor_phone": "847/467-6538", "instructor_name": "Ji-Yeon   Yuh", "instructor_addr": "Harris Hall, Room 306, 1881 Sheridan Road, Evanston 60208"}], "topic": "Korean Diasporas", "course": "370-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "The 20th century has been marked by upheaval and consequent migration for the people of the Korean peninsula. As a result of these migrations, substantial communities of ethnic Koreans exist in Central Asia, China, Japan, the United States and Canada, South America and Europe. How and why did Koreans go to these places? What kinds of communities and identities did they construct? How do these Koreans fit into the history of Korea, particularly in the context of a country divided into two opposing states? How do they fit into the history of their host countries? By examining the histories of ethnic Koreans outside the Korean peninsula, we will examine issues of migration, diaspora, race relations, and colonialism. We will also take a fresh look at modern Korean history by examining how these &quot;overseas Koreans&quot; view and relate to the history and ongoing politics of their divided homeland."}, {"name": "Teaching Method", "value": "Lecture"}, {"name": "Evaluation Method", "value": "Class participationPapersProject, final"}, {"name": "Class Materials (Required)", "value": "Books<br/>Peter Hyun, In the New World<br/>Sonia Shinn Sunoo, Korean Picture Brides<br/>John Lie, Zainichi: Diasporic Nationalism and Postcolonial Identity<br/>Fang Gao, Becoming a Model Minority: Schooling Experiences of Ethnic Koreans in China<br/>Jane Jeong Trenka, Fugitive Visions: An Adoptee's Return to Korea<br/><br/>Articles/Chapters<br/>*Andre Schmid, &quot;Beyond the Peninsula,&quot; in Korea Between Empires, pp.224-253<br/>* Michael Weiner, &quot;Assimilation and opposition&quot; in Race and Migration in Imperial Japan, pp. 154-186<br/>*Michael Weiner, &quot;The limits of assimilation,&quot; in Race and Migration in Imperial Japan, pp. 209-216<br/>*Charles Armstrong, &quot;Revolution on the Margins,&quot; in The North Korean Revolution, pp.13-37<br/>*Hyun Ok Park, &quot;Korean women's role in the revolution in Manchuria: peasant revolt, citizenship, and gender [1920s-1930s], in Shin, Eui Hang; Kim, Yun, eds. Korea and the world: strategies for globalization. Columbia, S.C.: Center for Asian Studies, Richard L. Walker Institute of International Studies, University of South Carolina, 1995, pp. 39-57<br/>*Chae-Jin Lee, China's Korean Minority<br/>*Sonia Ryang, &quot;Part 2: The History,&quot; in North Koreans in Japan, pp. 77-136<br/>*Ji-Yeon Yuh, Introduction and Chapter One of Beyond the Shadow of Camptown, pp.1-41 *Matthew Rothschild, &quot;Babies for Sale,&quot; from The Progressive, 1988.<br/>*Illsoo Kim, Introduction and Chapters 1 through 4, in &quot;New Urban Immigrants,&quot; pp. 3-100<br/>*Kyeyoung Park, &quot;&quot;I Am Floating in the Air&quot;: Creation of a Korean Transnational Space among Korean -Latino American Remigrants.&quot; Positions 7, no. 3 (1999).<br/>*Kari Ruth, &quot;Dear Luuk,&quot; from Seeds from a Silent Tree, pp. 143-144.<br/>*Amy Mee-Ran Dorin Kobus, &quot;Hello Good-by Hello,&quot; from Voices From Another Place, pp. 41-49<br/>*Kwang Kyu Lee, &quot;The Transformation of Korean Chinese Ethnic Identity,&quot; in Korean and Korean American Studies Bulletin, vol. 12, no. 1, 2001, pp.C61-C75<br/>*Chikako Kashiwazaki, &quot;To Be Korean Without Korean Nationality: Claim to Korean Identity by Japanese Nationality Holders,&quot; in Korean and Korean American Studies Bulletin, vol. 11, no. 1, 2000, pp.J48-J70<br/>*Lisa Yoneyama, &quot;Memory Matters: Hiroshima's Korean Atom Bomb Memorial and the Politics of Ethnicity,&quot; in Living With the Bomb,&quot; pp. 202-231<br/><br/>Required Films<br/>We will be viewing a number of films, including:<br/>Homes Apart<br/>Forgotten Koreans<br/>Osaka Story<br/>Annyoung Kimchi<br/>Koryo Saram<br/>In the Matter of Cha Jung Hee"}], "path": "/class-descriptions/4640/WCAS/ASIAN_AM/370-0/10624", "instructor": ["Ji-Yeon   Yuh"], "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "id": "10624", "subject": "ASIAN_AM"}]