[{"class_mtg_info": [{"meet_t": "Mo 6:15PM - 9:15PM", "meet_l": "Lunt Hall 105"}], "school": "SCS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "38072", "title": "SCS MATH 230-CN-62 Differential Calculus of Multivariable Functions", "class_attributes": "", "section": "38072", "instructors": [{"instructor_phone": "", "instructor_name": "Martina   Bode", "instructor_addr": ""}], "topic": "", "course": "230-CN", "descriptions": [{"name": "Overview of class", "value": "This course will extend the methods of single-variable calculus to functions of many variables, i.e. it will develop techniques to obtain local linear approximations of functions (of multiple variables) in order to analyze and optimize quantities. Specific topics include: vectors, dot and cross products, equations of lines and planes, polar, cylindrical and spherical coordinates, differentiation of vector functions, velocity and acceleration, arc length, parametric surfaces, functions of several variables, partial derivatives, tangent plane and linear approximations, chain rule for partial derivatives, directional derivative and gradient, max-min problems for functions of several variables, Lagrange multipliers. Prerequisite: MATH 224 or equivalent."}, {"name": "Registration Requirements", "value": "MATH 224 or equivalent."}, {"name": "Learning Objectives", "value": "Course Objectives:<br/>-Understand lines, curves, planes, surfaces and graphs of functions in two variables in three dimensional coordinate systems<br/>-Understand the concepts of vectors, and vector valued functions in two and three dimensions.<br/>-Demonstrate ability to effectively interpret and use functions of several variables including finding limits, the use of partial derivatives, and finding and analyzing critical points of these functions with and without constraints.<br/>Learning Objectives:<br/>-Write coherent and logical solutions to mathematical problems.<br/>-Demonstrate problem-solving skills, by analyzing a problem, hypothesizing the outcome, and applying the techniques learned in class to solve the problem."}, {"name": "Teaching Method", "value": "This class will be integrating active learning methods including in class worksheets, group work, and in class presentations and discussions."}, {"name": "Evaluation Method", "value": "The final grade will be determined by weekly quizzes (20 points each x 8 = 160 points), weekly written homework (10 points each x 8= 80 points), online homework within WebAssign (10 points each x 9 =90 points), and a final exam (200 points)."}, {"name": "Class Materials (Required)", "value": "Stewart, Essential Calculus: Early Transcendentals Volume 2, 2nd + Enhanced WebAssign.<br/><br/>WebAssign contains a copy of the textbook as eBook, and thus an access code to Enhanced WebAssign is all that is needed, or buy a bundle at Norris or online at: http://services.cengagebrain.com/course/site.html?id=1943476"}], "lmod": "2/16/17 6:41 PM (CT)", "subject": "MATH"}]