[{"school": "WCAS", "overview_of_class": "This course will examine ideas of justice in western cultural and literary traditions. The focus will be the classical tradition, the biblical tradition, and Shakespeare who inherited both and reworked them in the early modern period. The trial of Socrates, the trial of Jesus, biblical prophecy, tragedy in Aeschylus and Shakespeare, and a modern work by Melville will be included. Our exploration will be done in the context of theories of justice, and we will read those theories alongside the literature. But we will also heed how literature itself offers elaborations of theories of justice, following their consequences both within legal frameworks and beyond, as they shape the public and intimate lives of people. We will ask how religious ideas of justice inform and depart from secular ideas of justice, how retributive and distributive ideas of justice are imagined and critiqued, and how the relation between justice and law has been conceived.", "name": "Topics in Combined Studies", "section": "20", "location": "Parkes Hall 223", "topic": "Law & Literature", "course": "385-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4660/WCAS/ENGLISH/385-0/33297", "instructor": ["Regina M Schwartz"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "33297", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "Some medical conditions are more than physiological disorders; they become cultural boogeymen. At specific historical crossroads, such afflictions as the Bubonic Plague, tuberculosis, epilepsy, and AIDS came to symbolize a culture's heightened anxieties about the body, personal identity, and social ties. Meanwhile, disabilities like blindness or paralysis have much longer-acting legacies of cultural connotation. This course will examine the intellectual history of diseases and disabilities in Western culture. We will ask: When do physiological conditions accumulate cultural significance? How do the physical attributes of a medical condition interact with larger cultural structures of meaning-making? Do literary portrayals of such conditions reinforce or destabilize cultural notions of disease? Within modern-day controversies, what role do physicians play in navigating cultural conceptions of illness on behalf of their patients?<br/> <br/>In this class, we will examine the literary and historical record of specific medical conditions in order to understand how these conditions both accumulate and shed cultural meanings over time. In surveying this history, you will also have the opportunity to apply your findings to analyze contemporary medical controversies, such as those surrounding vaccinations & autism, Zika & birth control, or death with dignity legislation.", "name": "Topics in Combined Studies", "section": "21", "location": "University Hall 121", "topic": "Medical Humanities", "course": "385-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4660/WCAS/ENGLISH/385-0/33298", "instructor": ["Hosanna Grace Krienke"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "33298", "subject": "ENGLISH"}]