[{"school": "WCAS", "overview_of_class": "Before his tragic death in 2008, David Foster Wallace had established himself as one of the most important chroniclers of contemporary American life. His fiction and nonfiction attempted to understand phenomena as varied as athletic achievement, drug addiction, pornography, religion, and how new technologies were changing human relationships. This course will survey Wallace's work in several different genres, including essays (Consider the Lobster), short stories (Oblivion), and the novel (Infinite Jest). How does Wallace's work respond to and revise the influence of such postmodern writers as Thomas Pynchon, Donald Barthelme, and Don Delillo? What were the historical conditions that made Wallace's work resonate with such a wide readership? What will be Wallace's literary legacy?", "name": "Studies in American Literature", "section": "20", "location": "Parkes Hall 222", "topic": "David Foster Wallace", "course": "378-0", "meeting_time": ["MoWe 9:30AM - 10:50AM"], "path": "/class-descriptions/4620/WCAS/ENGLISH/378-0/34926", "instructor": ["John Alba Cutler"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>Attendance at 1st class mandatory<br/><br/>", "id": "34926", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "Urbanologist Yi Fu Tuan writes, \"What begins as undifferentiated space becomes place when we get to know it better and endow it with values.\" In The Untouchables, Sean Connery tells Kevin Costner, \"You want to get Capone? Here's how you get Capone. He pulls a knife, you pull a gun. He puts one of yours in the hospital, you put one of his in the morgue. That's the Chicago way.\" In this class, we will examine \"the Chicago way\" from many different angles in order to interrogate the values with which various artists have endowed Chicago. We will read in a broad range of media: journalism, poetry, song, fiction, film, and sequential art to see how a sense of Chicago as a place works over time. We will pay close attention to depictions of the construction of American identity, and to the role of the artist and intellectual in the city.", "name": "Studies in American Literature", "section": "21", "location": "Norris Center Big Ten Room 104", "topic": "Chicago Way: Urban Spaces", "course": "378-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4620/WCAS/ENGLISH/378-0/34927", "instructor": ["William J Savage"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "34927", "subject": "ENGLISH"}]