[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Frances Searle Building 2107"}], "school": "SoC", "enrl_requirement": "", "qtr": "Winter 2017", "name": "25921", "title": "SoC CSD 392-0-1 Language Development and Usage", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "25921", "instructors": [{"instructor_phone": "", "instructor_name": "Elizabeth Spencer Norton", "instructor_addr": ""}], "topic": "", "course": "392-0", "descriptions": [{"name": "Overview of class", "value": "Description, Key Questions Addressed, and Objectives: Language is a complex skill unique to human beings. How does this remarkable skill develop? What are the environmental and biological factors necessary for successful language development, and what can we learn about this process through the study of atypical language development? How can this knowledge guide clinical practice?<br/>This class will explore the course of language development across key domains of language - phonology, morphology, semantics, syntax, pragmatics - and consider the major theories of language development and its biological basis. We will also cover methods for studying language over the lifespan, and study patterns of language development in particular language-impaired populations both as a guide for understanding the nature and course of language growth in developmental disabilities of language and communication, as well as how such developmental patterns may inform understanding of the biological and experiential influences on language development and use in typical development."}, {"name": "Learning Objectives", "value": "After successfully completing the course, you should be able to 1) critically evaluate different theories of language development, 2) understand how different patterns of language acquisition (across different languages, different populations, etc.) support or refute different theories of language development, 3) critically analyze a language sample to ascertain an individual's language competence and stage of development, and 4) communicate clearly about different stages of language development to support further stages of training in evaluating language disorders."}, {"name": "Class Materials (Required)", "value": "Development of Language, The, 9/E Jean Berko Gleason, Boston University Nan Bernstein Ratner, University of Maryland, College Park <br/>ISBN-13: 978-0134161143<br/>Suggested retail price: $187.40"}], "lmod": "12/25/16 6:46 PM (CT)", "subject": "CSD"}]