[{"school": "SoC", "overview_of_class": "In this course, students will explore what goes into curating, organizing and promoting film/video screenings and festivals, with the goal of producing a public event as a culminating class project. We will discuss audience engagement, distribution, and outlets (online, broadcast, and brick-and-mortar) and interview programmers, who work for festivals, movie theaters, micro cinemas, and cinematheques. Students will come away with insights about festival strategy for their own films and a solid understanding of the distribution and exhibition phase, allowing them to navigate that landscape more successfully as mediamakers and potentially as programmers. In addition to the class group project, students will also develop an individual proposal for an event or series that can encompass a wide range of work (audio, new film/video, or even archival material).<br/> <br/>Students will leave the course with a portfolio that includes their interview with a programmer, a written proposals for an event or series, and in-depth documentation of a successfully realized public event that they co-produced.<br/> <br/>Students will be evaluated based on individual assignments and the culminating group project; as well as attendance and class participation.<br/> <br/>Required class materials will include a course packet or book (TBA), not to exceed $50.", "name": "Symposium: Issues in RTVF", "section": "20", "location": "Annie May Swift Hall 109", "topic": "Curatorial Practices", "course": "398-0", "meeting_time": ["We 12:00PM - 2:50PM"], "path": "/class-descriptions/4660/SoC/RTVF/398-0/34660", "instructor": ["Ines R Sommer-Simpson"], "class_attributes": "", "id": "34660", "subject": "RTVF"}, {"school": "SoC", "overview_of_class": "RTVF 398: History of the Recording Industry<br/> <br/>This course will explore the history of the recording industry from the invention of the phonograph in 1877 to recent developments in digital audio. We will examine the social, cultural, and technological factors that have shaped the development of the recording industry, and consider musical genres such as jazz, blues, rock, swing, muzak, dub, techno and rap. We will consider the production, distribution, and reception of recordings, tracking the changing ways in which people have listened to music, from phonograph parlors to jukeboxes to hi-fi home stereos to iPods. The industry in recorded music will be our primary focus, but we will explore synergies with the film industry, radio, gaming, and other emergent digital forms. Some of the key themes in the course will be the intersection of sound industries; the tension between independent and major labels; questions of copyright and creativity in popular music; the relationship between technology and innovation in sound art; and the increasing mobility and cultural ubiquity of recorded sound. Looking back across the \"century of sound\" allows us to gain a deeper appreciation of our current immersion in recorded sound, and to understand the central debates and dynamics that have shaped the recording industry.<br/> <br/>By the end of the course students should be able to:<br/> <br/>Understand and appreciate a wide range of sound recordings in their full historical, social, and cultural contexts.<br/> <br/>Apply a historical understanding of the recording industry to current practices, companies, and artists.<br/> <br/>Think critically about the role played by the recording industry in everyday social life.<br/> <br/>Situate the recording industry within a broad terrain of media industries, including film, television, radio, and digital games.<br/> <br/>Create an original and well-informed analysis of a significant aspect of recording history.<br/> <br/>Assessment:<br/> <br/>Students will be assessed through: 1) short response papers assigned throughout the quarter; 2) short quizzes and a final exam that cover material from class readings, lectures, and discussions; 3) a final research paper. <br/> <br/> <br/>Required books:<br/> <br/>David L. Morton. Sound Recording: The Life Story of a Technology (Johns Hopkins University Press, 2004).<br/> <br/>Steve Knopper. Appetite for Self-Destruction: The Spectacular Crash of the Record Industry in the Digital Age (Soft Skull Press, 2010) <br/> <br/>Jeremy Morris. Selling Digital Music, Formatting Culture (University of California Press, 2015)", "name": "Symposium: Issues in RTVF", "section": "21", "location": "Helmerich Auditorium", "topic": "The History of the Recording Industry", "course": "398-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4660/SoC/RTVF/398-0/37380", "instructor": ["Jacob Arnaud Smith"], "class_attributes": "", "id": "37380", "subject": "RTVF"}]