[{"school": "WCAS", "overview_of_class": "Tolerance: A Global History.<br/><br/>In this course we will explore the ways that global Christianity laid the groundwork for European ideas about diversity and tolerance. The aim of the course is to understand how the historically contingent confrontations with religious diversity were foundational to, and indeed, shaped the terms of the development of modern assumptions not only about religious tolerance, but also about tolerance of cultural diversity broadly speaking. One of the primary learning goals for students is to 1) gain the skills to interpret primary texts in order to 2) understand how the category of &quot;religious&quot; difference, while not disappearing, eventually ceded primacy of place to notions of &quot;cultural&quot; and &quot;racial&quot; differences by the end of the first era of globalization such that 3) all of these terms became foundational to understandings about the nature of human diversity, not only in the era of the European Enlightenment (18th century) but also today, as we continue to fight our own &quot;culture wars&quot; about difference and diversity. <br/><br/><ln/>We will treat the European religious wars following the Reformation, but given that the primary aim of the course is to historicize the perceived possibilities and limits of &quot;tolerance&quot; in a global context, the bulk of the readings will demonstrate how ideas about human &quot;sameness&quot; and &quot;difference&quot; emerged from face-to-face encounters and conflicts in the first era of globalization. The course will foreground the entangled histories of early modern missionary encounters as the ground for working out ideas about how one ought to think about religious diversity in the global world and how modern ideas about tolerance emerged from early modern debates about what religious differences might be tolerated and which were &quot;idolatrous.&quot;<br/> <br/><ln/>Accordingly, the course takes as its starting point the history of European expansion into the Americas and Asia under the Iberian Empires in the 15th century. Christian explorers and missionaries evaluated &quot;difference&quot; in terms of &quot;idolatry&quot; and &quot;superstition.&quot; Idolatry was to be extirpated, but &quot;superstition&quot; led to the development of concepts about &quot;cultural differences&quot; that might be tolerated, laying the groundwork for what we think of today as &quot;cultural relativism.&quot; We will take up four case studies: 1) the New World controversies about the humanity of the Indians, best represented in the polemical writings of Bartolomé de las Casas, but treated in greater depth by Jesuit missionary and proto-ethnologist, Jose de Acosta, 2) the controversies about Jesuit missionary cultural &quot;accommodation&quot; in Asia (the Chinese and Malabar Rites controversies); and 3) the experiments with religious toleration at the Mughal court under the reign of Akbar. We will end with a discussion of how 4) these global encounters influenced the ideas found in Voltaire&#39;s <i>Treatise on Tolerance</i> and in John Locke&#39;s <i>A Letter Concerning Toleration</i>.", "name": "First-Year Seminar", "section": "20", "topic": "Tolerance: A History", "course": "101-6", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4640/WCAS/RELIGION/101-6/14130", "instructor": ["J Michelle   Molina"], "id": "14130", "subject": "RELIGION"}, {"school": "WCAS", "overview_of_class": "For the past several centuries, human nature has been described through the unique capacity to think and reason. Over the past several decades, however, humans have become increasingly successful at designing machines to think and reason, the very activity that seems so central to human experience. The rapid emergence of intelligent machines is creating new attention to older questions that have concerned religion scholars for some time. Could a machine ever be spiritual? Is consciousness unique to humans? Could consciousness reside in things such as machines? How did Westerners come to view matter-versus-spirit in an oppositional manner? How has religion shaped the way Westerners view the capacity to be sentient and to act (subjectivity) and the lack of this capacity (objecthood)? What have the intellectual and religious traditions of West Africa (Orisha ontology), East Asia, and Indigenous America asserted about the nature of things versus the nature of people? Do all societies today share the same assumptions about the nature of personhood? If technologists throughout the globe succeed in developing cognitive machines that rival or surpass human intelligence, will these machines become human? <br/><br/>This course examines the problems of religion and humanity that artificial intelligence (AI) is currently generating. Students will read texts by religion scholars, AI technologists, cognitive scientists, and philosophers of the mind to understand the theoretical, philosophical, and technological foundations for older religious claims about the nature of people and things. Students will study and understand (1) the conceptual paradigms on which claims of human exceptional are based; (2) religious claims about bodies and souls; 3) the basic architecture of cognitive machines; (4) what recent brain research reveals about human cognition; and (5) recent theoretical efforts (e.g., integrated information theory) to account for consciousness in things and people. On this basis, students will learn to engage skillfully with both classical and contemporary accounts of people versus things that are emerging in response to the rapid progress in AI.", "name": "First-Year Seminar", "section": "21", "topic": "Religion, Artificial Intelligence, and the Life of", "course": "101-6", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4640/WCAS/RELIGION/101-6/14131", "instructor": ["Sylvester Alric Johnson"], "id": "14131", "subject": "RELIGION"}]