[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Harris Hall L06"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Registration is reserved for Latina and Latino Majors and Minors.", "qtr": "Spring 2017", "name": "34027", "title": "WCAS LATINO 392-0-21 Topics in Latina and Latino Social and Political Issues", "class_attributes": "Interdisciplinary Distro - See Rules<br/><br/>Social &amp; Behavioral Sciences Distro Area<br/><br/>Ethics &amp; Values Distro Area<br/><br/>", "section": "34027", "instructors": [{"instructor_phone": "847/491-8916", "instructor_name": "Alejandro Eduardo Carrion", "instructor_addr": "1908 Sheridan"}], "topic": "Urban Education: Race, Class, &amp; Culture", "course": "392-0", "descriptions": [{"name": "Overview of class", "value": "What do we mean by urban education? Is it a code word for discussing race? Is it the study of urban schooling? This course is designed to enhance students' knowledge of urban education and schooling, especially related to dynamics of race, class, and culture. It provides an analysis of policies and practices and how they have/are implemented to meet the &quot;need&quot; of the individuals and groups who interact with these institutions. We will explore the following: historical and political economic factors influencing urban education; the distribution of opportunity and wealth in cities and schools; multicultural education, the development of positive school cultures, and the use of community services and resources. The goal is to encourage and foster students' critical thinking and reflective practice to address the pressing challenges which students face in American urban public schools."}, {"name": "Teaching Method", "value": "DiscussionGroup workLectureOnline workPresentationsResearch projectWriting assignments"}, {"name": "Evaluation Method", "value": "AttendanceClass participationExam, finalExam, mid-termGroup projectHomeworkPaper, finalPaper, mid-termPapersPresentationsReadingsWriting assignments"}, {"name": "Class Materials (Required)", "value": "No books at this time"}], "lmod": "2/14/17 6:46 PM (CT)", "subject": "LATINO"}]