[{"class_mtg_info": [{"meet_t": "Th 6:15PM - 9:15PM", "meet_l": "University Hall 101"}], "school": "SCS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "18465", "title": "SCS PSYCH 228-CN-66 Cognitive Psychology", "class_attributes": "", "section": "18465", "instructors": [{"instructor_phone": "847.491.5025", "instructor_name": "Christopher Ryan Schmader", "instructor_addr": "Cresap 108"}], "topic": "", "course": "228-CN", "descriptions": [{"name": "Overview of class", "value": "This course is an introduction to cognitive psychology, the study of how the mind represents and processes information about the world. The course will begin by describing how this branch of psychology approaches the mind: as a set of processes that take incoming sensory information - such as visual information, or human speech - and transforms it into mental representations that guide our interactions with our environment. In this class, we will cover topics such as perception, attention, memory, knowledge representation, language, reasoning, problem solving and decision-making. Over the course of the quarter, we will gain an understanding of the assumptions and methods underlying research on cognition. Students will also become familiar with scientific debates about how the mind works, read original empirical research papers, participate in demonstrations of experiments, and learn to think critically about experimental research in psychology."}, {"name": "Registration Requirements", "value": "Psychology 110 or equivalent"}, {"name": "Learning Objectives", "value": "By the end of the quarter, you will gain an understanding of the assumptions and methods underlying research on cognition. You will also become familiar with scientific debates about how the mind works, read original empirical research papers, participate in demonstrations of experiments, and learn to think critically about experimental research in psychology."}, {"name": "Teaching Method", "value": "Class participation<br/>Demonstrations<br/>Discussion<br/>Group work<br/>Lecture<br/>Online work <br/>Readings<br/>Writing assignment"}, {"name": "Evaluation Method", "value": "Three exams<br/>Two writing assignments<br/>Homework assignments in which students complete demos of cognitive psychology experiments<br/>Class participation"}, {"name": "Class Materials (Required)", "value": "Texts or materials may include the following:<br/><br/>Title: Fundamentals of Cognitive Psychology, 2nd Edition <br/>Author: Ronald T. Kellogg <br/>Publisher: Sage [ISBN: 9781412977852]<br/><br/>Title: CogLab 5: Instant Access, 5th Edition <br/>Authors: Greg Francis and Ian Neath <br/>Publisher: Cengage Learning [ISBN: 9781285461137]"}], "lmod": "10/30/16 6:57 PM (CT)", "subject": "PSYCH"}]