[{"school": "WCAS", "overview_of_class": "Legal_St 276-0-20 \"Japanese American 'Internment'\" (also ASIAN_AM 220-3), Shana Bernstein (Spring 2017)<br/><br/>Twice since 9/11 politicians have referred to the World War II imprisonment of Japanese Americans as a possible precedent for policies toward Muslims. Yet many Americans remain ignorant about this important and understudied episode in U.S. history. This seminar-style course examines events leading up to the mass imprisonment of a group of people based on race, the role played by wartime emergency language, the experiences of Japanese Americans, and the consequences of this wartime policy. It focuses on the intersections between race, gender, nation, and law. Readings include secondary and primary sources, including related court cases, executive orders, documentary films, memoirs, and fiction. Note this is a discussion-based class.<br/>Students will be expected to read and participate daily, as well as write three papers throughout the quarter (two approx. 3-5 pages, one 8-10 pages).", "name": "Introductory Topics in Legal Studies", "section": "20", "location": "University Hall 102", "topic": "Japanese American 'Internment'", "course": "276-0", "meeting_time": ["TuTh 9:30AM - 10:50AM"], "path": "/class-descriptions/4660/WCAS/LEGAL_ST/276-0/34047", "instructor": ["Shana B Bernstein"], "class_attributes": "", "id": "34047", "subject": "LEGAL_ST"}, {"school": "WCAS", "overview_of_class": "Legal_St 276-0-21 \"The Age of Hamilton and Jefferson\" Susan Gaunt Stearns (Spring 2017)<br/><br/>The lives of Alexander Hamilton and Thomas Jefferson touched deeply on every aspect of the creation of the American state, but neither the man, nor the nation, sprang into being fully formed in 1776; nor did Hamilton's death in 1804 or Jefferson's retirement from public office in 1808 end the impact that these two men had on the nation. This course uses the years of Jefferson and Hamilton's lives (1743-1826) to explore the world that created them and the world that they created.", "name": "Introductory Topics in Legal Studies", "section": "21", "location": "Annenberg Hall 101", "topic": "", "course": "276-0", "meeting_time": ["MoWe 12:30PM - 1:50PM"], "path": "/class-descriptions/4660/WCAS/LEGAL_ST/276-0/34048", "instructor": ["Susan Gaunt Stearns"], "class_attributes": "", "id": "34048", "subject": "LEGAL_ST"}]