[{"class_mtg_info": [{"meet_t": "MoWe 6:00PM - 7:20PM", "meet_l": "TBA"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: REASON: Pre-registration is not allowed for this class. Please try again during regular registration.", "qtr": "Spring 2017", "name": "33077", "title": "WCAS COMP_LIT 205-0-20 Gender, Sexuality, and Representation", "class_attributes": "", "section": "33077", "instructors": [{"instructor_phone": "847/491-5293", "instructor_name": "Penelope L Deutscher", "instructor_addr": "Crowe 1-107"}], "associated_classes": [{"component": "DIS", "room": "Locy Hall 314", "meeting_time": "Th 11:00AM - 11:50AM"}, {"component": "DIS", "room": "Locy Hall 314", "meeting_time": "Th 12:00PM - 12:50PM"}, {"component": "DIS", "room": "Locy Hall 314", "meeting_time": "Th 2:00PM - 2:50PM"}, {"component": "DIS", "room": "Locy Hall 314", "meeting_time": "Th 3:00PM - 3:50PM"}], "topic": "Rights, Identities, Politics, Analogies", "course": "205-0", "descriptions": [{"name": "Overview of class", "value": "This course has the following main aims. It introduces key ideas from some of the leading political philosophical traditions such as: social contract tradition, liberalism, republicanism, socialism/Marxism and critical theory. It considers the role of gender and sexuality in these traditions. A historical focus is given to major texts by past women philosophers and political theorists from the 18th to the 20th C, whose reflections on sex, gender and women's rights are also considered classics of political philosophy: this section includes writings by Mary Wollstonecraft, John Stuart Mill, Harriet Taylor, Simone de Beauvoir, and Carole Pateman. A fourth focal point of the course asks how equal rights claims were historically formulated by &quot;those who had no rights&quot;. Here students draw on their own critical resources to assess the rhetorical and philosophical strategies of some of the most famous rights claims. Critical focus is given, for example, to the tradition of using analogy to justify rights claims. Thus students will have the opportunity to critical evaluate rights claims based on analogies to animals, slavery, children, and to consider possible alternatives. Texts by white feminists who compared their condition to slavery are discussed in tandem with texts by philosophers of color who have challenged such analogies. A further section of the course which gives a focus to paradoxes and inconsistencies which have arisen in the history of rights claims discourse allows student to develop their skills in textual interpretation. A comparative approach is also taken to different rights claims. The class asks: What are the most imperative rights claims formulated by those who had no rights? What should those who seek equal rights actually claim? How has the perception of these imperatives transformed over time? How do the intersecting perspectives of gender, sexuality, race, and class change these imperatives? Finally, the course also gives attention to the role of gender and sexuality in contemporary political theory, focussing on debates about justice and the family, pornography, prostitution, surrogacy contracts, the 'politics of the veil' in the public sphere, multiculturalism, and challenges from contemporary theorists whose work is based in the resources of intersectionality theory, critical race theory, and queer theory. A final section on contemporary debates and figures in feminist political philosophy, includes excepts by contemporary philosophers and political thinkers such as Susan Moller Okin, Carole Pateman, Joan Scott and Judith Butler."}, {"name": "Learning Objectives", "value": "Become familiar with the classics of feminist political philosophy. Understand and compare traditions in the articulation of rights, freedom and political future. Consider paradox and inconsistencies which arise in the language of rights claims. Develop a critical and constructive perspective on these traditions. Draw on new familiarity with the historical background to bring a critical perspective on main debates exploring gender in contemporary political philosophy."}, {"name": "Evaluation Method", "value": "4 short papers, class presentation, class participation, in class keyword test."}, {"name": "Class Materials (Required)", "value": "Course pack <br/>Film: Google Baby"}], "lmod": "2/13/17 6:43 PM (CT)", "subject": "COMP_LIT"}]