[{"class_mtg_info": [{"meet_t": "We 6:00PM - 8:50PM", "meet_l": "University Hall 101"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "25414", "title": "WCAS PSYCH 314-0-20 Special Topics in Psychology", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "25414", "instructors": [{"instructor_phone": "", "instructor_name": "Renee Suzanne Engeln", "instructor_addr": "Swift 304"}], "topic": "Psychology of Beauty", "course": "314-0", "descriptions": [{"name": "Overview of class", "value": "The purpose of this course is to thoughtfully consider psychological theory, methodology, and empirical data relating to questions such as the following: What is it that makes us find beautiful people beautiful? How can evolutionary psychology explain why we find certain features beautiful? Where does this theory fail in terms of predicting perceptions of beauty? Is beauty really in the eye of the beholder? How have beauty ideals shifted over history? How are gender roles and sexual orientation related to beauty and its pursuit? Why is beauty associated with femininity? What cultural biases help those perceived as beautiful and hurt those perceived as lacking in beauty? Are beautiful people happier or more successful? In what ways are beauty standards sometimes destructive? How do cultural standards of beauty affect disorders such as anorexia nervosa, bulimia nervosa, and body dysmorphic disorder?"}, {"name": "Registration Requirements", "value": "Prerequisite: Psychology 110"}, {"name": "Teaching Method", "value": "The teaching method will be a combination of lecture, class discussions, student presentations, and in­class activities/demonstrations."}, {"name": "Evaluation Method", "value": "Grading will be based on two exams (one in-class and one take-home), one paper, one blog, comments on other students' blogs, and a final (group) research project and presentation."}, {"name": "Class Materials (Required)", "value": "There is no textbook required for this course. All readings can be downloaded from Canvas (or purchased in the form of a course packet at Quartet for approximately $40)."}], "lmod": "12/29/16 7:04 PM (CT)", "subject": "PSYCH"}]