[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Annenberg Hall G15"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "32240", "title": "WCAS ANTHRO 211-0-01 Culture &amp; Society", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "32240", "instructors": [{"instructor_phone": "", "instructor_name": "Elizabeth Anne Smith", "instructor_addr": ""}], "associated_classes": [{"component": "DIS", "room": "ANTHRO Sem Rm 104 - 1810 Hinmn", "meeting_time": "Tu 8:30AM - 9:20AM"}, {"component": "DIS", "room": "ANTHRO Sem Rm B07 - 1810 Hinmn", "meeting_time": "We 8:30AM - 9:20AM"}], "topic": "", "course": "211-0", "descriptions": [{"name": "Overview of class", "value": "This course introduces the history, methods, and concepts of cultural anthropology. Topics include anthropology's study of gender and sexuality, race and ethnicity, economic exchange, kinship and family relations, religious practice, music and art, and medical and applied/development anthropology. We explore three sets of questions through case studies from contemporary cultures worldwide, including our own: 1. How do humans organize their lives? How do social differences and hierarchies impact those lives? 2. How do people relate to one another and create meaning about those relations? and, 3. How do cultures change and travel over time and space? What kinds of solutions can anthropology offer for human problems?"}, {"name": "Learning Objectives", "value": "You will develop an anthropological point of view that will allow you to analyze human behavior and the world around you from different perspectives. Specific objectives include: <br/>1. Learn about and apply cultural relativism to world cultures and your own social environment;<br/>2. Analyze social phenomena from both an emic and an etic perspective; <br/>3. Identify and use theories and characteristics of the major areas of human social life;<br/>4. Research and write short ethnographic and analytic assignments.<br/>Assessment is through two exams, two short papers, and participation in lecture and discussion."}, {"name": "Class Materials (Required)", "value": "Robert L. Welsch and Luis A Vivanco. Cultural Anthropology: Asking Questions about Humanity. New York: Oxford University Press, 2014. (ISBN 9780199925728)<br/>Other required readings include an ethnography available in the bookstore (title TBA) and PDFs available on the course website."}], "lmod": "2/16/17 6:43 PM (CT)", "subject": "ANTHRO"}]