[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Harris Hall L06"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "25072", "title": "WCAS HISTORY 260-1-20 History of Latin America in the Colonial Period 1492-1821", "class_attributes": "Historical Studies Distro Area<br/><br/>Attendance at 1st class mandatory<br/><br/>", "section": "25072", "instructors": [{"instructor_phone": "847/491-7444", "instructor_name": "Paul F Ramirez", "instructor_addr": "Harris Hall Room 233"}], "topic": "Becoming Latin American", "course": "260-1", "descriptions": [{"name": "Overview of class", "value": "A survey of Latin America through images and primary texts, from the era of Spanish exploration and conquest through Independence (roughly 1492 to 1830), that stresses the experiences and sociocultural contributions of Americans, Europeans, and Africans to the region's history. Participants will examine textual sources in translation, as well as music, film, and especially images - maps, artwork, architecture - with the following topics for consideration: Aztec, Maya, Inca, and Iberian civilizations; models of governance in comparative perspective (Spanish, Portuguese, and Amerindian); religion, the Catholic Church, and the Inquisition; the development of industries such as mining and sugar; urban and rural life; and the significance of race, caste, class, gender, and honor. Brazil provides a continuous counterpoint to Mexico and the Andes, while &quot;fringe&quot; areas of empire, such as Cuba, Argentina, and northern Mexico, become central in the final weeks."}, {"name": "Teaching Method", "value": "DiscussionLecture"}, {"name": "Evaluation Method", "value": "Class participationExam, finalExam, mid-termQuizzesMap quiz 5%, Essay 20%, Midterm exam 20%, Final exam 25%, Class participation 30%"}, {"name": "Class Materials (Required)", "value": "Inga Clendinnen, Ambivalent Conquests: Maya and Spaniard in Yucatan, 1517-1570, ISBN 0521527317<br/><br/><br/>Kenneth Mills, William B. Taylor, and Sandra Lauderdale Graham, Colonial Latin America: A Documentary History, ISBN 0842029974<br/><br/><br/>Martin and Wasserman, Latin America and Its People, vol. 1, ISBN 0205520529 (2nd edition)"}, {"name": "Class Notes", "value": "Attendance at 1st class mandatory<br/><br/>HISTORY AREA OF CONCENTRATION: Americas"}], "lmod": "1/9/16 6:48 PM (CT)", "subject": "HISTORY"}]