[{"class_mtg_info": [{"meet_t": "Tu 2:00PM - 4:50PM", "meet_l": "Crowe 4-130 Rel Studies Sem Rm"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: PRE-REG only: Reserved for German majors.", "qtr": "Spring 2017", "name": "30899", "title": "WCAS GERMAN 326-0-20 German Cultural Studies", "class_attributes": "", "section": "30899", "instructors": [{"instructor_phone": "847/491-2616", "instructor_name": "Christine M Helmer", "instructor_addr": "Crowe Hall, Room 4-148"}], "topic": "Economics &amp; Religion in Germany", "course": "326-0", "descriptions": [{"name": "Overview of class", "value": "The primary questions addressed in this course have to do with relations between economics and religion. These questions have attracted attention because of Max Weber`s analysis of modernity in terms of the impact of Calvinist theology on modern capitalism. Yet Weber's is only one of many important studies that have considered the way in which religion shapes a particular understanding of economics. In this course we will look at key texts in the west that have contributed religious and theological ways of thinking about economics. Questions discussed will consider the Bible in relation to economic exchange, how God plays a role in capitalism, religion in relation to critiques of economic exploitation, and proposals for economic justice as informed by religious commitments. Texts by the following authors will be studied: Martin Luther, Martin Luther King Jr., Adam Smith, Karl Marx, Max Weber, Georg Simmel, and Hannah Arendt."}, {"name": "Registration Requirements", "value": "Have taken one class in the history of the west (either in the history, German, religious studies, or philosophy departments)."}, {"name": "Learning Objectives", "value": "Students will be able to define basic ideas in the study of religion and theology (biblical interpretation, God, greed, providence, justice). Students will connect religious and theological concepts to economic concepts, such as capitalism, money, and exploitation. Students will also be comfortable with the broad intellectual contours of the modern West from the 16th century to today, with exposure to major thinkers in each period: Reformation (Martin Luther), modernity (e.g. Smith and Marx), 20th century (Georg Simmel, Max Weber, Hannah Arendt and Martin Luther King Jr.)."}, {"name": "Teaching Method", "value": "Class participation: Yes!<br/>Discussion: Classes are comprised entirely of discussions.<br/>Online work: Posts and discussions on Canvas<br/>Presentations: 1 in-class presentation<br/>Readings: Approx. 150-200 pages of reading per week.<br/>Writing assignments: Study guides; 2 5-7 page papers<br/>"}, {"name": "Evaluation Method", "value": "Class participation: 10%<br/>Online work: 10%<br/>Paper, final: 20%<br/>Paper, mid-term: 10%<br/>Presentations: 10%<br/>Portfolios - 40%"}, {"name": "Class Materials (Required)", "value": "Harvey Cox. The Market as God. Harvard University Press 2013. ISBN 9780674659681. $26.95.<br/><br/>Les Leopold. Runaway Inequality: An Activist`s Guide to Economic Justice. The Labor Institute 2015. ISBN 978-0692436301. $19.95.<br/><br/>Martin Luther King, Jr. Where Do We Go From Here: Chaos or Community? Beacon 2010. ISBN 978-0807000670. $16.00.<br/><br/>Adam Smith, The Essential Adam Smith. Norton 1987. ISBN 978-0393955309. $25.46.<br/><br/>Georg Simmel, The Philosophy of Money. Routledge 2011. ISBN 978-0415610117. $38.95.<br/><br/>Max Weber, The Protestant Ethic and Spirit of Capitalism. Angelico Press 2014. ISBN 978-1621380931. $12.95."}], "lmod": "2/12/17 6:54 PM (CT)", "subject": "GERMAN"}]