[{"school": "MUSIC", "overview_of_class": "This class will explore music and performance in the film musical, investigating key themes and tropes of the genre from the early years of sound film to the early 21st century. Blending historical, theoretical, and cultural approaches, we will address the musical's iterations in diverse contexts including the \"golden age\" of MGM musicals, Bollywood, documentary, and television. Course requirements will include watching a weekly film, engaging with academic reading, and midterm and final projects.", "name": "Selected Topics in Music Literature for Non-Majors", "section": "20", "location": "RCMA 1-180", "topic": "The Film Musical", "course": "175-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4620/MUSIC/GEN_MUS/175-0/35748", "instructor": ["Emily Michelle Lane"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "35748", "subject": "GEN_MUS"}, {"school": "MUSIC", "overview_of_class": "During this class we will review the evolution of Latin American music from the Colonial period to the present day, discussing the role that this art has played in shaping Latin American identities.<br/><br/>We will approach this topic through different case studies, ranging from classical to folk and popular music, to see how different historical moments were influenced by musical activity. It will be necessary to contextualize the historical, political, and cultural scenario in which every case study is circumscribed, with the purpose of understanding the background of the works, songs, and authors that we will explore. No musical background is required.", "name": "Selected Topics in Music Literature for Non-Majors", "section": "21", "location": "RCMA 1-160", "topic": "Music of Latin America", "course": "175-0", "meeting_time": ["TuTh 9:30AM - 10:50AM"], "path": "/class-descriptions/4620/MUSIC/GEN_MUS/175-0/37736", "instructor": ["Jose Miguel Arellano"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "37736", "subject": "GEN_MUS"}]