[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "Kresge Centennial Hall 2-425"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: REASON: Pre-registration is not allowed for this class. Please try again during regular registration.", "qtr": "Spring 2017", "name": "31078", "title": "WCAS RELIGION 339-0-21 Topics in Judaism", "class_attributes": "Ethics &amp; Values Distro Area<br/><br/>", "section": "31078", "instructors": [{"instructor_phone": "", "instructor_name": "Joseph Tzvi Ringel", "instructor_addr": ""}], "topic": "Ethnic Communities in Contemporary Israel", "course": "339-0", "descriptions": [{"name": "Overview of class", "value": "In this course, you will learn about the variety of ethnic and religious minorities in the State of Israel. The State of Israel defines itself as a Jewish and democratic state. At the same time, about 25 percent of its population is not Jewish, and Jews themselves are divided along ethnic and ideological lines. Among Jews, Sephardim (Jews whose origins trace back to Spain) and Mizrahim (Jews whose origins trace back to the Islamic world) struggled against an Ashkenazi (central and eastern European) elite up through the 1990's, which saw waves of Russian and Ethiopian Jews come to the country. The largest ethnic group among non-Jews is the Arab/Palestinian population, which is divided in terms of religion between Christians and Muslims on the one hand and between Bedouin and settled communities on the other. Armenians, Circassians, and Druze, who often speak Arabic at home but largely do not regard themselves as Arab, likewise occupy a place in Israeli culture and society. In recent decades, immigrants from the Far East and refugees from Africa have added to the rich ethnic tapestry, even as the refugees' arrival has been accompanied by increasing tensions.<br/><br/>The course is multi-disciplinary, exploring both the politics and culture of different minorities in the state. The course therefore devotes time to exploring the cultural productivity of different minority groups within the realms of religion, music, art, literature and cinema. On the political level, the complexities of the Israeli-Palestinian conflict have often exacerbated tensions between the Arab minority and Jewish majority and between Jews, Christians, and Muslims, and likewise have divided these groups amongst themselves. At the same time, religious minorities have official recognition in certain spheres of life. Therefore, this course also explores the often frayed - and at other times close -relationships between, among, and within these different groups. We will try to ascertain to what extent Israel manages the tensions between these groups, what responsibilities minority groups have to the larger society and the larger society toward minorities, to what extent the tensions within Israel are/are not a microcosm of tensions within the Middle East and even across the world, and to what extent Israel can/cannot serve as a model for the proper balance between minority-majority relations, especially in conflict situations.  <br/><p>Counts towards the <a href=&quot;http://www.religion.northwestern.edu/undergraduate/major/interdisciplinary-concentrations/religion-law-politics.html&quot;>Religion, Law and Politics (RLP) </a> major concentration.</p>"}, {"name": "Registration Requirements", "value": "There are no registration requirements."}, {"name": "Learning Objectives", "value": "Content-wise, students will be expected to know the identity of the major ethnic minorities in Israel, their internal divisions, their relationship with the majority population, and the strategies they use to negotiate their cultural identities and political status. Students will likewise be expected to be able to identify the major structures that underlie minority-majority relations and to be able to compare and contrast the experiences of minorities in Israel to minorities in other countries and to think about why those similarities and differences exist.  <br/>   "}, {"name": "Teaching Method", "value": "Class participationDiscussionLectureReadingsResearch project<ln/>"}, {"name": "Evaluation Method", "value": "Class participationPapers: Short response papers, including final paper<br/>Presentations: Possible depending on size of class<br/>Research project: Research paper<br/>"}, {"name": "Class Materials (Required)", "value": "Students should buy the paperback or download via Muse, Adia Mendelson-Maoz's Multiculturalism in Israel: Literary Perspectives (West Lafayette, IN: Purdue University Press, 2014; ISBN 10:1557536805; ISBN 13:9781557536808; Listed Price for paperback: $59.95).<br/><br/>There is no one text on minorities in Israel that covers all the minorities in the course on the political level and on the cultural level outside of literature. Relevant articles and individual book chapters will be posted on Canvas.  "}], "lmod": "2/13/17 6:48 PM (CT)", "subject": "RELIGION"}]