[{"class_mtg_info": [{"meet_t": "MoWeFr 10:00AM - 10:50AM", "meet_l": "Locy Hall 301"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "12197", "title": "WCAS FRENCH 125-2-21 Intensive Intermediate French", "class_attributes": "Attendance at 1st class mandatory<br/><br/>Prerequisites apply, see description<br/><br/>", "section": "12197", "instructors": [{"instructor_phone": "847/467-0899", "instructor_name": "Katia   Viot-Southard", "instructor_addr": "1860 S. Campus Drive, Crowe Hall #2-171"}], "topic": "", "course": "125-2", "descriptions": [{"name": "Overview of class", "value": "French 125-2 is the second quarter of the three-quarter Intensive Intermediate French course for students who have completed French 125-1 or have been placed in that course by the French department. The primary goal of this course is to strengthen oral and written communication skills by immersing students in authentic cultural contexts and language. A review of essential grammar will reinforce linguistic foundations. Class meets three times a week and will be conducted in French."}, {"name": "Registration Requirements", "value": "125-1 or placement"}, {"name": "Learning Objectives", "value": "Develop students speaking, listening, reading and writing skills at the intermediate level of French in a cultural context and foster critical thinking."}, {"name": "Teaching Method", "value": "Through study, exercises, conversation and various class activities, students will review and practice basic grammar, while exploring contemporary French and Francophone cultures. Students are expected to attend class daily, to actively participate and to spend at least 2 hours of work outside of class for each contact hour. P/N not allowed."}, {"name": "Evaluation Method", "value": "Class participation, homework &amp; quizzes, four compositions, four lesson tests and end-of-quarter oral test."}, {"name": "Class Materials (Required)", "value": "Réseau (2nd ed. ) Pearson: ISBN 9781269774093<br/>Customized Intermediate French textbook for Northwestern University with MyFrenchLab access. <br/><br/>This is a specially designed textbook for this class - you will not be able to purchase online and you will need the online access card to work in the online program MyFrenchLab. The package is available at both Norris bookstore and Becks bookstore."}], "lmod": "10/30/16 7:04 PM (CT)", "subject": "FRENCH"}]