[{"school": "WCAS", "overview_of_class": "Over 90% of Islamic figurative painting is found in manuscripts and illustrates their texts. What is an illustrated manuscript? What relationships and dialogues the manuscripts produce? The course discusses the arts of the book in the Islamic lands from the 13th century until the second half of the 16th century in historical and cultural contexts. First, it examines Arabic illustrated manuscripts of scientific texts and of adab literature, and explores their literary and pictorial precedents. Second, it discusses the changes that occurred in the subject-matter and style following the Mongol conquest of Persia and Baghdad in the second half of the 13th century. Emphasis will be given to historical texts, heroic and romantic Persian poetry, and mystical allegories.<br/><br/>A two-day Myers symposium, New Studies in Islamic Painting, will be held at Northwestern University and the Art Institute of Chicago, April 14-15. The symposium addresses the relationship between word and image, questions of patronage and reception, as well as theoretical approaches to the study of Pre-Modern Islamic painting.", "name": "Studies in Medieval Art", "section": "20", "topic": "Arts &amp; Patrons Under the Valoi", "course": "420-0", "meeting_time": ["Fr 2:00PM - 4:50PM"], "path": "/class-descriptions/4620/WCAS/ART_HIST/420-0/36715", "instructor": ["Bilha   Moor"], "id": "36715", "subject": "ART_HIST"}, {"school": "WCAS", "overview_of_class": "This course has two parts. In the first four weeks we will familiarize ourselves with the broad outlines of the historiography and current debates surrounding cross-cultural art historical studies related to Europe during the medieval period, from the 4th to 15th centuries (although this periodization and geographical scope too will hopefully be questioned by our study). In the second half of the course students will be expected to choose a key location or route (to be selected the first day of class) and prepare short weekly presentations on it in relation to topics such as architecture, portable objects, patrons and artisans: these presentations will be roughly the length of conference panel papers and are intended to help students practice that scholarly genre as well as to give the class as a whole a set of case studies for comparison.", "name": "Studies in Medieval Art", "section": "21", "topic": "", "course": "420-0", "meeting_time": ["Mo 2:00PM - 4:50PM"], "path": "/class-descriptions/4620/WCAS/ART_HIST/420-0/36716", "instructor": ["Christina E Normore"], "id": "36716", "subject": "ART_HIST"}]