[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Harris Hall L28"}], "school": "WCAS", "overview_of_class": "Legal Studies Research Methods introduces students to research methods used in interdisciplinary legal studies, including jurisprudence and legal reasoning, qualitative and quantitative social science methods, and historical and textual analysis. The course is a prerequisite for the Advanced Research Seminar in Legal Studies, 398-1,- 2, and is intended to prepare students for the design of their own research project to be conducted in 398-1, -2. Through exposure to and engagement with interdisciplinary research methods on law and legal processes, the course will provide students with a deeper understanding of law in its historical and social context. The course will provide students with a set of research tools with which to conduct research on legal institutions. The course builds on content from Legal Studies 206, a prerequisite for 207. While part of the Legal Studies major sequence, the course will enrich the analytic skills of students from many fields who are interested in law or in interdisciplinary research methods. Prerequisite: LEGAL ST 206. Taught with SOCIOL 227; may not receive credit for both courses.", "qtr": "Spring 2017", "name": "Legal Studies Research Methods", "title": "WCAS LEGAL_ST 207-0-20 Legal Studies Research Methods", "lmod": "2/22/17 6:48 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Robert L Nelson", "instructor_addr": ""}], "topic": "", "course": "207-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Legal Studies Research Methods introduces students to research methods used in interdisciplinary legal studies, including jurisprudence and legal reasoning, qualitative and quantitative social science methods, and historical and textual analysis. The course is a prerequisite for the Advanced Research Seminar in Legal Studies, 398-1,- 2, and is intended to prepare students for the design of their own research project to be conducted in 398-1, -2. Through exposure to and engagement with interdisciplinary research methods on law and legal processes, the course will provide students with a deeper understanding of law in its historical and social context. The course will provide students with a set of research tools with which to conduct research on legal institutions. The course builds on content from Legal Studies 206, a prerequisite for 207. While part of the Legal Studies major sequence, the course will enrich the analytic skills of students from many fields who are interested in law or in interdisciplinary research methods. Prerequisite: LEGAL ST 206. Taught with SOCIOL 227; may not receive credit for both courses."}, {"name": "Registration Requirements", "value": "Legal Studies 206 is a prerequisite."}, {"name": "Learning Objectives", "value": "Once you complete Legal Studies Research Methods, you should be able to: <br/>o Read and analyze diverse primary legal and political sources carefully and accurately, with attention to the author's perspective, position, and credibility, and to the source's general context.<br/>o Be familiar with research methods and best practices in the social sciences and humanities regarding qualitative and quantitative data, written materials, and electronic databases.<br/>o Read, evaluate, summarize, and engage with scholarly works by others, and be able to analyze authors' arguments for evidence, context, strength, and credibility. <br/>o Generate original research questions regarding the relationship of law and society and devise research strategies for answering research questions.<br/>o Make clearly written and organized arguments that are well supported by primary sources. <br/>o Critically assess how courts and other authorities use social science in their decisions and policymaking"}, {"name": "Teaching Method", "value": "Seminar that meets 80 minutes twice a week; active discussion of readings and assignments"}, {"name": "Evaluation Method", "value": "Evaluation based on class participation, a series of short assignments and research exercises, a brief research proposal for their honor's thesis."}, {"name": "Class Materials (Required)", "value": "Epp, Maynard-Moody, and Haider-Markel, Pulled Over: How Police Stops Define Race and Citizenship (University of Chicago Press, 2014), isbn-13:978-0-226-11399-9; Luker, Salsa Dancing into the Social Sciences: Research in an Age of Info-glut (Harvard University Press, 2008), isbn 978-0-674-04821-8; Sarat, When the State Kills: Capital Punishment and the American Condition (2002, Princeton University Press), isbn 0-691-10261-9. Additional cases, articles, and documents will be provided through a course pack and on canvas."}, {"name": "Class Notes", "value": "First class required; must be taken for a grade (no p/n option)"}], "path": "/class-descriptions/4660/WCAS/LEGAL_ST/207-0/34049", "instructor": ["Robert L Nelson"], "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "id": "34049", "subject": "LEGAL_ST"}]