[{"class_mtg_info": [{"meet_t": "TuWe 3:00PM - 5:50PM", "meet_l": "Annie May Swift Hall 109"}], "school": "SoC", "overview_of_class": "Students in this intensive workshop will learn transportable storytelling concepts fundamental to artistic expression on the screen and stage. They will learn how core concepts of character, structure, plot, theme and tone apply within existing media and how, in a rapidly-expanding technological universe, they will continue to apply to all media yet-to-come.", "qtr": "Fall 2017", "name": "Foundations of Writing for Screen & Stage", "title": "SoC RTVF 561-0-20 Foundations of Writing for Screen &amp; Stage", "lmod": "5/14/17 6:42 PM (CT)", "section": "20", "topic": "", "course": "561-0", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "descriptions": [{"name": "Overview of class", "value": "Students in this intensive workshop will learn transportable storytelling concepts fundamental to artistic expression on the screen and stage. They will learn how core concepts of character, structure, plot, theme and tone apply within existing media and how, in a rapidly-expanding technological universe, they will continue to apply to all media yet-to-come."}, {"name": "Learning Objectives", "value": "Through the viewing and analysis of short films and scenes and sequences from features, students will learn how the above concepts are utilized to express personal vision. With the goal of writing and revising their own short film screenplay, emphasis throughout will be placed on mastery of all aspects of the art and craft of screenwriting. In conjunction with RTVF 475 (and/or other courses), students will be supplied with tools to expand and enrich their appreciation of all aspects of filmmaking and screenwriting in particular."}, {"name": "Teaching Method", "value": "Lectures, reading assignments, discussion, in-class viewing of short films and selected film clips, and in-class workshop of student assignments. Above all else, the environment will be a supportive one and students will be encouraged to participate in a community marked by an atmosphere of collaboration.<br/>Writing assignments are arranged to mirror a writer's creative process starting with ideas and culminating in the successful completion of a 10-page screenplay and a 20-30 page screenplay (or 2 additional 10-page screenplays) for a short \"film\" (the experience not the shooting medium)."}, {"name": "Evaluation Method", "value": "Grades will be based on the breakdown below (although I reserve the right to adjust this over the summer as the syllabus developed):<br/>OBJECTIVE<br/>Attendance 10%<br/>Professionalism 10% energy, commitment, doing the work on time, work looks perfect as we flip through your pages, xeroxed, no printer problems, etc. Also no recreational computer work, cell phones, texting, etc.ANALYSES<br/>1-page paper - visual development (How is the story told in images, actions, ideas as opposed to dialogue) 5%<br/>1-page paper - structural analysis (Scene, Sequence or Acts) 5%<br/>Character Map 5%<br/>1-2 page paper - mythic journey 5%<br/>1-2 page paper - book report on an assigned book (McKee, Aristotle, Campbell) + verbal presentation about that book to the class. 5%<br/>SCREENWRITING<br/>Final synopsis for character-based film or \"wordless\"/no talking film 10%<br/>Final 10 page screenplay 10%<br/>Final 20-30 page screenplay (or 2 10 page screenplays) 30%<br/>Grading of screenwriting is based on to what extent did you accomplish the goals emphasized by the course (i.e. structural twists, strong beginning and ending, echoes, etc.)? To what extent did you follow through what was set up in the beginning? Is the script whole, feel complete? Does it represent a coherent vision? Is there a question that's answered? If sloppy, does it have fire and originality, a strong voice that can't be ignored?<br/>REQUIRED BACKGROUND ASSIGNMENTS: 10 page plays for competitions (more in class)."}, {"name": "Class Materials (Required)", "value": "CLASS MATERIALS (REQUIRED)<br/>1. Linda Seger, Making A Good Script Great (3rd) edition<br/>Publisher: Silman-James Press; 3rd edition (February 15, 2010) Language: English<br/>ISBN-10: 1935247018<br/>ISBN-13: 978-1935247012<br/>2. Myth & the Movies: Discovering the Myth Structure of 50 Unforgettable Films [ILLUSTRATED] (Paperback)<br/>by Stuart Voytilla (Author)<br/>Paperback: 300 pages<br/>Publisher: Michael Wiese Productions; illustrated edition (November<br/>1999)<br/>Language: English ISBN-10: 0941188663<br/>ISBN-13: 978-0941188661<br/>3. Writing the Short Film<br/>Patricia Cooper (Author), Ken Dancyger (Author)<br/>Print ISBN-10: 0240805887 Print ISBN-13: 978-0240805887 Edition: 3<br/>And one of these:<br/>1. The Rhetoric and Poetics of Aristotle Publisher: Modern Library ISBN-10: 0075546027<br/>2. Campbell, Joseph, The Hero With A Thousand Faces Publisher: Princeton University<br/>ISBN-10: 0691017840<br/>3. McKee Robert, Story Publisher: Regan Books ISBN-10: 0060391685<br/>The class will be divided into thirds, with one-third of the class each reading one of these to report on to the rest of the class (see Book Report assignment above), although all are welcome to read all.<br/>OTHER REQUIRED MATERIALS<br/>Working computer, internet access, NU email/account, word processing program, xeroxing of materials required for class discussions.<br/>CLASS MATERIALS (SUGGESTED)<br/>1. Christopher Vogel, Mythic Structure for Writers<br/>2. Kristin Thompson Storytelling in the New Hollywood 3. Charles Deemer. Practical Screenwriting.<br/>4. Danziger/Rush, Alternative Scriptwriting<br/>5. Lucey, Paul Story Sense<br/>6. http://www.101shortfilmideas.com"}, {"name": "Class Notes", "value": "Reading assignments and possible additional writing assignments (i.e., giving online peer-to-peer feedback, blogging/commentary) per the syllabus."}], "instructor": ["David E. Tolchinsky"], "class_attributes": "", "id": "13171", "subject": "RTVF"}]