[{"school": "WCAS", "overview_of_class": "This course consists of a critical reading of Thucydides history of the Peloponnesian War and an investigation of the war itself. Current work has progressively exposed the writer Thucydides as both highly charged and a remarkable literary artist. This in turn has contributed to an increasing unease about Thucydides historical judgments and also his representations of fact. What factors drove Thucydides account? And how far can we reconstruct an independent history of the war? All readings in English.", "name": "Greek and Roman History", "section": "20", "topic": "Thucydides", "course": "320-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4620/WCAS/CLASSICS/320-0/37207", "instructor": ["Robert W Wallace"], "id": "37207", "subject": "CLASSICS"}, {"school": "WCAS", "overview_of_class": "By conducting a critical survey of the main literary sources available for the study of Rome from her mythic foundation to the establishment of the Republic, this course provides a wide-ranging exploration of how the history of early Rome was shaped through centuries. While exploring the genesis and development of the legendary traditions concerning the beginnings of Rome, students will engage questions which are central to understanding the politics of Roman identity at various stages of the city's growth and expansion. What do the stories of Aeneas, Romulus and Remus, the Sabine women, the rape of Lucretia and the expulsion of the kings from Rome tell us about the way the Romans of the Republican and Early Imperial ages conceived of their past? How and with what results did these legends aim to provide mythic justification for the centrality of Rome to the history of the Mediterranean world? Besides examining the historical and political dynamics which account for the fluid, multifaceted, at times even conflicting nature of the literary tradition, students will learn about important archaeological discoveries of the last half-century which have revolutionized our thinking about the origins of Rome.", "name": "Greek and Roman History", "section": "21", "topic": "The Foundation of Rome", "course": "320-0", "meeting_time": ["MoWe 9:30AM - 10:50AM"], "path": "/class-descriptions/4620/WCAS/CLASSICS/320-0/37208", "instructor": ["Francesca   Tataranni"], "id": "37208", "subject": "CLASSICS"}]