[{"class_mtg_info": [{"meet_t": "MoWe 12:30PM - 1:50PM", "meet_l": "Parkes Hall 223"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "23937", "title": "WCAS ENGLISH 378-0-21 Studies in American Literature", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "23937", "instructors": [{"instructor_phone": "", "instructor_name": "Alanna Lynn Hickey", "instructor_addr": ""}], "topic": "The American Renaissance", "course": "378-0", "descriptions": [{"name": "Overview of class", "value": "The period between the 1820s and the 1860s has traditionally been called the &quot;American Renaissance&quot;: a time when the U.S. nation, and its literature, flourished. The nineteenth century witnessed the publication of a number of important American texts that gave rise to a new national literary tradition, including familiar titles like The Scarlet Letter, Moby-Dick, and Leaves of Grass. Yet, as the nation stretched its geographical coordinates, writers from outside of this predominantly white, male literary heritage issued their own responses to the vision of a &quot;New World Democracy.&quot; This course surveys major authors of the American Renaissance while contextualizing critical responses to literary representations of American Democracy. Reading authors from Native American, Latino/a, African American, and French Creole cultures, we'll expand our study of American literature to include writers who interrogate the democratic project from both within and outside of the nation. While analyzing autobiographies, poems, short stories, and speeches we will also learn to read paintings, Native American pictographs, songs, and newspaper sketches, in an exploration of what it meant to be &quot;American&quot; and what counted as &quot;Literature&quot; in the golden era of American Letters."}, {"name": "Teaching Method", "value": "Discussion"}, {"name": "Class Materials (Required)", "value": "William Apess, An Indian's Looking-Glass for the White Man (1833); W.E.B. DuBois, The Souls of Black Folk (1903); Ralph Waldo Emerson, &quot;The Poet&quot; (1844); Julia Ward Howe, The Hermaphrodite (1847); Harriet Jacobs, Incidents in the Life of a Slave Girl (1861); Herman Melville, Benito Cereno (1855); John Rollin Ridge, The Life and Adventures of Joaquín Murieta (1854); Walt Whitman, Leaves of Grass (1855)."}], "lmod": "12/24/16 6:58 PM (CT)", "subject": "ENGLISH"}]