[{"school": "SoC", "overview_of_class": "This class is required for (and only open to) MAG recipients.", "name": "Topics in Film/Video/Audio Production", "section": "20", "topic": "Making the Short Project that Connects", "course": "379-0", "meeting_time": ["Th 3:00PM - 5:50PM"], "path": "/class-descriptions/4620/SoC/RTVF/379-0/31672", "instructor": ["Laura   Kipnis"], "id": "31672", "subject": "RTVF"}, {"school": "SoC", "overview_of_class": "There are way too many varieties of the supernatural for us to be comprehensive in one quarter: horror, monsters, and werewolves, also reincarnation, occult, ghosts? One argument connects the supernatural to spirituality and religion?that is, not a realm apart but intrinsic to our daily lives. We'll focus on low-or no-budget indy and foreign films with supernatural themes, as inspiration for your own micro-budget projects, also for you to develop your own theories about what the lures of this genre are for your audience. There will be weekly screenings (outside class), presentations, and readings in the genre. <br/><br/>The goal of the class is to shoot a final project (7-10 min) in which you explore some variety of the supernatural. You can work independently or in pairs. Students will have the option of writing an original shooting script or collaborating on your original story idea with screenwriting students. Though this process you'll refine your understanding of the supernatural genre, develop your directing skills, and end up with a solid rough cut (you can do more sound and post-production on down the road if you choose).<br/><br/>All students will be shooting final projects in this class.<br/><br/>Note: You must attend the first class to hold your place, and class attendance IS mandatory throughout the quarter.", "name": "Topics in Film/Video/Audio Production", "section": "21", "topic": "Making the Micro-budget Supernatural Film", "course": "379-0", "meeting_time": ["Th 10:00AM - 12:50PM"], "path": "/class-descriptions/4620/SoC/RTVF/379-0/31673", "instructor": ["Laura   Kipnis"], "id": "31673", "subject": "RTVF"}, {"school": "SoC", "overview_of_class": "Students will collectively produce a sitcom that was written in a fall writing course. This course is by permission only and students were selected through a crew petition held by the student executive producers of the sitcom. All students are members of the crew.", "name": "Topics in Film/Video/Audio Production", "section": "22", "topic": "Sitcom Production", "course": "379-0", "meeting_time": ["We 9:00AM - 11:50AM"], "path": "/class-descriptions/4620/SoC/RTVF/379-0/31674", "instructor": ["Erik Steven Gernand"], "id": "31674", "subject": "RTVF"}, {"school": "SoC", "overview_of_class": "An introduction to various narrative forms (e.g. the round, fractured tandem, parallel, micro-fiction, episodic, environmental, ensemble, et al) that scramble notions of traditional three-act structure and posit alternate world views to narrative causality. The class will view and analyze a range of representative films with accompanied readings (e.g. Nicholas Roeg's Don't Look Now, Terence Davies Trilogy, Lindsay Anderson's The White Bus?, Athina Tsangari's Attenberg, Leos Carax's Holy Motors, Michael Haneke's Code Unknown, Andrea Arnold's Wuthering Heights, Lynne Ramsay's Small Deaths, Chris Marker's Sans Soleil et al), many of which are counter-cultural works which are designed to provoke strong emotional responses, so please review list of sample films above before considering taking the class. Students will then will write and create final short film projects positing their own narrative strategies working either as individuals or in pairs. One short response paper and one director's manifesto will also be completed over the course of the class.", "name": "Topics in Film/Video/Audio Production", "section": "23", "topic": "Fractured/Anti/Alternative Narratives", "course": "379-0", "meeting_time": ["TuTh 10:00AM - 11:50AM"], "path": "/class-descriptions/4620/SoC/RTVF/379-0/34295", "instructor": ["Kyle Richard Henry"], "id": "34295", "subject": "RTVF"}]