[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "University Hall 218"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Freshmen may not register for this course.", "qtr": "Spring 2017", "name": "34274", "title": "WCAS HISTORY 395-0-26 Research Seminar", "class_attributes": "", "section": "34274", "instructors": [{"instructor_phone": "847/491-7172", "instructor_name": "John Starkes   Bushnell", "instructor_addr": "Harris Hall - Room 204"}], "topic": "Death of the Soviet Empire", "course": "395-0", "descriptions": [{"name": "Overview of class", "value": "One explanation of the destruction of the Soviet Empire is that in 1985 Mikhail Gorbachev became the Soviet leader, understood that the Soviet Union was in a state of crisis, set out to introduce necessary reforms, over time undertook increasingly radical economic and political reforms that completely destabilized Soviet society and, in 1991, destroyed the Soviet Union. Even if you think that's more or less what happened, Soviet society was so large, and so complex, that the larger story was composed of many separate but overlapping stories. Members of the seminar will explore one of those smaller stories: why did the economic reforms create an ever deepening economic crisis? Why did the Soviet government lose control over the constituent Soviet republics (pick a republic)? Why did Gorbachev introduce competitive elections, and what were their consequences? Why did the many senior members of the Soviet government and Communist Party who opposed what Gorbachev was doing not kick him out of power? Why were many Russians willing allow many of the non-Russian republics to secede? Did the economic pressure on the Soviet Union exerted by the Reagan arms buildup contribute to the collapse, as some believe? And there are many other important components of the Soviet collapse to explore. You will try to answer your question by reading the many primary sources that are available in English translation, memoirs by Soviet leaders, and relevant scholarly studies."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Research Paper"}, {"name": "Class Materials (Required)", "value": "(Tentatively we will read much of the following books. They may not contribute directly to the papers you will write, but to understand how your papers fit into the larger story of the Soviet collapse you will need to know something about the bigger picture.) Mikhail Gorbachev. Memoirs. 9780385480192. Bernard Gwertzman &amp; Michael Kaufman. The Decline and Fall of the Soviet Empire: Forty Years That Shook The World, From Stalin to Yeltsin. 9780312168162.<br/>Stephen F. Cohen. Voices of Glasnost. Interviews with Gorbachev's Reformers. 9780393307351. Mikhail Gorbachev. Perestroika: New Thinking for Our Country and the World. 9780060390853. Boris Yeltsin. Against the Grain: An Autobiography. 9780671700553. Yegor Ligachev. Inside Gorbachev's Kremlin. 9780679413929. Archie Brown. The Gorbachev Factor. 9780192880529."}], "lmod": "2/9/17 6:43 PM (CT)", "subject": "HISTORY"}]