[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "ANTHRO Sem Rm 104 - 1810 Hinmn"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "37998", "title": "WCAS MENA 390-5-20 Advanced Topics in Middle East &amp; North African Studies", "class_attributes": "Ethics &amp; Values Distro Area<br/><br/>", "section": "37998", "instructors": [{"instructor_phone": "", "instructor_name": "Nermeen   Mouftah", "instructor_addr": ""}], "topic": "Anthropology of Religion", "course": "390-5", "descriptions": [{"name": "Overview of class", "value": "This course introduces students to key themes in the anthropological study of religion. We will bring classic thinkers into conversation with more recent and experimental contributions to the anthropology of religion. We will scrutinize how critical concepts in the anthropology of religion may also help us to better understand secularism. Topics will include embodiment, charisma, ethics, language, belief, and materiality. Our readings will include ethnographic examples that span geographic terrain and religious traditions. Through an emphasis fieldwork methods and ethnographic writing, students will develop strategies for understanding the relationship between ethnography and theory."}, {"name": "Registration Requirements", "value": "None"}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Participation (15%)<br/>We will conduct the course as a weekly seminar. Everybody's continuous participation is encouraged and required. All students are expected to have closely read the assigned texts before the respective sessions and to be prepared to engage in class discussion. Please remember that effective participation also requires good listening skills. Regular attendance is expected of all students.<br/><br/>Reading responses (25%)<br/>Students are required to post five short critical reflections on the readings during the term. You must post one reading response for each week. All reading responses must be posted on the Blackboard Discussion Board by midnight prior to our seminar meeting. Your response may take the form of questions, reflections, or responses to other students' postings. The postings should be no longer than one sing-spaced page (500 words). You are strongly encouraged to read your colleagues' postings before class. Some questions to consider:<br/><br/>? How is the text argued? How does it reach its conclusions?<br/>? What kind of evidence is presented? Could the evidence be interpreted differently?<br/>? How does the ethnography relate to the theoretical argument?<br/>? What kind of audience does it seem to be written for? Who is it in dialogue with? <br/>? How do the readings for this session speak to each other? How do they carry on or contrast with a theme from another session?<br/><br/>Ethnography of Religion Fieldwork Assignment (60%)<br/>Over the term you will develop the methodological skills of an anthropologist through fieldwork at a site of your choosing. We will discuss this assignment in class and further details will be posted on Blackboard. The aim is for you to appreciate the process of fieldwork and develop your observation and writing skills. This is an accumulative project that will take you from fieldwork to analysis, to the opportunity to share your findings and receive feedback from classmates. Your analysis of your findings should lead you to your own argument or theory, a process that we will discuss together in class. With each fieldwork assignment, you will submit a field notebook. You are encouraged to plan ahead and assess how you will successfully complete each step in a timely fashion.<br/><br/>Topic (5%) Due Week 2<br/>Observation (10%) Due Week 4<br/>Interview/s (10%) Due Week 6<br/>Analysis (5%) Due Week 7<br/>Class Workshop in Week 9 <br/>Conference Presentation (10%) in Week 10<br/>Final Paper (20%) due in Exam Week on June 9"}, {"name": "Class Materials (Required)", "value": "Favret-Saada, Jeanne. 1980. Deadly Words: Witchcraft in the Bocage. <br/><br/>Hamdy, Sherine. 2012. Our Bodies Belong to God: Organ Transplants, Islam, and the Struggle for Human Dignity in Egypt.<br/><br/>Emerson, Robert, Rachel Fretz, Linda Shaw. 2011. Writing Ethnographic Fieldnotes, Second Edition."}], "lmod": "4/3/16 8:12 PM (CT)", "subject": "MENA"}]