[{"class_mtg_info": [{"meet_t": "MoWeFr 9:00AM - 9:50AM", "meet_l": "University Library 4770"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "23285", "title": "WCAS FRENCH 210-0-20 Reading Literatures in French", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>Attendance at 1st class mandatory<br/><br/>Prerequisites apply, see description<br/><br/>Reading, writing, speaking proficiency<br/><br/>", "section": "23285", "instructors": [{"instructor_phone": "8474918289", "instructor_name": "Brett Russell Brehm", "instructor_addr": "1880 S. Campus Drive, Kresge Hall #4-375"}], "topic": "The Art of Happiness", "course": "210-0", "descriptions": [{"name": "Overview of class", "value": "Are art and happiness compatible? Or, must true art and literature involve some manner of conflict, struggle, and pain? In this course, we will examine these and other questions through selected readings in French literature from the 19th century to the present in the three main genres (poetry, narrative prose, plays). In what ways do we take pleasure and discover happiness or bliss in reading literature, in the very 'plaisir du texte'? How has literature promoted and articulated myths of the struggling tortured artist? How has French literature imagined happiness? How does gender shape the representation and idea of happiness in French literature, and how have conceptions of happiness changed across different historical periods and cultures? In addition to learning about the historical, cultural, and literary contexts of the texts we will read in this course, you will acquire tools to analyze language, form, style, and theme. You will learn how to read complete literary works, how to write persuasive critical essays in French, and how to present your ideas about these works in French. Through close reading and engaged discussion, you will elevate your language skills, become more confident in French, and deepen your understanding of literary texts."}, {"name": "Registration Requirements", "value": "French 202, AP of 5 or consent of instructor"}], "lmod": "1/9/16 6:47 PM (CT)", "subject": "FRENCH"}]