[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Technological Institute L168"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Winter 2017", "name": "25113", "title": "WCAS CHEM 105-6-04 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "25113", "instructors": [{"instructor_phone": "", "instructor_name": "Teri Wang   Odom", "instructor_addr": ""}], "topic": "Hope &amp; Hype of Nanotechnology", "course": "105-6", "descriptions": [{"name": "Overview of class", "value": "Nanotechnology involves the creation and use of small structures at the nanometer scale. This length is around a thousand times less than the diameter of a human hair. The potential of new materials with superior properties has captured the imagination of popular science culture, which has resulted in books that described the use of carbon nanotubes for tethering a space elevator to earth as well as nano-bots repairing damaged human tissue. Currently, nanotechnology is part of a wide range of consumer products, from sunscreen to tennis balls to stain-resistant clothing. This seminar will cover all aspects of nanotechnology, from the science involved to ethics and safety considerations to potential applications. Students will have opportunities to explain an idea in nanoscience to a general audience, assess whether the interest and investment in nanoscience is justified, and propose future prospects for nanoscience based on the present state of research at Northwestern."}, {"name": "Teaching Method", "value": "Discussion; interviews; media"}, {"name": "Evaluation Method", "value": "Class participation (20%); writing assignments (50%); final project (30%)<br/><br/>There will be four writing assignments throughout the course. The first will be a short paper (3-4 pages) on a specific nanoscience topic; the second will be a longer paper (5-6 pages) debating the possibilities and potential drawbacks of nanotechnology; the third will be an interview of a scientist who works in nanoscience (3-4 pages); and the fourth will be a script for a media presentation on a specific nanoscience concept (5-6 pages)."}, {"name": "Class Materials (Required)", "value": "Nanotechnology: Understanding Small Systems, 3rd Edition, Ben Rogers et al., 2014<br/>ISBN-10: 1482211726<br/><br/>In addition, journal or magazine articles may be provided by the instructor or by members of the class in order to introduce specific examples for discussion."}], "lmod": "12/29/16 6:56 PM (CT)", "subject": "CHEM"}]