[{"class_mtg_info": [{"meet_t": "Th 2:00PM - 4:50PM", "meet_l": "Kresge 4354 Art Hist. Sem. Rm."}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Spring 2017", "name": "32453", "title": "WCAS ART_HIST 430-0-1 Studies in Renaissance Art", "class_attributes": "", "section": "32453", "instructors": [{"instructor_phone": "", "instructor_name": "Claudia E Swan", "instructor_addr": ""}], "topic": "Time, Temporality, Chronicity", "course": "430-0", "descriptions": [{"name": "Overview of class", "value": "This seminar will explore theories of time, temporality, and the diffusion of temporality?primarily but not exclusively in art historical writings and in relationship to (art) history as a discipline that is institutionally committed to the place of (art) objects in temporal narratives. Our purview is largely early modern, but students interested in all eras and temporalities are welcome; this course is also open to students in all related disciplines?anthropology, history, sociology, art theory &amp; practice. <br/> <br/>What is the time of a visual work of art? How do works of art engage with the past, and how does the past figure in works of art and our conceptions of them? Are works of art distant signals of their own times, as G. Kubler implies in The Shape of Time. Remarks on the History of Things? What is the afterlife (Nachleben, per A. Warbug) of a work of art? Is the time of a work commensurate with the time of viewing? Is meaning processual, in Adorno's terms? How do art historians engage with temporality as a condition of works of art?and within the field of art history? The static dimensions of conventional (non-cinematic) media nonetheless asks viewers to consider duration; and the placement of works within historical traditions is an ongoing encounter with temporality. Readings will range broadly, from Augustine, Nietzsche, Adorno, and Hayden White to Aby Warburg, Christopher Wood and Alexander Nagel (Anachronic Renaissance), G. Didi-Huberman, and K.P.F. Moxey."}, {"name": "Teaching Method", "value": "Class participationDiscussionReadingsSeminar"}, {"name": "Evaluation Method", "value": "PapersPresentationsThis course is dedicated to the analysis of texts and concepts; students will make brief oral presentations throughout. Two shorter papers will be assigned, one on a temporal concept and the second on a work of art of any era."}, {"name": "Class Materials (Required)", "value": "C. Wood and A. Nagel, Anachronic Renaissance, 193540802X; K.P.F. Moxey, Visual Time, 0822353695; G. Didi-Huberman, The Surviving Image, 0271072083; article-length readings will be made available on Canvas."}], "lmod": "2/6/17 6:40 PM (CT)", "subject": "ART_HIST"}]