[{"class_mtg_info": [{"meet_t": "Th 6:15PM - 9:15PM", "meet_l": "Swift Hall 107"}], "school": "SCS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "27604", "title": "SCS PSYCH 303-CN-66 Psychopathology", "class_attributes": "", "section": "27604", "instructors": [{"instructor_phone": "847/491-3652", "instructor_name": "Sara Cantonia Broaders", "instructor_addr": "Swift 243, 2029 Sheridan Road"}], "topic": "", "course": "303-CN", "descriptions": [{"name": "Overview of class", "value": "This course provides an introduction to the major categories of psychological disorders, encouraging thoughtful and critical evaluation of the DSM and other systems of classification. We explore etiological theories of mental disorder and how these views have changed over time. The course also develops critical thinking skills through the study of several controversial issues in abnormal psychology. Importantly, the course emphasizes the human face of psychological distress through case studies, readings, and videos. Carries social science credit."}, {"name": "Registration Requirements", "value": "PSYCH 110."}, {"name": "Learning Objectives", "value": "Providing an introduction to the major categories of psychological disorders.<br/>Encouraging thoughtful and critical evaluation of the DSM and other systems of classification.<br/>Exploring etiological theories of mental disorder and how these views have changed over time.<br/>Developing critical thinking skills through the study of several controversial issues in abnormal psychology.<br/>Emphasizing the human face of psychological distress through case studies, readings, and videos."}, {"name": "Teaching Method", "value": "Lecture, discussion, videos"}, {"name": "Evaluation Method", "value": "Weekly quizzes and a cumulative final exam"}, {"name": "Class Materials (Required)", "value": "Butcher, J.N., Hooley, J.M., &amp; Mineka, S. (2014). Abnormal Psychology (16th ed.). Boston: Allyn &amp; Bacon. ISBN: 978-0-205-94428-6,<br/><br/>NOTE: There should be a loose-leaf version of this book available. The book will be available at the Norris Center Bookstore."}], "lmod": "12/24/16 6:51 PM (CT)", "subject": "PSYCH"}]