[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "Scott Hall 212"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-registration - Reserved for Political Science students.", "qtr": "Spring 2017", "name": "35525", "title": "WCAS POLI_SCI 376-0-20 Civil Wars", "class_attributes": "", "section": "35525", "instructors": [{"instructor_phone": "8474912648", "instructor_name": "Hendrik   Spruyt", "instructor_addr": "601 University Place # 316"}], "associated_classes": [{"component": "DIS", "room": "University Hall 318", "meeting_time": "Th 11:00AM - 11:50AM"}, {"component": "DIS", "room": "Locy Hall 109", "meeting_time": "Th 4:00PM - 4:50PM"}], "topic": "", "course": "376-0", "descriptions": [{"name": "Overview of class", "value": "The decades following WW II are sometimes described by students of International Relations as &quot;The Long Peace.&quot; Despite obvious tensions and a Cold War between the superpowers and despite major differences in ideology and economic policies, major power war did not erupt. Indeed, some scholars wonder whether such war has become obsolete. <br/> Be that as it may, by some counts, the past half century has seen more than 20 million deaths in many other conflicts. Among these conflicts, civil wars have been some of the bloodiest and costliest. This course will examine the causes behind such conflicts as well as study how such conflicts might be terminated or prevented altogether. Some of the causes of civil wars will be internal to the states in question, other causes might be due to international actors and external forces. Correspondingly some efforts to terminate or prevent such conflicts will reside at the domestic level while others will operate in the international arena.<br/> The class will be a mixture of lectures and seminar style participation, culminating in a short research project that is of particular interest to the student and which will be designed in cooperation with the professor. Throughout the course, students will be expected to keep up with the readings and to actively contribute to the discussions in class.<br/> Although our main attention will go to conflicts after 1945, the course is not focused on any specific geographic area or any specific war. Instead, the aim of the course is to increase your understanding of the phenomenon of civil wars in general. With this general theoretical knowledge of civil wars, the student will then design a research project of a case or cases that are of particular interest to the student. One-on-one meetings with the professor and graduate assistant will help you with the research design."}, {"name": "Registration Requirements", "value": "Required class Poli Sci 240 Intro to IR"}, {"name": "Learning Objectives", "value": "After completing the course successfully students should be able to:<br/>-Develop a better understanding of the various types of civil wars.<br/>-Analyze the various causes of civil war and evaluate which cause or causes led to a specific civil war or wars.<br/>-Evaluate different strategies to prevent civil war and strategies to terminate such wars<br/>-Assess the tradeoffs of particular policy choices in dealing with civil wars<br/>-Understand the elements of social science research, and constructively critique the extant literature and suggest improvements."}, {"name": "Teaching Method", "value": "Combination of Lecture; Discussion Sections and Papers"}, {"name": "Evaluation Method", "value": "Class attendance and participation. 25% of grade; Midterm 25 %; Final paper 50%"}, {"name": "Class Materials (Required)", "value": "Ahram, Ariel, Proxy Warriors. Stanford U.P., 2011. 978-0-8047-7359-1 paperback<br/>Reno, Will, Warfare in Independent Africa. Cambridge UP, 2011. 978-0-521-61552-5. paperback"}], "lmod": "2/13/17 6:47 PM (CT)", "subject": "POLI_SCI"}]