[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "University Hall 121"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "37727", "title": "WCAS ENGLISH 385-0-21 Topics in Combined Studies", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "37727", "instructors": [{"instructor_phone": "847 4915675", "instructor_name": "James Joseph Hodge", "instructor_addr": "University Hall Room 408"}], "topic": "Critical Internet Studies", "course": "385-0", "descriptions": [{"name": "Overview of class", "value": "This course examines the varieties of audio/visual discourse native to and sustained by the Internet and the World Wide Web. Topics may include memes, selfies, supercuts, animated .gifs, comments, search engines, trolling, casual games, etc. While &quot;sharing&quot; and &quot;connection&quot; typically rule discussions of what networks do or enable, our aim will be to analyze how web-based genres promote affects that diverge from conventional accounts but nonetheless constitute much of networked life, e.g. boredom, cuteness, disinhibition, etc. We will proceed by pairing readings in critical theory and new media studies alongside artworks."}, {"name": "Teaching Method", "value": "Discussion, short lecture."}, {"name": "Evaluation Method", "value": "Short writing assignments; research paper."}, {"name": "Class Materials (Required)", "value": "Readings by Kant, Cavell, Ngai, Warner, Cohen, Dibbell, Nakamura, Jagoda, Hansen, Starosielski, Richmond, and others. Artworks to be analyzed include a novel (Dennis Cooper's The Sluts), a film (Frances Stark's My Best Thing), and web-based art and data visualization (Thomson and Craighead's Beacon, Kamvar &amp; Harris' We Feel Fine), and a game (David OReilly's Mountain)."}, {"name": "Class Notes", "value": "Post 1830<br/><br/>The above course is combined with another department. If the ENGLISH side of the course is full, you may register for the course under the co-listed department and receive the same credit toward your English major."}], "lmod": "4/3/16 7:59 PM (CT)", "subject": "ENGLISH"}]