[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Kresge Centennial Hall 2-415"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "10093", "title": "WCAS ANTHRO 390-0-22 Topics In Anthropology", "class_attributes": "", "section": "10093", "instructors": [{"instructor_phone": "847/467-1638", "instructor_name": "Shalini   Shankar", "instructor_addr": "1810 Hinman Ave., Room #209, EV Campus"}], "topic": "Asian Persuasion: Advt &amp; Cons", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "What is Asian American advertising, how can we understand cultural production<br/><br/>and consumption practices among Asian Americans? This course will examine<br/><br/>ethnographic approaches to advertising, fashion, food, and expressive culture<br/><br/>among Asian communities in the United States. The first portion of the class will<br/><br/>examine the creative and production processes involved in creating ads for<br/><br/>specific Asian ethnic groups, as well as other cultural production in Asian<br/><br/>American industries, including fashion. The second will look in depth at various<br/><br/>studies of consumption that document the ways in which Asian Americans<br/><br/>engage with popular culture and commodities, including food and art. The course<br/><br/>will also draw relevant connections between advertising and consumption in the<br/><br/>US with China, India, Japan, and other Asian nation-states. The course will be<br/><br/>grounded in anthropological perspectives of advertising and cultural production<br/><br/>as well as theories of consumption, and consider the effects of these on<br/><br/>meanings of ethnicity, race, gender, class, nation, and diaspora."}, {"name": "Learning Objectives", "value": "To familiarize students with qualitative social science research and<br/><br/>analysis and offer a substantive exploration of capitalist culture industries pertaining to Asian<br/><br/>Americans."}, {"name": "Teaching Method", "value": "Class participation<br/>Discussion<br/>Field Trips <br/>Field Work<br/>Films/videos<br/>Group Work<br/>Guest Speakers<br/>Lectures<br/>Presentation<br/>Readings<br/>Research Project<br/>Writing Assignment"}, {"name": "Evaluation Method", "value": "Attendance<br/>Class Participation<br/>Field Work<br/>Group Projects<br/>Group Work<br/>Paper, Final<br/>Papers<br/>Presentations<br/>Project, Final"}, {"name": "Class Materials (Required)", "value": "1. Kim, R. 2014. Dubious Gastronomy. U Hawaii Press. ISBN: 978-<br/><br/>0-8248- 3997-0<br/><br/>2. Shankar, Shalini. 2015. Advertising Diversity: Ad Agencies and the<br/><br/>Creation of Asian American Consumers. Durham, NC: Duke<br/><br/>University Press. ISBN: 978-0- 8223-5877- 0<br/><br/>3. Tu, T.L. 2010. The Beautiful Generation. Duke U Press. ISBN:<br/><br/>978-0- 8223-4913- 6"}, {"name": "Class Notes", "value": "No P/N option; students must contact instructor to add after first class meeting."}], "lmod": "10/30/16 6:58 PM (CT)", "subject": "ANTHRO"}]