[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Annenberg Hall G30"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Registration is reserved for students who have taken and passed any 200 or 300 level courses. Otherwise, permission of the instructor is required.", "qtr": "Winter 2017", "name": "20567", "title": "WCAS LING 300-0-22 Topics in Linguistics", "class_attributes": "", "section": "20567", "instructors": [{"instructor_phone": "847/491-8052", "instructor_name": "Annette Kumsun D'onofrio", "instructor_addr": "2016 Sheridan Rd,, Room 106"}], "topic": "", "course": "300-0", "descriptions": [{"name": "Overview of class", "value": "This course will explore how experimental methods from a variety of areas (speech perception, social psychology, and psycholinguistics) can help us examine new and exciting questions about the social meaning of language. We will begin by discussing current theoretical work on socially meaningful linguistic variation, finding research questions that are suited to the use of experimental methods. We will then turn to the growing body of experimental research in sociolinguistics to understand the theoretical and methodological contributions of this work. Using prior work as a jumping off point, we will discuss questions such as: How do our social experiences, stereotypes, and attitudes mediate how we speak and how we listen? How do we infer who someone is from the way that they speak? How do our social expectations influence our linguistic perceptions? And how much control do we have over these processes? Students will gain both a theoretical understanding of research in these areas, as well as practical knowledge related to formulating research questions and constructing experimental studies on sociolinguistic topics."}, {"name": "Registration Requirements", "value": "Another previous linguistics course at the 200 or 300 level, or graduate standing, preferred."}, {"name": "Learning Objectives", "value": "Through successfully completing this course, students will understand current theories of socially-conditioned linguistic variation and change, and gain knowledge of an arsenal of experimental approaches to test these theories. Students will also gain experience in formulating research questions based on previous work, as well as in selecting methods and design appropriate to these questions. This provides students with practice in the skills required to conduct theoretically-motivated experimental research in sociolinguistics."}, {"name": "Teaching Method", "value": "Class discussion and lecture."}, {"name": "Evaluation Method", "value": "Assignments (reading responses), article presentation, final project."}, {"name": "Class Materials (Required)", "value": "No required texts (all will be provided by instructor)"}], "lmod": "12/24/16 7:03 PM (CT)", "subject": "LING"}]