[{"class_mtg_info": [{"meet_t": "We 6:15PM - 9:15PM", "meet_l": "Wieboldt Hall 701"}], "school": "SCS", "overview_of_class": "This course applies the concepts of strategic planning to various types of organizations. Initial discussions will provide a basic framework for preparing a strategic plan for corporations, non-profits and government agencies. Practical applications will be developed from case studies and the experiences of the instructor and students. Since we can learn from wide range of situational discussions, we will consider entrepreneurial and established operations, as well as success stories and failures.", "qtr": "Spring 2016", "name": "Strategic Planning and Management", "title": "SCS ORG_BEH 367-CN-15 Strategic Planning and Management", "lmod": "4/3/16 7:34 PM (CT)", "section": "15", "instructors": [{"instructor_phone": "", "instructor_name": "Max W. Reed", "instructor_addr": ""}], "topic": "", "course": "367-CN", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "This course applies the concepts of strategic planning to various types of organizations. Initial discussions will provide a basic framework for preparing a strategic plan for corporations, non-profits and government agencies. Practical applications will be developed from case studies and the experiences of the instructor and students. Since we can learn from wide range of situational discussions, we will consider entrepreneurial and established operations, as well as success stories and failures."}, {"name": "Registration Requirements", "value": "It is recommended that students have taken courses in basic accounting and finance. Other business courses such as marketing, economics, etc, coupled with practical experience will provide a strong foundation for learning. Most important however is an interest in learning about how to plan in a business environment and coming to class with an open mind."}, {"name": "Learning Objectives", "value": "1) To develop students' capacity to think strategically about a company, its present business position, its long-term direction, its resources and competitive capabilities, the caliber of its strategy, and its opportunities for gaining sustainable competitive advantage.<br/>2) To build skills in conducting strategic analysis in a variety of industries and competitive situations and, especially, to provide students with a stronger understanding of the competitive challenges of a global market environment.<br/>3) To give you hands-on experience in crafting business strategy, evaluating strategic options, using what-if analysis to evaluate action alternatives, and making sound strategic decisions.<br/>4) To acquaint you with the managerial tasks associated with implementing and executing company strategies, learn of the range of actions managers can take to promote competent strategy execution.<br/>5) To integrate the knowledge gained in other courses and in the business world, showing how the various pieces of the business puzzle fit together. To demonstrate why the different parts of a business need to be managed in strategic harmony for the organization to operate in a consistent, winning fashion.<br/>6) To heighten your awareness of how and why ethical principles, core values, and socially responsible management practices matter greatly in the conduct of a company's business and are must be considered as a critical part of the decision-making process.<br/>7) To develop your powers of managerial judgment, help you learn how to assess business risk, and improve your ability to make sound business decisions and achieve effective outcomes."}, {"name": "Class Materials (Required)", "value": "The Essentials of Strategic Management - The Quest for Competitive Advantage; <br/>Gamble and Thompson; McGraw-Hill - 2014;<br/>ISBN: 9780078112898; Ed 4"}, {"name": "Class Notes", "value": "Students are expected to stay up to date on current business topics by reading by business periodicals and newspapers such as the Wall Street Journal. These will be used to extend discussions into appropriate areas pertaining to strategic planning."}], "path": "/class-descriptions/4620/SCS/ORG_BEH/367-CN/37912", "instructor": ["Max W. Reed"], "class_attributes": "", "id": "37912", "subject": "ORG_BEH"}]