[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Annenberg Hall G21"}], "school": "WCAS", "overview_of_class": "Russian Culture in Revolution: From Lenin to Putin<br/><br/>2017 is the 100th anniversary of the Russian Revolution. To make sense of the significance of this anniversary, this unique, team-taught lecture course integrates insights from Northwestern specialists in Russian and Soviet literature, visual art, music, theatre, film, graffiti, history, and politics. The course provides an introduction to modern Russia's rich cultural history, from the revolutionary fervor of the 1920s to Stalinist repression, from the vitality of official and unofficial art during the post-Stalin \"thaw\" to the new artistic revolutions that followed the collapse of the Soviet Union. The course also grapples with fundamental questions such as how historical and political contexts shape the arts, how the arts have been and can be used to imagine new worlds, how foreign ideologies interact with national cultures, and how scholars' distinct disciplinary tools and frameworks shape their approaches to the study of Russia's history, politics, and artistic culture.", "qtr": "Fall 2017", "name": "Slavic Civilizations", "title": "WCAS SLAVIC 255-0-1 Slavic Civilizations", "lmod": "5/1/17 8:39 PM (CT)", "section": "1", "associated_classes": [{"component": "DIS", "room": "TBA", "meeting_time": "Fr 10:00AM - 10:50AM"}, {"component": "DIS", "room": "TBA", "meeting_time": "Fr 11:00AM - 11:50AM"}, {"component": "DIS", "room": "TBA", "meeting_time": "Fr 1:00PM - 1:50PM"}, {"component": "DIS", "room": "TBA", "meeting_time": "Fr 2:00PM - 2:50PM"}], "topic": "Russian Culture in Revolution: Lenin to Putin", "course": "255-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Russian Culture in Revolution: From Lenin to Putin<br/><br/>2017 is the 100th anniversary of the Russian Revolution. To make sense of the significance of this anniversary, this unique, team-taught lecture course integrates insights from Northwestern specialists in Russian and Soviet literature, visual art, music, theatre, film, graffiti, history, and politics. The course provides an introduction to modern Russia's rich cultural history, from the revolutionary fervor of the 1920s to Stalinist repression, from the vitality of official and unofficial art during the post-Stalin \"thaw\" to the new artistic revolutions that followed the collapse of the Soviet Union. The course also grapples with fundamental questions such as how historical and political contexts shape the arts, how the arts have been and can be used to imagine new worlds, how foreign ideologies interact with national cultures, and how scholars' distinct disciplinary tools and frameworks shape their approaches to the study of Russia's history, politics, and artistic culture."}, {"name": "Learning Objectives", "value": "1) Achieve an understanding of the chronology of and principal developments in Soviet and post-Soviet Russian history.<br/>2) Achieve an understanding of how historical context and politics shape artistic and cultural production, and vice versa.<br/>3) Achieve an understanding of how \"Russian\" culture interacts with international influences.<br/>4) Achieve an understanding of how scholars' disciplinary tools shape their insights.<br/>5) Build a vocabulary to articulate the development of Soviet culture, focusing on artistic movements (e.g., Futurism, Constructivism, Socialist Realism) and aesthetic techniques (e.g., estrangement, biomechanics, montage).<br/>6) To develop skills of close reading, critical visual analysis, active listening, engaged discussion, and making clear, well-reasoned arguments in writing and speaking."}, {"name": "Teaching Method", "value": "Lecture and discussion. This is a team-taught course, including professors from Slavic Languages and Literatures, History, Art History, Political Science, Music and Theater."}, {"name": "Evaluation Method", "value": "Evaluation<br/>? Midterm exam (20%) <br/>? 4-5 page paper (25%) <br/>? Final examination (30%) <br/>? 2-page précis (10%) written about a local event or exhibition related to the 2017 anniversary<br/>(see list below [TK])<br/>? Participation in discussion section and class attendance (15%)"}, {"name": "Class Materials (Required)", "value": "Articles and chapters will be made available on Canvas and/or course packet.<br/>Sample readings to accompany specific lectures may include:<br/><br/>Kazimir Malevich, \"From Cubism and Futurism to Suprematism\" (1915)<br/>Natan Altman, \"?Futurism' and Proletarian Art\" (1918) <br/>Komfut Program Declaration (1919) <br/>Alexander Blok, \"The Decline of Humanism\" (1918)<br/>T.J. Clark, \"God Is Not Cast Down\" (short excerpt), from Farewell to an Idea<br/>Christina Kiaer, Imagine No Possessions, excerpts<br/>Robert Leach, \"Revolutionary theatre, 1917-1930\"<br/>Aleksandra Kollontai, \"Vasilisa Malygina\"<br/>Lydia Chukovsky, \"Sofia Petrovna\"<br/>Anna Akhmatova, \"Requiem\"<br/>Aleksandr Solzhenitsyn, One Day in the Life of Ivan Denisovich<br/>Solzhenitsyn, \"Matrena's Home\"<br/>Sozhenitsyn, \"Incident at Krechetovka Station\"<br/>Alexei Yurchak, Everything was Forever until it was No More (2007)?one chapter<br/>Daniel Treisman, The Return: Russia's Journey from Gorbachev to Medvedev (Free Press, 2011) - Chp 5: \"The Unraveling\" (pp. 163-196)<br/>Alexander Dallin, \"Causes of the Collapse of the USSR,\" Post-Soviet Affairs 8, 4 (1992)<br/>John Bushnell, \"The Brief Post-Soviet Life of the Soviet Graffiti Argot,\" in Russia's Century of Revolutions: Parties, People, Places (2012), pp. 173-94<br/>Sheila Fitzgerald, The Russian Revolution (3rd edition), ISBN 978-01-99237678."}], "instructor": ["Jordan Luc Gans-Morse"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "14404", "subject": "SLAVIC"}]