[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "Annenberg Hall G21"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24758", "title": "WCAS SOCIOL 218-0-20 Education and Inequality: Focus on Chicago", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "24758", "instructors": [{"instructor_phone": "847/467-0517", "instructor_name": "Karrie A Snyder", "instructor_addr": "1808 Chicago, Room 106"}], "associated_classes": [{"component": "DIS", "room": "Annenberg Hall G32", "meeting_time": "Tu 3:00PM - 3:50PM"}, {"component": "DIS", "room": "Annenberg Hall 101", "meeting_time": "We 5:00PM - 5:50PM"}, {"component": "DIS", "room": "Parkes Hall 224", "meeting_time": "Th 4:00PM - 4:50PM"}, {"component": "DIS", "room": "Annenberg Hall 101", "meeting_time": "Fr 9:00AM - 9:50AM"}], "topic": "", "course": "218-0", "descriptions": [{"name": "Overview of class", "value": "This course is an examination of social inequality in education, including its causes and consequences. The course will focus on the case study of Chicago Public Schools (CPS), a diverse school system in a major urban area. Building on existing sociological theories and concepts regarding educational stratification, as a class we will look at the influences of social inequality and diversity on the practice of education within CPS, including how educational outcomes vary across social student populations. We will also explore the historical development of CPS and the current state of social inequality and diversity within CPS. Social inequality takes on many forms and we will examine the interplay among multiple social statuses including gender, socioeconomic status, immigrant status, and race/ethnicity and explore how inequality impacts the experiences of the diverse student body present within CPS. Finally, we look at current efforts aimed at improving local Chicago public schools and the efficacy of these reform initiatives."}, {"name": "Registration Requirements", "value": "During preregistration this course is only open to Sociology Majors &amp; Minors. <br/>This course is open to all students during regular registration."}, {"name": "Learning Objectives", "value": "During the quarter, students will address the following questions:<br/><br/>1) What is social inequality? How does inequality shape the practice of education? How have sociologists studied education? <br/><br/>2) How do schools within CPS respond to their diverse student populations and their unique needs? How have recent school reform efforts both encouraged and alleviated social inequality?<br/><br/>3) How is CPS both representative and unique in terms of its educational system and relationship to inequality? What larger social factors influence the structure and performance of CPS schools and students?<br/><br/>During the quarter, students will also: <br/><br/>4) Engage with research and theories related to social inequalities and diversities, with the primary focus on the United States (using the case study of Chicago). <br/><br/>5) Better understand how such differences as race, class, ethnicity, and gender/sexual orientation are related.<br/><br/>6) Better understand the impact that histories, institutions, and/or social structures have on local issues and on individual experiences and identities, including their own. <br/><br/>7) Demonstrate their ability to think more critically about political, social, scientific, economic, and/or cultural issues related to social inequalities and diversities."}, {"name": "Teaching Method", "value": "Lecture, Discussion Sections, Group Work, Writing Assignments"}, {"name": "Class Materials (Required)", "value": "This is a tentative book list. Please confirm all books before purchase:<br/>Tentative list;<br/>Bryk, Organizing Schools for Improvement: Lessons from Chicago, 2010, University of Chicago Press (978-0226078007)<br/>Schulz, Spectacular Things Happen Along the Way: Lessons from an Urban Classroom, 2008, Teachers College Press ( 978-0807748572)<br/>Kozol, Savage Inequalities, Broadway Books (978-0770435684)<br/>Duncan &amp; Murnane, Restoring Opportunity: The Crisis of Inequality and the Challenge of American Education, 2013, Harvard/Russell (978-1612506340)<br/>Sage Foundation<br/><br/>Library reserves on Canvas."}, {"name": "Class Notes", "value": "If you go to Dr. Snyder's CTECs, click on &quot;Academic Term&quot; to look at the CTECs for her most recent courses, including SOCIOL 307 School and Society."}], "lmod": "12/24/16 7:08 PM (CT)", "subject": "SOCIOL"}]