[{"school": "SCS", "overview_of_class": "This course is designed for those who have experience with college-level writing but who want to sharpen their writing and communication skills. Students learn to apply measures of excellence in business writing and communication. Assignments relate to business environments, including audience analysis, persuasive writing, verbal and interpersonal communication, and document design and graphics. Writers gain experience writing in collaborative environments. Students produce multiple drafts and receive feedback from their peers and the instructor. This course combines classroom lecture and discussion with an online component. For the lecture and discussion components, this course is paired with the morning session of BLP/ORG BEH 307-CN taught by Aleen Bayard, and the in-class meetings are on alternate Saturdays: 9/24, 10/8, 10/22, 11/5, 11/19. For the online component, students must have ready access to the Internet. This course is part of the Business Leadership year one cohort.", "name": "Intermediate Composition", "section": "19", "location": "Wieboldt Hall 512", "topic": "Business Communication", "course": "205-CN", "meeting_time": ["Sa 1:00PM - 4:00PM"], "path": "/class-descriptions/4640/SCS/ENGLISH/205-CN/18433", "instructor": ["Leslie   Fischer"], "class_attributes": "", "id": "18433", "subject": "ENGLISH"}, {"school": "SCS", "overview_of_class": "This course is designed for students who have experience with college-level writing but who want to sharpen their writing and communication skills. Students learn to apply measures of excellence in business writing and communication. Assignments relate to business environments, including audience analysis, persuasive writing, verbal and interpersonal communication, and document design and graphics. Writers gain experience writing in collaborative environments, producing multiple drafts and receive feedback from their peers and the instructor.<br/><br/>This hybrid course combines classroom lecture and discussion with an online component; such courses are demanding and best suited for students who work well independently. In-class meeting dates are 9/22, 9/29, 10/13, 10/27, 11/17 and 12/1. Attendance is required for all sessions. Absences for in-class meetings will significantly affect the final grade. Homework will be due in-class and online.", "name": "Intermediate Composition", "section": "66", "location": "University Hall 318", "topic": "Business Communication", "course": "205-CN", "meeting_time": ["Th 6:15PM - 9:15PM"], "path": "/class-descriptions/4640/SCS/ENGLISH/205-CN/18434", "instructor": ["Katharine B Duke"], "class_attributes": "", "id": "18434", "subject": "ENGLISH"}]