[{"class_mtg_info": [{"meet_t": "Th 5:00PM - 7:50PM", "meet_l": "ANTHRO Sem Rm 104 - 1810 Hinmn"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Graduate Students.<br/><br/>Reserved for Graduate Students.", "qtr": "Winter 2017", "name": "23183", "title": "WCAS ANTHRO 476-0-20 Globalization &amp; Discontents", "class_attributes": "Graduate Students Only<br/><br/>", "section": "23183", "instructors": [{"instructor_phone": "847/491-4821", "instructor_name": "Micaela   di Leonardo", "instructor_addr": "1810 Hinman Ave., Room #210, EV Campus"}], "topic": "", "course": "476-0", "descriptions": [{"name": "Overview of class", "value": "&quot;Globalization talk&quot; has grown wildly in scholarly and popular discourse over the last decades, frequently supplanting &quot;capitalism,&quot; &quot;imperialism,&quot; &quot;transnationalism,&quot; and, in a sense, &quot;postmodernism.&quot; Globalization is ordinarily used to refer to increasing contemporary international economic, political, and cultural integration. Some wish to claim this tightening set of linkages is a novel global phenomenon, while others point to the long histories of waxing and waning political-economic and cultural ties. In this seminar, we will link this polysemous referent explicitly to the history of global capitalism, with special foci on the rise of neoliberal capitalism and with it increasing economic inequality worldwide, on the shifting meanings of national identity, on labor and commodities, and on the world's foremost imperial power since the Second World War, the United States?with a particular emphasis on the history of US/Muslim state relations and imaginaries. We will also use the globalization question to highlight considerations of the transnationality of changing race and gender/sexuality relations in a variety of global contexts, and to revisit the thorny issue of historically and political-economically informed ethnographic cultural analysis. Readings will be anthropologically focused but broadly interdisciplinary, with many ripped-from-the-headlines contributions. Seminar participants will each co-facilitate two discussions of readings-in which each co-facilitating pair will take extra responsibility for providing précis and guiding seminar discussion. Evaluation will include seminar participation and a take-home final synthetic essay exam on course readings."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Class Materials (Required)", "value": "Jefferson Cowie, Capital Moves. New Press ISBN 1-56584-659-1<br/>David Harvey, A Brief History of Neoliberalism. Oxford ASIN B00DU7EATM<br/>Roger Lancaster and Micaela di Leonardo, eds, The Gender/Sexuality Reader. Routledge ISBN 0-415-91004-8<br/>Mahmood Mamdani, Good Muslim, Bad Muslim: America, the Cold War, and the Roots of Terror. Pantheon ISBN 0-385-51537-5<br/>Ara Wilson, The Intimate Encounters of Bangkok: Tomboys, Tycoons, and Avon Ladies in the Global City. California ISBN 0-520-23968-7<br/>Wayne Ellwood, Globalization: Buying and Selling the World. 2015 Updated Edition. New Internationalist. ISBN 978-1-78026-237-6<br/>All books are paperback.<br/>*Articles in coursepack at Quartet Copies"}], "lmod": "12/25/16 6:54 PM (CT)", "subject": "ANTHRO"}]