[{"school": "WCAS", "overview_of_class": "Topic: Burning Embers and Burka Avengers: Society, Literature and Popular Culture in Pakistan<br/><br/>This class will an offer an introduction to the literature, arts and popular culture of Pakistan with a focus on the productive - if often fraught- relationship between artistic creation, social reform and political change. Looking beyond the confines of the modern nation-state, our examination will stretch from the leftist modernism of the 1930s to contemporary trends, including the recent appearance of hip-hop, &quot;Sufi rock,&quot; and animated programs such as Burka Avenger. The course will examine major movements and figures, reading them with reference to the historical context in which they were produced. While our primary focus will be on the written word - novels, short stories, and poetry - we will also devote significant attention to the place of music, television and film. By the end of the course, students will have a strong knowledge of Pakistan's political, cultural and artistic history, as well as its contemporary relevance. They will also gain a critical understanding of the relationship between the arts, politics and social reform.", "name": "Introductory Topics in Asian Languages and Cultures", "section": "20", "topic": "Burning Embers and Burka Avengers: Society, the Ar", "course": "290-0", "meeting_time": ["MoWe 9:30AM - 10:50AM"], "path": "/class-descriptions/4620/WCAS/ASIAN_LC/290-0/32068", "instructor": ["Daniel Joseph Majchrowicz"], "id": "32068", "subject": "ASIAN_LC"}, {"school": "WCAS", "overview_of_class": "Topic: Modern Korean Literature <br/>This course examines the development of modern Korean literature from the 1900s to the 1970s. In addition to providing a survey of major works of modern Korean literature, this course will examine the significance and role of literature in Korean society, topics that have been intensely debated upon ever since the modern notion of &quot;literature&quot; was introduced to Korea. We will explore questions such as: How have the social and historical contexts of this period - from Japanese colonialism to Korean War and national division to rule by authoritarian governments - shaped Korean literature? Why have so many Korean writers asked, &quot;What is literature?&quot; How have they attempted to answer this fundamental question? The readings for the course will include works of literary fiction and criticism, as well as historical and/or critical readings, which will be used to supplement and contextualize the literary texts. All readings will be in English. No previous knowledge of Korea or Korean language is required.", "name": "Introductory Topics in Asian Languages and Cultures", "section": "21", "topic": "Modern Korean Literature", "course": "290-0", "meeting_time": ["MoWe 11:00AM - 12:20PM"], "path": "/class-descriptions/4620/WCAS/ASIAN_LC/290-0/32069", "instructor": ["Mi-Ryong   Shim"], "id": "32069", "subject": "ASIAN_LC"}, {"school": "WCAS", "overview_of_class": "This course is devoted to the study of the novel in late imperial Chinese literature. This quarter we will read the English translation of Shuihu zhuan, aka The Water Margins, or The Outlaws of the Marsh. Due to its length, this novel will be the primary focus of the course, though we will include selections from other contemporary and related sources, when relevant to the overall understanding of the text under study. As we read through this text, in translation, uncovering its richness and complexity, we will in turn address issues such as the place of the novel in traditional Chinese literature; authorship and authority; narrative strategies and plot development; magic and religion; material culture; demons and exorcism; sexuality and adultery; femininity, masculinity and their discontents. In addition to Shuihu zhuan, representative theoretical work in the field of pre-modern Chinese literature will be incorporated as much as possible.", "name": "Introductory Topics in Asian Languages and Cultures", "section": "22", "topic": "Ming Novel", "course": "290-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4620/WCAS/ASIAN_LC/290-0/32070", "instructor": ["Paola   Zamperini"], "id": "32070", "subject": "ASIAN_LC"}]