[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Tech Institute Lecture Room 2"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Cognitive Science major and minors.", "qtr": "Spring 2017", "name": "32729", "title": "WCAS COG_SCI 211-0-20 Learning, Representation &amp; Reasoning", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>Attendance at 1st class mandatory<br/><br/>", "section": "32729", "instructors": [{"instructor_phone": "", "instructor_name": "Dedre   Gentner", "instructor_addr": ""}], "topic": "", "course": "211-0", "descriptions": [{"name": "Overview of class", "value": "Questions about the nature of the mind have been asked throughout human existence, and yet gaining a complete and satisfactory understanding of the phenomenon of cognition has remained a challenge. The daunting complexity of the brain, the remarkable<br/>flexibility of human thought, and the apparent paradox of a brain being able to understand itself have combined to make this goal elusive. However, in recent years, a set of promising new ways of approaching the study of the mind have emerged as a result of two forces: (1) the interaction and collaboration of scientists studying cognition in a variety of disciplines, and (2) the advent of computers, which make it possible to build testable models (in the form of computer programs) of various aspects of intelligence. The fields of cognitive psychology, artificial intelligence, linguistics, philosophy, anthropology, and neuroscience have all contributed to these endeavors, and the result has come to be known as cognitive science - the interdisciplinary study of<br/>the mind.<br/>This course focuses on three main areas: learning, knowledge representation, and reasoning. Some of the issues we explore are the nature of concepts and how they are acquired and used; how experiences are stored in memory and what determines when they are retrieved; how children's minds develop into adult minds, and how this compares to what happens when adults learn a new domain. We will cover current research on whether the language we speak affects the way we think and discuss new findings on animal cognition. The goal of the course is not merely to survey research in these areas, but rather to explore current theories and to describe the evidence - psychological, computational, and linguistic - that supports or challenges them."}, {"name": "Teaching Method", "value": "Twice-weekly lecture and discussion."}, {"name": "Evaluation Method", "value": "Weekly homeworks plus two in-class examinations."}, {"name": "Class Materials (Required)", "value": "Readings on current topics, provided by instructor."}], "lmod": "2/7/17 6:42 PM (CT)", "subject": "COG_SCI"}]