[{"class_mtg_info": [{"meet_t": "MoWe 10:00AM - 11:20AM", "meet_l": "Louis Hall 118"}], "school": "SoC", "enrl_requirement": "Enrollment Requirements: Students must have taken RTVF 190-0 and be sophomore, junior, or senior standing in order to enroll in this course.<br/>Add Consent: Department Consent Required<br/>", "qtr": "Spring 2017", "name": "37378", "title": "SoC RTVF 376-0-22 Topics in Interactive Media", "class_attributes": "Prerequisites apply, see description<br/><br/>", "section": "37378", "instructors": [{"instructor_phone": "847/467-0483", "instructor_name": "Ozge   Samanci", "instructor_addr": "Louis Hall 221"}], "topic": "Alternative Reality Storytelling", "course": "376-0", "descriptions": [{"name": "Overview of class", "value": "RTVF 376-0 Sec. 22 Topics in Interactive Media: Alternative Reality Storytelling<br/>Course Description<br/> <br/>Mobile and location-based technologies (GPS, Google Earth, Google Maps) are offering artists, storytellers and filmmakers new meaning making opportunities and new challenges. The world surface has become a navigable canvas or stage where we can explore stories through physical walks. These walks can benefit from limitless interactivity of real life and all available technology. Location-based storytelling borrows conventions from game design, interactive narrative, improvisational theatre, sound and performance art, film, and more.<br/> <br/>In this course, we will merge physical and virtual worlds and we will design fictional or non-fictional storytelling, game, art pieces based on walks that create or benefit from alternate, fragmented and virtual reality.<br/> <br/>This production class will include tutorials about QR codes, ARIS (GPS based game design platform), Virtual Reality (HTC Vive, Tilt Brush, Google Sketch up). In addition to these tools participants can use any existing low or high technology such as USPS mailing system, email, augmented reality apps, SMS, tattoo and t-shirt design, Morse code, Skype, Google image search, sound recordings, film and video, photographs, music, flash mobs, live actors, etc. Class participants will design a short alternate reality experience that purposefully blurs reality and fiction and narrates a story. The final project will also include a short documentation video of this ephemeral experience. This video could become a portfolio piece.<br/> <br/>Course Objectives<br/>Along with the production of an alternate reality storytelling experience and demo video, we will read assigned theoretical text exploring the concept of the flâneur, psychogeographic drifts, theory of the dérive, affordances and limitations of interactive narratives, parallel universes, fragmentation of time and space. We will also explore seminal pieces (site-specific and location-based art, performance pieces, walks, music videos, collaborative games, alternate reality film promotion campaigns). Class participants will respond to the readings with written questions/answers. Participants will also make presentations about assigned artifacts.<br/> <br/>Participants may choose to collaborate for their Final Project. No coding skills are needed. ?"}], "lmod": "2/12/17 6:47 PM (CT)", "subject": "RTVF"}]