[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "Kresge 3354 German Seminar Rm."}], "school": "WCAS", "overview_of_class": "Are we confronting an age of \"post-truth\"? Of \"alternate facts\"? And if so, what are the implications of this? The thinker who perhaps more than other addressed this question is Friedrich Nietzsche. Nietzsche's writings are situated at the crossroads between traditional and contemporary thinking. Many of the most radical thinkers of the 20th and 21st centuries are deeply indebted to Nietzsche's critique of traditional metaphysics, religion, ethics and aesthetics. But Nietzsche's critical impulses were not just academic or intellectual: they sought to articulate news ways of living. The problem is that Nietzsche's thought and writing, although coherent, is anything but unified. This class will seek to introduce students to the complex and contradictory critical thought of Nietzsche by focusing on the notes written by Nietzsche in the years following the publication of The Birth of Tragedy, i.e. 1872-75. In these relatively short fragments, which have been published in English under the title, \"Philosophy and Truth,\" Nietzsche reflects on the relation of language and bodily situations to traditional conceptions of truth and knowledge, perception and sensation, feeling and belief. The course will read closely the fragmentary writings collected in \"Philosophy and Truth,\" including the one completed essay, \"Truth and Lies in an Extramoral Sense.\" The readings will be in English, although reference will be occasionally made to the German original texts. No previous familiarity with Nietzsche is required. <br/>As to requirements: students will be expected to prepare a limited quantity of readings for each session: limited, because Nietzsche's writing requires re-reading and not merely a first impression (which is often undercut by subsequent reading). Also, students will be asked to make brief presentations of the texts, in order to raise whatever problems and questions strike them as important, and thereby to initiate a class discussion.", "qtr": "Spring 2017", "name": "German Contributions to World Literature", "title": "WCAS GERMAN 322-0-20 German Contributions to World Literature", "lmod": "2/26/17 6:46 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "847/491-8296", "instructor_name": "Samuel   Weber", "instructor_addr": "Kresge Hall, Room 3335"}], "topic": "Nietzsche: Language & Truth", "course": "322-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Are we confronting an age of \"post-truth\"? Of \"alternate facts\"? And if so, what are the implications of this? The thinker who perhaps more than other addressed this question is Friedrich Nietzsche. Nietzsche's writings are situated at the crossroads between traditional and contemporary thinking. Many of the most radical thinkers of the 20th and 21st centuries are deeply indebted to Nietzsche's critique of traditional metaphysics, religion, ethics and aesthetics. But Nietzsche's critical impulses were not just academic or intellectual: they sought to articulate news ways of living. The problem is that Nietzsche's thought and writing, although coherent, is anything but unified. This class will seek to introduce students to the complex and contradictory critical thought of Nietzsche by focusing on the notes written by Nietzsche in the years following the publication of The Birth of Tragedy, i.e. 1872-75. In these relatively short fragments, which have been published in English under the title, \"Philosophy and Truth,\" Nietzsche reflects on the relation of language and bodily situations to traditional conceptions of truth and knowledge, perception and sensation, feeling and belief. The course will read closely the fragmentary writings collected in \"Philosophy and Truth,\" including the one completed essay, \"Truth and Lies in an Extramoral Sense.\" The readings will be in English, although reference will be occasionally made to the German original texts. No previous familiarity with Nietzsche is required. <br/>As to requirements: students will be expected to prepare a limited quantity of readings for each session: limited, because Nietzsche's writing requires re-reading and not merely a first impression (which is often undercut by subsequent reading). Also, students will be asked to make brief presentations of the texts, in order to raise whatever problems and questions strike them as important, and thereby to initiate a class discussion."}, {"name": "Learning Objectives", "value": "Nietzsche is an especially challenging writer to read, because he often seems to contradict himself. In reading his texts, the course will seek to bring out the questions and concerns to which the often bombastic style responds but also often conceals. The ability to decode the declarative dimension of language, written and spoken, its power to fascinate and to intimidate, should help students in interpreting similar styles of expression in many areas other than this one seminar: for example in the tendency of certain political discourses to hyperbole."}, {"name": "Teaching Method", "value": "Class participation: Students will present short presentations of readings.<br/>Discussion: Part of each meeting will be devoted to class discussion.<br/>Lecture: Part of each meeting will be devoted to a short presentation.<br/>Presentations: Students will be asked to make short class presentations.<br/>Readings: Each seminar will be devoted to one or more texts.<br/>SeminarWriting assignments: One 15 page term paper will be required. No exams.<br/>"}, {"name": "Evaluation Method", "value": "Attendance: 25% of final grade<br/>Class participation: 35% of final grade (includes class presentations)<br/>Paper, final: 50% of final grade.<br/>Presentations: Students will make one or two short class presentations<br/>Readings: Texts included in ?Philosophy and Truth?<br/>"}, {"name": "Class Materials (Required)", "value": "Main texts: <br/>1. Philosophy and Truth: Selections from Nietzsche's Notebooks of the early 1870s, edited and translated by Daniel Breazeale, pp. 3-146.<br/>2. Ferdinand de Saussure, Course in General Linguistics (Wade Baskin Translation!), 65-100.<br/>Nietzsche: Thus Spoke Zarathustra; The Will to Power (Walter Kaufman, editor): Selections from these two works may be suggested for individual class meetings."}, {"name": "Class Materials (Suggested)", "value": "Nietzsche: Thus Spoke Zarathustra; The Will to Power (Walter Kaufman, editor): Selections from these two works may be suggested for individual class meetings."}, {"name": "Class Notes", "value": "German is not required, although references will be made to the German text where necessary.<br/>No prior knowledge of Nietzsche is required. <br/>The Quantity of reading will be limited: students will be expected to read and reread the readings required for each class."}], "path": "/class-descriptions/4660/WCAS/GERMAN/322-0/30875", "instructor": ["Samuel   Weber"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "30875", "subject": "GERMAN"}]