[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "University Hall 312"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Prerequisites: Students must have completed any two of the following courses: STAT 325, STAT 350, STAT 320-2, STAT 320-3, ECON 381-1, ECON 381-2, MMSS 386-1, MMSS 386-2, IEMS 303, IEMS 304; or receive permission from instructor to enroll in this course.", "qtr": "Fall 2016", "name": "16565", "title": "WCAS STAT 370-0-20 Human Rights Statistics", "class_attributes": "Formal Studies Distro Area<br/><br/>", "section": "16565", "instructors": [{"instructor_phone": "847.491.5810", "instructor_name": "Bruce David   Spencer", "instructor_addr": "2006 Sheridan Road, Room 302"}], "topic": "", "course": "370-0", "descriptions": [{"name": "Overview of class", "value": "We consider uses of statistics - as numbers and as methodology - for use in the context of Human Rights (HR). We take as HR those stipulated in existing international laws, but we may also consider HR not covered by those laws. The emphasis of the course is on the discovery and critique of statistical methods used in the HR context, including development, analysis, interpretation, use, and misuse of statistical data for description, assessment, evaluation, and political action. Some examples of HR topics include missing females, deaths of combatants and noncombatants from war, disappearances, criminal justice, violence against women, trafficking, child labor, profiling, free elections, hunger, refugees, poverty, illegal immigration, hate crimes and discrimination."}, {"name": "Registration Requirements", "value": "Permission of instructor OR completion of any 2 of the following courses: ECON 381-1, ECON 381-2, IEMS 303, IEMS 304, MMSS 386-1, MMSS 386-2, STAT 325, STAT 350, STAT 320-2, STAT 320-3. Students who have not completed at least 2 of those courses are more likely to be granted permission to register if they have human rights background from other courses or activities."}, {"name": "Learning Objectives", "value": "-Describe ways that different statistical methods are used in different areas of human rights<br/>-Interpret the analyses based on the application of the methods for human rights<br/>-Understand how statistics are misused - intentionally and unintentionally - in the human rights context<br/>-More readily tease out and critique unstated assumptions behind statistical analyses<br/>-Identify human rights issues to which statistical methods and statistical data could be applied more effectively<br/>-Identify problems that need development of new statistical methods<br/>-Begin to develop and/or improve new statistical methods for human rights work (graduate students and the exceptional undergraduate)."}, {"name": "Teaching Method", "value": "Class is run in seminar style. One person leads discussion, all students have read background material, all students discuss. Instructor leads discussions for the first part of the quarter, and students lead discussions thereafter.<br/><br/>Students are required to read the background materials for each meeting, attend all class meetings, lead 2 presentations, submit 2 drafts (preliminary and final) of a term paper on a topic approved by the instructor. Attendance does not mean just showing up, but also participation in discussions led by others. Except for the first class, each student will bring to each class meeting 1 or 2 written questions or suggestions based on the assigned readings - these questions will be posted the day before class for use by the discussion leader. Students are required to meet multiple times with instructor to: develop themes and readings for discussions they lead, choose term paper topic, and review rough draft of term paper."}, {"name": "Evaluation Method", "value": "Students will make 2 class presentations as seminar leader (@15% of grade), submit a preliminary draft (10% of grade) and a final draft (15% of grade) of a term paper. Students are also graded on their attendance and participation in seminar discussions led by others, including quality of written questions/suggestions (45% of grade). Each student automatically is excused from 2 instances of non-attendance at class, but must email instructor ahead of time when missing a class meeting. Students will have points subtracted from grade for unexcused non-attendance at classes or at required meetings with instructor."}, {"name": "Class Materials (Required)", "value": "Jana Asher, David Banks, Fritz J. Scheuren, eds. (2008) <em>Statistical Methods for Human Rights.</em> New York: Springer.<br/><br/>ISBN: 978-0387728360; <br/>Statistical Methods for Human Rights; <br/>Jana Asher, David Banks, Fritz J. Scheuren; <br/>Springer"}, {"name": "Class Notes", "value": "Attendance at first class is required."}], "lmod": "10/30/16 7:10 PM (CT)", "subject": "STAT"}]