[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "Annenberg Hall 101"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "27458", "title": "WCAS CLASSICS 110-0-1 A Study of Scientific Vocabulary Through Classical Roots", "class_attributes": "", "section": "27458", "instructors": [{"instructor_phone": "847/491-8043", "instructor_name": "Graziela Marieta Byros", "instructor_addr": "Crowe Hall 3-145"}], "topic": "", "course": "110-0", "descriptions": [{"name": "Overview of class", "value": "One aim of this course is to familiarize students with a wide range of Greek- and Latin-derived terms encountered in scientific and primarily medical fields. Students will gain familiarity with the basic components and an understanding of the underlying principles of word formation. This will include acquiring a basic vocabulary of word roots, prefixes, and suffixes, much of which is a matter of applied memorization. It will also include analysis of terms, aiming at an understanding of the relationship of their various components. Once equipped with the knowledge of how such words function, the meaning of previously unapproachable specialized vocabulary may be inferred with reasonable assurance of accuracy, when encountered in context. <br/><br/>Another aim of the course is to acquaint students with the ancient Greek and Roman roots of scientific (specifically medical) inquiry: what were the ancients' ideas and understanding of the workings of the human body and mind? How did they view health, healing and disease patterns? What was the connection between medicine and religion? How did Hippocrates, Plato, Aristotle, Galen, Soranus, or the Roman army doctors contribute to the Western medical/scientific tradition?<br/><br/>Important: This course is NOT an independent study. It has regular class meetings (twice weekly), as well as in-class tests (quizzes, midterm and final examination)."}, {"name": "Class Materials (Required)", "value": "Textbooks:<br/>1) Dunmore and Fleischer's Medical Terminology: Exercises in Etymology (3rd Edition) by Walker-Esbaugh, McCarthy, and Sparks (Publisher: F.A. Davis Company, Philadelphia).(ISBN:0803600321) Since this is a workbook, please be sure to purchase a BRAND NEW 3rd edition, since a used one will likely have chapter exercises already filled in by a previous user - this will put you at a significant disadvantage in your preparation for quizzes and exams and in learning and practicing the concepts of the course, in general.~$40-$60<br/>2) Taber's Cyclopedic Medical Dictionary (22nd edition) edited by Clayton L. Thomas (Publisher: F.A. Davis). (ISBN: 080362977X)~$30-$40"}, {"name": "Class Notes", "value": "Important: This course is NOT an independent study. It has regular class meetings (twice weekly), as well as in-class tests (quizzes, midterm and final examination)."}], "lmod": "1/9/16 6:45 PM (CT)", "subject": "CLASSICS"}]