[{"class_mtg_info": [{"meet_t": "Th 12:00PM - 2:50PM", "meet_l": "Annie May Swift Hall 110"}], "school": "SoC", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24494", "title": "SoC RTVF 360-0-26 Topics in Media Writing", "class_attributes": "Prerequisites apply, see description<br/><br/>", "section": "24494", "instructors": [{"instructor_phone": "", "instructor_name": "Michael Brandt Maher", "instructor_addr": ""}], "topic": "Writing the Short Play", "course": "360-0", "descriptions": [{"name": "Overview of class", "value": "Topics in Media Writing: Writing the Short Play<br/>RTVF 360-0 Sec. 26<br/><br/>Instructor: Mickle Maher <br/>mahermickle@gmail.com<br/><br/>This workshop will explore the underlying mechanics that have made plays tick for the last 2,500 odd years, from Euripedes to Shakespeare to Büchner, Caryl Churchill, Amiri Baraka, and Will Eno, etc. Students will be asked to shamelessly steal those playwrights' tricks and techniques (if they're found useful), and employ them in the creation of their own pieces. Designed for playwrights at any level (beginning or advanced), the workshop's primary goals will be to develop a personal sense of what &quot;works&quot; on stage within the context of what's worked in the past, and to generate one rehearsal-ready ten minute play, and one short one act play, start to finish. <br/><br/>Learning objectives: acquiring a basic understanding of playwriting techniques and terms, and developing an ear and voice for the language and structures of the stage, with a focus on the short play. <br/><br/>Evaluation method: Class participation, completion of reading assignments, 2 plays (one ten minute, one short one act). <br/><br/>Class materials: 6 books:<br/><br/>Georg Buchner - Complete Plays, Lenz and Other Writings<br/>ISBN-10: 0140445862<br/>Penguin<br/><br/>Pornography, by Simon Stephens <br/>Series: Student Editions<br/>Publisher: Bloomsbury Methuen Drama (February 27, 2014)<br/>ISBN-10: 1408179857<br/><br/>Thom Paine (based on nothing), by Will Eno<br/>ISBN: 978-0-8222-2076-3<br/>Dramatists Play Service<br/><br/>A Number, by Caryl Churchill<br/>ISBN-10: 1559362251<br/>Theatre Communications Group (May 1, 2003)<br/><br/>Dutchman and The Slave: Two Plays, by LeRoi Jones<br/>ISBN-10: 0688210848<br/>Harper Perennial<br/><br/>Plays: Maria Irene Fornes<br/>ISBN-10: 0933826834<br/>Series: PAJ Books"}], "lmod": "12/29/16 6:46 PM (CT)", "subject": "RTVF"}]