[{"class_mtg_info": [{"meet_t": "Th 3:00PM - 5:50PM", "meet_l": "Technological Institute M349"}], "school": "SoC", "enrl_requirement": "Enrollment Requirements: Reserved for Comm Studies juniors.  Majors who study abroad a full year may enroll senior year.  Comm_ST 394-0 may not be repeated.", "qtr": "Winter 2016", "name": "27611", "title": "SoC COMM_ST 394-0-20 Communication Studies Research Seminar", "class_attributes": "Juniors Only<br/><br/>", "section": "27611", "instructors": [{"instructor_phone": "", "instructor_name": "Jennifer Lindsy Baker", "instructor_addr": ""}], "topic": "Gay life &amp; Divorce, 70s-style", "course": "394-0", "descriptions": [{"name": "Overview of class", "value": "This course will examine the 1970s TV show An American Family. After shooting 300+ hours of 16mm film, this long-form documentary was edited to 12 hours that were broadcast on Thursday nights at 9pm on PBS. Although the show has been called the grandfather of reality television, it was actually shot in the cinéma vérité filmmaking form. <br/><br/>An American Family is an ethnographic representation of family on television, that had never been seen before. There were over 10 million viewers fascinated by the Loud family who had 5 children. The show was also heavily criticized and became extremely controversial as it dealt with one son who was openly gay living in NYC-and a marriage that was on the rocks, in 1971. The ultimate impact of the show was that it was a groundbreaking look into the life of a regular, but not regular, family living in the United States. <br/><br/>As we examine the show, we will consider how marriage and family is reflected; how being homosexual is reflected; and whether this representation truly looks at what life was like in a family in the early 1970s. We will also look at the form of the show, and how it has become a text for looking at life and family-as well as the entertainment business in the 1970s. Furthermore, we will analyze how it might affect our outlook today on these issues. Throughout the course, we will watch the show and discuss readings about the show and related interpersonal communication topics. The final project will be a research paper that students will create and workshop throughout the quarter."}, {"name": "Class Materials (Required)", "value": "Craft of Research by Wayne C Booth 3rd edition"}], "lmod": "1/9/16 6:38 PM (CT)", "subject": "COMM_ST"}]