[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "University Hall 121"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "23925", "title": "WCAS ENGLISH 313-0-20 Studies in Fiction", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "23925", "instructors": [{"instructor_phone": "", "instructor_name": "Nicholas Pardee Valvo", "instructor_addr": ""}], "topic": "Reading for Pleasure", "course": "313-0", "descriptions": [{"name": "Overview of class", "value": "Pleasure in reading can be a fragile, almost ineffable experience. It is also plural, diverse, variant. Some stories lose all allure if we accidently discover ? spoil, in the idiom ? the plot's conclusion, while others yield further pleasure in rereading. Some sweep us into thrilling fantasy, while we approach others with a more calm and measured affect. In &quot;Reading for Pleasure,&quot; we will meditate on precisely these sensations of enjoyment that narrative can provide, their history, and what they can do for us ? and to us. The class will trace the development of modern reading ? private, silent, governed by judgments of taste and sensations of individualized enjoyment ? and introduce students to some of the ways that literary theorists and historians have understood the advent and consequences of this surprisingly recent mode of cultural consumption. We will read a wide range of fictional texts that invite us to feel distinctive varieties of pleasure, from wish fulfillment to suspense to fantasy. Fictional texts will likely include Miguel de Cervantes' Don Quixote, Jane Austen's Northanger Abbey, Agatha Christie's Who Killed Roger Ackroyd?, Françoise Sagan's Bonjour Tristesse, and J.K. Rowling's Harry Potter and the Sorceror's Stone, with which we will begin."}, {"name": "Teaching Method", "value": "Mixed discussion and lecture."}, {"name": "Evaluation Method", "value": "Written assignments."}, {"name": "Class Materials (Required)", "value": "Miguel de Cervantes' Don Quixote (excerpts); Garci Rodriguez de Montalvo, Amadis of Gaul (excerpts); Georgette Heyer, The Conqueror; Jane Austen's Northanger Abbey; Agatha Christie's Who Killed Roger Ackroyd?; Françoise Sagan's Bonjour Tristesse; Vladimir Nabokov, Pale Fire; J.K. Rowling's Harry Potter and the Sorceror's Stone."}], "lmod": "12/29/16 6:57 PM (CT)", "subject": "ENGLISH"}]