[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "Technological Institute LG62"}], "school": "WCAS", "overview_of_class": "Photons are the main messengers of information from our Universe. Astronomers collect photons from cosmic objects and analyze that light to remotely infer the physical conditions in astronomical objects, such as stars, planets, galaxies, or cosmic explosions. Understanding the physical processes that produce electromagnetic radiation and how that radiation propagates from astronomical sources to the Earth are at the very basis of astronomical research. This course aims at developing the theoretical background and tools that scientists need to interpret and model astronomical observations. Students will learn how radiation is produced by moving charges (the synchrotron, bremsstrahlung, and Compton scattering processes) as well as by atomic transitions. The students will also learn how radiation is modified by propagation through an intervening plasma and interaction with matter. Astronomical applications include radiation from stars, active galactic nuclei, cosmic explosions, planets, and more.", "qtr": "Spring 2017", "name": "Astrophysical Radiative Processes and Transport", "title": "WCAS ASTRON 410-0-1 Astrophysical Radiative Processes and Transport", "lmod": "2/22/17 6:44 PM (CT)", "section": "1", "instructors": [{"instructor_phone": "", "instructor_name": "Raffaella   Margutti", "instructor_addr": ""}], "topic": "", "course": "410-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Photons are the main messengers of information from our Universe. Astronomers collect photons from cosmic objects and analyze that light to remotely infer the physical conditions in astronomical objects, such as stars, planets, galaxies, or cosmic explosions. Understanding the physical processes that produce electromagnetic radiation and how that radiation propagates from astronomical sources to the Earth are at the very basis of astronomical research. This course aims at developing the theoretical background and tools that scientists need to interpret and model astronomical observations. Students will learn how radiation is produced by moving charges (the synchrotron, bremsstrahlung, and Compton scattering processes) as well as by atomic transitions. The students will also learn how radiation is modified by propagation through an intervening plasma and interaction with matter. Astronomical applications include radiation from stars, active galactic nuclei, cosmic explosions, planets, and more."}, {"name": "Registration Requirements", "value": "Grad student. Undergraduates can register after getting into contact with the instructor."}, {"name": "Learning Objectives", "value": "1) Understand how radiation propagates in space and interact with matter. Familiarize with the basic concepts of intensity, flux, and opacity. Solve the equation of radiative transfer. <br/>2) Understand the physical properties and the generation of the main emission processes that make our Universe &quot;shine&quot; in different ways at different wavelengths, including black-body emission, bremsstrahlung, synchrotron, Compton and Inverse Compton scattering processes.<br/>3) Understand how radiation produced in astronomical systems is modified by propagation through an intervening plasma or matter, through absorption and re-emission processes. <br/>4) Understand the emission and absorption of radiation by atoms and molecules, and line formation mechanisms, that are of fundamental importance to interpret Astronomical data sets. <br/>5) Become proficient at interpreting and modeling astronomical observations of electromagnetic radiation (e.g. recognizing the physical processes giving rise to different spectral features, derive physical properties of the emitting regions based on real Astronomical data sets from radio to the X-ray band)."}, {"name": "Teaching Method", "value": "Lecture"}, {"name": "Evaluation Method", "value": "Two class exams (mid-term and final)."}, {"name": "Class Materials (Required)", "value": "Text book (primary): Radiative Processes in Astrophysics (by Rybicki and Lightman) ISBN 0-471-82759-2<br/><br/>Text book (secondary): Astrophysics Of Gaseous Nebulae And Active Galactic Nuclei (by Osterbrock and Ferland) ISBN-13: 978-1891389344 ISBN-10: 1891389343"}], "path": "/class-descriptions/4660/WCAS/ASTRON/410-0/37188", "instructor": ["Raffaella   Margutti"], "class_attributes": "", "id": "37188", "subject": "ASTRON"}]