[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "University Hall 118"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "24969", "title": "WCAS HISTORY 392-0-32 Topics In History", "class_attributes": "", "section": "24969", "instructors": [{"instructor_phone": "847/467-2670", "instructor_name": "Daniel A Stolz", "instructor_addr": "Harris Hall 235"}], "topic": "Creationism: A Global History", "course": "392-0", "descriptions": [{"name": "Overview of class", "value": "The battle between advocates of Darwinian evolution and &quot;creationists&quot; has helped define the way we think about the relationship between science, religion, public policy, and the law. For many of us, however, when we think of such controversies, we think of a single religion?Protestant Christianity?in specific places, most famously the Tennessee courtroom immortalized in Inherit the Wind. Yet, creationism has a global history that reaches far beyond the American &quot;Bible Belt.&quot; This history links teachers, politicians, religious activists, and scientists in the United States with counterparts across the world, and especially in the Middle East?another place where the public role of religion has been a topic of great controversy since the 19th century. This course will explore the global history of creationism as a way of understanding how science and religion have come to be in conflict in specific times and places rather than others, and how modern forms of politics and education have shaped, and been shaped by, these controversies."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Research paper"}, {"name": "Class Materials (Required)", "value": "Marwa Elshakry, Reading Darwin in Arabic (Chicago: University of Chicago Press, 2013) ISBN 9780226378732<br/><br/><br/>Edward Larson, The Creation-Evolution Debate (Athen, Georgia: University of Georgia Press, 2007) ISBN 978-0820331065<br/><br/><br/>Ronald Numbers, The Creationists (Cambridge, Mass.: Harvard University Press, 2006) ISBN 978-0674023390"}, {"name": "Class Notes", "value": "HISTORY AREA OF CONCENTRATION: Asia/Middle East, Americas"}], "lmod": "1/9/16 6:48 PM (CT)", "subject": "HISTORY"}]