[{"school": "SoC", "overview_of_class": "This course is designed to take ambitious student film works-in-progress beyond the assembly or first/second rough-cut stage to a finished cut that has been shaped by rigorous re-evaluation. Directors or editors MUST submit the current cut of their film via a password protected private link (e.g. Vimeo or YouTube) to the instructor via email BEFORE the first week of classes. This can either be an assembly or rough cut of any length and any genre (e.g. narrative, documentary, experimental, et al). Classes will include: feedback sessions, test-screenings, editing labs and allowing sections of your work to be re-edited by classmates in order to open the work up to further possibilities. Through readings and screenings, we will survey current festival programming to better familiarize yourself with the curatorial landscape. Additionally, you will acquire advanced finishing techniques, including color correction, sound-mixing and effects application within AVID. Students will be graded on re-cuts, class attendance/participation, and accomplishing final picture-lock.", "name": "Topics in Post-Production", "section": "20", "topic": "Finishing", "course": "378-0", "meeting_time": ["TuTh 1:00PM - 2:50PM"], "path": "/class-descriptions/4620/SoC/RTVF/378-0/31755", "instructor": ["Kyle Richard Henry"], "id": "31755", "subject": "RTVF"}, {"school": "SoC", "overview_of_class": "This course is designed to take ambitious student film works-in-progress beyond the assembly or first/second rough-cut stage to a finished cut that has been shaped by rigorous re-evaluation. Directors or editors MUST submit the current cut of their film via a password protected private link (e.g. Vimeo or YouTube) to the instructor via email BEFORE the first week of classes. This can either be an assembly or rough cut of any length and any genre (e.g. narrative, documentary, experimental, et al). Classes will include: feedback sessions, test-screenings, editing labs and allowing sections of your work to be re-edited by classmates in order to open the work up to further possibilities. Through readings and screenings, we will survey current festival programming to better familiarize yourself with the curatorial landscape. Additionally, you will acquire advanced finishing techniques, including color correction, sound-mixing and effects application within AVID. Students will be graded on re-cuts, class attendance/participation, and accomplishing final picture-lock.", "name": "Topics in Post-Production", "section": "21", "topic": "Color Correction", "course": "378-0", "meeting_time": ["Tu 3:00PM - 5:50PM"], "path": "/class-descriptions/4620/SoC/RTVF/378-0/31756", "instructor": ["Jeff Clayton Brown"], "id": "31756", "subject": "RTVF"}, {"school": "SoC", "overview_of_class": "How do you get your film seen, and build a community of engaged and passionate fans that will not only<br/>share your film with others, but help sustain your career as an emerging filmmaker and/or make an impact<br/>on society? In the digital age, audiencebuilding<br/>increasingly is the responsibility of the filmmaker.<br/>Unprecedented numbers of films apply for festivals, pitch distributors and broadcasters, and employ an<br/>evergrowing<br/>range of platforms and tools to directly reach an audience. The distribution possibilities are<br/>endless and traditional barriers to entry loosened, yet making a lowbudget<br/>documentary stand out amid<br/>this surplus of content and deficit of attention requires organized planning, persistence, and inspiration.<br/>In this course, MFA in Documentary Media students will develop a marketing and distribution strategy<br/>for their thesis project. We will discuss the timeline and windows of a professional, traditional distribution<br/>documentary release and awards campaign, and compare them to ?DIY' and grassroots techniques. We<br/>will cover identifying your goals, core audience and key gatekeepers? communitybuilding?<br/>pitching and<br/>presales?<br/>festival strategy? approaching and negotiating with sales agents, broadcasters, and distributors?<br/>building press kits and pitching your film to the press? designing a website and newsletters, and using<br/>social media and crowdfunding? and evaluating social impact and visibility alongside financial return.", "name": "Topics in Post-Production", "section": "22", "topic": "Documentary Marketing and Distribution", "course": "378-0", "meeting_time": ["Tu 6:00PM - 8:50PM"], "path": "/class-descriptions/4620/SoC/RTVF/378-0/34294", "instructor": ["Tim D Horsburgh"], "id": "34294", "subject": "RTVF"}]