[{"school": "WCAS", "overview_of_class": "Illusion, theatricality and role-playing often take center stage in Shakespearean plays. In this course, we will investigate ways that Shakespeare uses these themes to explore critical social issues in the Renaissance - the nature of monarchy, good government, gender roles, race, and the supernatural. How is performance associated with supposedly &quot;unruly&quot; elements in the culture (tavern crowds, racial others, upstart women) but also with the actions of monarchs and good rulers? What dangers and pleasures did &quot;playing&quot; offer Renaissance audiences? We will also consider ways that Shakespeare's works speak to contemporary issues as they travelled into new time periods and cultures, including our own Chicago, which is hosting 850 events for the 400th anniversary of Shakespeare's death. We will read five plays in the context of historical materials, criticism, and modern films; and we will attend one local performance.", "name": "Special Topics in Shakespeare", "section": "20", "topic": "Performing Identity and Culture in Shakespeare", "course": "339-0", "meeting_time": ["MoWe 9:30AM - 10:50AM"], "path": "/class-descriptions/4640/WCAS/ENGLISH/339-0/11973", "instructor": ["Wendy L Wall"], "id": "11973", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "2016 marks the 400th anniversary of Shakespeare's death. As the massive festivals in his honor occurring around the world all year long would attest, &quot;The Bard&quot; may be lone gone but is hardly forgotten. What makes Shakespeare's work so appealing to modern audiences? How has it been adapted to fit today's globalized and ever-changing world? This course aims to answer these questions by examining Shakespeare in a modern context. From an updated film version of The Tempest that imagines Prospero as an overbearing mother (Helen Mirren), to West Side Story's race-conscious adaptation of Romeo and Juliet, to Key &amp; Peele's satirical take on Othello, we will explore how modern readers, writers, theater directors, film-makers, and other &quot;Bardolotors&quot; make Shakespeare's work relevant for present-day audiences. Throughout the course we will consider the reception (and ongoing revision) of Shakespeare's legacy; Shakespearean productions in a global context; translation and adaptation; and Shakespeare in modern media (including film, social media, and TV). Students will have the opportunity to attend a live performance, and to stage an in-class performance of their own.", "name": "Special Topics in Shakespeare", "section": "21", "topic": "20th-21st Century Shakespeare", "course": "339-0", "meeting_time": ["MoWe 11:00AM - 12:20PM"], "path": "/class-descriptions/4640/WCAS/ENGLISH/339-0/11974", "instructor": ["Rebecca Lynn Fall"], "id": "11974", "subject": "ENGLISH"}]