[{"class_mtg_info": [{"meet_t": "Tu 2:00PM - 4:50PM", "meet_l": "Allison Residential Comm 1021"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Winter 2016", "name": "23200", "title": "WCAS COMP_LIT 486-0-20 Studies in Literature &amp; the Disciplines", "class_attributes": "", "section": "23200", "instructors": [{"instructor_phone": "", "instructor_name": "Brian T Edwards", "instructor_addr": "1897 Sheridan Rd #215"}], "topic": "", "course": "486-0", "descriptions": [{"name": "Overview of class", "value": "This course brings together two sets of critical debates that have responded to the so-called transnational turn: the vibrant discussion in US literary studies about the appropriate frame of reference for thinking beyond the nation when reading critical literary marked &quot;American.&quot; And in comparative literature, postcolonial, and diaspora studies that have responded to what is called the transnational turn. Thus key terms such as the hemisphere, the planet, the oceanic, the transnational, the global, are investigated both for the debate within the field and, more importantly, how it might orient students' own critical projects in US and transnational literary studies. Subtopics include reading in the digital age and the impact of new methods of digitally driven research paradigms, distant reading, etc. Selected 20th/21st century literary texts from US, North Africa and the Middle East, will be incorporated and read through competing paradigms. Primary texts may include Henry James, Claude McKay, Jane Bowles, Thomas Pynchon, Naguib Mahfouz, Abdellah Taia."}, {"name": "Evaluation Method", "value": "Students will meet once per week for a seminar and will be asked to make oral presentations. A paper of at least twenty pages is required at the end of the quarter. In this paper, students will be asked to integrated the insights they have acquired in the course of the quarter to their own scholarly enquiries."}], "lmod": "1/9/16 6:46 PM (CT)", "subject": "COMP_LIT"}]