[{"class_mtg_info": [{"meet_t": "Tu 6:15PM - 9:15PM", "meet_l": "Wieboldt Hall 402"}], "school": "SCS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "27831", "title": "SCS RTVF 260-CN-14 Foundations of Screenwriting", "class_attributes": "", "section": "27831", "instructors": [{"instructor_phone": "", "instructor_name": "Anthony Ross Werner", "instructor_addr": ""}], "topic": "", "course": "260-CN", "descriptions": [{"name": "Overview of class", "value": "This course is an introduction to the writing and revising of screenplays. We will discover how core concepts of character, structure, plot, theme and tone interact within existing and emerging media and explore how to utilize these concepts to express personal vision. The course will focus primarily on building the beginning writer's toolkit. We will begin this course with an examination of cinematic story structure, discussing idea generation and visual storytelling; characterization and relationships; form and genre; and conflict, obstacles, and stakes. Following that, we will study the finer tools of beginnings and endings; transitions; scenic design and choice; and dialogue. There will be in-class viewings of select scenes from classic and contemporary films, followed by discussion. In addition to brief writing assignments, students will craft a logline, an outline, and the script for the first act of a feature-length film."}, {"name": "Registration Requirements", "value": "None."}, {"name": "Learning Objectives", "value": "The student is expected to leave the course with a working knowledge of cinematic storytelling and style."}, {"name": "Teaching Method", "value": "Class participation<br/>Films/videos<br/>Discussion<br/>Readings<br/>Writing assignments"}, {"name": "Evaluation Method", "value": "Students will be evaluated based on attendance, class participation, writing assignments, and a final project of a logline, step outline, and final script."}, {"name": "Class Materials (Required)", "value": "Readings will likely be based on the following list:<br/><br/>-Handouts and Canvas course site postings.<br/><br/>-Seger, Linda. Making a Good Script Great. Third Edition. New York: Silman-James Press: 2011.<br/>ISBN 1935247018 (NU bookstore)."}], "lmod": "1/9/16 6:42 PM (CT)", "subject": "RTVF"}]