[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Harris Hall L06"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24152", "title": "WCAS GNDR_ST 341-0-21 Transnational Perspectives on Gender and Sexuality", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "24152", "instructors": [{"instructor_phone": "", "instructor_name": "LaShonda Katrice Barnett", "instructor_addr": ""}], "topic": "African Women Writers", "course": "341-0", "descriptions": [{"name": "Overview of class", "value": "This course engages with the literature of African Women with respect to language, gender, the colonial legacy and the racial experience. We will study the ways in which women authors write to re-vision themes such as: history and colonialism; exile and alienation; and identities marginalized by ethnicity, gender, and in some cases religion. Attention will be paid to historical and cultural contexts, but the emphasis will be on the analysis of literary texts by writers repre-senting Ghana, Nigeria, Senegal, South Africa, Morocco and Egypt. Our discussions will focus on issues of exile, language, translation and colonialism, using as points of entry a diverse set of texts including articles on the African literary tradition, short stories by Chimamanda Ngozi Adichie and Sindiwe Magona and novels (set in the twentieth century) by: Ama Ata Aidoo, Buchi Emecheta, Nawol Al Saadawi, Mariama Bâ and Fatima Mernissi. In our exploration of African womens' literary traditions we seek to answer: in what ways these writers speak to each other (even across genre)? Where do literary representations engage with or counter the society around them? What is the influence of other black creative expression (i.e. music, visual art, dance) on the development of the tradition? Assignments include in-class presentations; two thought pieces; one literary book review and a comparative literary analysis."}], "lmod": "12/25/16 7:00 PM (CT)", "subject": "GNDR_ST"}]