[{"class_mtg_info": [{"meet_t": "Tu 3:00PM - 5:50PM", "meet_l": "Harris Hall L04"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Spring 2016", "name": "31235", "title": "WCAS INTL_ST 390-0-25 Special Topics in International Studies", "class_attributes": "", "section": "31235", "instructors": [{"instructor_phone": "", "instructor_name": "Timothy Keeler Stanton", "instructor_addr": ""}], "topic": "Research in Intl Development", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "The seminar is designed for students intending to engage in community-based research with international NGO partners. These research projects should be substantive community development investigations that students undertake in collaboration with international NGOs or government agencies, or other community-based organizations or groups. The projects should be designed to respond effectively to community development information needs of the NGO partners, to build new knowledge and skills for students, and ultimately to contribute to improved life for residents served by these NGOs. The seminar will introduce students to rationales, approaches, methods and controversies related to partnership-based, community research and to their community-based research partners. It will introduce students to principles and effective practice in effective collaboration with Community research partners and data sources. It will enable students to prepare for, plan, and launch their projects in collaboration with these partners. While open to all students, the seminar should be taken by all students intending to undertake research over the summer as Buffet Center research fellows."}, {"name": "Learning Objectives", "value": "Understand and practice theories and strategies of community-based partnership research<br/><br/>Complete the planning, implementation and evaluation of a substantive, collaborative community-based research project with an established NGO research partner<br/><br/>Learn and apply principles of community health and development theory and collaborative community partnership in their project planning and development."}, {"name": "Teaching Method", "value": "? Student presentations of course related theoretical material, assigned readings, etc.<br/>? Facilitated seminar discussion of assigned readings and course issues - theoretical and practical<br/>? Project-based learning through research proposal development."}, {"name": "Evaluation Method", "value": "? Assigned writing assignments<br/>? Marking of students' in-class participation and oral presentations<br/>? Final reflective essay and approved research proposal"}], "lmod": "4/3/16 8:09 PM (CT)", "subject": "INTL_ST"}]