[{"class_mtg_info": [{"meet_t": "Fr 9:00AM - 11:50AM", "meet_l": "Scott Hall 212"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: REASON: Pre-registration is not allowed for this class. Please try again during regular registration.", "qtr": "Spring 2017", "name": "35455", "title": "WCAS POLI_SCI 490-0-20 Special Topics in Political Science", "class_attributes": "", "section": "35455", "instructors": [{"instructor_phone": "847/491-2626", "instructor_name": "James L Mahoney", "instructor_addr": "Scott Hall, Room 402, Evanston Campus"}], "topic": "Methods on Comparative Analysis", "course": "490-0", "descriptions": [{"name": "Overview of class", "value": "Prof. Mahoney's 490 Spring 2015 &quot;Methods of Comparative Analysis&quot;<br/><br/>This seminar offers a broad introduction to the field of comparative methodology. The emphasis is on what are conventionally regarded in political science as &quot;qualitative&quot; methods for the analysis of a relatively small number of cases. In sociology, this field is generally known as comparative-historical methodology. The course focuses on recent methodological writings, though a few classical pieces are also included. The readings are not specific to any substantive sub-field in political science or sociology. The course assumes no prior background in qualitative methodology."}, {"name": "Registration Requirements", "value": "Graduate students only Soc and Poli Sci students get first priority. Second year students get priority over first year students."}, {"name": "Learning Objectives", "value": "This seminar offers a broad and advanced introduction to the field of comparative methodology. The emphasis is on what are conventionally regarded in political science as &quot;qualitative&quot; methods for the analysis of a relatively small number of cases. In sociology, this field is generally known as comparative-historical methodology. The course focuses on recent methodological writings, though a few classical pieces are also included. The readings are not specific to any substantive subfield in political science or sociology. The course assumes no prior background in qualitative methodology, but the material is advanced."}, {"name": "Teaching Method", "value": "Graduate seminar"}, {"name": "Evaluation Method", "value": "(1) Seminar Discussion (25%): Students are expected to read the assigned chapters and articles for each seminar meeting and come prepared to discuss them.<br/><br/>(2) Concept Paper (20%): An essay of 6-10 pages in which students analyze a concept of their choice. Ideally, this concept should be a dependent variable of interest; choose carefully, because this concept may be used in subsequent assignments.<br/><br/>(3) Causal Assessment Paper (25%): An essay of 6-10 pages in which students propose a research question and discuss the qualitative methods that could be used to answer this question. Both cross-case and within-case methods should be discussed.<br/><br/>(4) Research Design Paper (30%): An essay of approximately 15 pages in which students develop a research design for carrying out a project using qualitative methods. This research design can form the basis for a project that is pursued at a later date."}, {"name": "Class Materials (Required)", "value": "See instructor for the syllabus"}], "lmod": "2/14/17 6:48 PM (CT)", "subject": "POLI_SCI"}]