[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "Parkes Hall 223"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-registration - Reserved for English students.", "qtr": "Spring 2017", "name": "33290", "title": "WCAS ENGLISH 359-0-20 Studies in Victorian Literature", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "33290", "instructors": [{"instructor_phone": "847/491-7475", "instructor_name": "Christopher   Lane", "instructor_addr": "University Hall Room 206"}], "topic": "The Brontes: Testimony, Critique &amp; Detachment", "course": "359-0", "descriptions": [{"name": "Overview of class", "value": "The Brontë sisters were a source of intense fascination to their Victorian admirers and occasional detractors. Because of their talent and premature deaths, that fascination has grown into a full-scale mythology that celebrates their genius and apparent isolation on the Yorkshire moors. Like all myths, this one contains an element of truth, but it has also hampered readers wanting a deeper understanding of their artistic strengths and intellectual perspectives. In this course, we will not ignore the mythology, but we'll try to set it aside to study how several remarkable novels and poems by Anne, Emily, and Charlotte Brontë advanced a powerful critique of Victorian society, including its almost unbridled support for industrialization, its intensive focus on domesticity and marriage (and related laws), and its judgments against single women. We will also trace the formal development of their fiction, including its debt to Romanticism, its preoccupation with narrative voice, its commitment to partial detachment, and its movement toward a distinctly &quot;modern&quot; narrative, full of intriguing philosophical riddles."}, {"name": "Teaching Method", "value": "Seminar-style discussion."}, {"name": "Evaluation Method", "value": "Canvas posts, one short analytical paper, a final essay, and in-class participation."}, {"name": "Class Materials (Required)", "value": "Anne Brontë, The Tenant of Wildfell Hall (ISBN 9780140434743); Emily Brontë, Wuthering Heights (ISBN 9780141439556); Charlotte Brontë, Jane Eyre (ISBN 9780141441146); and Villette (ISBN 9780375758508). Copies will be available at the Norris Center Bookstore; please acquire new or used copies of the above editions."}, {"name": "Class Notes", "value": "Post 1830"}], "lmod": "2/6/17 6:42 PM (CT)", "subject": "ENGLISH"}]