[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "Harris Hall L06"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "17667", "title": "WCAS ASIAN_LC 290-0-24 Introductory Topics in Asian Languages and Cultures", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "17667", "instructors": [{"instructor_phone": "", "instructor_name": "Hui   Zhang", "instructor_addr": "1880 Campus Dr. (Kresge) Office 3359"}], "topic": "Influence of Russian Lit. on Chinese Writers", "course": "290-0", "descriptions": [{"name": "Overview of class", "value": "This course focuses on the profound impact of 19th-Century Russian literature on early 20th-Century Chinese writers. It explores the ways Russian literature informed and inspired the social opinions, cultural arguments and artistic practices of major Chinese writers within the social-historical context of early 20th-Century China. Through a comparative study of texts in different genres - short story, novel, drama, etc. - we shall consider such questions as: How did Russian literature become the dominant source of influence and enlightenment for Chinese intelligentsia? What did the Chinese writers, driven by the need to practice a new literature that would serve as a &quot;cure for society&quot;, strive to find in their dialogue with the Russian writers? How did Chinese writers incorporate the themes and styles of their Russian predecessors into a different cultural tradition? These questions will allow us to fully understand the history and mechanism of this dialogue across cultures and centuries, and see how literature plays its pivotal role in the life of two nations."}, {"name": "Registration Requirements", "value": "Students are not expected to have any prior knowledge of Chinese or Russian language, though they will learn the basics of Chinese and Russian proper names to facilitate their reading. All lectures, discussions, readings and written assignments will be in English."}, {"name": "Learning Objectives", "value": "Students will improve their understanding of cross-cultural communication and ability of comparative analysis through reading and discussion of literary texts within different cultural and social-historical contexts. They will also be introduced to the works of major figures in Chinese and Russian literature such as Lu Xun, Ba Jin, Gogol, Turgenev, etc."}, {"name": "Teaching Method", "value": "Lecture and Discussion"}, {"name": "Evaluation Method", "value": "Attendance and Participation: 20%<br/>Short Close Reading Assignment (1 pg): 10%<br/>Comparative Reading Assignment (4-6 pgs): 30%<br/>Final Paper (9-10 pgs): 40%"}, {"name": "Class Materials (Required)", "value": "The following materials will be available in campus bookstore:<br/><br/>Mau-sang Ng. The Russian Hero in Modern Chinese Fiction. Albany: SUNY Press, 1989.<br/>Chin Pa, translated by Olga Lang. Family. Long Grove: Waveland Press, Inc., 1972.<br/><br/>Other readings will be available on reserve and/or on Canvas."}], "lmod": "10/30/16 6:58 PM (CT)", "subject": "ASIAN_LC"}]