[{"school": "WCAS", "overview_of_class": "This course will introduce students to a variety of ways in which queer and feminist scholarship has theorized public feelings. Coming from critical analyses of gender, sexuality, and race, this work asks us to think about how emotions are not only individual and internal, but also political and collective. We will be putting this scholarship in conversation with another type of text that explores the dynamics of political life - science fiction. Spanning from the mid 20th to the early 21st century, our science fiction texts will include novels, short stories, films, and television selections. In engaging with these texts, students will practice reading fiction and critical theory in mutually informative conversation. How can scholarship that theorizes the politics of feeling help us think about the worlds conjured by imaginative texts? How do speculative fictional texts do their own form of theorizing about the relationships between social conditions and emotions? How are all of our course materials operating as responses to specific historical and political circumstances and themselves engaging in modes of public feeling? As we address these questions over the course of the quarter, we will also continue to reflect on the stakes of our critical conversations for our own contemporary moment and the variety of invocations of emotion currently circulating in US political rhetoric and debate. <br/><br/>The authors covered in the course may include Isaac Asimov, James Tiptree Jr., Samuel Delany, and Octavia Butler. Media texts may include Alien (1979), Children of Men (2006), Advantageous (2015), and selections from Battlestar Galactica (2004).", "name": "Gender, Sexuality, and Literature", "section": "20", "topic": "Science Fiction and Public Feelings", "course": "361-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4650/WCAS/GNDR_ST/361-0/24156", "instructor": ["Erin Leigh Andrews"], "id": "24156", "subject": "GNDR_ST"}, {"school": "WCAS", "overview_of_class": "Writing in 1855, novelist Nathaniel Hawthorne complained that his own literary work was being overshadowed by \"a damned mob of scribbling women.\" Some female authors in the nineteenth century indeed produced unprecedented runaway bestsellers; most notably, Harriet Beecher Stowe's Uncle Tom's Cabin became the best-selling novel of the century. However, the act of writing remained a vexed vocation for women in this period. On the one hand, women writers were able to capitalize on the stereotype of feminine virtue to voice strident critiques of the status quo. On the other hand, women's writing was often treated as a niche market assumed to be read exclusively by other women. In this class, we will examine how women writers depict the act of writing and, by extension, the role of women in intervening in public and political discourse. Crucially, we will also examine differences among this cohort of writers, including the racial and class differences that produced divergent visions for the role of women in the public sphere.", "name": "Gender, Sexuality, and Literature", "section": "21", "topic": "19th Century American Women Writers", "course": "361-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4650/WCAS/GNDR_ST/361-0/27517", "instructor": ["Hosanna Grace Krienke"], "id": "27517", "subject": "GNDR_ST"}]