[{"class_mtg_info": [{"meet_t": "Mo 5:30PM - 8:30PM", "meet_l": "Frances Searle Building 3220"}], "school": "SoC", "enrl_requirement": "Enrollment Requirements: Prerequisite: CSD 406", "qtr": "Spring 2017", "name": "32891", "title": "SoC CSD 496-0-20 Approaches to Cognitive Treatment", "class_attributes": "", "section": "32891", "instructors": [{"instructor_phone": "", "instructor_name": "Martha S Burns", "instructor_addr": "2240 Campus Drive"}], "topic": "", "course": "496-0", "descriptions": [{"name": "Overview of class", "value": "COURSE DESCRIPTION: The purpose of this course is to provide an overview of acquired disorders of cognition and approaches to their clinical management."}, {"name": "Registration Requirements", "value": "PREREQUISITES: Neuroanatomy; Language Science 1, 2"}, {"name": "Class Materials (Required)", "value": "REQUIRED READINGS: (WILL BE SENT AS E-ATTACHMENT 1 WEEK BEFORE RELEVANT LECTURE) <br/>Brookshire, R. H. (2007). Traumatic brain injury. In Introduction to neurogenic communication disorders (pp. 445-530). St. Louis: Molsby Elsevier.<br/>Bavelier, D., et al. (2011) Brains on video games. Nature Reviews Neuroscience, 12,763-768.<br/>Bayles, K. A. (2001). Understanding the neuropsychological syndrome of dementia. Seminars in Speech and Language, 19, 261-259.<br/>Cappa, S.F. et al. (2011) Cognitive Rehabilitation. European Handbook of Neurological Management, 2nd Edition. Edited by N.E. Gilbus, M.P. Barnes, M. Brainin, 545-567.<br/>Cicerone, K.D., Langenbahn, D.M., Braden, C., Malec, J.F., Kalmar, K., Fraas, M., Felicetti, T., Laatsch, L., Harley, F.P., Berquist, T., Azrulay J., Cantor, J,.&amp; Ashman, T. (2011) Evidence-based cognitive rehabilitation updated review of the literature from 2003 through 2008. Archives of Physical Medicine and Rehabilitation, 9, 519-530.<br/>Craig CD, Monk BJ, Farley J, Chase DM (2013) Cognitive Impairment in Gynecologic Cancers: A Systematic Review of Current Approaches to Diagnosis and Treatment. J Palliative Care Med 3: 144 Gehring, Karin, Roukema, Jan Anne, &amp; Sitskoorn, Margriet M. Review of recent studies on interventions for cognitive deficits in patients with cancer. Expert Reviews (2012); 12(2): 255-269.<br/>Ehlhardt, L., Sohlberg, M.M. et al. (2008). Evidence-based Practice Guidelines for Instructing Individuals with Acquired Memory Impairments: What Have We Learned in the Past 20 Years? Neuropsychological Rehabilitation, 18 (3), 300-342 Erickson KI, Voss MW, Prakash RS, et al. (2011) Exercise training increases size of hippocampus and improves memory. Proc Natl Acad Sci;108:3017-3022 Kilgore, W., Olson, E., &amp; Weber, M. (2013) Physical Exercise Habits Correlate with Gray Matter Volume of the Hippocampus in Healthy Adult Humans. Scientific Reports. Published Online December 12, 2013. <br/>Klingberg, T. (2010) Training and Plasticity of Working Memory. Trends in Cognitive Sciences 14:7, 317-324 Kim, Y-H et al. (2009) Plasticity of the Attentional Network after Brain Injury and Cognitive Rehabilitation. Neurorehabilitation and Neural Repair (23) 468-477 Kurz, A., Pohl, C., Ramsenthaler, M., Sorg, C. (2009). Cognitive rehabilitation in patients with mild cognitive impairment. International Journal of Geriatric Psychiatry, 24, 163-168.<br/>Mahncke, H. W., Connor, B. B., Appleman, J., Ahsanuddin, O. N., Hardy, J. L., Wood, R. A., Joyce, N. M., Boniske, T., Atkins, S. M., Merzenich, M. M. (2006). Memory enhancement in healthy older adults using a brain plasticity-based training program: A randomized, controlled study. Proceedings of the National Academy of Sciences, 33, 12523-12528.<br/>Miller, G. (2011) A battle no soldier wants to fight. Science, 333, 517-519 Chun, M., Johnson, M.K. (2011) Memory: Enduring traces of perceptual and reflective attention. Neuron,72,520-535, Rebok, et al. (2014) Ten-Year Effects of the Advanced Cognitive Training for Independent and Vital Elderly Cognitive Training Trial on Cognition and Everyday Functioning in Older Adults. Journal of the American Geriatrics Society 62:1, 16-24 Tononi, G., &amp; Cirelli, C. (2014) Sleep and the Price of Plasticiy: From Synaptic and Cellular Homeostasis to Memory Consolidation and Integration Westerberg, H. et al., (2007) Computerized working memory training after stroke-A pilot study. Brain Injury 21, No. 1, Pages 21-29 Winocur, G. &amp; Moscovitch, M. (2011) Memory transformation and systems consolidation. Jour. Intl. Neuropsyol. Soc., 17: 766-780 Miller, G. (2011) A battle no soldier wants to fight. Science, 333, 517-519 Chun, M., Johnson, M.K. (2011) Memory: Enduring traces of perceptual and reflective attention. Neuron,72,520-535, Zlokovic, B. (2011) Neurovascular pathways to neurodegeneration in Alzheimer's disease and other disorders. Nature Reviews Neuroscience, 12, 723-738.<br/>Haskins, Edmund C. et.al., (2012) Cognitive Rehabilitation Manual: Translating Evidence-Based Recommendations into Practice. Reston, Virginia: American Congress of Rehabilitation Medicine."}], "lmod": "2/6/17 6:37 PM (CT)", "subject": "CSD"}]