[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "Parkes Hall 222"}], "school": "WCAS", "overview_of_class": "This upper-division course investigates U.S. government surveillance of black internationalist feminists during the twentieth century.  Examining the controversial incarceration of Angela Davis and Assata Shakur, legendary figures in the Black Panther Party and Black Liberation Army, and historicizing the deportation of Claudia Jones, pioneering Trinidadian radical intellectual, the course situates black internationalist feminist work within a racial history of criminalization.  We will survey an immersive digital archive of FBI surveillance records, paying attention to how Davis, Jones, and Shakur are scripted as \"dissidents\" in COINTELPRO reports.  Students will be equipped to analyze black internationalist feminists' critical approach to human rights, specifically their attentiveness to cross-national issues of labor exploitation, imperialism, racialized gender, and black liberation across the African diaspora.  Overall, this course asks: What constitutes black internationalist feminist work? To what extent is the global and local imbricated in black internationalists' political positions, geographical locations, and diasporic identities? What is the relationship between the construction of black women \"criminals\" in state surveillance practices and the mobilization of race in colonial practices of governance? How might recovery of the radical black female subject advance intersectional analysis of a Black Radical Tradition?", "qtr": "Winter 2016", "name": "Topics in Transnational Black Studies", "title": "WCAS AF_AM_ST 381-0-20 Topics in Transnational Black Studies", "lmod": "1/9/16 6:42 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Assata Sankofa Kokayi", "instructor_addr": ""}], "topic": "Black Internationalist Feminists and Government Su", "course": "381-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "This upper-division course investigates U.S. government surveillance of black internationalist feminists during the twentieth century. Examining the controversial incarceration of Angela Davis and Assata Shakur, legendary figures in the Black Panther Party and Black Liberation Army, and historicizing the deportation of Claudia Jones, pioneering Trinidadian radical intellectual, the course situates black internationalist feminist work within a racial history of criminalization. We will survey an immersive digital archive of FBI surveillance records, paying attention to how Davis, Jones, and Shakur are scripted as &quot;dissidents&quot; in COINTELPRO reports. Students will be equipped to analyze black internationalist feminists' critical approach to human rights, specifically their attentiveness to cross-national issues of labor exploitation, imperialism, racialized gender, and black liberation across the African diaspora. Overall, this course asks: What constitutes black internationalist feminist work? To what extent is the global and local imbricated in black internationalists' political positions, geographical locations, and diasporic identities? What is the relationship between the construction of black women &quot;criminals&quot; in state surveillance practices and the mobilization of race in colonial practices of governance? How might recovery of the radical black female subject advance intersectional analysis of a Black Radical Tradition?"}, {"name": "Teaching Method", "value": "Lecture / Discussion"}, {"name": "Evaluation Method", "value": "Class participation, short writing assignments, student presentations, final essay"}, {"name": "Class Materials (Required)", "value": "Tentative until order posted to Norris website: <br/> <br/>Lorraine Hansberry, Les Blancs: The Collected Last Plays (New York: Vintage Books, 1994)<br/><br/>Assata Shakur, Assata: An Autobiography (UK: Zed Books Ltd., 2001)<br/> <br/>Carole Boyce Davies, Left of Karl Marx: The Political Life of Black Communist Claudia Jones (Durham: Duke University Press, 2008)<br/>Cheryl Higashida, Black Internationalist Feminism: Women Writers of the Black Left, 1945-1995 (Chicago: University of Illinois Press, 2011)<br/><br/>Angela Davis, Angela Davis: An Autobiography (New York: International Publishers, 2013)"}, {"name": "Class Materials (Suggested)", "value": "*Supplemental readings will be made available through Canvas*"}], "path": "/class-descriptions/4610/WCAS/AF_AM_ST/381-0/26475", "instructor": ["Assata Sankofa Kokayi"], "class_attributes": "", "id": "26475", "subject": "AF_AM_ST"}]