[{"school": "WCAS", "overview_of_class": "In this graduate seminar, we will explore how black masculinities have been framed, visualized, and constrained in American art from the 1950s to the present. To do so, we will first aim to understand and theorize the historical, social, and cultural conditions that have produced black male bodies as charged sites of violence and visualization in the U.S. public sphere. With this framework in place, we will proceed to home in on particular exhibitions, objects, and practices that help illuminate the ongoing logics that structure the appearance of black masculinity as well as the ways cultural practitioners have variously contested them. Artists considered will include David Hammons, Titus Kaphar, Kerry James Marshall, Jacolby Satterwhite, and Sun Ra. All readings will be available for free via Canvas.", "name": "Topics in Gender Studies", "section": "20", "location": "Kresge 4354 Art Hist. Sem. Rm.", "topic": "Black Masculinities in Contemporary American Art", "course": "490-0", "meeting_time": ["Mo 2:00PM - 4:50PM"], "path": "/class-descriptions/4660/WCAS/GNDR_ST/490-0/33903", "instructor": ["Huey Gene Copeland II"], "class_attributes": "", "id": "33903", "subject": "GNDR_ST"}, {"school": "WCAS", "overview_of_class": "This is an interdisciplinary course, drawing on literatures grounded in contemporary French philosophy ? the mid- period work of Michel Foucault ? and its ongoing impact on race, gender and sexuality studies. It considers the contemporary legacy of Michel Foucault in these domains with a focus on figures including Achille Mbembe, Jasbir Puar, Wendy Brown, Judith Butler, Ann Stoler, Lauren Berlant, Sharon Holland, and Alex Weheliye Participants will spend about the first section of the course reviewing Foucault's College de France lectures from 1973- 1979. We will track their impact on the development within post-Foucauldian biopolitics of the concepts of necropolitics, thanatopolitics, and reproductive biopolitics, giving attention on the one hand, to the role within these fields of critiques of Foucault by Esposito and Agamben, and new understandings of the reproductive biopoliticization of both gender and race . In light of the increasing focus in the field of post-Foucauldian theory of necropolitics and thanatopolitics, the courses ends with a focus on a number of new directions after Foucauldian biopolitics: such as vitalism, utopianism, futurism, the reconfiguration of life, or alternatively, the \"anti-social thesis.\"", "name": "Topics in Gender Studies", "section": "21", "location": "Kresge 3438 Philosophy Sem. Rm", "topic": "Biopolitics After Foucault", "course": "490-0", "meeting_time": ["Tu 6:00PM - 8:50PM"], "path": "/class-descriptions/4660/WCAS/GNDR_ST/490-0/33904", "instructor": ["Penelope L Deutscher"], "class_attributes": "", "id": "33904", "subject": "GNDR_ST"}, {"school": "WCAS", "overview_of_class": "This seminar examines the contributions of historical inquiry to gender analysis and queer critical practices. Readings will provide a broad survey of the fractious impact of post-structuralist theories since the 1980s and 90s on the urgent vindicationalist scholarship emanating from the women's and gay liberation movements of the 1960s and 70s. Through key monographs and articles, students will examine how historians have negotiated this turn by first understanding how historical research has deepened explanations of oppression and repression. Secondly, by highlighting the centrality of differences to historical investigation, we see the crucial role of historical methods in de-stabilizing received binaries and in creating critical distance from normative assumptions. Finally, this course traces how the political commitments of scholars have transformed the interpretative, and narrative practices of the academic discipline. In addition to explicating how feminist and queer stances altered historical reasoning, we also explore how building new archives have transformed collective understandings of the past.", "name": "Topics in Gender Studies", "section": "22", "location": "Kresge Centennial Hall 2-319", "topic": "Historical Methods in Gender and Sexuality Studies", "course": "490-0", "meeting_time": ["Th 2:00PM - 4:50PM"], "path": "/class-descriptions/4660/WCAS/GNDR_ST/490-0/33905", "instructor": ["Tessie P Liu"], "class_attributes": "", "id": "33905", "subject": "GNDR_ST"}, {"school": "WCAS", "overview_of_class": "This is an interdisciplinary course, drawing on literatures grounded in contemporary French philosophy ? the mid- period work of Michel Foucault ? and its ongoing impact on race, gender and sexuality studies. It considers the contemporary legacy of Michel Foucault in these domains with a focus on figures including Achille Mbembe, Jasbir Puar, Wendy Brown, Judith Butler, Ann Stoler, Lauren Berlant, Sharon Holland, and Alex Weheliye Participants will spend about the first section of the course reviewing Foucault's College de France lectures from 1973- 1979. We will track their impact on the development within post-Foucauldian biopolitics of the concepts of necropolitics, thanatopolitics, and reproductive biopolitics, giving attention on the one hand, to the role within these fields of critiques of Foucault by Esposito and Agamben, and new understandings of the reproductive biopoliticization of both gender and race . In light of the increasing focus in the field of post-Foucauldian theory of necropolitics and thanatopolitics, the courses ends with a focus on a number of new directions after Foucauldian biopolitics: such as vitalism, utopianism, futurism, the reconfiguration of life, or alternatively, the \"anti-social thesis.\"", "name": "Topics in Gender Studies", "section": "23", "location": "Parkes Hall 222", "topic": "Soc.Science Approach Gendr/Sex", "course": "490-0", "meeting_time": ["We 1:00PM - 3:50PM"], "path": "/class-descriptions/4660/WCAS/GNDR_ST/490-0/33906", "instructor": ["Ann Shola   Orloff"], "class_attributes": "", "id": "33906", "subject": "GNDR_ST"}, {"school": "WCAS", "overview_of_class": "Intersectionality has become central to how our field defines itself - its methods, politics, pedagogical strategies, and theoretical frameworks. At the same time, intersectionality is increasingly subject to rigorous critiques - it has been condemned as a passé identity politic, bemoaned as too demanding in its imagined call to analyze the simultaneity of complex social structures. Our collective task is to understand how, why, and when intersectionality became the metric of rigorous feminist scholarship, the key program-building intiative in our field, and a synonym of \"ethical\" feminist work. Over the course of the quarter, we will explore topics including: the institutionalization of intersectionality, the politics of inclusion, the conflation of black feminism(s) and intersectionality, Left critiques of intersectionality, diversity/intersectionality, transnationalism/intersectionality, decoloniality/intersectionality, debates about intersectionality's histories and origins, and scholarly and political attempts to expand intersectionality to capture categories including sexuality, class, and religion. Ultimately, we will spend the quarter following intersectionality around a feminist archive, seeking to understand feminist attachments, anxieties, and ambivalence around the term.", "name": "Topics in Gender Studies", "section": "24", "location": "Allison Residential Comm 1021", "topic": "Intersectionality & its Discontents", "course": "490-0", "meeting_time": ["Mo 2:00PM - 4:50PM"], "path": "/class-descriptions/4660/WCAS/GNDR_ST/490-0/33907", "instructor": ["Jennifer Christine Nash"], "class_attributes": "", "id": "33907", "subject": "GNDR_ST"}]