[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "Kresge Centennial Hall 2-435"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "22696", "title": "WCAS PERSIAN 111-2-20 Persian I", "class_attributes": "", "section": "22696", "instructors": [{"instructor_phone": "", "instructor_name": "Austin Michael O'Malley", "instructor_addr": ""}], "topic": "", "course": "111-2", "descriptions": [{"name": "Overview of class", "value": "This introductory Persian course is open to both undergraduate and graduate students, and to students with some background in Persian as well as to those entirely new to the language. The course is the second of the year-long sequence that runs for 3 consecutive quarters, Fall to Spring. The basics of Persian grammar are presented, and these are reinforced by in-class dialogs and readings. By the end of the first year, students should be able to read and write Persian script with ease and make themselves understood in most practical situations."}, {"name": "Registration Requirements", "value": "Prerequisites: Successful completion of Fall quarter elementary Persian, or permission of the instructor."}, {"name": "Teaching Method", "value": "The Persian alphabet is presented and is used throughout the course for both reading and writing. Persian is also introduced gradually as the language of instruction. Abdi Rafiee's Colloquial Persian will form the basis for the lectures on grammar and most of the exercises. L.P.Elwell-Sutton's Elementary Persian Grammar will also be used for presenting the alphabet and some further grammar points. Reading selections, workbook pages, and films on various topics are also drawn from other sources. Samples of classical Persian literature are brought in for cultural enrichment, but contemporary Persian writing (newspapers, literature) is also included. Classes will meet for 3 hours weekly."}, {"name": "Evaluation Method", "value": "Assessment of progress will be done by means of unit quizzes, homework assignments, a mid-term and a final exam."}, {"name": "Class Materials (Required)", "value": "TEXTBOOKS: <br/>Colloquial Persian, by Abdi Rafiee. Routledge (Francis and Taylor Group), London and New York, 3rd edition, 2011. <br/>Elementary Persian Grammar, by L.P.Elwell-Sutton, Cambridge University Press, 1992. <br/><br/>REFERENCES: <br/>S. Haim, The Larger Persian-English Dictionary. Farhang-e Moaser Publishing, Tehran, 1991."}], "lmod": "12/24/16 7:05 PM (CT)", "subject": "PERSIAN"}]