[{"class_mtg_info": [{"meet_t": "Tu 4:00PM - 6:50PM", "meet_l": "Harris Hall L40"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Fall 2016", "name": "12407", "title": "WCAS HISTORY 481-0-20 Western Literature of Chinese History", "class_attributes": "", "section": "12407", "instructors": [{"instructor_phone": "847/491-2753", "instructor_name": "Peter J Carroll", "instructor_addr": "Harris Hall Room 216"}], "topic": "", "course": "481-0", "descriptions": [{"name": "Overview of class", "value": "This field seminar examines classic and new scholarship on the growth of the CCP and the history of the PRC, from its founding to recent times. We will pay particular attention to the flurry of new work that reconsiders the 1950s and Cultural Revolution, as well as emerging scholarship on the post-Mao reform era, which has now irrevocably passed into &quot;history.&quot; Major themes will include modulations in the conception and structure of the Chinese state and its relationship with society, the transformation of the gender system, the growth of scientism in state and society, and China's shifting role in world affairs. Since the English-language scholarship in 20th c. China has expanded exponentially in the past decade, we will only be able to sample a few key works. Nonetheless, the seminar aims to make students aware of the wider literature."}, {"name": "Registration Requirements", "value": "AREA OF CONCENTRATION: Asia<br/>GRADING BASIS: Student option"}, {"name": "Teaching Method", "value": "Discussion"}, {"name": "Evaluation Method", "value": "EVALUATION METHOD: Book reviews, final paper"}, {"name": "Class Materials (Required)", "value": "***Tentative until order posted to Norris website<br/>Frank Dikotter, The Tragedy of Liberation. 9781620403495.Zhang Shuguang, Mao's Military Romanticism: China and the Korean War, 1950-1953. 9780700607235.<br/>Lorenz Luthi, The Sino-Soviet Split: Cold War in the Communist World (Princeton, 2008). 9780691135908.Andrew Mertha, Brothers in Arms: Chinese Aid to the Khmer Rouge, 1975-1979 (Cornell, 2014).<br/>9780801452659."}, {"name": "Class Notes", "value": "NOTES: Attendance at first class is mandatory"}], "lmod": "10/30/16 7:06 PM (CT)", "subject": "HISTORY"}]