[{"school": "WCAS", "overview_of_class": "Zombies seem to be everywhere lately: in comic books, in numerous films and television series, even in video games. The \"walking dead\" phenomenon is not just a North American fad; zombies have appeared in literature and films in countries as diverse as Cuba, Norway, and India. Despite their current popularity, zombies have actually been around for some time, although their story has changed significantly. This course will explore the history of the zombie and its insertion into pop culture. We will explore the zombie's origins as a figure of Haitian folklore, and its introduction to English-language audiences through North American involvement in the Caribbean region. We will watch some of the earliest Hollywood zombie films, which make use of the zombie's Haitian origins, and we will read some examples of early pulp fictions that include zombies. The second half of the course will look at the re-configuration of the zombie story through the films of George Romero, and the films and parodies that have followed. We will end by examining the current globalization of the zombie figure and its transnational transformations. As we trace the zombie's history in popular culture, we will explore the figure's connections to slavery, colonialism, environmentalism, and consumerism. We will ask what the zombie as metaphor explores - or exploits - in today's cultural production.", "name": "First-Year Seminar", "section": "1", "location": "University Library 4670", "topic": "Zombies: A Brief Cultural History", "course": "105-6", "meeting_time": ["TuTh 9:30AM - 10:50AM"], "path": "/class-descriptions/4610/WCAS/SPANISH/105-6/24004", "instructor": ["Emily A Maguire"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "24004", "subject": "SPANISH"}, {"school": "WCAS", "overview_of_class": "\"The World in the Camera\": Latin American Culture through Photography<br/>This seminar will explore the photographic representations of major social and historical events in Latin American from the late 19th century throughout the 20th century. We will look at how photography became a medium of visual expression in the culture of Latin America; questions of the construction of a shared Latin American identity; and how different kinds of photographs (journalistic, ethnographic, territorial survey, artistic) work as cultural interpretive tools. We will also learn how to speak and write critically about photographs, learn who major photographers were and how their images were produced and have circulated. We will put emphasis on the study of photographic themes that are singular to the Latin American experience: colonialism, revolution, native society, modernization, violence and oppression, politics and self-determination.", "name": "First-Year Seminar", "section": "2", "location": "University Library 3322", "topic": "The World in the Camera", "course": "105-6", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4610/WCAS/SPANISH/105-6/24005", "instructor": ["Maria Alejandra Uslenghi"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "24005", "subject": "SPANISH"}]