[{"class_mtg_info": [{"meet_t": "Tu 3:00PM - 6:00PM", "meet_l": "Technological Institute LG76"}], "school": "MEAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "31763", "title": "MEAS EECS 395-0-24 Special Topics in Electrical Engineering and Computer Science", "class_attributes": "", "section": "31763", "instructors": [{"instructor_phone": "", "instructor_name": "Lawrence Joseph   Henschen", "instructor_addr": ""}, {"instructor_phone": "", "instructor_name": "Chung   Lee", "instructor_addr": ""}], "topic": "Embedded Systems", "course": "395-0", "descriptions": [{"name": "Overview of class", "value": "CATALOG DESCRIPTION: Introduction to the design and evaluation of embedded systems, with emphasis on the system-level aspects of embedded systems. Topics include modeling (models of computation and models of communication), survey of embedded system hardware, software and operating system issues specific to embedded system design, mapping specifications to hardware, and testing and evaluation of embedded systems.<br/><br/> This course fulfills the Systems breadth and depth requirement."}, {"name": "Registration Requirements", "value": "PREREQUISITES: Senior or graduate standing in Computer Science or Computer Engineering."}, {"name": "Learning Objectives", "value": "COURSE OBJECTIVES: After a student completes this course he or she should be able to:<br/><br/> Model the computational and communication requirements of an embedded system and select the model(s) most appropriate for the application.<br/> Select relevant hardware for system implementation and at least design the interconnections between hardware elements.<br/> Determine schedules or select scheduling algorithms for an application.<br/> Select from alternatives based on general computing elements, ASIC circuits, and software components to implement a system.<br/> Identify criteria for evaluating a design and select designs from a list that are most likely to satisfy system requirements."}, {"name": "Evaluation Method", "value": "Exam, final: Final ? 35%<br/>Exam, mid-term: Midterm ? 35%<br/>Homework: Lab/homework ? 30%<br/>LAB/HOMEWORK:<br/><br/>Students will work in teams to design an embedded system. The steps will include modeling the computation and communication, searching for appropriate hardware and software elements, and evaluation of alternate designs."}, {"name": "Class Materials (Required)", "value": "REQUIRED TEXT: Tentative text: Embedded System Design: Embedded Systems Foundations of Cyber-Physical Systems - Second Edition, Peter Marwedel, Springer"}, {"name": "Class Notes", "value": "DETAILED COURSE TOPICS:<br/><br/>1. ES design challenges and characteristics.<br/>2. ES modeling:<br/><br/> a. Models of computation - finite-state machines, Petri nets, timing, etc.<br/> b. Models of communication - communicating FSMs, Kahn networks, SDL, etc.<br/> c. Models of discrete events - VHDL<br/><br/>3. ES hardware:<br/><br/> a. Sensors - ADC, DAC, sampling, signal reconstruction.<br/> b. Computing elements<br/> c. Memories<br/> d. Interconnection techniques - parallel, serial, bus arbitration<br/><br/>4. Operating system issues for ES:<br/><br/> a. General requirements<br/> b. Real-time operating systems<br/> c. Scheduling - static/dynamic, periodic event scheduling, ASAP, ALAP, least laxity, etc.<br/><br/>5. System synthesis.<br/>6. Evaluation:<br/><br/> a. Objectives used in ES evaluation.<br/> b. Techniques for evaluation - Pareto evaluation, etc.<br/><br/>7. System testing.<br/>8. Optimization techniques for ES"}], "lmod": "2/6/17 6:35 PM (CT)", "subject": "EECS"}]