[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Frances Searle Building 1421"}], "school": "SoC", "overview_of_class": "Exploration of the structural and functional intricacies of the upper aerodigestive tract and concepts of motor control and learning as they pertain to speech and swallowing. Anatomical structures and physiology of the speech mechanism, including oral, pharyngeal, and laryngeal structures and the respiratory system are reviewed and theories of motor control and learning are introduced. Clinical scenarios and populations provide the context for concept exploration.", "qtr": "Fall 2017", "name": "Clinical Speech Anatomy, Physiology, and Motor Control", "title": "SoC CSD 455-0-20 Clinical Speech Anatomy, Physiology, and Motor Control", "lmod": "5/14/17 6:41 PM (CT)", "section": "20", "topic": "", "course": "455-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Exploration of the structural and functional intricacies of the upper aerodigestive tract and concepts of motor control and learning as they pertain to speech and swallowing. Anatomical structures and physiology of the speech mechanism, including oral, pharyngeal, and laryngeal structures and the respiratory system are reviewed and theories of motor control and learning are introduced. Clinical scenarios and populations provide the context for concept exploration."}, {"name": "Learning Objectives", "value": "Upon successful completion of this course the student should be able to do the following:<br/><br/>1. Identify and describe anatomical structures and physiology of the speech mechanism, including oral, pharyngeal, and laryngeal structures and the respiratory system<br/>2. Describe the impact of a tracheostomy (with and without ventilator use) on speech production and swallowing and possible interventions utilized to restore function <br/>3. Describe the potential ramifications of head and neck cancers on structures and function of speech and swallowing <br/>4. Describe the impact of laryngectomy on communication and swallowing and possible interventions utilized to restore function<br/>5. Describe types of gastric reflux and the potential impact on the structures and function of voice and swallowing<br/>6. Describe the impact of various orofacial anomalies on structure and function of the speech and swallowing mechanism <br/>7. Describe various theories of motor control and learning and their application to practice <br/>8. Compare and contrast the concepts of motor skill, control, learning, and development<br/>9. Discuss the motor learning principles of practice (amount, distribution, variability), attentional focus, and target complexity as they relate to speech<br/>10. Apply motor learning principles to common treatment approaches to speech sound and motor speech disorders"}, {"name": "Class Materials (Required)", "value": "Required Texts:<br/><br/>Frucht, S. (2012). Medical Terminology: Get Connected. Upper Saddle River, NJ: Pearson. ($76.19)<br/><br/>McFarland, D. (2015). Netter's Atlas of Anatomy for Speech, Swallowing, and Hearing, Second Edition. St. Louis, MO: Elsevier. ($67.17)"}], "instructor": ["Stacy Lyn Kaplan"], "class_attributes": "", "id": "11072", "subject": "CSD"}]