[{"school": "WCAS", "overview_of_class": "This seminar explores theoretical approaches to the problems of embodiment/materiality/affect. One aim of the course is to examine various methodological approaches to embodiment, materiality and affect, making use of sociology and philosophy (Pierre Bourdieu, Maurice Merleau-Ponty, Spinoza, Massumi). The second and closely related aim is to situate bodies in time and place, that is, in history. Here we look to the particular circumstances that shaped the manner in which historical actors experienced their bodies in the Christian west (Peter Brown, Caroline Bynum, Mary Carruthers, Michel de Certeau, Michel Foucault). Ultimately, we will be examining theoretical tools while we put them to work. The goal: how to use these thinkers to write more dynamic, creative, interesting scholarship?", "name": "Studies in History of Religions", "section": "20", "topic": "Embodiment/Materiality/Affect", "course": "471-0", "meeting_time": ["Mo 11:00AM - 1:50PM"], "path": "/class-descriptions/4640/WCAS/RELIGION/471-0/14170", "instructor": ["J Michelle   Molina"], "id": "14170", "subject": "RELIGION"}, {"school": "WCAS", "overview_of_class": "All the controversies that came clearly into view in the sixteenth century were already anticipated in the last medieval centuries. And the conflicts among historical subjects can be seen mirrored in debates among modern scholars. Religion in the late medieval West has for some time been vigorously discussed and debated, across disciplinary and sometimes also denominational lines. The most widely respected scholars, such as Eamon Duffy and Caroline Walker Bynum, are not only emulated but also challenged. Theoretical issues sometimes lie at the heart of controversy. Views about the relationship between medieval and Reformation religion continue to generate conflict. More unexpected issues also arise: how precisely to conceive and define heresy; how far literacy and reading habits supported traditional commitment, or when and whether they fostered dissent; how to map the boundaries, if any, separating devotional practice from superstition and magic. Venerable clichés about late medieval religion-its emphasis on the humanity of Christ, or its neurotically penitential character-are now much disputed. We will plunge into all these conversations and controversies in an effort to see just why late medieval religion is so controversial. This seminar should be of interest to historians, religionists, art historians, and students of medieval and early modern literature.", "name": "Studies in History of Religions", "section": "21", "topic": "Late Medieval Religion", "course": "471-0", "meeting_time": ["Tu 2:00PM - 4:50PM"], "path": "/class-descriptions/4640/WCAS/RELIGION/471-0/14171", "instructor": ["Richard   Kieckhefer"], "id": "14171", "subject": "RELIGION"}, {"school": "WCAS", "overview_of_class": "This seminar examines critical themes at the intersection of religion, race, and global politics. We will explore how particular constructions of &quot;religion&quot; and &quot;race&quot; inform contemporary scholarship, and authorize national and international legal and governmental practice. These questions will be examined in a variety of contexts ranging from antisuperstition laws in Haiti, to the rise of Christian free enterprise in the aisles of Wal-Mart, to the celebration of &quot;moderate&quot; religion at the US State Department, to the politics of immigration, and beyond. Topics include religion and the rise of the nation-state; the politics of religious establishment and religious freedom; the role of race in the formation of the disciplines of religious studies and international relations; the formation of modern vocabularies of religious exclusion (e.g., &quot;superstition,&quot; &quot;vodou,&quot; &quot;folk religion&quot;); and the role of religiosity and religious affect in neoliberal experience. Our readings will traverse disciplinary boundaries to explore these questions by drawing on new work that draws together the study of international relations, religion, law, anthropology and history.", "name": "Studies in History of Religions", "section": "22", "topic": "Religion, Race and Global Politics", "course": "471-0", "meeting_time": ["We 9:00AM - 11:50AM"], "path": "/class-descriptions/4640/WCAS/RELIGION/471-0/14172", "instructor": ["Elizabeth S Hurd"], "id": "14172", "subject": "RELIGION"}]