[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Cresap Laboratory 101"}], "school": "WCAS", "overview_of_class": "This course explores prosody in spoken language, examining how pitch melodies and the temporal patterning of speech are used to convey structure and meaning above the level of the word. Prosodic patterns will be examined in diverse languages where prosody functions variously to structure words into phonological phrases, to mark the information status of words and phrases in discourse, and in structuring dialogue interactions among conversational partners. Evolutionary and developmental links between linguistic and emotional prosody will also be considered. The course will address prosody from theoretical and empirical perspectives, in terms of symbolic representations and in the acoustic patterning of pitch, duration, and other measures.", "qtr": "Winter 2017", "name": "Laboratory Phonology I", "title": "WCAS LING 450-1-20 Laboratory Phonology I", "lmod": "2/5/17 6:45 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "847/467-7092", "instructor_name": "Jennifer Sandra Cole", "instructor_addr": "2016 Sheridan Road, Rm 201"}], "topic": "", "course": "450-1", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "descriptions": [{"name": "Overview of class", "value": "This course explores prosody in spoken language, examining how pitch melodies and the temporal patterning of speech are used to convey structure and meaning above the level of the word. Prosodic patterns will be examined in diverse languages where prosody functions variously to structure words into phonological phrases, to mark the information status of words and phrases in discourse, and in structuring dialogue interactions among conversational partners. Evolutionary and developmental links between linguistic and emotional prosody will also be considered. The course will address prosody from theoretical and empirical perspectives, in terms of symbolic representations and in the acoustic patterning of pitch, duration, and other measures."}, {"name": "Registration Requirements", "value": "LING 350 or permission of instructor"}, {"name": "Learning Objectives", "value": "Students in this course will gain an understanding of the empirical evidence, the typology and formal modeling of prosody in its phonological and phonetic form. Students will learn and gain practical experience with experimental methods for investigating prosody through acoustic measurement, annotation, and perceptual judgments. Students will learn how to relate empirical evidence of prosody to theories of the cognitive representation and processing of spoken language."}, {"name": "Teaching Method", "value": "The class format will be combination of lecture, discussion and laboratory activities."}, {"name": "Evaluation Method", "value": "Students will be evaluated based on class discussion, laboratory assignments and a final research paper. Laboratory assignments will give students hands-experience examining prosody through acoustic and behavioral measures. For the final paper, students will select a topic of interest related to prosody and present a literature review and proposal for new research on that topic."}, {"name": "Class Materials (Required)", "value": "Readings will be assigned from textbooks, handbooks and research articles made available through the course website."}], "path": "/class-descriptions/4650/WCAS/LING/450-1/20583", "instructor": ["Jennifer Sandra Cole"], "class_attributes": "", "id": "20583", "subject": "LING"}]