[{"school": "WCAS", "overview_of_class": "This is an introductory course in economics with an emphasis on macroeconomics. The first, more `microeconomic' third of the course will cover general topics such as scarcity, choice, how the market system works and the effects of government intervention. This will take us up to the first midterm. We'll then turn to long-run macroeconomics and consider such things as economic growth, unemployment and perhaps the significance of the US current account deficit. This should take us through to the second midterm. We'll then look at money and inflation. We'll finish with short-run macroeconomics, with a focus on the role of monetary and fiscal policy in stabilizing the business cycle. En route, time permitting, we will consider such contemporary issues as the role of economic policy in addressing environmental concerns and the recent financial crisis.", "name": "Introduction to Macroeconomics", "section": "20", "location": "Leverone Auditorium Owen Coon", "topic": "", "course": "201-0", "meeting_time": ["MoWeFr 9:00AM - 9:50AM"], "path": "/class-descriptions/4650/WCAS/ECON/201-0/20948", "instructor": ["Richard E H Walker"], "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "id": "20948", "subject": "ECON"}, {"school": "WCAS", "overview_of_class": "An introduction to economics with an emphasis on macroeconomics (business cycles, inflation, unemployment, economic growth). The first three weeks cover aspects of general microeconomics that everyone should know, including how the market system works, how prices are determined, why shortages and surpluses occur, and basic industrial competition. Topics include: supply and demand, competition versus monopoly, comparative advantage in trade, taxation, and market failures. The last two-thirds of the class build on these tools to study the behavior of the economy as a whole, particularly in an international context. Topics include: inflation, unemployment, recessions, booms, fiscal and monetary policy, budget deficits, economic development of nations, international trade, and exchange rates.", "name": "Introduction to Macroeconomics", "section": "40", "location": "Leverone Auditorium Owen Coon", "topic": "", "course": "201-0", "meeting_time": ["MoWeFr 11:00AM - 11:50AM"], "path": "/class-descriptions/4650/WCAS/ECON/201-0/20949", "instructor": ["Mark P Witte"], "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "id": "20949", "subject": "ECON"}]