[{"school": "SoC", "overview_of_class": "This course will examine the movement of musicals from the stage to the screen and from the screen to the stage.  Students will explore the motivations behind such adaptations, the methods used in executing them, as well as the social, cultural, and economic effects/implications of the creative decisions involved in such a transfer.  Students will be evaluated based on attendance, discussion participation, writing assignments, group work, quizzes, a midterm paper, and a final group project.  Students will be expected to view films, as well as reading librettos and supplementary materials.  Most course materials will be provided via Canvas.", "name": "Radio/Television/Film Genre", "section": "20", "location": "Helmerich Auditorium", "topic": "Musicals from Stage to Screen", "course": "322-0", "meeting_time": ["We 10:00AM - 12:50PM"], "path": "/class-descriptions/4610/SoC/RTVF/322-0/22290", "instructor": ["Roxane H Heinze-Bradshaw"], "class_attributes": "", "id": "22290", "subject": "RTVF"}, {"school": "SoC", "overview_of_class": "This class considers Reality TV from aesthetic, cultural, and historical perspectives. Reality TV is a hybrid mode of television, with messy boundaries, and programs that seem at once obvious and opaque, innovative and repetitive, transparent and self-reflexive, superficial and profound, manufactured and spontaneous.  The class will engage critical methods to explore the variety of ways one might (or does) enjoy, interpret, and deride reality television programs, sometimes all at the same time; and also consider whether, when, and how these different postures involve imagining whether (or when) programs are made for \"us\" or \"others.\"  This means considering the programs in terms of formal properties, narrative structure, cultural context, social identity formation, and transmediality, among other considerations.  The class will lead to a broad-based understanding of reality TV, and hone critical skills in media analysis.<br/><br/>Class format will be a combination of lecture, discussion, and in-class screenings.", "name": "Radio/Television/Film Genre", "section": "21", "location": "Louis Hall 119", "topic": "Reality TV", "course": "322-0", "meeting_time": ["MoWe 3:00PM - 4:50PM"], "path": "/class-descriptions/4610/SoC/RTVF/322-0/22291", "instructor": ["Miriam B White"], "class_attributes": "", "id": "22291", "subject": "RTVF"}]