[{"class_mtg_info": [{"meet_t": "Tu 3:30PM - 6:20PM", "meet_l": "Scott Hall 319 ExperimentalLab"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Winter 2016", "name": "24357", "title": "WCAS POLI_SCI 101-6-22 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "24357", "instructors": [{"instructor_phone": "", "instructor_name": "James N Druckman", "instructor_addr": ""}], "topic": "Sports, Politics, and Public Opinion", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "Prof. Druckman &quot;Sports, Politics, and Public Opinion&quot; Winter 2016 First-year Seminar<br/><br/>Sports and politics have become increasingly intertwined over the last 40 years. Local, state, and federal governments as well as other governing bodies (e.g., the NCAA) regulate who can participate (e.g., eligibility, equality) and what standards players must meet (e.g., drug testing, academic performance). These organizations also oversee economic (e.g., stadiums) and symbolic (e.g., mascots) issues. Ideally, governing policies would be responsive to the wishes of their constituents (e.g. players, owners, voters). But are they? How would we know? How do we gauge their opinions? Alternatively, how do sports affect public opinion? Do citizens prefer politicians who engage in sports? Do media portrayals of sport affect what citizens think about race and/or gender? These are examples of the questions we will consider in this class. This involves learning the science of public opinion polling and then applying this knowledge to study opinions about public policies relevant to sports."}, {"name": "Registration Requirements", "value": "Must be a first-year student Attendance required at the first class."}, {"name": "Learning Objectives", "value": "How to design a public opinion study. Understand how to systematically study the relationship between sports and politics, using social science methods."}, {"name": "Teaching Method", "value": "Some lecture, much discussion"}, {"name": "Evaluation Method", "value": "1. Class Projects. <br/><br/>2. Research Paper. <br/><br/>3. Research Exercise. <br/><br/>4. Participation."}, {"name": "Class Materials (Required)", "value": "All readings can be found on-line or will be available from the Professor."}], "lmod": "1/9/16 6:52 PM (CT)", "subject": "POLI_SCI"}]