[{"class_mtg_info": [{"meet_t": "MoWe 9:30AM - 10:50AM", "meet_l": "Scott Hall 212"}], "school": "WCAS", "overview_of_class": "This course will explore these implications and the histories including the more contemporary social and political developments of Latino communities in the United States from a comparative urban framework. We will focus on the diverse experiences of America's three largest groups of Latino-origin: Mexican Americans, Puerto Ricans, and Cuban Americans.   <br/> <br/>The first part of the course will examine the social construction of Latino identities and trace the historical experiences of all three groups, comparing the elements behind each group's migration and how those processes affect their incorporation in mainstream society.  We also examine demographic resources and the impact of immigration on the politics of the Latino collectivity.  Next, we turn to the development of a Latino politics, placing special emphasis on political attitudes, mobilization strategies and electoral participation. Lastly, we tackle public policy issues such as voting rights and language policy.   <br/><br/>The question that we will return to throughout the course is the degree to which and under what circumstances is it appropriate to speak of a Latino community.", "qtr": "Winter 2016", "name": "Topics in Latina and Latino Social and Political Issues", "title": "WCAS LATINO 392-0-29 Topics in Latina and Latino Social and Political Issues", "lmod": "1/9/16 6:50 PM (CT)", "section": "29", "instructors": [{"instructor_phone": "", "instructor_name": "Jaime   Dominguez", "instructor_addr": ""}], "topic": "Latino Politics in the U.S.", "course": "392-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "This course will explore these implications and the histories including the more contemporary social and political developments of Latino communities in the United States from a comparative urban framework. We will focus on the diverse experiences of America's three largest groups of Latino-origin: Mexican Americans, Puerto Ricans, and Cuban Americans. <br/> <br/>The first part of the course will examine the social construction of Latino identities and trace the historical experiences of all three groups, comparing the elements behind each group's migration and how those processes affect their incorporation in mainstream society. We also examine demographic resources and the impact of immigration on the politics of the Latino collectivity. Next, we turn to the development of a Latino politics, placing special emphasis on political attitudes, mobilization strategies and electoral participation. Lastly, we tackle public policy issues such as voting rights and language policy. <br/><br/>The question that we will return to throughout the course is the degree to which and under what circumstances is it appropriate to speak of a Latino community."}, {"name": "Learning Objectives", "value": "To introduce students to the notion of Hispanic versus Latino.<br/>To learn to distinguish under what conditions the above notion's take form in the political arena.<br/>To learn to differentiate between a racial group and an ethnic group and why it matters in the case of Latinos/Hispanics.<br/>To better understand why some Latino groups compared to other have different levels of political power than others.<br/>To better understand how the immigration experiences of each Latino group impact identity formation in political, economic and social circles.<br/>To better understand the structural and institutional mechanisms that give rise to Latino political agency.<br/>To assess how regional variation, i.e., the Southwest versus the Midwest region, affects the politics of these communities.<br/>To better assess whether Latino politics is a national, state or local phenomenon."}, {"name": "Teaching Method", "value": "Case studiesClass participationDiscussionFilms / videosLecturePresentationsReadingsWriting assignments"}, {"name": "Class Materials (Required)", "value": "David Gutierrez. 1995. Walls and Mirrors: Mexican Americans, Mexican Immigrants and the Politics of Ethnicity. Berkeley: University of California Press. <br/><br/>Maria de los Angeles Torres. 1999. In the Land of Mirrors: Cuban Exile Politics in the United States. Ann Arbor: University of Michigan Press. <br/><br/>Marcelo Suarez-Orozco &amp; Mariela Paez. 2002. Latinos: Remaking America. Berkeley: University of California Press. <br/><br/>Lisa Garcia-Bedolla. 2005. Fluid Borders: Berkeley University of California Press.<br/><br/>Amalia Pallares and Nilda Flores-Gonzalez. 2010. Marcha: Latino Chicago and the Immigrant Rights Movement"}, {"name": "Class Notes", "value": "PREREQUISITES: 300 Level LLSP or POLS Course<br/><br/>No P/N option and attendance at first class is mandatory"}], "path": "/class-descriptions/4610/WCAS/LATINO/392-0/24765", "instructor": ["Jaime   Dominguez"], "class_attributes": "Interdisciplinary Distro - See Rules<br/><br/>Social &amp; Behavioral Sciences Distro Area<br/><br/>Ethics &amp; Values Distro Area<br/><br/>", "id": "24765", "subject": "LATINO"}]