[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "Loder Hall Lower Level 023"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "23565", "title": "WCAS LEGAL_ST 276-0-20 Introductory Topics in Legal Studies", "class_attributes": "", "section": "23565", "instructors": [{"instructor_phone": "", "instructor_name": "Susan Gaunt Stearns", "instructor_addr": "620 Lincoln #203"}], "topic": "Law on the Frontier", "course": "276-0", "descriptions": [{"name": "Overview of class", "value": "Legal_St 276-0-20 &quot;Introductory Topics in Legal Studies: Law on the Frontier&quot; Prof. Susan Gaunt Stearns, Winter 2016 <br/><br/>This course examines the legal history of the American frontier, examining how legal institutions and practices spread across what would become the United States. From Jesse James to Chinese Exclusion, from polygamy to American Indian boarding schools, this course examines the presence and absence of the law in the west. Throughout the course, students will be engaged in building a website showcasing their research."}, {"name": "Learning Objectives", "value": "Students will be able to describe and analyze the controversy surrounding the term &quot;frontier.&quot;<br/>Students will analyze the interactions between race, class, and the law on the frontier. <br/>Students will develop a chronology of U.S. policy related to American Indians. <br/>Students will perform primary and secondary source research. <br/>Students will learn to build websites and work collaboratively."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Evaluation will be based on discussion and website projects."}, {"name": "Class Materials (Required)", "value": "Sarah Baringer Gordon, The Mormon Question: Polygamy and Constitutional Conflict in 19th Century America, University of North Carolina Press, any edition, 2002, ISBN-13: 978-0807849873 <br/><br/>Erika Lee, At America's Gates: Chinese Immigration During the Exclusion Era, 1882-1943, University of North Carolina Press, any edition, ISBN-13: 978-0807854488 <br/><br/>Linda Gordon, The Great Arizona Orphan Abduction, Harvard University Press, (2001), ISBN-13: 978-0674005358<br/><br/>Rachel St. John, Line in the Sand: A History of the Western U.S.-Mexico Border, Princeton University Press, 2012, ISBN-13: 978-0691156132, any edition <br/><br/> Marsha Weisiger and Bill Cronon, Dreaming of Sheep in Navajo Country, University of Washington Press, 2011, ISBN: 978-0295991412, any edition"}], "lmod": "1/9/16 6:50 PM (CT)", "subject": "LEGAL_ST"}]