[{"class_mtg_info": [{"meet_t": "Th 6:15PM - 9:15PM", "meet_l": "Lunt Hall 105"}], "school": "SCS", "overview_of_class": "This course is an introduction to complex variables and functions, laying stress on general concepts, examples, and computational techniques. Complex analysis is a very attractive subject to learn. Complex numbers have a natural geometric interpretation (which aids in problem solving). One can immediately begin to demonstrate interesting results (a real polynomial of odd degree must have a real root), and many facets of the subject are completely different from their real-variable counterparts (a function that is differentiable is infinitely differentiable). Finally, there are many important applications: evaluating definite integrals, finding eigenvalues and eigenvectors, solving differential equations. Proofs of basic results will be covered, but that will not be the primary focus of the course, which will be examples, computational techniques, and applications.", "qtr": "Fall 2017", "name": "Complex Analysis", "title": "SCS MATH 325-CN-66 Complex Analysis", "lmod": "9/12/17 6:54 PM (CT)", "section": "66", "topic": "", "course": "325-CN", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "This course is an introduction to complex variables and functions, laying stress on general concepts, examples, and computational techniques. Complex analysis is a very attractive subject to learn. Complex numbers have a natural geometric interpretation (which aids in problem solving). One can immediately begin to demonstrate interesting results (a real polynomial of odd degree must have a real root), and many facets of the subject are completely different from their real-variable counterparts (a function that is differentiable is infinitely differentiable). Finally, there are many important applications: evaluating definite integrals, finding eigenvalues and eigenvectors, solving differential equations. Proofs of basic results will be covered, but that will not be the primary focus of the course, which will be examples, computational techniques, and applications."}, {"name": "Registration Requirements", "value": "MATH 234 and 240 or equivalent, and a basic understanding of vectors and matrices."}, {"name": "Learning Objectives", "value": "Understand the basic definitions, concepts and results of complex variables and learn the basic computational techniques of the subject. These techniques include the ability to: manipulate complex numbers; compute complex derivatives and integrals; evaluate complex infinite series; find Laurent expansions; use the residue calculus to evaluate definite integral; and construct a variety of conformal maps. Students will learn why complex numbers play a key role in linear algebra and differential equations, and their role in the historical development of modern mathematics."}, {"name": "Teaching Method", "value": "Lectures, detailed examples, assigned readings, problem sets, and class discussion (including going over the solutions to the problem set due that class."}, {"name": "Evaluation Method", "value": "Weekly problem set, midterm and final examinations"}, {"name": "Class Materials (Required)", "value": "Course texts:<br/><br/>1. John M. Howie, Complex Analysis, Springer Undergraduate Mathematics Series, 2008. <br/><br/>2. Konrad Knopp, Elements of the Theory of Functions, Dover Publications, 2016. [An outstanding, classic, and very readable introduction to the subject. To be used as supplementary reading]<br/><br/>Detailed notes and problem solutions will also be distributed via Canvas."}], "instructor": ["Sandy L Zabell"], "class_attributes": "", "id": "17535", "subject": "MATH"}]