[{"school": "JOUR", "overview_of_class": "Photojournalism is a visual reporting class that teaches students to make compelling images that convey multiple levels of information. Students will study past and current photojournalists and their contributions to journalism, as well as ethics while shooting and in the use of Photoshop. A foundation of camera knowledge and storytelling techniques will be enhanced with weekly critiques and discussions. Examining how photo editing impacts the<br/><br/>presentation and perception of images is a key part of the course. Using provided equipment, students will complete the course with a portfolio of single images and in-depth photo stories.<br/><br/>Examples: * http://picturestory.knightlab.com/stories/lashonda.html * http://picturestory.knightlab.com/stories/jackie.html * http://picturestory.knightlab.com/stories/farm.html * http://picturestory.knightlab.com/stories/cattleranchers.html", "name": "Special Topics", "section": "20", "topic": "Advanced Photojournalism", "course": "390-0", "meeting_time": ["MoWe 10:00AM - 11:50AM"], "path": "/class-descriptions/4620/JOUR/JOUR/390-0/31358", "instructor": ["Zach   Wise"], "id": "31358", "subject": "JOUR"}, {"school": "JOUR", "overview_of_class": "The flow of migrants away from war, famine and economic hardship is one of the most significant stories of our time. Across the globe, millions of people are on the move, straining the capacity of governments and international relief organizations to cope and ordinary citizens to comprehend. In the United States, France, Germany and much of Europe, the recent flow of humanity from the Middle East, in particular, has become a prominent social and political issue, prompting profound questions about how to respond. This class explores the origins of the current refugee crisis and its ongoing evolution, paying attention to disparate voices and interests. You will polish skills in research/reporting, interviewing and critical thinking as you work toward meaningful final projects in an array of media. Open to graduates and undergraduates, the class is a prerequisite for BSJ students chosen to travel to France or MSJ students chosen to travel to Germany in June 2016.", "name": "Special Topics", "section": "21", "topic": "Responses to Crisis: Refugees 2016", "course": "390-0", "meeting_time": ["We 6:00PM - 8:50PM"], "path": "/class-descriptions/4620/JOUR/JOUR/390-0/31359", "instructor": ["Peter D Slevin"], "id": "31359", "subject": "JOUR"}, {"school": "JOUR", "overview_of_class": "Modern Israel plays an enormous role in Middle East politics and impacts millions of Americans. The struggle between Israelis and Palestinians and its relations with neighboring Arab states is a staple of worldwide media coverage and one of the most challenging areas for journalists. This class explores the opposing narratives of the current conflict over the West Bank and Gaza and the entire land's extraordinary history, one that is filled with both politics and passion, dreams and dislocation. At the western end of the so-called Fertile Crescent, Israel/Palestine is a multi-cultural arena and the class will examine how the contested capital, Jerusalem, is core for three great monotheistic religions. Students will learn the cultural nuances that exist among Jews, Muslims and Christians and be introduced to great archaeological finds and the role Tel Aviv's high-tech start-ups play in fueling the &quot;Start-Up<br/>Nation&quot;.", "name": "Special Topics", "section": "22", "topic": "Bitter Fruit: Modern Life and Conflict in the Prom", "course": "390-0", "meeting_time": ["Mo 9:00AM - 11:50AM"], "path": "/class-descriptions/4620/JOUR/JOUR/390-0/31360", "instructor": ["Timothy J McNulty"], "id": "31360", "subject": "JOUR"}]