[{"class_mtg_info": [{"meet_t": "Th 3:00PM - 6:00PM", "meet_l": "Kresge Centennial Hall 2-440"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "22360", "title": "WCAS COMP_LIT 414-0-20 Comparative Studies in Genre", "class_attributes": "", "section": "22360", "instructors": [{"instructor_phone": "847/467-1849", "instructor_name": "Erica Suzanne Weitzman", "instructor_addr": "Kresge Hall, Rm 3333, 1880 Campus Drive"}], "topic": "Theories of Realism", "course": "414-0", "descriptions": [{"name": "Overview of class", "value": "The art of life-writing is perennially popular, yet its conventions have changed much over time. Medieval authors did not write &quot;autobiography&quot; in the modern sense, assuming that their personal lives were inherently interesting. But several wrote confessiones, with the double meaning Augustine gave to that term: a confession of sin coupled with a confession of faith and praise to God. Converts used the genre to announce their conversion, prophets to validate their prophetic call, and mystics to share divine revelations and edify their readers. More overtly literary forms of autobiography emerged in the high Middle Ages. The poets Ulrich von Liechtenstein and Dante crafted prose narratives to frame their love lyrics, inventing the genre of erotic autobiography?comically in Ulrich's case, seriously in Dante's. Finally, such fourteenth- and fifteenth-century writers as Chaucer, Langland, Christine de Pizan, and Thomas Hoccleve skillfully developed literary personas that drew on the confessional genre to situate themselves within their own fictive creations."}, {"name": "Registration Requirements", "value": "class participation; one 10-minute oral presentation; a short paper; and a term paper of 12-15 pages."}, {"name": "Learning Objectives", "value": "?"}, {"name": "Teaching Method", "value": "Discussion"}, {"name": "Class Materials (Required)", "value": "Readings will include Augustine of Hippo, Confessions; Guibert of Nogent, Monodiae (Songs for a Solo Voice), Book 1; Judah/Hermann of Scheda, A Short Work on His Conversion; Peter Abelard, Story of My Calamities; Heloise and Abelard, Letters 2-5; Hildegard of Bingen and Gottfried of St. Disibod, The Life of St. Hildegard, Books 1 and 2; Ulrich von Liechtenstein, Frauendienst (The Service of Ladies); Dante Alighieri, Vita Nuova; Julian of Norwich, A Vision Showed to a Devout Woman (Short Text); Margery Kempe and Robert Spryngolde, The Book of Margery Kempe; Geoffrey Chaucer, prologue to The Legend of Good Women; William Langland, &quot;Apology for his life,&quot; from Piers Plowman, C-text; Christine de Pizan, prologue to The Book of the City of Ladies; and Thomas Hoccleve, &quot;My Compleinte.&quot; We will also read criticism by Evelyn Birge Vitz, John Fleming, A. C. Spearing, and others. Middle English texts will be read in the original and others in translation, but those who can read Latin, German, French, or Italian are encouraged to use those languages."}, {"name": "Class Notes", "value": "This class is combined with ENGLISH 422 &quot;Medieval Autobiography&quot;"}], "lmod": "12/25/16 6:57 PM (CT)", "subject": "COMP_LIT"}]