[{"class_mtg_info": [{"meet_t": "Th 5:00PM - 7:20PM", "meet_l": "University Hall 418"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24116", "title": "WCAS FRENCH 440-0-20 Studies in the 18th Century", "class_attributes": "", "section": "24116", "instructors": [{"instructor_phone": "847/491-8255", "instructor_name": "Doris L Garraway", "instructor_addr": "1860 S. Campus Drive, Crowe Hall #2-134"}], "topic": "Radical Thought", "course": "440-0", "descriptions": [{"name": "Overview of class", "value": "In this course, we explore some of the most radical political philosophies, discourses, and freedom projects of the French eighteenth century with an aim to discern the extent to which these are informed by a reflection on the problem of slavery as an extreme instance of unfreedom. Although many recent studies of Enlightenment have challenged the radicalism of its emancipatory ethos in light of its inability to sustain an unambiguous attack on contemporary New World slavery, scholars have yet to fully apprehend the conceptual role of servitude in French Enlightenment discourses of emancipation and sovereignty- both individual or collective. We depart from the striking observation that the metaphor of political slavery was a foundational feature of modern contract theory and universal rights-based philosophies of freedom, and that most of the century's most politically revolutionary stories were figured through foreign contexts in which slavery was practiced- the Turkish Seraglio, the Spanish American plantation, and various sites of European colonial cruelty. Moving beyond common explanations of these displacements, we query the potentialities and limits of French Enlightenment narratives of emancipation or resistance with an aim to uncover the philosophical parallels and conflicts between radical Enlightenment and antislavery, as well as the specific meanings and exclusions of the freedom projects they underwrite. Beginning with Montesquieu's monumental epistolary critique of &quot;Oriental despotism&quot; as the conflation of physical and political servitude, we move on to the radical republican project of Jean-Jacques Rousseau, in which the emancipation of the subject is indistinguishable from the general will that binds it. This we contrast with the rationalist, materialist philosophy of Baron d'Holbach, whose attempt to reduce the human to pure matter determined by physical causes offers what Jonathan Israel maintains is the most politically emancipatory discourse of the era, deriving from the monism of Baruch Spinoza. Moving on to examples of actual &quot;antislavery&quot; literature of the time, by Voltaire, De Gouges, and De Staël, together with the highly polemical Histoire des deux Indes, we examine their ambiguities, ambivalences, and relation to Enlightenment discourses of political emancipation. We conclude with a sustained interrogation of the dialectics of liberty and slavery in the French and Haitian Revolutions, tracking closely the extent to which both projects rely on various forms of unfreedom for their fulfillment. Guided by the theoretical work of Orlando Patterson, Wendy Brown, Mary Nyqyuist, Hannah Arendt, and others. Taught in French."}], "lmod": "12/29/16 6:58 PM (CT)", "subject": "FRENCH"}]