[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "University Hall 102"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Asian American Studies majors and minors", "qtr": "Spring 2017", "name": "32485", "title": "WCAS ASIAN_AM 360-0-1 Studies in Race, Gender, and Sexuality", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "32485", "instructors": [{"instructor_phone": "847/491-4337", "instructor_name": "Jillana B Enteen", "instructor_addr": "1800 Sherman Ave. 4th floor"}], "topic": "Med Tourism &amp; Transn'l Sex'lty", "course": "360-0", "descriptions": [{"name": "Overview of class", "value": "This course is situated at the intersection of theoretical, cultural, medical, and commercial online discourses concerning the burgeoning GCS-related surgeries (Gender Confirmation Surgery) presented online and conducted in Bangkok, Thailand. Using &quot;Trans&quot; theories: transgender, transnational, translation, spatio/temporal, this class discusses the intersections, dialogues, refusals, and adaptions when thinking about medical travel to Thailand. We will examine Thai cultural/historical conceptions of sex and gender, debates concerning bodies and diagnoses, and changes in presentations of sex/gender related surgeries offered online. Comparative cultural studies, medical discourses, and an archive of web images offering SRS surgeries to Thailand produced by Thais for western clientele will serve as axes for investigating this topic."}, {"name": "Registration Requirements", "value": "None."}, {"name": "Learning Objectives", "value": "We will be studying this topic using Three Axes: 1 Comparative Culture How sex gender system in Thailand is/was historically different than what we take as normal. How queer and trans theory have positioned trans bodies. Issues of SRS medical tourism in Thailand. 2 Data and Digital Imaging Using<br/>visualization and websites/webcrawls to understand how we see digital images and texts and how that informs both our understanding of the process, its surrounding medical and legal issues and the interplay of cultures. 3 Medical-Juridical Medical, legal and policy issues at the US and transnational level concerning<br/>transnational tourism, transgender positionings, Standards of Care (WPATH) and different legal forces."}, {"name": "Evaluation Method", "value": "Class participation: 20<br/>Exam, final: 10<br/>Group project: 10<br/>Paper, mid-term: 15<br/>Writing assignments: 45<br/>"}, {"name": "Class Materials (Required)", "value": "All materials for this course will be made available on Canvas - no purchase necessary."}, {"name": "Class Notes", "value": "Attendance at first class mandatory."}], "lmod": "2/9/17 6:40 PM (CT)", "subject": "ASIAN_AM"}]