[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "University Hall 122"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "23672", "title": "WCAS PHIL 210-2-20 History of Philosophy - Medieval", "class_attributes": "Ethics &amp; Values Distro Area<br/><br/>", "section": "23672", "instructors": [{"instructor_phone": "8474677536", "instructor_name": "David Buckley Ebrey", "instructor_addr": "Crowe 1-103"}], "associated_classes": [{"component": "DIS", "room": "Lunt Hall 104", "meeting_time": "Mo 3:00PM - 3:50PM"}, {"component": "DIS", "room": "Harris Hall L06", "meeting_time": "Mo 4:00PM - 4:50PM"}], "topic": "", "course": "210-2", "descriptions": [{"name": "Overview of class", "value": "In this course you will discover a fascinating thousand-year span of the history of philosophy that is often overlooked: medieval philosophy in both the Latin and the Arabic speaking world. This period of philosophy is perhaps most famous for its proofs of the existence of god. We certainly will consider those, but we will give equal attention to the origins of the notions of a will and of free will. We will examine medieval views of the value of philosophy for living our daily lives. We will discuss the nature of perception, cognition, the soul, and the cosmos. And we will reflect on how medieval philosophical theories are importantly different from ancient theories, while at the same time evolving out of them. Our understanding of medieval philosophy, in turn, will help you better appreciate early modern philosophy, which evolved out of and in response to medieval philosophy."}, {"name": "Learning Objectives", "value": "The class will help you develop fundamental philosophical and interpretative skills, such as: how to formulate and understand philosophical positions, arguments, and objections; how to carefully read and learn from difficult texts; and how to write clearly and precisely about philosophical issues. You will be learning to do philosophy by engaging with fascinating, underapreciated texts."}, {"name": "Teaching Method", "value": "Discussion sectionLecture"}, {"name": "Evaluation Method", "value": "Two paper, weekly assignments, and a final."}, {"name": "Class Materials (Required)", "value": "Philosophy in the Middle Ages: The Christian, Islamic, and Jewish Traditions, Third Edition (ISBN 978-1603842082)"}], "lmod": "1/9/16 6:51 PM (CT)", "subject": "PHIL"}]