[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "555 Clark 230"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Freshmen may not register for this course.", "qtr": "Spring 2017", "name": "34271", "title": "WCAS HISTORY 395-0-20 Research Seminar", "class_attributes": "", "section": "34271", "instructors": [{"instructor_phone": "847/467-3399", "instructor_name": "Yohanan   Petrovsky-Shtern", "instructor_addr": "Harris Hall - Room 317"}], "topic": "Origins of Zionism", "course": "395-0", "descriptions": [{"name": "Overview of class", "value": "What does the &quot;national home&quot; for the Jewish people, mention in the 1917 Balfour Declaration, imply? Why Jewish nationalists decided to choose Palestine to establish the Jewish state? Why did they prefer the elitist Hebrew to their contemporary spoken German, Russian, or Yiddish? How did they plan to deal with the Arab population in the contemporary Palestine? Focusing on Europe and the Middle East between the 1850s and the 1930s, this course explores the rise of the Jewish Diaspora nationalism, known as Zionism, discusses the forging of modern Jewish political identities, showcases the early stages of the Jewish resettlement in the land of Israel and delves into the causes of modern Middle Eastern conflicts. The course considers Zionism against the backdrop of rising European nationalisms and links Jewish nationalism to the modernization of Jewish life, to new trends in Judaism, to the nineteenth and twentieth century cultural myths, to the emerging racial antisemitism and new types of mass violence, and to the demise of multi-ethnic empires. Students will consider the contribution to Zionist movement of such figures as Theodor Herzl, Ahad ha-Am, Eliezer ben Yehuda, and Zeev Jabotinsky. Explore how diverse groups of national-minded individuals transformed themselves into an ambitious modern political movement, which helped create the State of Israel and shaped contradictions that plague this state to date."}, {"name": "Teaching Method", "value": "Seminar, Interactive Discussion, &amp; In-Dept Analysis of Primary and Secondary Sources"}, {"name": "Evaluation Method", "value": "Three Response Papers (2 pgs. each) (30%), Take-home Final Research Paper - plus bibliography (13 pgs.) 40%), &amp; Participation (30%)"}, {"name": "Class Materials (Required)", "value": "Derek Penslar. Origins of Israel, 1882-1948: A Documentary History. 9780299284947. Course Readings on Canvas"}], "lmod": "2/16/17 6:47 PM (CT)", "subject": "HISTORY"}]