[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Frances Searle Building 2107"}], "school": "SoC", "enrl_requirement": "", "qtr": "Spring 2017", "name": "37370", "title": "SoC CSD 369-0-1 Special Topics in Communication Sciences and Disorders", "class_attributes": "", "section": "37370", "instructors": [{"instructor_phone": "", "instructor_name": "Jane Louise Rankin", "instructor_addr": ""}], "topic": "Aging and Communication Processes", "course": "369-0", "descriptions": [{"name": "Overview of class", "value": "This course is being used as a place holder for a new course CSD 320 Introduction to Speech, Language, Learning and Their Disorders. Anyone registering for this course will be switched over to CSD 320 once CSD 320 has been approved and entered into CAESAR. The course description for CSD 320 is: Overview of normal and disordered communication. Speech, language, cognitive development and hearing disorders across the age continuum according to etiology, clinical manifestations, and intervention. Anatomy and physiology of speech, language, and hearing. Psychosocial impact of communicative disorders. Settings for service delivery; ethical and legal considerations; and professional issues."}, {"name": "Registration Requirements", "value": "This class may not be taken for credit if you completed CSD 369 Special Topics: Introduction to SLP in Spring 2015. This class is not appropriate for students who have completed a considerable number of pre-SLP courses (e.g. CSD 392, 301, 305, 319, 332)."}, {"name": "Learning Objectives", "value": "Upon successful completion of this course the student should be able to:<br/>- Describe the educational backgrounds, scope of service, and professional credentials of speech language pathologists, audiologists, speech language pathology assistants, and learning disability specialists<br/>- Discuss the basic history, laws and ethical practices within the fields of speech language pathology and learning disabilities<br/>- Identify and describe anatomy and physiology significant in the study of speech, language, and learning<br/>- Describe normal development of speech and language<br/>- Describe correlated variables, characteristics, and intervention for childhood language delays and learning disorders<br/>- Describe correlated variables, characteristics, and intervention for articulation and phonological delays and disorders<br/>- Describe the major categories of neurogenic communication disorders in adults according to etiology and characteristics<br/>- Describe the impact of craniofacial anomalies on communicative development and intervention strategies<br/>- Describe fluency, swallowing and vocal disorders and general intervention strategies"}], "lmod": "2/6/17 8:35 AM (CT)", "subject": "CSD"}]