[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "Kresge Centennial Hall 2-425"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "21733", "title": "WCAS AF_AM_ST 380-0-3 Topics in African-American Studies", "class_attributes": "", "section": "21733", "instructors": [{"instructor_phone": "", "instructor_name": "Jackson Christopher Bartlett", "instructor_addr": ""}], "topic": "(Race and) Sex and the City", "course": "380-0", "descriptions": [{"name": "Overview of class", "value": "This course will examine how sexuality?together with race, gender, and class?figures into contemporary urban political economy in North American cities. Taking a historical sociological approach, the course will ask students to consider the shift from the assimilation politics of the middle twentieth century to the multicultural politics of neoliberalism as a major factor in the racialization of the &quot;Gayborhood.&quot; Taking into account the broad cultural shift from compulsory whiteness and heteronormativity to anti-black multiculturalism and the embrace of the &quot;creative class,&quot; students will consider how certain axes of difference are incorporated in the race to attract young white professionals to cities, towns, and suburbs, and which modes of difference blunt that very project. Which types of difference?in terms of race, gender, class, and sex?remain on the wrong side of urban political economy? By the end of this course, students should be able to critically assess the ways sexual and racial difference are deployed to create, maintain, and resist power in the neoliberal city."}, {"name": "Teaching Method", "value": "Lecture/discussion"}, {"name": "Evaluation Method", "value": "Participation: 15%<br/>In-class Presentation: 25%<br/>Midterm Precis: 20%<br/>Final Paper: 40%<br/><br/>Attendance and Participation: Students will be required to attend all class meetings and come prepared to participate in class discussion each week. Two unexcused absences will be allowed. Each additional absence will result in a 1/3 reduction of the final grade (from an A to an A-, for instance). Class participation WILL BE GRADED and accounts for 10% of the final grade. <br/><br/>In-class Presentation: Each student will present on one week's readings during the term. Topics will be chosen on a first come, first serve basis during the first class session. Presentations are ten minutes and must be followed with the proposal of one in-depth discussion question for the class. Presentations will account for 15% percent of the grade.<br/><br/>Midterm Precis: The midterm precis is a two-page proposal of your final paper. The precis will be evaluated based on your presentation of a topic, argument, and evidence using sources from inside and outside the class. <br/><br/>Final Paper: The final paper will be a twelve to fifteen-page essay on a topic of your choice. You must engage with secondary sources from within and outside the class, and at least one primary source. This will account for 30% of the final grade and is and is DUE ON CANVAS BY Thursday, March 14, 2017 at 5:00pm.<br/><br/>All assignments will be evaluated based on clarity, depth of analysis, and argument where applicable. More detailed rubrics will be discussed in class. Late assignments will receive an automatic full grade reduction for each day they are late (from an A to a B)."}, {"name": "Class Materials (Required)", "value": "Sarah Ahmed (2012), On Being Included: Racism and Diversity in Institutional Life, Durham: <br/>Duke University Press. <br/>Baldwin, James. (1956/2013). Giovanni's Room. New York: Random House. <br/>Delaney, Samuel R. (1999). Times Square Red, Times Square Blue. New York: New York <br/>University Press. <br/>Duggan, Lisa (2004). The Twilight of Equality?: Neoliberalism, Cultural Politics, and the <br/>Attack on Democracy. Boston: Beacon Press. <br/>Ghaziani, Amin (2015). There Goes the Gayborhood? Princeton, NJ: Princeton University Press.<br/><br/>*All other readings will be assigned on Canvas"}], "lmod": "12/29/16 6:53 PM (CT)", "subject": "AF_AM_ST"}]