[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "2122 Sheridan Rd Classroom 232"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "24422", "title": "WCAS POLI_SCI 390-0-22 Special Topics in Political Science", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "24422", "instructors": [{"instructor_phone": "", "instructor_name": "Brian Falb Harrison", "instructor_addr": ""}], "topic": "LGBTQ Politics &amp; Identity", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "Prof. Brian Harrison &quot;LGBTQ Politics &amp; Identity&quot; Winter 2016<br/>In the past 20 years, there has been a meteoric and unprecedented shift in attitudes in the United States toward lesbian, gay, bisexual, and transgender (LGBT) individuals and their rights, yet many obstacles to LGBT equality remain. This course will include a broad discussion of identity, public opinion, its formation, and how it is affected by the news media; contemporary attitudes toward LGBT individuals in the U.S. context; a history of the LGBT movement; and a focus on institutional constraints on issues like marriage equality, adoption rights, employment non-discrimination, and transgender equality."}, {"name": "Registration Requirements", "value": "Attendance at first class required; no p/n option; abc grading only"}, {"name": "Learning Objectives", "value": "As a result of this course, students will be able to: <br/><br/>Overall Course Objectives<br/>1. Analyze the progression of LGBT rights in the context of public opinion and U.S. institutions<br/>2. Think about social justice and social movements in the context of LGBT identities and politics<br/>3. Critically evaluate arguments and/or counter-arguments to contemporary debates surrounding LGBT rights<br/><br/>Specific Learning Objectives<br/>1. Read controversial and difficult material objectively and critically.<br/>2. Communicate how the LGBT movement changed over time and the social and cultural significance of those changes<br/>3. Engage with different approaches to the study of public opinion, identity politics, and LGBT politics <br/>4. Construct a narrative about identity, sexual orientation, and public opinion in the United States over the past several decades"}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "(Evaluation plan subject to change).<br/><br/>1. Class Leadership (5%)<br/>2. Short Memo Paper (10%)<br/>3. 2 medium-length papers (10% each; 20% total)<br/>4. Final Presentation and Research outline (20%)<br/>5. Final Exam/paper (35%)<br/>6. Participation: (10%)"}, {"name": "Class Materials (Required)", "value": "Students should purchase at Norris:<br/>- Blasius and Phelan, eds. 1997. We Are Everywhere. New York: Routledge. ISBN-10: 0415908590. ISBN-13: 978-0415908597<br/><br/>These are required readings but do not need to be purchased from Norris<br/>1. Mucciaroni, Gary. 2008. Same Sex, Different Politics: Successes and Failures in the Struggle Over Gay Rights. Chicago: University of Chicago Press. <br/>2. David Eisenbach, 2006. Gay Power: An American Revolution. New York: Carroll &amp; Graf. <br/>3. The Politics of Same-Sex Marriage, Craig A. Rimmerman and Clyde Wilcox, eds. Chicago: University of Chicago Press.<br/>4. LeVay, Simon. 2011. Gay, Straight, and the Reason Why. Oxford: Oxford University Press.<br/>5. Chauncey, George. 2004. Why Marriage? The History Shaping Today's Debate over Gay Equality. New York: Basic Books."}, {"name": "Class Materials (Suggested)", "value": "SUGGESTED/ reading list for semester<br/>1. LeVay, Simon. 2011. Gay, Straight, and the Reason Why. Oxford: Oxford University Press. Chapters 1-3. <br/>2. Nagoshi, Julie L., Stephan/ie Brzuzy, &amp; Heather K. Terrell. 2012. &quot;Deconstructing the Complex Perceptions of Gender Roles, Gender Identity, and Sexual Orientation among Transgender Individuals.&quot; Feminism &amp; Psychology, 22(4), 405-422. <br/>3. LeVay, Simon. 2011. Gay, Straight, and the Reason Why. Oxford: Oxford"}], "lmod": "1/9/16 6:52 PM (CT)", "subject": "POLI_SCI"}]