[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Kresge Centennial Hall 2-425"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "14571", "title": "WCAS SPANISH 310-0-1 Origins of Spanish Civilization", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "14571", "instructors": [{"instructor_phone": "847/491-8281", "instructor_name": "Dario   Fernandez-Morera", "instructor_addr": "2-148 Crowe"}], "topic": "", "course": "310-0", "descriptions": [{"name": "Overview of class", "value": "The course will allow students to research in relative depth a topic related to the development of Spanish civilization. To this end, the first part of the course will be devoted to lectures, videos, and the examination of some literary and non-literary Medieval texts in class. The second part of the course will be largely devoted to the presentation of the student research in an oral report that will lead to a paper of no less than 2000 words. The course will examine various aspects of the culture of Spain, from the conquest and domination of most of the land by Rome (218 B.C. to the early fifth century) through the Visigoth domination and kingdom (415 A.D.-711 A.D.), the Muslim invasion and domination (711-1212), and the Christian victory of Navas de Tolosa in 1212 A.D. which led to the re-conquest of most of the territory by the mid thirteenth century with the exception of the Muslim kingdom of Granada (finally conquered in 1492). We will read pages from a cultural history packet, many primary documents, and watch videos and films on Medieval art, culture, and the march of history."}, {"name": "Registration Requirements", "value": "1 course from 250, 251, 260, or 261"}, {"name": "Learning Objectives", "value": "Goals<br/>At the end of the course, the student will be able to demonstrate a basic knowledge of the formative period of Spanish culture, language, and literature, and will have been able to carry out research on a particular topic related to the course.<br/>At the end of the course the student will have enjoyed the aesthetic, religious, and general cultural values of the period between the Roman conquest and the practical conclusion of the Re-conquest of most of Spain by the Christians upon the battle of Navas de Tolosa (1212)."}, {"name": "Teaching Method", "value": "Lectures, videos, discussion, and student oral responses and presentations. Grade will be based on class participation (on the material assigned for the day or lectured upon and examined in the previous classes, or presented during the previous class by a fellow student), a student oral presentation on a topic assigned by the professor, and a student final paper of no less than 2000 words on the topics of the oral report. Approximate distribution of the grade: 5 min. oral response papers 25% based on the &quot;planes de trabajo,&quot; &quot;actividades&quot; and &quot;guias de investigacion&quot; in the packet, OR in the videos listed in the syllabus; Oral Presentation based on material being read for the final paper 25%; Final Paper explaining, summarizing and commenting on the outside readings assigned by the professor and on the work done in class 50% due on OR before the last day of classes. Buyer Beware: This class depends heavily on the student's contribution to the class. Two absences are the equivalent of an entire week of classes during which the student has not contributed anything to the class and certainly not learned from the lectures, discussion, etc.: therefore a week of absence (=two absences), including absences during a peer's oral report, will result in the drop of one grade in the final grade for the class, whatever that grade is."}, {"name": "Class Notes", "value": "P/N not allowed for majors."}], "lmod": "10/30/16 7:10 PM (CT)", "subject": "SPANISH"}]