[{"class_mtg_info": [{"meet_t": "Tu 2:00PM - 4:50PM", "meet_l": "Fisk Hall 306"}], "school": "JOUR", "enrl_requirement": "Enrollment Requirements: Pre-Requisite:  Reserved for students who have taken &amp; passed JOUR 301.", "qtr": "Spring 2017", "name": "33231", "title": "JOUR JOUR 371-0-20 Journalism of Empathy", "class_attributes": "Prerequisites apply, see description<br/><br/>No Freshmen<br/><br/>", "section": "33231", "instructors": [{"instructor_phone": "847/467-4099", "instructor_name": "Alex W Kotlowitz", "instructor_addr": "555 Clark Street, Room 218"}], "topic": "", "course": "371-0", "descriptions": [{"name": "Overview of class", "value": "This course will explore writing on those along the margins, reporting on those people and places neglected and This course will explore writing about those along the margins, reporting on those people and places neglected and misunderstood by mainstream America. As a journalist, I can't think of anything more exhilarating than moving beyond the center of the storm, giving voice to those without, introducing readers to people they otherwise would never have reason to meet. Why write on outsiders? What does it tell us about the way power is wielded? How does one gain access to an inner-city or immigrant community or to a prison or to a group of gay students? How do you immerse yourself in the lives of others without losing yourself in your subjects? How do you establish empathy? We'll read lots - books and magazine pieces - and listen to radio pieces and watch some film. I hope to bring in a guest nonfiction storyteller or two. We'll also do a fair amount of writing. There will be two short writing assignments, as well as a longer piece which will be due at the end of the quarter. This course will be run as a seminar, so expect robust and vigorous class discussions. We'll workshop papers, discuss readings, watch film and work at understanding the artistry behind compelling nonfiction?storytelling. ?"}, {"name": "Registration Requirements", "value": "Prerequisite: JOUR 301"}], "lmod": "2/19/17 6:39 PM (CT)", "subject": "JOUR"}]