[{"school": "WCAS", "overview_of_class": "The 1948 war created a unique situation: A Palestinian-Arab minority amidst the Jewish state of Israel. Thus, Israel was established as a Jewish state but not exclusively so. The Palestinian Arabs who became Israeli citizens remained nationally and religiously bound to the outside Arab world. This necessarily resulted in a sharp crisis of loyalties, the Arab community being torn between its Israeli citizenship and its Arab national identity.<br/>Today the Arab minority constitutes nearly 20 percent of Israel's population. It has undergone intensive processes of change, generally referred to as: Israelization, Palestinization and Islamization.<br/>The seminar will focus on minority-majority relations in Israel, with special emphasis on three areas: first, the effect of modernization on the more traditional Arab society; second, the dilemma of national identity (the interrelation between the Israeli, Arab, Palestinian and Muslim/Christian components, the impact of the PLO and Hamas), political participation (Knesset) and the struggle of the Arab minority for equality, and third, the developments following the Oslo Accords, the establishment of the Palestinian Authority and the Intifada (the October 2000 Uprising; the discourse over the \"Jewish and Democratic\" nature of Israel; the search for alternative models - \"State of its Citizens\", separatism, autonomy).", "name": "Topics In History", "section": "20", "location": "Harris Hall L06", "topic": "Arabs in a Jewish State", "course": "392-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4640/WCAS/HISTORY/392-0/12361", "instructor": ["Elie   Rekhess"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "id": "12361", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "This will be a seminar/colloquium focusing on the issue of gender and women's status in the pre-modern Islamic Middle East. The term \"Harem\" derives from the Arabic \"Haruma\" and refers to a zone of private residence restricted to female access or immediate male kin. The evolution of this restricted section of the household into a complex institution regulating the lives of women who wielded power in royal courts will constitute the central topic of discussions, but background information on the status of women in Koran and Islamic Law, matters of sexuality and passion, women's contributions to the economy, and women in religious life will also be addressed. In general, issues pertaining to feminist activism in the nineteenth and twentieth centuries, periods of cultural and political influence from Western Europe, will NOT be considered. The seminar will weigh the question of gender as it would have emerged during the traditional era of Islamic History, when social standing was decided indigenously according to Muslim precepts.", "name": "Topics In History", "section": "22", "location": "Annenberg Hall 101", "topic": "Harem as an Institution", "course": "392-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4640/WCAS/HISTORY/392-0/12362", "instructor": ["Carl Forbes   Petry"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "id": "12362", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "This course will examine the rise and fall of piracy in the early modern Atlantic. No other band of outlaws can match the hold that pirates have on the popular imagination, from the \"sea dogs\" who prowled the Spanish Main to the fearsome exploits of Blackbeard. Setting piracy within the larger context of the Atlantic World, this course will explore the reasons why men, and occasionally women, risked their lives as buccaneers on the high seas. We will analyze the societies they sought to create, at sea and on land, grappling with themes of race, class, colonialism and rebellion. We will also consider our enduring fascination with pirates, from lurid contemporary newsletters to later legends of buried treasure, separating myth from reality in their time and our own.", "name": "Topics In History", "section": "26", "location": "Kresge Centennial Hall 2-331", "topic": "The Golden Age of Piracy", "course": "392-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4640/WCAS/HISTORY/392-0/12364", "instructor": ["Ryan Christopher Burns"], "class_attributes": "", "id": "12364", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "What can shopping teach us about history? Something we do almost every day, shopping has a history that is tied up with the development of capitalism, empire and globalization, new roles for women and ideas about the family, changes in political culture, and new ideas about the self. In this research seminar, we will ask how such a mundane activity came to be laden with such varied and often negative meanings. How have people's relationships to the goods they purchase changed from the industrial revolution to the present? How have writers, philosophers, physicians, and critics conceived of the act of shopping? How have people thought about class, gender, race, nation, and politics through consumption? Can consumption be a political act? Drawing on primary sources (historical and literary texts), feminist scholarship, and historical monographs, this class with grapple with the historical relationships between consumption, sexuality, gender, race, and politics on a global scale.", "name": "Topics In History", "section": "28", "location": "Locy Hall 305", "topic": "Global History of Shopping", "course": "392-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4640/WCAS/HISTORY/392-0/12365", "instructor": ["Alexandra Simone Lindgren-Gibson"], "class_attributes": "", "id": "12365", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "This course will consider the causes and consequences of the end of the Cold War consensus in American life between the defeat of Lyndon Johnson in 1968 and the election of Ronald Reagan in 1980. It will argue that this era of the \"long 1970s\" saw the end of political consensus and the emergence of a newly hyper-partisan politics has defined U.S. politics ever since.", "name": "Topics In History", "section": "32", "location": "Garrett-Evangelic Seminary 107", "topic": "Extreme Makeover: The End of Consensus and the Ris", "course": "392-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4640/WCAS/HISTORY/392-0/17474", "instructor": ["Michael J. Allen"], "class_attributes": "", "id": "17474", "subject": "HISTORY"}]