[{"class_mtg_info": [{"meet_t": "MoWe 9:30AM - 10:50AM", "meet_l": "Technological Institute M128"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "23412", "title": "WCAS HUM 370-4-1 Special Topics in the Humanities", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "23412", "instructors": [{"instructor_phone": "", "instructor_name": "Angela   Ray", "instructor_addr": ""}], "topic": "Popular Education in the 19th Century US", "course": "370-4", "descriptions": [{"name": "Overview of class", "value": "Popular Education in the 19th Century US<br/><br/>How did nineteenth-century Americans create intellectual culture? What counted as desirable knowledge? Who could possess such knowledge, and how was knowledge obtained and shared? In this course we will study the theory and practice of education in the nineteenth-century United States, with a special focus on how people who lacked access to formal educational institutions found ways to learn. We will read scholarship from communication, history, and American studies and will analyze many primary source materials, such as widely circulated textbooks, posters advertising public lectures, and the unpublished minutes of debating clubs and literary societies. Students who complete the course successfully can expect to have a deeper understanding of alternative modes of learning, nineteenth-century U.S. culture, and analytic approaches to the study of communication in history."}, {"name": "Evaluation Method", "value": "Two analytic essays, one essay exam, seminar participation."}, {"name": "Class Materials (Required)", "value": "Jensen, Robin E. &quot;Dirty Words: The Rhetoric of Public Sex Education, 1870-1924.&quot; Urbana: University of Illinois Press, 2010. ISBN: 9780252077661<br/><br/>Ray, Angela G. &quot;The Lyceum and Public Culture in the Nineteenth-Century United States.&quot; East Lansing: Michigan State University Press, 2005. ISBN: 9780870137440"}], "lmod": "1/9/16 6:49 PM (CT)", "subject": "HUM"}]