[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "University Lib B182 - Comp Cla"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-requisite: Students must have completed Psych 205 in order to register for this course.", "qtr": "Winter 2017", "name": "25591", "title": "WCAS PSYCH 387-0-20 Consumer Psychology and Marketing Research", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>Attendance at 1st class mandatory<br/><br/>", "section": "25591", "instructors": [{"instructor_phone": "847/467-3041", "instructor_name": "Ginger L. Pennington", "instructor_addr": "Swift Hall, 2029 Sheridan Road, Evanston"}], "topic": "", "course": "387-0", "descriptions": [{"name": "Overview of class", "value": "This course is an introduction to the application of psychological science to our ability to understand, predict, and influence consumer behavior. In addition to covering core theories and empirical findings relevant to the science of consumer psychology, this course involves the hands-on application of research methods to address real-world marketing questions and problems. Students will be involved in the design and execution of an applied marketing research project. Students will analyze data from the project and learn how to effectively communicate the results to a non-scientific, business audience."}, {"name": "Registration Requirements", "value": "Prereq: Psych 205"}, {"name": "Learning Objectives", "value": "Knowledge of core theories and findings in consumer psychology.<br/>Familiarity with research design, data analysis and results presentation for marketing problems."}, {"name": "Teaching Method", "value": "Case studies, Class participation, Discussion, Field work, Group work, Guest speakers, Readings, Research<br/>project, Writing assignments"}, {"name": "Evaluation Method", "value": "Attendance, Class participation, Exam-midterm, Field<br/>trips, Group project, Homework, Presentations, Project- final"}], "lmod": "12/24/16 7:07 PM (CT)", "subject": "PSYCH"}]