[{"class_mtg_info": [{"meet_t": "We 11:00AM - 1:50PM", "meet_l": "No Room Needed"}], "school": "SoC", "overview_of_class": "In this class you will engage with two previously realized productions by creating lighting designs of professional, production ready quality.  You will be provided with production relevant material including source material, scenic (and costume, if available) designs, and technical plans.  Through the class you will investigate and utilize a proven design process to complete you work.  Weekly critiques of work in process will allow you to make work, present, and revise, focused towards the final design presentation.  Your work will be challenged and you will be held accountable for your ideas and methods.  Major emphasis in critique will be given to the compositional and dramaturgical appropriateness of your design ideas.  We will also address industry standard graphic standards.", "qtr": "Winter 2016", "name": "Advanced Studies in Lighting Design", "title": "SoC THEATRE 462-1-1 Advanced Studies in Lighting Design", "lmod": "1/9/16 6:40 PM (CT)", "section": "1", "instructors": [{"instructor_phone": "", "instructor_name": "Marcus Bipin Doshi", "instructor_addr": ""}], "topic": "", "course": "462-1", "enrl_requirement": "Enrollment Requirements: Registration open to MFA Directing &amp; Design Students Only.<br/>Add Consent: Instructor Consent Required<br/>", "descriptions": [{"name": "Overview of class", "value": "In this class you will engage with two previously realized productions by creating lighting designs of professional, production ready quality. You will be provided with production relevant material including source material, scenic (and costume, if available) designs, and technical plans. Through the class you will investigate and utilize a proven design process to complete you work. Weekly critiques of work in process will allow you to make work, present, and revise, focused towards the final design presentation. Your work will be challenged and you will be held accountable for your ideas and methods. Major emphasis in critique will be given to the compositional and dramaturgical appropriateness of your design ideas. We will also address industry standard graphic standards."}], "path": "/class-descriptions/4610/SoC/THEATRE/462-1/24171", "instructor": ["Marcus Bipin Doshi"], "class_attributes": "", "id": "24171", "subject": "THEATRE"}]