[{"class_mtg_info": [{"meet_t": "MoWeFr 10:00AM - 10:50AM", "meet_l": "Technological Institute L150"}], "school": "MEAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "31199", "title": "MEAS CIV_ENV 340-0-20 Fluid Mechanics II", "class_attributes": "", "section": "31199", "instructors": [{"instructor_phone": "847/467-4540", "instructor_name": "Mark M Clark", "instructor_addr": "2145 N. Sheridan Road / TECH A321"}], "associated_classes": [{"component": "LAB", "room": "Frances Searle Building 1421", "meeting_time": "Mo 2:00PM - 3:50PM"}, {"component": "LAB", "room": "Technological Institute LG68", "meeting_time": "Mo 4:00PM - 6:00PM"}], "topic": "", "course": "340-0", "descriptions": [{"name": "Overview of class", "value": "Civil engineering applications of fluid mechanics. Turbulent flow in pipes, pipe networks, and open channels."}, {"name": "Registration Requirements", "value": "Prereqs: CHEM_ENG 321; MECH_ENG 241; or consent of instructor"}, {"name": "Learning Objectives", "value": "By the end of the course, students should be able to:<br/>1. Describe gas partial pressures and the vapor pressure of water<br/>2. Describe the phenomenological and molecular basis of viscosity<br/>3. Calculate energy transfer during phase changes in water<br/>4. Describe the difference between absolute and gage pressures<br/>5. Compute hydrostatic forces on flat and curved surfaces<br/>6. Apply typical boundary conditions in flow sections and at flow boundaries<br/>7. Apply momentum principles to computation of forces on pipes at pipe bends<br/>8. Compute energy losses in pipes in laminar and turbulent flows<br/>9. Compute energy losses in valves pipe contractions, expansions, and bends<br/>10. Interpret the different terms of the Bernoulli equation<br/>11. Compute energy-head relationships in centrifugal pumps<br/>12. Predict the occurrence of cavitation in pumps and pipe networks<br/>13. Compute flows, pressure and head in branched pipes and pipe networks<br/>14. Compute flow conditions to avoid water hammer<br/>15. Compute uniform flow and critical depths in open channels<br/>16. Develop specific energy equation and concept of the critical state<br/>17. Compute conjugate depths and energy loss in hydraulic jump<br/>18. Classify generic gradually varied flows<br/>19. Compute surface profiles in gradually varied flow (including use of HEC-RAS)<br/>20. Identify and compute critical flows in hydraulic transitions<br/>21. Calculate flow velocity in pipes using pitotubes and hydraulic structures<br/>22. Review/criticize published article on role of water supply in economics of sustainable development"}, {"name": "Class Notes", "value": "Fundamentals of Hydraulic Engrg Systems, Hwang, ISBN-13: 9780134292380, 2017, 5th edition, Pearson"}], "lmod": "2/16/17 6:35 PM (CT)", "subject": "CIV_ENV"}]