[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "University Library Video Theat"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Spring 2016", "name": "34882", "title": "WCAS ENGLISH 101-6-21 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "34882", "instructors": [{"instructor_phone": "", "instructor_name": "Christine   Froula", "instructor_addr": ""}], "topic": "On Bees", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "&quot;The arts of building from the bee receive,&quot; urged Alexander Pope (Essay on Man, Epis. iii.1.175). From ancient civilizations to our time, architectural technique is but one of the bountiful gifts that honeybees (Apis mellifera a k a Apis mellifica) bestow upon our human world, from honey (&quot;the flower transmuted, its scent and beauty transformed into aroma and taste&quot;; Stephanie Rosenbaum, Honey: from Flower to Table), wax, and the myriad fruits and vegetables that depend on bees' nectar-gathering, pollinating labor to aeronautic, navigational, and engineering know-how, models of political and social order, medicinal benefits, and aesthetic inspiration.<br/><br/> Our seminar will be a collaborative workshop, a sort of virtual beehive, and our subjects will be selections from the scientific, historical, and aesthetic work on honeybees, from Aesop, Aristotle, Pliny, and Virgil through Mandeville, Maeterlinck, Pastorius, Karl von Frisch, and Muddy Waters to Richard Avedon, Tammy Horn, Lalinn Paull, to the current dangers of Colony Collapse Disorder. We'll explore honeybee ecology in relation to human culture through collaborative research and reading, documentary and feature films, and possible visits with experts on the science, natural and cultural history, and practical knowledge of bees. Each student will take an active part both in designing our common goals and in shaping lines of research and analysis for his or her own course projects. These will include a research paper and a personal essay or creative work. Like the honeybees, we'll be one for all and all for one, and everyone will gain and share experience in developing promising research questions, exploring and selecting relevant bibliography, critical thinking, and analytic and imaginative writing."}, {"name": "Teaching Method", "value": "Discussion, possible visiting lectures and/or field trips."}, {"name": "Evaluation Method", "value": "The grade will be based on attendance and participation including exercises and informal reports (40%); a class presentation (10%); a critical research paper and a personal essay or creative project (50%, with percentages flexibly allotted to accord with each student's particular goals and projects). Each student's contributions to our common goals will also be credited.<br/><br/>In addition to informal exercises and a bee journal, students will develop annotated bibliographic entries (~1000 words), a research proposal (~300-500 words), a research paper or critical study (~2500 words), and a personal essay or creative project (flexible; ~1500 words)."}, {"name": "Class Materials (Required)", "value": "Research, thinking, and art selected from such authors as Aristotle, Pliny, Virgil, F. D. Pastorius, Karl von Frisch, Bernard Mandeville, Arthur Conan Doyle, Maurice Maeterlinck, Zora Neale Hurston, Tammy Horn, Lalinn Paull; visual art; documentary and feature films (More than Honey, The Beekeepers, The Vanishing Hive, Queen of the Sun, Secret Life of Bees); essays and nature writing (Michel de Montaigne, Charles Lamb, Virginia Woolf, Annie Dillard); and our own research."}], "lmod": "4/3/16 7:57 PM (CT)", "subject": "ENGLISH"}]