[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Leverone Auditorium Owen Coon"}], "school": "WCAS", "overview_of_class": "Students will examine and analyze political and identity issues in terms of the languages and dialects of the Balkans (particularly: Albanian, Bosnian, Bulgarian, Croatian, Macedonian, Romani, and Serbian).  Topics to be covered include: linguistic nationalism, language laws, rights of minority languages, language discrimination, language and religion, alphabet issues, language and dialect as ethnic identity, standard language, and others.  This course will introduce the student to some of the key issues that have plagued the Balkans in the past and continue to shape its future.", "qtr": "Winter 2016", "name": "Slavic Civilizations", "title": "WCAS SLAVIC 255-0-20 Slavic Civilizations", "lmod": "1/9/16 6:53 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "847/491-8082", "instructor_name": "Elisabeth M Elliott", "instructor_addr": "1800 Sherman Ave. #3506"}], "topic": "Language, Politics, & Identity", "course": "255-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Students will examine and analyze political and identity issues in terms of the languages and dialects of the Balkans (particularly: Albanian, Bosnian, Bulgarian, Croatian, Macedonian, Romani, and Serbian). Topics to be covered include: linguistic nationalism, language laws, rights of minority languages, language discrimination, language and religion, alphabet issues, language and dialect as ethnic identity, standard language, and others. This course will introduce the student to some of the key issues that have plagued the Balkans in the past and continue to shape its future."}, {"name": "Registration Requirements", "value": "This course fulfills an Area V, Ethics and Values, Distribution Requirement."}, {"name": "Learning Objectives", "value": "1) Learn about the myths that surround languages, dialects, accents, etc. 2) Learn about the connection and practice of languages and prejudice 3) Discover the role that languages can play in identity, ethnicity, and nationalism 4) Learn about languages and cultures of Southeastern Europe (the Balkans)"}, {"name": "Teaching Method", "value": "Lecture; some group-work during classes with class discussions"}, {"name": "Evaluation Method", "value": "Canvas quizzes, two-page linguistic and ethnic biography, group-work, midterm exam and final exam."}, {"name": "Class Materials (Required)", "value": "1. Reading Packet available from Quartet Copies 818 Clark, 847-328-0720<br/>2. A Concise Historical Atlas of the Balkans. By Hupchick, Dennis P. and Harold E. Cox. NY: St. Martin's Press. Available on Canvas"}, {"name": "Class Materials (Suggested)", "value": "1. The Balkans in World History by Andrew Wachtel. Oxford University Press, 2008. (A short, 176 pages, history of the Balkans; Kindle edition available from Amazon). On reserve (hard copy) in CORE (Reserve) 2nd floor of the library. (Kindle edition also available for purchase from Amazon).<br/>2. Nationalism A Very Short Introduction by Steven Grosby. Oxford University Press, 2005. On e-reserve for this course (see link in Canvas; also Kindle edition available from Amazon).<br/>3. The Balkans: A Short History (Modern Library Chronicles) by Mark Mazower. Modern Library 2002 (Kindle edition available from Amazon). On reserve (hard copy) in CORE (Reserve) 2nd floor of the library. (Kindle edition also available for purchase from Amazon)."}], "path": "/class-descriptions/4610/WCAS/SLAVIC/255-0/26908", "instructor": ["Elisabeth M Elliott"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "26908", "subject": "SLAVIC"}]