[{"class_mtg_info": [{"meet_t": "MoTuWeThFr 11:00AM - 11:50AM", "meet_l": "University Hall 412"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-requisite: Students must have passes Chinese 121-2 with at least a C- or be placed in according to placement test results.<br/><br/>Pre-requisite: Students must have passes Chinese 121-2 with at least a C- or be placed in according to placement test results.", "qtr": "Spring 2017", "name": "32498", "title": "WCAS CHINESE 121-3-22 Chinese II", "class_attributes": "", "section": "32498", "instructors": [{"instructor_phone": "8474912760", "instructor_name": "Li-Cheng   Gu", "instructor_addr": "1880 Campus Drive, Kresge Hall, Office 4-530"}], "topic": "", "course": "121-3", "descriptions": [{"name": "Overview of class", "value": "This year-long course is a sequel to Chinese I (Chinese 111), designed for students who have completed Chinese 111 at Northwestern or the equivalent elsewhere. It aims to further develop students' Chinese proficiency through: (1) consolidating the foundation built in students' beginning modern Chinese courses; (2) introducing them to more complex grammatical structures, varieties of language styles, and background cultural information. Upon the satisfactory completion of the course, students will be able to handle various types of more complex daily conversational situations and multi-paragraph passages on familiar topics. This 50-minute class meets five times a week. Successful completion of CHINESE 121-3 will satisfy the WCAS foreign language requirement."}, {"name": "Registration Requirements", "value": "Students must pass the preceding course with C- or above, or must be placed into the course by the departmental placement test."}, {"name": "Teaching Method", "value": "Class time is spent mainly on oral development, and written assignments are given for reading and writing development. The students are expected to be fully prepared for each lesson. This course is conducted mostly in Chinese."}, {"name": "Evaluation Method", "value": "Class attendance and participation, written assignments, dictations, oral quiz and oral presentation, a midterm and a final."}, {"name": "Class Materials (Required)", "value": "Textbook and workbook: Modern Chinese 2A Simplified Characters <br/>Publisher: Better Chinese <br/>ISBN: 978-1-60603-487-3(textbook); 978-1-60603-488-0 (workbook)<br/>Price: $69.95 (textbook); $34.95(workbook)"}], "lmod": "2/8/17 6:41 PM (CT)", "subject": "CHINESE"}]