[{"class_mtg_info": [{"meet_t": "MoWeFr 1:00PM - 1:50PM", "meet_l": "Parkes Hall 224"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "23147", "title": "WCAS ENGLISH 105-0-21 Expository Writing", "class_attributes": "", "section": "23147", "instructors": [{"instructor_phone": "", "instructor_name": "Todd G Nordgren", "instructor_addr": ""}], "topic": "", "course": "105-0", "descriptions": [{"name": "Overview of class", "value": "<br/>With the central aim of helping students learn to write clearly, thoughtfully, and effectively, this course will explore the concept of &quot;ghost writing&quot; in Euro-American culture from the seventeenth to twenty-first centuries. Thinking beyond the &quot;ghost&quot; as the white-sheets-and-chains spook we've come to associate with the term, we will explore the ghost as it represents the uncanny persistence of the past in the present. Cultural interpretations of ghosts and haunting go beyond notions of the fictional and supernatural. Ghosts invite us to a seance with our unfinished past, and conjure compelling analytical and methodological tools across the humanities and social sciences. We will ask: what are ghosts, and what are their roles in the development, or the dismantling, of cultural formations? What is the relationship between ghosts and haunting? How has the concept of the ghost changed through history, and how does that history in turn inform our concept of ghosts? We will investigate both the scholarly and popular answers to these questions as well as come up with our own informed answers over the course of the quarter. Considering ghost writing as it is deployed in works of poetry, fiction, drama, art, and film, along with works of journalism, criticism, and memoir, we will approach the dynamicnature of how ghosts manifest through a complex interplay of values, perspectives, and practices. Focusing on the ghosts of race, gender, sexuality, trauma, and that undying specter of forgetting, our ghosts exemplify the elusiveness of spaces and places, and the lingering presences and absences of memory and history. Collectively, we will work to provide a conceptual framework for ghost writing that can integrate the knowledge generated by different academic disciplines and cultural media, allowing us not only to become more skillful and confident writers, but more conscious, observant, and astute critics of our contemporary culture."}, {"name": "Class Notes", "value": "<br/>Registration for this course is not handled by the English department. Questions about this course should be directed to The Cook Family Writing Program: writing-program@northwestern.edu"}], "lmod": "1/9/16 6:46 PM (CT)", "subject": "ENGLISH"}]