[{"school": "WCAS", "overview_of_class": "This seminar is designed to analyze anthropological approaches to the study of Islam and Muslims in the MENA region and the Islamicate world. We will begin the course by critically revisiting the historical legacies that mediate contemporary debates on and representations of Muslims and Islam. We will explore what it means to take Islam as an object of anthropological analysis and the kinds of normative assumptions that underlie references to \"religion\" and \"tradition.\" Second, we will closely examine seminal interventions advanced by Ernst Gellner, Clifford Geertz and Michael Gilsenan before turning to Talal Asad's analysis of anthropological categories of religion and his attempts to reformulate the study of Islam as a discursive tradition. Situating these debates within the broader intellectual history of anthropological thought, we will then proceed to examine the analytical purchase of symbolic, discursive and practice-centered approaches in studies of Islam. In the second half of the course, we will shift our attention to more ethnographically grounded materials that explore Muslim engagements with, and responses to, various facets of modernity such as gender inequality, capitalist economics and neoliberalist development, religious minorities and the secular nation-state as well urban life and practices of leisure.", "name": "Advanced Topics in Middle East & North African Studies", "section": "21", "topic": "Anthropology of Islam: Symbol, Discourse, Practice", "course": "390-3", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4650/WCAS/MENA/390-3/22715", "instructor": ["Emrah   Yildiz"], "id": "22715", "subject": "MENA"}, {"school": "WCAS", "overview_of_class": "Mass uprisings have been one of the most powerful threats to autocratic governments, and Iran is no exception. Large protest movements have challenged different regimes throughout the country's contemporary history, including the 1905 Constitutional Revolution, 1963 Uprising, 1979 Islamic Revolution, and 2009 Green Movement. Why have so many mass uprisings and revolutions occurred in Iran? Has Iran been a revolutionary country? Why did the 1979 Revolution succeed, but the 2009 Green Movement fail? These are some of the questions that will be studied in this course. The aim of this course is to compare the Iranian revolutions in 1979 and 2009 by studying the processes, causes, and outcomes of these revolutions. This course will be divided into three sections. It will begin by briefly examining the recent theories of revolution and revolutionary movement. The second part of the course will focus on the Iranian Revolution that overthrew the monarchy regime in 1979. We will also study the causes of the Iranian revolution using most influential theoretical approaches, such as structural, cultural, discourse, mobilization, feminist, and Marxist. The third part of this course will be focused on the Green Movement, or Green Revolution, that followed the disputed 2009 presidential election. The course will cover the nature of the Green Movement, as well as the causes for its failure, and its impact on \"Arabs' awaking.\" The course will culminate with a general theory of revolution and revolutionary movements in Iran.", "name": "Advanced Topics in Middle East & North African Studies", "section": "23", "topic": "Revolution and Revolutionary Movements Modern Iran", "course": "390-3", "meeting_time": ["MoWe 9:30AM - 10:50AM"], "path": "/class-descriptions/4650/WCAS/MENA/390-3/22717", "instructor": ["Saeid   Golkar"], "id": "22717", "subject": "MENA"}]