[{"class_mtg_info": [{"meet_t": "Tu 6:00PM - 8:50PM", "meet_l": "Parkes Hall 214"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "22797", "title": "WCAS ASIAN_AM 394-0-20 Professional Linkage Program", "class_attributes": "", "section": "22797", "instructors": [{"instructor_phone": "taoki@saic.edu", "instructor_name": "Tatsuyuki   Aoki", "instructor_addr": "1819 Hinman"}], "topic": "Asian Identity in Cinema", "course": "394-0", "descriptions": [{"name": "Overview of class", "value": "This course looks at America's perceptions of Asians through their portrayal in American mainstream media in contrast to those made in Asia by Asian filmmakers. It is a survey and discussion oriented case studies of representation of Asian and Asian American icons. By comparing films made by Asians and those produced by the American mainstream, major differences in their perspectives and approaches are found. In doing this, the class investigates issues of representation and misrepresentation in mass culture stereotypes of Asians to show how they have been rooted in confusions surrounding cultural differences between Asians and Asian Americans. The course presents Hollywood films; mainstream Asian films, independent works from as well as other visual media such as Youtube submissions and commercial application both the Asian and Asian American communities"}, {"name": "Registration Requirements", "value": "None"}, {"name": "Learning Objectives", "value": "The class will be conducted based on lectures, discussion and viewing movies and other visual presentation works. Students are required to satisfy all recommended reading materials and viewing assigned works. One mid term project presentation and final research paper is requited."}, {"name": "Teaching Method", "value": "Class participationDiscussionFilms / videosGroup workLecturePresentationsReadingsResearch projectWriting assignments"}, {"name": "Evaluation Method", "value": "AttendanceDiscussion sectionFilms / videos: Weekly film viewing &amp; journal<br/>Paper, finalPaper, mid-termReadings: Weekly readings &amp; journal<br/>"}, {"name": "Class Materials (Required)", "value": "Assigned viewing: <br/>Charlie Chan or Fuman Chu, Mr. Wong, Mr. Moto? (any episode from Youtube) <br/>Assigned reading: Sabine Haenni<br/>Filming &quot;Chinatown&quot;: Fake Visions, Bodily Transformations <br/>From Screening Asian Americans, p 21 ~ p 41<br/>The Early Years: Asians in the American Films Prior to World War II <br/>By Eugene Franklin Wong <br/>From Screening Asian Americans, p 53 ~ p 70<br/>Rutgers University Press, 2002, ISBN 0-8153-3025-3<br/><br/>Assigned reading: Peter X. Feng <br/>Introduction / from Screening Asian Americans <br/>Rutgers University Press, 2002. pp. 1- 15 <br/>ISBN 0-8135-3025-3<br/><br/>Assigned reading Marchetti, Gina<br/>Tragic and Transcendent Love: Sayonara and The Crimson Kimono (Chapter 7) / from Romance and the &quot;Yellow Peril&quot;: Race, Sex, and Discursive Strategies in Hollywood Fiction <br/>Berkeley: University of California Press, 1993. pp. 125-157; notes pp. 232-233. ISBN 0-520-08495-0<br/><br/>Emigrants Twice Displaced: Race, Color and Identity in Mira Mair's Mississippi Masala by Binita Mehta / from &quot;Screening Asian Americans&quot; Edited by Peter XFeng <br/>Rutgers University Press, 2002, . pp. 217-234 <br/>ISBN 0-8153-3025-3<br/><br/><br/>Assigned readings: <br/>Coming Out into the Global System: Postmodern Patriarchies and Transnational Sexualities in 'The Wedding Banquet' / from Screening Asian Americans <br/>Edited and with an introduction by Peter X. Feng. New Brunswick: Rutgers University Press, 2002. pp. 273-292. <br/>ISBN 0-8153-3025-3<br/><br/>Also if you have time ?? <br/>Feng, Peter X.<br/>We're Queer! We're Where? Locating transgressive films (Chapter 7) <br/>from Identities in Motion: Asian American Film and Video <br/>Durham: Duke University Press, 2002. pp. 170-190; notes pp. 248-254. <br/>ISBN 0-8223-2996-4<br/> <br/><br/>Assigned reading: Tuan, Mia<br/>Introduction (Chapter 7) / from Forever Foreigners or Honorary Whites? : the Asian Ethnic Experience Today <br/>New Brunswick: Rutgers University Press, 1998. pp. 153; notes pp. 167. <br/>ISBN 0-8135-2624-8<br/><br/>Assigned reading: Wu, Frank H.<br/>Perpetual Foreigner: Yellow Peril in the Pacific Century (Chapter 3) / from Yellow: Race in America Beyond Black and White <br/>New York: Basic Books, 2002. pp. 79-129; notes pp. 362-365. <br/>ISBN 0-465-00640-X<br/><br/>Assigned reading: Zia, Helen<br/>Gangsters, Gooks, Geishas, and Geeks (Chapter 5) / from Asian American Dreams: the Emergence of an American People <br/>New York: Farrar, Straus and Giroux, 2000. pp. 109-135. <br/>ISBN 0-374-52736-9<br/><br/>Assigned reading: <br/>Rambo: Getting to Win This Time (Chapter 6) by Gregory A. Waller Never Having to Say You're Sorry (Chapter 5) by David Desser from From Hanoi to Hollywood: The Vietnam War in American Film Rutgers University Press 1990, pp 102- pp 127 <br/>ISBN 0-8135-1586-6<br/><br/><br/><br/>Assigned reading: Stringer, Julian<br/>Cultural Identity and Diaspora in Contemporary Hong Kong Cinema (Chapter 17) / from from Countervisions: Asian American Film Criticism <br/>Philadelphia: Temple University Press, 2000. pp. 298-312. <br/>ISBN 1-56639-776-6<br/><br/><br/><br/>Asian Male <br/>Sexuality and social positioning <br/>Idea of Strong Man vs. Geeks, <br/>Gangster Asian / Permission and punishment <br/>Strong Asian and Ancient Asian <br/>Immigration and naturalization / Satisfying the basic component of Forever Foreigners <br/><br/><br/>Assigned reading: Jang, Lindsey<br/>Through the Mirror, Sideways (Chapter 6) / from Countervisions: Asian American Film Criticism <br/>Philadelphia: Temple University Press, 2000. pp. 112-125. <br/>ISBN 1-56639-776-6<br/><br/><br/>Assigned reading: Marchetti, Gina<br/>Conclusion: the Postmodern Spectacle of Race and Romance in Year of the Dragon (Chapter 10) / from Romance and the &quot;Yellow Peril&quot;: Race, Sex, and Discursive Strategies in Hollywood Fiction <br/>Berkeley: University of California Press, 1993. pp. 202-221; notes pp. 236-237. <br/>ISBN 0-520-08495-0<br/><br/><br/>Assigned reading: Hamamoto, Darrell Y.<br/>Counterprograming (Chapter 7) / from Monitored Peril: Asian Americans and the Politics of TV Representation <br/>Minneapolis: University of Minnesota Press, 1994. pp. 206-237; notes pp. 276-279. <br/>ISBN 0-8166-2369-4<br/><br/> <br/><br/>Assigned reading: Wu, Frank H.<br/>The Model Minority: Asian American &quot;Success&quot; as a Race Relation Failure (Chapter 2) / from Yellow: Race in America Beyond Black and White <br/>Basic Books, 2002. pp. 39-77; notes pp. 358-362. <br/>ISBN 0-465-00640-X<br/><br/>Assigned reading: Feng, Peter X.<br/>Becoming Asian American: Chan is missing (Chapter 6) / from Identities in Motion: Asian American Film and Video <br/>Durham: Duke University Press, 2002. pp. 151-169; notes pp. 245-248. <br/>ISBN 0-8223-2996-4"}], "lmod": "1/9/16 6:43 PM (CT)", "subject": "ASIAN_AM"}]