[{"class_mtg_info": [{"meet_t": "TBA", "meet_l": "Carnegie Mellon Room 3177"}], "school": "DOHA", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Summer 2016", "name": "41517", "title": "DOHA JOUR 390-0-72 Special Topics", "class_attributes": "", "section": "41517", "instructors": [{"instructor_phone": "", "instructor_name": "Ilhem   Allagui", "instructor_addr": ""}], "topic": "Global Perspectives in Strategic Communication", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "<p>This course provides students with learning about the global perspective of strategic communication and exposure to some of the best marketing communication practices from all over the world, exhibited and discussed in the Cannes International Festival of Creativity. This festival celebrates creativity in all forms of communication and offers a great opportunity for learning and networking: industry experts share their brand success stories or creative productions in digital, broadcast, film, PR, and IMC among many others. With plenary sessions, seminars, forums, master classes and workshops, the students will find about new trends in marketing communications in general and in specific interests they may have, such as health communication, entertainment, sports or innovation. Students will also have the opportunity to attend a one-on-one portfolio session with industry experts who meet with the students and comment on their portfolios. Networking is another opportunity in this gathering, as the students can meet with practitioners and peers from various universities.This course starts locally with two meetings to introduce the course and the structure of the festival, then 10 days travel to the festival and back to Doha to reflect on the learning and complete the assigned project.</p>"}, {"name": "Registration Requirements", "value": "<ul><br/><li>Prerequisites: IMC 303 or IMC 330</li><br/><li>Open to sophomore and above</li><br/><li>Instructor permission is required</li><br/><li>Travel to Cannes is required for this course</li><br/><li>Class meets in Doha on May 15, May 29 and June 30.Travel to Cannes is scheduled for June 18-June 27</li><br/></ul>"}], "lmod": "5/1/16 6:30 PM (CT)", "subject": "JOUR"}]