[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Kresge 3438 Philosophy Sem. Rm"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Spring 2017", "name": "34460", "title": "WCAS PHIL 109-6-21 First-Year Seminar in Philosophy", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "34460", "instructors": [{"instructor_phone": "847/467-6249", "instructor_name": "Stephen John White", "instructor_addr": "Crowe Hall, Room 1-159"}], "topic": "Love and Money", "course": "109-6", "descriptions": [{"name": "Overview of class", "value": "There are many different and incommensurable kinds of goods: consumer goods (like cars and computers and clothes), personal relationships (love and friendship), goods of status, bodily goods (health, freedom from pain), opportunities for meaningful work, leisure, and so on. We will explore the moral and political implications of the idea that the way in which a specific good should be allocated, promoted and engaged with depends on the type of good it is. In particular, we'll be interested in the contrast between marketable goods - commodities - and other sorts of goods. If there are things that should not be for sale, why is that, and what does it say about the nature of value?"}, {"name": "Learning Objectives", "value": "Students will <br/>?Learn to identify and reconstruct the main arguments and assumptions of the authors we read in class<br/>?Be able to write an essay that articulates a clear thesis and presents a thoughtful argument in support of that thesis<br/>?Understand how economic markets may affect the way in which things are valued<br/>?Understand the moral problems that can arise when certain types of goods are bought and sold"}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Grades will be based on student performance on papers, as well as in-class participation."}, {"name": "Class Materials (Required)", "value": "Michael Sandel, &quot;What Money Can't Buy&quot; (New York: Farrar, Straus and Giroux)"}], "lmod": "2/16/17 6:48 PM (CT)", "subject": "PHIL"}]