[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "University Hall 121"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "23425", "title": "WCAS INTL_ST 395-0-20 Integrating Project Seminar", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "23425", "instructors": [{"instructor_phone": "", "instructor_name": "Brittany Michelle Friedman", "instructor_addr": ""}], "topic": "The Rise&amp;Fall of Criminal Orgs", "course": "395-0", "descriptions": [{"name": "Overview of class", "value": "The Rise of the Criminal Organization: Gangs and Organized Crime in International and Comparative Perspective<br/><br/>What most people know about gangs and organized crime comes from representations in popular culture such as The Godfather, Breaking Bad, and The Wire. By demystifying the criminal underworld, this seminar introduces students to the complex social phenomena underlying the rise of criminal organizations. Students will learn to use a case study approach to compare and contrast different international cases of gangs and organized crime. We will specifically focus on the social processes, which explain the development of criminal organizations by: (1) tracing the importance of social networks, (2) situating their practices within existing cultural structures, (3) examining their participation in legal and illegal markets, and (4) interrogating their relationship to politics and other social institutions. <br/><br/>Enrollment is open to all students regardless of major. Students will address a real world problem at a sophisticated level for their final project and present their research to the class at the culmination of the course."}, {"name": "Class Materials (Required)", "value": "Gambetta, David. 1993. The Sicilian Mafia: The Business of Private Protection. Cambridge: Harvard University Press. ISBN: 9780674807426<br/> <br/>Heinonen, Paula. 2013. Youth Gangs and Street Children: Culture, Nurture, and Masculinity in Ethiopia. Oxford, New York: Berghahn Books. ISBN: 978178238132"}], "lmod": "1/9/16 6:50 PM (CT)", "subject": "INTL_ST"}]