[{"class_mtg_info": [{"meet_t": "Th 12:00PM - 2:50PM", "meet_l": "Annie May Swift Hall 219"}], "school": "SoC", "enrl_requirement": "", "qtr": "Spring 2016", "name": "31665", "title": "SoC RTVF 360-0-20 Topics in Media Writing", "class_attributes": "Prerequisites apply, see description<br/><br/>", "section": "31665", "instructors": [{"instructor_phone": "", "instructor_name": "Thomas Lamar Bradshaw", "instructor_addr": ""}], "topic": "Writing Compelling Characters", "course": "360-0", "descriptions": [{"name": "Overview of class", "value": "This intensive workshop aims at instructing aspiring screenwriters and playwrights how to write plays, TV scripts and screenplays on various political issues. Those issues are of a wide spectrum; the projects will address sexual/gender orientation and protests against sexual violence or the threat of sexual violence against young people whether in the US or in the refugee camps in the Middle East and elsewhere, protests against racial discrimination, demanding human rights, upheavals against dictators, underground activism against authoritarian regimes.. etc. The course will include a survey about some major dramatists' contributions in political drama, ranging between the Greeks and Brecht. We will review also the principles of dramatic writing. The workshop will tackle censorship issue and how writers manage to avoid it, transcend it, or choose to confront it. There will be some assigned readings, ranging between Shakespeare, Ibsen, Ariel Dorfman and Ali Salem. There will be also some assigned films or clips of features to view and analyze."}, {"name": "Learning Objectives", "value": "With the goal of developing the talents of dramatic writing, emphasis will be placed on mastery of the technical aspects of the craft of both playwriting and screenwriting on political/social subject-matters."}, {"name": "Evaluation Method", "value": "What criteria will be used for grading (e.g., papers, projects, final exam, etc.)<br/>Projects; but also few assignments on some course materials like films and plays."}, {"name": "Class Materials (Required)", "value": "Specify any materials required to participate in this course (e.g., books, course packs, computer or film equipment, etc.). NOTE: For books, include ISBN numbers.<br/>REFERENCE BOOKS:<br/>Advanced Screenwriting, by: Linda Seger; ISBN: 1-87950-73-8<br/>Writing Short Films, by: Linda J. Cowgill; ISBN: 1-58065-063-5<br/>PLAYS TO READ:<br/>Antigone, by: Sophocles<br/>Hamlet and Macbeth, by: Shakespeare<br/>Rosmersholm, by: Henrik Ibsen<br/>The Visions of Simone Machard, by: Bertolt Brecht<br/>Death and the Maiden, by: Ariel Dorfman<br/>The Coffee Bar, by: Ali Salem; (will be circulated via Canvas.)<br/>FILMS:<br/>Z (1969) directed by: Costa-Gavras<br/>The Lion of Desert (1981) directed by: Moustapaha Akkad<br/>Sacco and Vanzetti (1971) directed by: Giuliano Montaldo<br/>Destiny (1997) directed by: Youssef Chahine <br/>Born on the Fourth of July (1989) directed by: Oliver Stone<br/>Across the Universe (2007), directed by: Julie Taymor"}, {"name": "Class Materials (Suggested)", "value": "Specify any materials suggested, but not required for this course.<br/>BOOKS:<br/>Screenplay, by: Syd Field<br/>An Anatomy of Drama, by: Martin Esslin<br/>Ten Film Classics, by: Edward Murray<br/>The Art of Dramatic Writing, by Lajos Egri<br/>EXTRA SUGGESTED FILMS:<br/>Seven Days in May (1964), dir. by: John Frankenheimer<br/>Viva Zapata (1952), dir. by: Elia Kazan<br/>Schindler's List (1993), dir. by: Steven Spielberg<br/>JFK (1991), dir. by: Oliver Stone<br/>Missing (1982), dir. by: Costa-Gavras<br/>Rosewater (2014), dir. by: Jon Stewart<br/>Salmon Fishing in the Yemen (2011), dir. by: Lasse Hallstrom<br/>A Time to Kill (1996), dir. by: Joel Schumacher<br/>Vantage Point (2008), dir. by: Pete Travis<br/>Death and the Maiden (1994) directed by: Roman Polanski"}, {"name": "Class Notes", "value": "What else would you like students to know about this course? <br/> The course structure will include lectures, viewing films and, possibly, clips of features and short films, reading assignments of some chosen dramatic works, discussions in-class after viewing and reading and in-class workshop on students' projects. Above all, the students will be encouraged to research certain realistic stories about all sorts of injustice and persecution in their own environments and also through international stories based on research. <br/>Writing assignments are arranged to reflect a writer's creative abilities and the process of writing, starting with premises and culminating in completion of approximately the first 30 pages and a synopsis/outline for the remainder of a full length feature film, play or TV script. A complete work of approximately 30 pages may also be developed in consultation with instructor. The class will meet once a week and range between theoretical and practical aspects. <br/><br/>Bio of Instructor: Riad Ismat wrote 7 television serials broadcast by many satellite TV stations in the Middle East and North Africa, besides 12 plays, 6 collections of short stories and several books of criticism. He served as Rector of the Syrian Academy of Dramatic Arts, Director General of State Radio &amp; Television, Ambassador and Minister of Culture, before he chose to leave Syria in 2012 to live in exile."}], "lmod": "4/3/16 7:23 PM (CT)", "subject": "RTVF"}]