[{"class_mtg_info": [{"meet_t": "Th 6:00PM - 8:50PM", "meet_l": "Elder Hall 030 Seminar Room"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Spring 2016", "name": "37799", "title": "WCAS GEN_LA 280-6-30 Residence-Linked Seminar - VI (Literature and Fine Arts)", "class_attributes": "Permission of Instructor<br/><br/>", "section": "37799", "instructors": [{"instructor_phone": "", "instructor_name": "Freda Love Smith", "instructor_addr": ""}], "topic": "Table to Page: The Art and Culture of Food Writing", "course": "280-6", "descriptions": [{"name": "Overview of class", "value": "In this course we will study and practice multiple forms of food writing, including food memoir, critical restaurant reviews, recipe essays, and analyses of family and cultural foodways. Course will also include a hands-on culinary component and will utilize the kitchen in Elder R.C. for a cooking demonstration with a chef and for students to test recipes for the recipe essay assignment."}, {"name": "Learning Objectives", "value": "After taking this course, students should be able to show they can:<br/><ul><br/><li> Understand and appreciate food writing in historical, literary, social, and cultural context. </li><br/><li> Apply this understanding and appreciation to the production of multiple and varied pieces of food writing.</li><br/><li> Explore and analyze the cultural function of family foodways. </li><br/><li> Understand how the rising prestige of critical food writing contributed to major changes in American food habits.</li><br/><li> Understand the ways in which television, new media, and especially social media have transformed food writing. </li><br/><li> Analyze the recent explosion in popular food-based media.</li><br/><ul>"}, {"name": "Teaching Method", "value": "This course will be divided into four units: Family Foodways; Critical Reviews; The Recipe Essay; Food Memoir. Weekly reading assignments and bi-weekly film screenings will be assigned."}, {"name": "Evaluation Method", "value": "Each unit is organized around the production of a polished piece of writing. These four writing assignments will together comprise half the graded work for the course. Student engagement with readings and films will be assessed through a blend of short quizzes, response papers, and substantial in-class discussion."}], "lmod": "4/3/16 8:01 PM (CT)", "subject": "GEN_LA"}]