[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "Technological Institute M164"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: PRE-REG: Reserved for Biology Majors of any concentration.<br/><br/>Pre-requisite: Students must have completed either BIOL_SCI 215 or ENVR_SCI 202 and one course in Statistics to enroll in this course.", "qtr": "Spring 2017", "name": "33456", "title": "WCAS BIOL_SCI 347-0-20 Conservation Biology", "class_attributes": "Prerequisites apply, see description<br/><br/>", "section": "33456", "instructors": [{"instructor_phone": "847/491-5098", "instructor_name": "Joseph S Walsh", "instructor_addr": "Hogan Hall, Room 6-110A"}], "topic": "", "course": "347-0", "descriptions": [{"name": "Overview of class", "value": "Conservation biology is an integrated science based primarily on ecology, with important contributions from genetics, evolution, and biogeography, as well as nonbiological disciplines, including economics, politics and ethics. The first half of the course will: address the definitions, origins, and patterns of biological diversity; explore why the maintenance of biodiversity in natural (and unnatural) ecosystems is fundamentally important to the continued well-being of humans and other species; examine the context and causes of extinction. The second half of the course will deal with strategies and tactics for preventing or ameliorating the loss of biodiversity. Specific topics will include: the biology of small populations (including population viability analysis); the selection, design, and management of protected areas; ecological restoration; conservation design, legislation, and other higher-level strategies."}, {"name": "Registration Requirements", "value": "Prerequisites: BIO 215 or ENVR SCI 202; one statistics course"}, {"name": "Teaching Method", "value": "Two lectures per week. One Saturday or Sunday field trip in April or May."}, {"name": "Evaluation Method", "value": "Two midterm exams, a diversity analysis, a newspaper editorial, and a group project. There is one required full-day weekend field trip in April or May. Students will have a limited choice of dates."}, {"name": "Class Materials (Required)", "value": "Essentials of Conservation Biology, 5th Edition, Primack, Sinauer Associates, ISBN 087893-6408 (or 9780878936403). <br/><br/>Selected readings from the primary literature available online."}], "lmod": "2/12/17 6:50 PM (CT)", "subject": "BIOL_SCI"}]