[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Wirtz Center Ballroom"}], "school": "SoC", "overview_of_class": "When first creating movement for the stage, we tend to make pieces that are based on the articulation of space more than on the articulation of energy. Looking into a mirror or at other bodies, we put together movements that assemble the body's parts into interesting spatial designs. We then turn those designs into motion that is performed in a stationary position and/or while traveling through space. Using our eyes critically, we continue working on the piece by refining the spatial \"outside\" of its movements. <br/><br/>In this course, we use an energy-oriented approach to creating movement. The goal is to let both our kinesthetic sense and our emotional responses - what is felt \"inside\" the body - serve as the primary arbiters of the movement we make. <br/><br/>To help us produce movement that's charged with the energy felt in us, it helps to work with music that's similarly charged. For this course, that music includes pieces from any genre that communicates the energy of dynamically accented rhythms. First, we listen analytically to a chosen piece's rhythmic and dynamic elements. Then we focus on using percussively gesturing body parts to transform those musical elements into dynamically accented motion. <br/><br/>Since this approach to composition emphasizes working from what's felt more than from what's seen, it supports choreographing movement whose intention is to communicate an emotional state or an emotion-driven dramatic intention. Given this point of view, the approach can work effectively for character-driven dance, strongly written dramatic scenes from a play, sung-through scenes of musical theatre, and pieces of narrative-driven physical theatre.", "qtr": "Fall 2017", "name": "Advanced Choreographic Study", "title": "SoC DANCE 325-0-20 Advanced Choreographic Study", "lmod": "5/9/17 7:02 PM (CT)", "section": "20", "topic": "Choreographing Music", "course": "325-0", "enrl_requirement": "Enrollment Requirements: Pre-Registration is restricted to Dance Majors and Minors at this time. Registration will open to all undergraduates during the second week of regular registration.", "descriptions": [{"name": "Overview of class", "value": "When first creating movement for the stage, we tend to make pieces that are based on the articulation of space more than on the articulation of energy. Looking into a mirror or at other bodies, we put together movements that assemble the body's parts into interesting spatial designs. We then turn those designs into motion that is performed in a stationary position and/or while traveling through space. Using our eyes critically, we continue working on the piece by refining the spatial \"outside\" of its movements. <br/><br/>In this course, we use an energy-oriented approach to creating movement. The goal is to let both our kinesthetic sense and our emotional responses - what is felt \"inside\" the body - serve as the primary arbiters of the movement we make. <br/><br/>To help us produce movement that's charged with the energy felt in us, it helps to work with music that's similarly charged. For this course, that music includes pieces from any genre that communicates the energy of dynamically accented rhythms. First, we listen analytically to a chosen piece's rhythmic and dynamic elements. Then we focus on using percussively gesturing body parts to transform those musical elements into dynamically accented motion. <br/><br/>Since this approach to composition emphasizes working from what's felt more than from what's seen, it supports choreographing movement whose intention is to communicate an emotional state or an emotion-driven dramatic intention. Given this point of view, the approach can work effectively for character-driven dance, strongly written dramatic scenes from a play, sung-through scenes of musical theatre, and pieces of narrative-driven physical theatre."}, {"name": "Evaluation Method", "value": "Each choreographer is responsible for completing the following assignments: <br/><br/>1. Three solo studies. The three studies are created to pieces of music selected by the choreographer. Each piece of music represents a different genre, and each piece of music contains, throughout its duration or in sections of it, passages of dynamically accented rhythms. <br/>a. The first study is built by using any percussively performed movements, accompanied by the scat-singing voice, to rhythmically imitate the rhythms heard in a piece of music. A term sometimes used to describe this way of choreographing is music visualization. This study is both created and performed by the choreographer. <br/>b. The second study is built by using percussively gesturing hand movements, accompanied by the scat-singing voice, to create rhythms that contrast with those heard in the piece of music. Such rhythms can be referred to as counter- rhythms, cross-rhythms, or polyrhythms. This study is both created and performed by the choreographer. <br/>c. The third study builds into its compositional structure movement that, first, rhythmically imitates the dynamically accented rhythms heard in the music and, second, rhythmically contrasts with them. It uses percussively gesturing movements in the hands and the head, accompanied by the scat-singing voice. This study is created by the choreographer for another member of the class, who performs it. <br/><br/>2. Final project. Each choreographer creates a longer piece on another member or members of the class. (Students outside the class can also serve as cast members, schedules permitting.) The piece not only incorporates both types of rhythmic-dynamic responses to the chosen music; it is structured around an emotional state, or a character-driven or narrative-driven objective. <br/><br/>3. Readings and their written responses. Through the quarter, a chapter or essay from a book listed below is assigned. Students write a page or two that responds to a single thought in the reading - a thought that not only stirs the student intellectually but provokes more vulnerably personal reflections that address the challenges and pleasures experienced when creating from within. Starting in the second week, classes often begin with students discussing how a given reading relates to their choreographic process."}, {"name": "Class Materials (Suggested)", "value": "Anne Bogart, A Director Prepares. New York: Routledge (2001). Nicholas Carr, The Glass Cage. New York: W.W. Norton & Company, Inc. (2014). John Miller Chernoff, African Rhythm and African Sensibility. Chicago: University<br/>of Chicago Press (1979)<br/>Pema Chödrön, Taking The Leap. Boston: Shambala Publications, Inc. (2009). <br/>Louis Horst and Carroll Russell. Modern Dance Forms. Brooklyn: Dance Horizons<br/>(1961).<br/>Doris Humphrey, The Art of Making Dances. New York: Rinehart and Company<br/>(1959).<br/>Don Michael Randel, ed., The Harvard Dictionary of Music, Fourth Edition. Cambridge: Harvard University Press (2003). Rainer Maria Rilke, Letters to a Young Poet. New York: Vintage Books (1984). Sherry Turkle, Reclaiming Conversation: The Power of Talk in a Digital Age. New York: Penguin Press (2015)."}], "instructor": ["William Lewis   Siegenfeld"], "class_attributes": "No Freshmen<br/><br/>", "id": "16698", "subject": "DANCE"}]