[{"class_mtg_info": [{"meet_t": "Tu 6:15PM - 9:15PM", "meet_l": "Technological Institute L361"}], "school": "SCS", "overview_of_class": "In this course, students will gain an understanding of important topics in cell biology. We will discuss membrane structure and dynamics, cell signaling, cytoskeletal dynamics, cell division cycle, organelle structure and function, regulation of gene expression and cell-cell communication. A focus of the course will also be on understanding how experiments are designed and conducted. Students will gain experience with critical reading of primary scientific literature, learn the history of major discoveries in cell biology, and will be exposed to recent breakthroughs in modern cell biology and cell biology techniques.", "qtr": "Spring 2017", "name": "Advanced Cell Biology", "title": "SCS BIOL_SCI 315-CN-64 Advanced Cell Biology", "lmod": "2/22/17 6:41 PM (CT)", "section": "64", "instructors": [{"instructor_phone": "", "instructor_name": "Thomas A Volpe", "instructor_addr": ""}, {"instructor_phone": "847/491-5061", "instructor_name": "Michele M McDonough", "instructor_addr": "Hogan Hall, Room - 2-100"}], "topic": "", "course": "315-CN", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "In this course, students will gain an understanding of important topics in cell biology. We will discuss membrane structure and dynamics, cell signaling, cytoskeletal dynamics, cell division cycle, organelle structure and function, regulation of gene expression and cell-cell communication. A focus of the course will also be on understanding how experiments are designed and conducted. Students will gain experience with critical reading of primary scientific literature, learn the history of major discoveries in cell biology, and will be exposed to recent breakthroughs in modern cell biology and cell biology techniques."}, {"name": "Registration Requirements", "value": "BIOL SCI 216, or 219, or 210-C"}, {"name": "Learning Objectives", "value": "? Explain the importance of membrane function as well as the role of membrane lipids,<br/>protein components and membrane organization in eukaryotic cells.<br/>? Explain how cellular components are targeted and distributed to different regions and<br/>compartments of a cell.<br/>? Explain how different components of the cytoskeleton support a variety of cell<br/>functions, such as cell shape, division, movement, sensing the environment, and cell-cell<br/>communication.<br/>? Explain how cells send, receive, and respond to signals from their<br/>environment, including other cells.<br/>? Explain how cells coordinate and regulate cell division.<br/>? Explain how an imbalance or mutation in normal cell processes can lead to cancer and<br/>other disease states.<br/>? Explain how experimental approaches are used to learn about cellular activities and gain<br/>skills in interpreting and being critical of experimental results.<br/>? Read and understand the primary scientific literature, to keep abreast of major<br/>developments, and to synthesize and integrate this literature with the concepts<br/>discussed in class.<br/>? Develop skills in analytical thinking through problem based assignments and exams.<br/>? Integrate factual knowledge and problem solving skills."}, {"name": "Teaching Method", "value": "Primarily lecture based but will also include:<br/>Analysis of primary research papers<br/>Class participation<br/>Discussion<br/>Group work<br/>Online work<br/>Presentations<br/>Problem sets associated with primary articles<br/>Readings"}, {"name": "Evaluation Method", "value": "Class participation, quizzes, final exam, presentation, homework sets."}, {"name": "Class Materials (Required)", "value": "Texts and materials may include the following: Text book/ also PDFs of primary research articles<br/>provided via Canvas."}], "path": "/class-descriptions/4660/SCS/BIOL_SCI/315-CN/38090", "instructor": ["Thomas A Volpe", "Michele M McDonough"], "class_attributes": "", "id": "38090", "subject": "BIOL_SCI"}]