[{"class_mtg_info": [{"meet_t": "Tu 6:15PM - 9:15PM", "meet_l": "TBA"}], "school": "SCS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "27528", "title": "SCS ADVT 312-CN-14 Advertising: Intermediate Creative", "class_attributes": "", "section": "27528", "instructors": [{"instructor_phone": "", "instructor_name": "Christopher Michael Bruney", "instructor_addr": ""}], "topic": "", "course": "312-CN", "descriptions": [{"name": "Overview of class", "value": "In the ADVT 311, 312, 313 sequence, students interested in pursuing a career in advertising copywriting or art direction learn the skills needed to obtain positions in this highly competitive field. Students work with partners under the guidance of a team of creative professionals. At the end of the sequence, students should have an interview-ready portfolio. Students are also split into small groups and introduced to various applications they will need to succeed in the business. The basics of Photoshop, Illustrator, InDesign, Flash and Dreamweaver are covered. Periodically, advertising professionals lecture on other areas of the industry, including strategic planning, account management and commercial production. <br/><br/>In ADVT 312, you are be introduced to the most highly awarded work in all media - from award-winning print and TV to ambient/outdoor and online advertising. You also work on refining your ideas from the first quarter and be given opportunities to work on real world ad assignments. Separate sections give specific attention to students interested in art direction and copywriting. May not be audited. Enrollment is limited.<br/><br/>This course meets off-campus at DDB Chicago, 200 East Randolph, 40th floor, Chicago, 60601."}, {"name": "Registration Requirements", "value": "Prerequisite: ADVT 311"}, {"name": "Learning Objectives", "value": "Students will leave the sequence with a portfolio of work that is interview ready for getting a job in creative advertising as a copywriter or art director."}], "lmod": "12/24/16 6:49 PM (CT)", "subject": "ADVT"}]