[{"class_mtg_info": [{"meet_t": "We 3:30PM - 5:50PM", "meet_l": "Kresge 5531 Comp Lit. Sem. Rm."}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Spring 2017", "name": "33091", "title": "WCAS COMP_LIT 481-0-21 Studies in Literary Theory", "class_attributes": "", "section": "33091", "instructors": [{"instructor_phone": "847/491-5493", "instructor_name": "Christopher Paul Bush", "instructor_addr": "1860 S. Campus Drive, Crowe Hall #2-135"}], "topic": "", "course": "481-0", "descriptions": [{"name": "Overview of class", "value": "Bergsonism and Global Modernism<br/><br/>In the opening decades of the twentieth century, Henri Bergson was the most famous philosopher in the world. Although his early writings focused on debates about number (he was trained as a mathematician), space, and above all time, he later turned to such topics as evolution and the nature of life. His key terms were interpreted in wildly conflicting ways by different readers and rapidly became a central reference for not only philosophers, artists, and literary writers, but for many political thinkers as well.<br/><br/>This course explores the connections between Bergson as a philosopher of time, space, and life to some of the diverse Bergsonisms that evoked his philosophy to justify and energize their aesthetic and political agendas during the modernist period. After an introduction to Bergson's philosophical writings, we will concentrate on their uses in three different historical contexts: Parisian modernism of the interwar period (with a special emphasis on right-wing uses of Bergson); Japanese philosophy and cultural criticism from the same period; and writers associated with the négritude movement, from the late 1930s into the period of decolonization. Writers from the period may include Walter Benjamin, Wyndham Lewis, Nishida Kitaro, Kobayashi Hideo, Marcel Proust, Georges Sorel, and Léopold Senghor. Recent criticism may include Jimena Canales, Bachir Diagne, Mary Ann Doane, Donna Jones, and Stefan Tanaka."}, {"name": "Class Materials (Required)", "value": "The majority of readings will be provided as pdfs via Canvas, but the following books are required (in English or French):<br/><br/>Henri Bergson. Time and Free Will [0486417670]<br/>Henri Bergson. Creative Evolution. [0486400360]<br/>Henri Bergson. ?uvres. Tome 1. [2253131369]<br/>Bachir Diagne African Art as Philosophy: Senghor, Bergson and the Idea of Negritude [1906497893]"}, {"name": "Class Notes", "value": "There will be a reading assignment for the first meeting; students not registered for the course by then should contact the instructor for details."}], "lmod": "2/6/17 6:41 PM (CT)", "subject": "COMP_LIT"}]