[{"class_mtg_info": [{"meet_t": "Tu 2:00PM - 4:50PM", "meet_l": "ANTHRO Sem Rm 104 - 1810 Hinmn"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Graduate Students.", "qtr": "Spring 2017", "name": "32286", "title": "WCAS ANTHRO 490-0-21 Topics in Anthropology", "class_attributes": "", "section": "32286", "instructors": [{"instructor_phone": "847/467-1648", "instructor_name": "Mark William Hauser", "instructor_addr": "1812 Hinman Ave., Room #205, EV Campus"}], "topic": "Artifact and Text", "course": "490-0", "descriptions": [{"name": "Overview of class", "value": "This course is about colonialism as an ongoing process rather than a particular period of history. From this perspective, while the formal political institutions of colonialism had largely given way by the mid-twentieth century, the after-lives of this protracted history continue to be felt in economic, cultural, aesthetic, ecological and discursive domains. Many of the things that we take for granted as being part and parcel of our day-to-day worlds are the result of these centuries of interaction, so much so that we see them now as &quot;local&quot; rather than hailing from distant shores. This class will try to disentangle some of these long histories, and show how the world was created through these encounters. Slavery, the environment, trade, cultural transmission, the body and violence are a part of all of these stories, though in different ways. The course hopes to impart to students the overwhelmingly important role of these political constellations in forging human history, both in the centuries that have past and in our modern world."}, {"name": "Registration Requirements", "value": "Open to all graduate students. Advanced undergraduates require instructor consent"}, {"name": "Learning Objectives", "value": "The goal of this seminar will be to provide students with an evaluative treatment of the anthropological literature on Colonialism and a detailed examination of particular anthropological and archaeological case studies. The specific goals of the course are: 1) to provide a general understanding of decidedly varied features of Colonialism including process and repercussions, 2) to examine the different methodological contributions of anthropological disciplines exploring this topic specifically those framing the relationship between the documentary and material record, and 3) to frame a comparative approach which considers political and cultural processes of associated with Colonialism. While there is a broad anthropological engagement on this topic in many parts of the world, case studies will be drawn from the Caribbean and Latin America."}, {"name": "Evaluation Method", "value": "1) A research paper of approximately 15 pp (not including citations) on a topic of your choosing under the rubric of colonial encounters. You should consult with me before undertaking your study. (50% of grade)<br/>2) Each student will be asked to co-supervise a seminar with me once during the semester. As part of this task you will help prep the class by distributing a series of points of discussion to your classmates a day before your seminar session meets. (25% of grade)<br/>3) Class (25% of grade)"}, {"name": "Class Materials (Required)", "value": "? Cooper, Frederick 2005 Colonialism in Question: Theory, Knowledge, History. University of California <br/> Press, Berkeley. ISBN-13: 978-0520244146<br/>? Voss, Barbara 2008 The Archaeology of Ethnogenesis: Race and Sexuality in Colonial San Francisco,<br/> University of California Press, Berkeley. ISBN-13: 978-0813061252<br/>? Hauser, Mark 2013 An Archaeology of Black Markets: Local Ceramics and Economies in Eighteenth-<br/> Century Jamaica. University Press of Florida ISBN-13: 978-0813049021<br/>? Dawdy, Shannon 2009 Building the Devil's Empire: French Colonial New Orleans University of Chicago <br/> Press. ISBN-13: 978-0226138428"}], "lmod": "2/14/17 6:41 PM (CT)", "subject": "ANTHRO"}]