[{"school": "WCAS", "overview_of_class": "Prof. Jeffrey Rice &quot;Spectacular Protest&quot; Summer 2016<br/>Anti-establishment protest comes in many forms: at one end we might have candle light vigils, at the other end violent revolution. Somewhere in between is where most political protest occurs with demonstrations, grass root organizations, lobbying etc. But somewhere in this spectrum resides what I call &quot;Spectacular Protest&quot; by which I mean activities that use theatricality to ?capture' a moment leaving people to identify with the gesture of anti-establishment behavior. Examples may come from music (The Sex Pistols or Bob Dylan or Chance the Rapper), from art (Marcel Duchamp), from theater (Bertolt Brecht) or from new variations on political protest (the Yippies' nomination of a pig,?Pigasus' for President in 1968.)<br/>This class will be a discussion of these rather public and theatrical moments of protest and how they galvanize public space, even if for a brief moment of time. The more ambitious aspect of this class is to determine whether these moments of protest can rise above juvenilia or immature spectacle and result in social change. In other words, should we even call them &quot;political&quot;?<br/>The examples we will cover in the brief time we have are (briefly) the Dada movement after World War One, the Situationist Movement in the 1960s (with their reinvention of Marx to explain the commodity in advanced capitalism), 1968 both in Paris (&quot;Be Realistic, Demand the Impossible&quot;) and Chicago (&quot;Stop the War in Vietnam) and lastly, &quot;The Sex Pistols&quot; and Punk.", "name": "Special Topics in Political Science", "section": "26", "topic": "Spectacular Protest", "course": "390-0", "meeting_time": ["MoWe 6:00PM - 8:30PM"], "path": "/class-descriptions/4630/WCAS/POLI_SCI/390-0/40404", "instructor": ["Jeffrey   Rice"], "id": "40404", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "Africa remains the world's poorest continent. Despite renewed optimism in the recent years, the continent's overall economic performance is less than impressive and a source of animated debate both in academia and policy circles. After remarkable performance in the 1960s and the first half of 1970s, the continent suffered negative growth throughout the 1980s and the first half of the 1990s. Only a few countries managed to recover and return to the level of 1970 GDP per capita at the turn of the century. The first part of the course will analyze classical and alternative explanations to Africa's economic stagnation and underdevelopment. The second part will cover a range of responses and prescriptions, both orthodox and heterodox, to tackling growth stagnation and accelerating economic transformation.", "name": "Special Topics in Political Science", "section": "27", "topic": "Political Economy of Development in Africa", "course": "390-0", "meeting_time": ["TuTh 10:00AM - 12:30PM"], "path": "/class-descriptions/4630/WCAS/POLI_SCI/390-0/41678", "instructor": ["Moses   Khisa"], "id": "41678", "subject": "POLI_SCI"}]