[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Kresge 4531 MENA Seminar Rm"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "23094", "title": "WCAS ANTHRO 390-0-29 Topics In Anthropology", "class_attributes": "", "section": "23094", "instructors": [{"instructor_phone": "", "instructor_name": "Emrah   Yildiz", "instructor_addr": "Kresge Hall 4540"}], "topic": "Anthropology of Islam: Symbol, Discourse, Practice", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "This seminar is designed to analyze anthropological approaches to the study of Islam and Muslims in the MENA region and the Islamicate world. We will begin the course by critically revisiting the historical legacies that mediate contemporary debates on and representations of Muslims and Islam. We will explore what it means to take Islam as an object of anthropological analysis and the kinds of normative assumptions that underlie references to &quot;religion&quot; and &quot;tradition.&quot; Second, we will closely examine seminal interventions advanced by Ernst Gellner, Clifford Geertz and Michael Gilsenan before turning to Talal Asad's analysis of anthropological categories of religion and his attempts to reformulate the study of Islam as a discursive tradition. Situating these debates within the broader intellectual history of anthropological thought, we will then proceed to examine the analytical purchase of symbolic, discursive and practice-centered approaches in studies of Islam. In the second half of the course, we will shift our attention to more ethnographically grounded materials that explore Muslim engagements with, and responses to, various facets of modernity such as gender inequality, capitalist economics and neoliberalist development, religious minorities and the secular nation-state as well urban life and practices of leisure."}, {"name": "Registration Requirements", "value": "None. Some familiarity with MENA and/or anthropological theories and studies of religion will be helpful."}, {"name": "Teaching Method", "value": "Discussion"}, {"name": "Evaluation Method", "value": "Students will be evaluated on the basis of two 10-15 page papers (50%) and class participation (50%). Attendance and active participation are mandatory: unexcused absences will affect your grade, as will non-participation in discussion. <br/><br/>Class participation includes:<br/><br/>(1) Regular attendance and contribution to discussion (10%).<br/><br/>(2) Reading responses (25%): Please post responses of no more than 2 paragraphs to the online discussion board no later than midnight on the night prior to class in order to allow everyone else to read and reflect on them. You may skip two weeks of reading responses, so that in total there should be eight original posts over eight weeks for each student. <br/><br/>(3) Leading discussion (15%): You will be expected to speak for no more than 15 minutes during which you should offer critical assessment of the week's readings that link them to previous discussions, address the discussion board postings of your classmates, and pose some questions to the class to start off discussion."}, {"name": "Class Materials (Required)", "value": "Deeb, L &amp; Harb, M. 2013. Leisurely Islam: Negotiating Geography and Morality in Shi'ite South Beirut. Princeton, NJ: Princeton University Press. 9781400848560<br/><br/>Geertz, C. 1968. Islam Observed: Religious Development in Morocco and Indonesia. New Haven. Yale University Press. 9780226285115<br/><br/>Gilsenan, M. 1983. Recognizing Islam: Religion and Society in the Modern Arab World. New York. Pantheon Books. 9780394713328<br/><br/>Mahmood, S. 2016. Religious Difference in a Secular Age: A Minority Report. Princeton, NJ: Princeton University, 1-111.9780691153285"}], "lmod": "12/24/16 6:53 PM (CT)", "subject": "ANTHRO"}]