[{"school": "WCAS", "overview_of_class": "A recent proliferation of edited volumes, special journal issues, dissertations, and historical monographs in Atlantic history aim to show that the early modern Atlantic was overwhelmingly African, Iberian, and indigenous American. As the field is reoriented away from its conventional northern Atlantic focus, scholars studying Latin America, Africa, and Europe have been compelled to take note of the field's insights, contributions, and analytical frameworks. We will read some of the best examples of this turn in Atlantic history, an inherently comparative, transnational, transcultural, and oceanic approach to the past, with an eye toward prevailing trends, methodologies, and topics; major schools of study; and ongoing debates about chronology, scope, and concepts (empire, nation, subject, citizen, slavery, feudalism, capitalism, commodity, ecosystem, revolution). What is the current state of the field? In what ways is the recent scholarship most persuasive?", "name": "Topics in History", "section": "20", "location": "Harris Hall L40", "topic": "Atlantic Worlds", "course": "492-0", "meeting_time": ["Mo 10:00AM - 12:50PM"], "path": "/class-descriptions/4620/WCAS/HISTORY/492-0/33406", "instructor": ["Paul F Ramirez"], "class_attributes": "Graduate Students Only<br/><br/>", "id": "33406", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "Early modern and modern world history is a story of cultural, economic, and biological interchange. This seminar explores the various ways ideas, people, and things circulated between China and \"the West,\" (for our purposes, Europe and Great Britain, though we occasionally will to turn to the U.S.), from roughly 1500 to the mid-twentieth century. We will attempt to address three huge, complicated, questions: How did the West influence the emergence of modern China? How did the Chinese affect the transformation of the modern West? How did the cultural encounter between China and the West affect the course of world history? We will read some of the important new work that attempts to answer these questions. Students will then write a term paper on a particular issue of interest to them.", "name": "Topics in History", "section": "22", "location": "Harris Hall L40", "topic": "Global China", "course": "492-0", "meeting_time": ["Mo 3:00PM - 5:50PM"], "path": "/class-descriptions/4620/WCAS/HISTORY/492-0/33407", "instructor": ["Melissa A Macauley"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>Graduate Students Only<br/><br/>", "id": "33407", "subject": "HISTORY"}]