[{"class_mtg_info": [{"meet_t": "Tu 6:00PM - 9:00PM", "meet_l": "Meets in Non-General PurposeRm"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Spring 2016", "name": "37793", "title": "WCAS GEN_LA 280-3-21 Residence-Linked Seminar - III (Social &amp; Behavioral Sciences)", "class_attributes": "Permission of Instructor<br/><br/>", "section": "37793", "instructors": [{"instructor_phone": "", "instructor_name": "Alec M Klein", "instructor_addr": ""}], "topic": "Lifting the Veil on Wrongful Convictions Around th", "course": "280-3", "descriptions": [{"name": "Overview of class", "value": "Miscarriages of justices are no longer a theoretical consideration but now a known fact, given advances in technology, forensic science and investigative breakthroughs, and the question is: How many is too many? There have been 330 post-conviction DNA exonerations in the United States since 1989, and those individuals have served a staggering 4,510 estimated years for crimes they didn't commit. Twenty served time on death row. And there have been tens of thousands of cases where suspects were pursued until DNA proved they were innocent.<br/>In recent years, there has been heightened awareness in the media and the public consciousness about injustices unfolding throughout the United States: the Ferguson unrest last year. The Baltimore riots earlier this year. The James Blake arrest just months ago. Such flare ups no longer just occur on the edges of society; they're impacting communities everywhere as there's a growing understanding that injustices and stratification across all levels?call it what you will, the haves and have nots?is a crisis of human rights that touches all of us.<br/>Miscarriages of justice plague other nations, of course, though how many aren't known. A snapshot: In Japan, a man who was wrongly convicted of murder and sentenced to death in 1968 was freed in March 2014 after the courts questioned evidence that led to his conviction and ordered a retrial. In the Netherlands, two men were freed in November 2013 after a forensics expert proved they couldn't have committed the murder. In France, a man who was convicted of murder in 1989 and sentenced to life in prison was granted a new trial in light of new evidence in the case and acquitted in 2002.<br/>This is one of the great problems of our times: Wrongful convictions, injustices and the concomitant issue, prison overcrowding. The United States owns the highest prison population rate in the world with 716 inmates per 100,000 people.<br/>Worldwide, more than 10.2 million people are locked up?and nearly half of those people are imprisoned in the United States, Russia or China. Meanwhile, prison population rates have been rising in Africa, the Americas, Asia, Europe and Oceania. In the past 15 years, the world prison population rate has risen about 6 percent."}, {"name": "Learning Objectives", "value": "<ul><br/><li> Identify several of the causes of wrongful convictions, such as misidentification of suspects and false confessions. </li><br/><li> Assess the prevalence of the problem in countries throughout the world.</li><br/><li> Examine the impact of wrongful convictions on society in terms of the cost economically, via taxes and other expenditures, and socially, as it relate to the safety and welfare of our communities, and the toll in years lost to those who were wrongfully convicted. </li><br/><li> Analyze solutions to ameliorate the problem of wrongful convictions and reforms to public policy in the criminal justice system. </li><br/></ul>"}, {"name": "Teaching Method", "value": "Course will be structured as a discussion, with occasional short presentations from students and the instructor."}, {"name": "Evaluation Method", "value": "Students will be evaluated on the following: Participation in student- and instructor-led discussions (20%); Four research papers (each 20%), accompanied by a student-led presentations and discussions."}], "lmod": "4/3/16 8:01 PM (CT)", "subject": "GEN_LA"}]