[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "Harris Hall 107"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "33833", "title": "WCAS ENVR_POL 390-0-22 Special Topics in Environmental Policy and Culture", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "33833", "instructors": [{"instructor_phone": "847/491-8985", "instructor_name": "Kimberly Ruggles Marion Suiseeya", "instructor_addr": ""}], "topic": "U.S. Environmental Politics", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "This course considers the political, economic, ethical, legal, and institutional issues involved in environmental decision-making. Drawing from both domestic and international cases, with an emphasis on the US, we will consider the formation and implementation of different environmental policies across a range of topics, which may include natural resources, coastal and marine resources, endangered species, air and water pollution, energy, climate change, sustainable development, hazardous waste, toxics, and environmental justice. The course is designed to give students an understanding of important conceptual issues in environmental policy-making, as well as an overview of core policies related to the US and internationally. Requirements include active class participation, short assignments and quizzes, and midterm and final examinations."}, {"name": "Learning Objectives", "value": "1. Students should become familiar with several different approaches to solving public policy problems, including their strengths and weaknesses. 2. Students should gain a basic understanding of core policies related to environmental problems, in the U.S. and internationally. 3. Students should gain a basic understanding of different views on several crucial debates in environmental policy today, including: a. Are there &quot;limits to growth&quot;? b. What are the causes and solutions of the &quot;Tragedy of the Commons&quot;? c. What is the proper role of markets vs. regulation in solving environmental problems? d. What is the proper role of the public and scientists in environmental policy making? e. How should environmental policymakers deal with scientific uncertainty or complexity in addressing important environmental challenges? 4. Students will hone writing and analytical skills to effectively communicate their ideas, opinions, and arguments on a variety of environmental policy topics."}, {"name": "Teaching Method", "value": "Interactive lecture"}, {"name": "Evaluation Method", "value": "short written assignments, midterm, and final exam"}, {"name": "Class Materials (Required)", "value": "Layzer, Judith. The Environmental Case: Translating Values Into Policy, 3rd edition, ISBN: 978-1604266122 Rosenbaum, Walter. Environmental Politics and Policy, 10th edition. ISBN 978-1506345376"}], "lmod": "2/16/17 6:46 PM (CT)", "subject": "ENVR_POL"}]