[{"class_mtg_info": [{"meet_t": "MoWeFr 2:00PM - 2:50PM", "meet_l": "Technological Institute LG52"}], "school": "WCAS", "overview_of_class": "This course will use magic tricks, illusion, and deception to discuss the rarely explored but often surprisingly flexible boundaries of what is physically possible. The topics to be considered include: discerning the skills of the performer versus concealed science; the identification of unconscious assumptions; mathematical, statistical, geometrical, and classical mechanical effects that challenge intuition; phenomena involving metamaterials, complex systems, and chaos; physics of optical illusions, levitation, and cloaking; effects in fluid dynamical, electromagnetic, and quantum mechanical systems; misconceptions and apparent paradoxes.", "qtr": "Fall 2017", "name": "Physics of Magic", "title": "WCAS PHYSICS 335-0-20 Physics of Magic", "lmod": "5/14/17 6:55 PM (CT)", "section": "20", "topic": "", "course": "335-0", "enrl_requirement": "Enrollment Requirements: Reserved for students outside the School of Engineering. Engineering students can register for this section with permission from the department.", "descriptions": [{"name": "Overview of class", "value": "This course will use magic tricks, illusion, and deception to discuss the rarely explored but often surprisingly flexible boundaries of what is physically possible. The topics to be considered include: discerning the skills of the performer versus concealed science; the identification of unconscious assumptions; mathematical, statistical, geometrical, and classical mechanical effects that challenge intuition; phenomena involving metamaterials, complex systems, and chaos; physics of optical illusions, levitation, and cloaking; effects in fluid dynamical, electromagnetic, and quantum mechanical systems; misconceptions and apparent paradoxes."}, {"name": "Registration Requirements", "value": "Prerequisites- The course will have as prerequisites familiarity with single-variable calculus and one quarter of a first-year general physics sequence: Physics 135, Physics 125, or Physics 130."}, {"name": "Learning Objectives", "value": "Students will become familiar with an important class of phenomena not discussed in other non-major courses, will develop the ability to identify those phenomena at work in a variety of contexts, will broaden their physical intuition, and will develop problem-solving skills to explain observations qualitatively even when quantitative analysis is not possible. As a byproduct, the course may help demystify unexplained phenomena and raise awareness of fringe science. Finally, it is expected that non-major students will improve their ability to incorporate scientific methods in their professional activities, even if they are not planning to work in STEM fields."}, {"name": "Teaching Method", "value": "There will be three class meetings per week. The classes will consist of interactive lectures led by the instructor, which will use extensively videos of recorded demonstrations, a selection of tabletop demonstrations, and real-time student participation."}, {"name": "Evaluation Method", "value": "Student evaluation will be based mainly on projects, homework assignments, and class presentations focused on formulating hypotheses and devising demonstrations to explain unknown effects. The course will also involve close student-instructor interaction and benefit from peer evaluation to encourage students to engage in the projects being developed by their colleagues."}, {"name": "Class Materials (Required)", "value": "None"}], "instructor": ["Adilson E Motter"], "class_attributes": "", "id": "13281", "subject": "PHYSICS"}]