[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "Parkes Hall 223"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-registration - Reserved for English students.", "qtr": "Spring 2017", "name": "33291", "title": "WCAS ENGLISH 366-0-20 Studies in African American Literature", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "33291", "instructors": [{"instructor_phone": "", "instructor_name": "Shaundra J Myers", "instructor_addr": ""}], "topic": "African American Narrative Departures", "course": "366-0", "descriptions": [{"name": "Overview of class", "value": "What happens when African American identity travels? This course will examine the multiple meanings and consequences of mobility in African American literature and culture since 1954. We will focus on depictions of departure, border-crossing, and relocation in the context of latter-20th-century discourses of national belonging, racial performance, class mobility, and gender transgression. While paying attention to the elimination of the most conspicuous dimensions of the color line in the decades following the Brown v. Board of Education ruling in 1954, we will also examine the less visible constraints that have characterized the post-civil rights era. Interested in the ways in which identity is forged through mobility, we will trace in the novel, short story, performance, and autobiography?as well as hybrid forms of these genres?representations of the shifting locations of African American identity across national, diasporic, and global spaces."}, {"name": "Teaching Method", "value": "Seminar discussion."}, {"name": "Evaluation Method", "value": "A Canvas posting and informal presentation of discussion responses are required for most classes; 2 papers, occasional quizzes, formal presentation, graded participation, and attendance."}, {"name": "Class Materials (Required)", "value": "Readings may include works by Richard Wright, Malcolm X, James Baldwin, Audre Lorde, Toni Morrison, Andrea Lee, James Alan McPherson, John Edgar Wideman, John Keene, and Edwidge Danticat. Critical and theoretical work will supplement our primary texts."}], "lmod": "2/8/17 6:42 PM (CT)", "subject": "ENGLISH"}]