[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Parkes Hall 215"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "24046", "title": "WCAS PORT 380-0-1 Contemporary Brazil: Literature and Film", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "24046", "instructors": [{"instructor_phone": "", "instructor_name": "Cesar A Braga-Pinto", "instructor_addr": ""}], "topic": "The documentary tradition in Brazilian literature", "course": "380-0", "descriptions": [{"name": "Overview of class", "value": "This course will explore selected themes and aesthetic trends in Brazilian literature and film (but mostly film) produced in the 21st century. We will be particularly interested in discussing how in the last decade both literature and film have blurred the boundaries between fiction and documentary, with an increasing emphasis on social and historical issues. We will first pay close attention to the key moments of social realism in the literature of the 20th century. We will then trace the development of documentary film making, particularly after the 1990's. Although we will pay some attention to film techniques, our major concern will be with narrative strategies and ideological content. There will be intense viewing of (subtitled) Brazilian films. Class discussion in a seminar format. Among the films, we plan to see Barren Lives; The Hour of the Star; City of God; Playing; News from a personal war; Santiago ;Bus 174 Estamira; Wasteland; 5 X Favela. We will also read short novel, among which The Hour of the Star, by Clarice Lispector. (trans. Benjamin Moser)"}, {"name": "Learning Objectives", "value": "By the end of the class, students will be expected to have:<br/>- increased their knowledge on road narratives in film<br/>- reflected upon Brazilian road movies in comparison to other travel narratives<br/>- learned more about contemporary Brazilian film as a whole<br/>- applied their acquired knowledge on a variety of written and oral tasks focused on film and film criticism"}, {"name": "Class Materials (Required)", "value": "- Brandellero, Sara (ed.). The Brazilian Road Movie - Journeys of Self Discovery. The University of Chicago Press, 2013. ISBN: 9780708325988<br/>-TBD (PDF files)"}, {"name": "Class Materials (Suggested)", "value": "Cohan, Steven &amp; Hark, Ina Rae (org.). The Road Movie Book. London/New York: Routledge, 2007. <br/>ISBN-13: 978-0415149372 <br/><br/>Johnson, Randal &amp; Stam, Robert (ed.). Brazilian cinema. Rutherford : Fairleigh Dickinson University Press, 1982.<br/>ISBN-13: 978-0231102674 <br/>Laderman, David. Driving Visions - Exploring the Road Movie. University of Texas Press, 2002. <br/>ISBN: 978-0-292-74732-6<br/>Nagib, Lucia. Brazil on the Screen. London: I. B. Tauris, 2007.<br/>ISBN-13: 978-1845113285 <br/>-. The New Brazilian Cinema. London: I. B. Tauris, 2003.<br/>ISBN-13: 978-1860649288 <br/>Shaw, Lisa. Brazilian National Cinema New York: Routledge, 2007. <br/><br/>ISBN-13: 978-0415338165"}, {"name": "Class Notes", "value": "- Students will be required to watch one to two full feature films per week on their own. Group screenings may be scheduled. <br/>- Required films will be on reserve."}], "lmod": "1/9/16 6:52 PM (CT)", "subject": "PORT"}]