[{"class_mtg_info": [{"meet_t": "MoWeFr 10:00AM - 10:50AM", "meet_l": "Technological Institute AUD"}], "school": "TGS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "37191", "title": "TGS DATA_SCI 423-0-1 Machine Learning: Foundations, Applications, and Algorithms", "class_attributes": "", "section": "37191", "instructors": [{"instructor_phone": "", "instructor_name": "Aggelos K Katsaggelos", "instructor_addr": ""}], "topic": "", "course": "423-0", "descriptions": [{"name": "Overview of class", "value": "From robotics, speech recognition, and analytics to finance and social network analysis, machine learning has become one of the most useful set of scientific tools of our age. With this course we want to bring interested students and researchers from a wide array of disciplines up to speed on the power and wide applicability of machine learning. The ultimate aim of the course is to equip you with all the modelling and optimization tools you'll need in order to formulate and solve problems of interest in a machine learning framework. We hope to help build these skills through lectures and reading materials which introduce machine learning in the context of its many applications, as well as by describing in a detailed but user-friendly manner the modern techniques from nonlinear optimization used to solve them. In addition to a well curated collection of reference materials, registered students will receive a draft of a forthcoming manuscript authored by the instructors on machine learning to use as class notes.<br/><br/>This course counts towards the AI breadth requirement for both undergraduate and graduate students. Students may receive credit for both this course and EECS 349.<br/>Course is crosslisted with Data_Sci 423"}, {"name": "Registration Requirements", "value": "A thorough understanding of Linear Algebra and Vector Calculus (e.g., students should be able to easily compute gradients/Hessians of a multivariate function), as well as basic understanding of the Python or MATLAB/OCTAVE programming environments."}, {"name": "Learning Objectives", "value": "COURSE OUTLINE:<br/><br/>1. Introduction<br/>-What kinds of things can you build with machine learning tools?<br/>-How does machine learning work? The 5 minute elevator pitch edition<br/>-Predictive models - our basic building blocks<br/>-Feature design and learning - what makes things distinct?<br/>-Numerical optimization - the workhorse of machine learning<br/><br/>2. Fundamentals of numerical optimization<br/>-Calculus defined optimality<br/>-Using calculus to build useful algorithms<br/>-Gradient descent<br/>-Newton's method<br/><br/>3.Regression<br/>-Linear regression - applications in climate science, feature selection, compression, neuroscience, and marketing<br/>-Knowledge-driven feature design for regression<br/>-Nonlinear regression<br/>-The L-2 regularizer<br/><br/>4.Classification<br/>-The perceptron<br/>-Logistic regression/Support Vector Machines<br/>-Multiclass classification<br/>-Knowledge driven feature design for classification- examples from computer vision (object/face detection and recognition), text mining, and speech recognition<br/><br/>5. Probabilistic Formulation <br/><br/>Regression<br/>-Bayesian linear regression<br/>-Non-linear regression<br/>-Sparse linear regression<br/><br/>Classification<br/>-Bayesian logistic regression<br/>-Non-linear logistic regression<br/>-Boosting<br/><br/>6. Feature learning<br/>-Function approximation and bases of features<br/>-Feed-forward neural network bases, deep learning, and kernels<br/>-Cross-validation<br/><br/>7. Special topics<br/>-Step length determination for gradient methods<br/>-Advanced gradient descent schemes: stochastic gradient descent and momentum<br/>-Dimension reduction: K-means clustering and Principal Component Analysis"}, {"name": "Teaching Method", "value": "Weekly problem sets will be assigned and graded. Homeworks will be assigned on Fridays and will be due the following Friday. Late homeworks will not be accepted.<br/><br/>Final grades for the course will be based entirely on homework assignment grades.<br/><br/>Up to 1 percentage point of extra credit can be earned by the first student to report a particular error found in the class text. Additional extra credit points will be considered for constructive suggestions for improving the text."}, {"name": "Evaluation Method", "value": "There are no exams in this course."}, {"name": "Class Materials (Required)", "value": "J. Watt, R. Borhani, and A. K. Katsaggelos, Machine Learning Refined: Foundations, Algorithms, and Applications, Cambridge University Press, 2016."}], "lmod": "2/13/17 6:40 PM (CT)", "subject": "DATA_SCI"}]