[{"school": "WCAS", "overview_of_class": "\"Kafka, His Critics and the role of the Reader\"<br/>The seminar will be evenly divided between readings of certain texts of Kafka and and of some of his more influence critics. Wherever possible, critical readings will be related to specific Kafka texts, even where they are more general in character. The fascination of the authorial name - Kafka - will be juxtaposed to the complexity of the texts themselves, especially the narrative texts, on which the emphasis will be placed. Texts to be read include (the list is not exhaustive): 1. Kafka: Cares of a House Father; 2. The Hunter Gracchus; 3. Josefine, Songstress of the People of Mice; 4. \"The Great Theater of Oklahama (sic!),\" from The Man Who Disappeared (aka America); 5. Before the Law (and its insertion in The Trial). Critics to be read include: W. Benjamin (in connection with The Theater of Oklahama), Th. Adorno (The Castle), J. Derrida (Before the Law), M. Blanchot, Deleuze-Guattari. Students will be asked to make short presentations of readings, as well as a term paper.", "name": "Studies in Literary Theory", "section": "20", "location": "Kresge 3354 German Seminar Rm.", "topic": "Kafka and his Critics", "course": "481-0", "meeting_time": ["Tu 2:00PM - 4:50PM"], "path": "/class-descriptions/4660/WCAS/COMP_LIT/481-0/33090", "instructor": ["Samuel   Weber"], "class_attributes": "", "id": "33090", "subject": "COMP_LIT"}, {"school": "WCAS", "overview_of_class": "Bergsonism and Global Modernism<br/><br/>In the opening decades of the twentieth century, Henri Bergson was the most famous philosopher in the world. Although his early writings focused on debates about number (he was trained as a mathematician), space, and above all time, he later turned to such topics as evolution and the nature of life. His key terms were interpreted in wildly conflicting ways by different readers and rapidly became a central reference for not only philosophers, artists, and literary writers, but for many political thinkers as well.<br/><br/>This course explores the connections between Bergson as a philosopher of time, space, and life to some of the diverse Bergsonisms that evoked his philosophy to justify and energize their aesthetic and political agendas during the modernist period. After an introduction to Bergson's philosophical writings, we will concentrate on their uses in three different historical contexts: Parisian modernism of the interwar period (with a special emphasis on right-wing uses of Bergson); Japanese philosophy and cultural criticism from the same period; and writers associated with the négritude movement, from the late 1930s into the period of decolonization. Writers from the period may include Walter Benjamin, Wyndham Lewis, Nishida Kitaro, Kobayashi Hideo, Marcel Proust, Georges Sorel, and Léopold Senghor. Recent criticism may include Jimena Canales, Bachir Diagne, Mary Ann Doane, Donna Jones, and Stefan Tanaka.", "name": "Studies in Literary Theory", "section": "21", "location": "Kresge 5531 Comp Lit. Sem. Rm.", "topic": "", "course": "481-0", "meeting_time": ["We 3:30PM - 5:50PM"], "path": "/class-descriptions/4660/WCAS/COMP_LIT/481-0/33091", "instructor": ["Christopher Paul Bush"], "class_attributes": "", "id": "33091", "subject": "COMP_LIT"}, {"school": "WCAS", "overview_of_class": "Biopolitics After Foucault<br/><br/>This is an interdisciplinary course, drawing on literatures grounded in contemporary French philosophy ? the mid- period work of Michel Foucault ? and its ongoing impact on race, gender and sexuality studies. It considers the contemporary legacy of Michel Foucault in these domains with a focus on figures including Achille Mbembe, Jasbir Puar, Wendy Brown, Judith Butler, Ann Stoler, Lauren Berlant, Sharon Holland, and Alex Weheliye Participants will spend about the first section of the course reviewing Foucault's College de France lectures from 1973- 1979. We will track their impact on the development within post-Foucauldian biopolitics of the concepts of necropolitics, thanatopolitics, and reproductive biopolitics, giving attention on the one hand, to the role within these fields of critiques of Foucault by Esposito and Agamben, and new understandings of the reproductive biopoliticization of both gender and race . In light of the increasing focus in the field of post-Foucauldian theory of necropolitics and thanatopolitics, the courses ends with a focus on a number of new directions after Foucauldian biopolitics: such as vitalism, utopianism, futurism, the reconfiguration of life, or alternatively, the \"anti-social thesis.\"", "name": "Studies in Literary Theory", "section": "22", "location": "Kresge 3438 Philosophy Sem. Rm", "topic": "", "course": "481-0", "meeting_time": ["Tu 6:00PM - 8:50PM"], "path": "/class-descriptions/4660/WCAS/COMP_LIT/481-0/33092", "instructor": ["Penelope L Deutscher"], "class_attributes": "", "id": "33092", "subject": "COMP_LIT"}]