[{"class_mtg_info": [{"meet_t": "We 9:00AM - 11:50AM", "meet_l": "Annie May Swift Hall 109"}], "school": "SoC", "enrl_requirement": "Enrollment Requirements: Reserved for Graduate Students.", "qtr": "Winter 2016", "name": "22331", "title": "SoC RTVF 443-0-20 Advanced Seminar in Film &amp; Video", "class_attributes": "", "section": "22331", "instructors": [{"instructor_phone": "", "instructor_name": "Jacob Arnaud Smith", "instructor_addr": ""}], "topic": "Sound Studies", "course": "443-0", "descriptions": [{"name": "Overview of class", "value": "This course will take a cultural and historical approach to auditory experience, and so serve as an introduction to the field of Sound Studies: the analysis of sonic practices and the discourses and institutions that shape and describe them. Sound Studies is defined by its interdisciplinary nature, and over the course of the quarter we will encounter work on popular music, the cinematic soundtrack, the history of sound technologies, the experience of listening, the social politics of the voice, and the sonic dimension of the lived environment. Though much of our emphasis will be on intersections of sound and popular forms of media, we will also have occasion to consider various forms of sound technology, sound art, and sound performance. The turn towards sound in humanities research has the potential to decenter dominant modes of thinking as well as to recover aspects of history and experience now forgotten or obscured. Inspired by that potential, we will consider questions such as: What methodologies best enable the study of sound? How can we write a history of auditory experience? How has listening changed in the era of modern media? How can we understand the ethical dimensions of listening? How are sounds combined with mediated images and bodies? What is the relationship between the voice and identity? How might a focus on sound facilitate new encounters with the lived environment and its human and nonhuman inhabitants?"}, {"name": "Evaluation Method", "value": "The main requirement of the course is a seminar paper of 15-20 pages in length. In addition, students will turn in several short response papers, as well as a short written report on an academic journal that addresses the topic of sound.<br/><br/> <br/>The required texts:<br/> <br/>Karin Bijsterveld et al, Sound and Safe<br/><br/>Michel Chion, Audio-Vision<br/><br/>Kate Lacey, Listening Publics<br/><br/>David Novak and Matt Sakakeeny eds, Keywords in Sound<br/><br/>Jonathan Sterne, The Audible Past<br/><br/>Emily Thompson, The Soundscape of Modernity<br/><br/> <br/>A Course Reading Pack is also required, and can be purchased at Quartet Copies."}], "lmod": "1/9/16 6:39 PM (CT)", "subject": "RTVF"}]