[{"class_mtg_info": [{"meet_t": "TuTh 1:00PM - 2:50PM", "meet_l": "Block Pick-Laudati Auditorium"}], "school": "SoC", "enrl_requirement": "Enrollment Requirements: Registration is reserved for Radio/TV/Film majors who have taken RTVF 190-0 and are of sophomore, junior, or senior standing.", "qtr": "Spring 2017", "name": "34654", "title": "SoC RTVF 379-0-20 Topics in Film/Video/Audio Production", "class_attributes": "Prerequisites apply, see description<br/><br/>", "section": "34654", "instructors": [{"instructor_phone": "", "instructor_name": "Spencer W Parsons", "instructor_addr": ""}], "topic": "True Crime Production", "course": "379-0", "descriptions": [{"name": "Overview of class", "value": "RTVF 379 True Crime Production<br/>Description: TV documentaries such as Making a Murderer, podcasts such as Serial and Crimetown, and dramatic series like The People vs OJ Simpson, have brought new attention, popularity, and prestige to &quot;True Crime,&quot; a traditionally disreputable genre at the perilous intersection of journalism, activism, and exploitation. In this course, we will examine the production practices, storytelling forms, and the ethical problems of True Crime through the examination of major film/television/podcast works, and the production of original works based on actual events, whether in cinematic or audio form. NOTE: this class will count as an elective for the Acting for Screen Module.<br/> <br/>Learning objectives: demonstrating technical skills in audiovisual storytelling; engaging in practical critique of storytelling structure and ethics, with particular attention to point of view and inclusion/selection/omission of relevant details in stories taken from actual events, whether as documentary or drama.<br/> <br/>Evaluation method: Class participation; in-class presentations; and execution of an audio or audiovisual work based on actual events; for students taking this as an Acting for Screen Elective, performance in an audiovisual piece created for the class will be evaluated.<br/> <br/>Class Materials: In Cold Blood by Truman Capote. Vintage 1994. ISBN 0679745580; The Philosophy of Horror, Thomas Fahy, Ed. University of Kentucky Press 2012. ISBN 0813136555; Media production expendables necessary for completion of dramatic or documentary project, should include hard drive for your media."}], "lmod": "2/19/17 6:41 PM (CT)", "subject": "RTVF"}]