[{"school": "WCAS", "overview_of_class": "Applied Geographic Information Systems II is a follow-up to Applied Geographic Information Systems and assumes an intermediate level of proficiency in using the professional standard in GIS software?ArcGIS?. This course builds on Applied GIS by introducing students to more sophisticated methods in raster processing, multi-dimensional data analysis, network analysis, and geostatistics. By working with LiDAR, differential GPS, and remote sensing datasets, student will learn how to optimize visualization and analysis of large geospatial datasets. Students will also learn how to automate their geospatial analysis workflow using Model Builder and Python scripting. These skills will be introduced in the context of exemplar problems in climate science, hydrology, geochemistry, and ecology.", "name": "Special Topics in Earth and Planetary Science", "section": "01", "location": "Technological Institute MG51", "topic": "GIS II", "course": "390-0", "meeting_time": ["TuTh 3:30PM - 6:00PM"], "path": "/class-descriptions/4620/WCAS/EARTH/390-0/37160", "instructor": ["Matthew William Rossi"], "class_attributes": "", "id": "37160", "subject": "EARTH"}, {"school": "WCAS", "overview_of_class": "Earth's surface is the interface among the atmosphere, hydrosphere, biosphere, and lithosphere. It is in this relatively thin ?skin' of the Earth where we harvest our crops, store our drinking water, and build our homes. Therefore, quantitative understanding of the physics and chemistry of the surface and shallow subsurface is important at both human (e.g., natural hazards, water resource availability) and geologic (e.g., mountain building) timescales. This course will introduce the basic principles of climate science and watershed hydrology to enable students to interpret the form and function of hillslopes and river channels. Implications of process-based understanding will be extended to the mountain range scale by examining the pace and pattern of tectonically-driven landscape evolution observed in natural landscapes. Students will also be introduced to modern methods for measuring erosion and deposition rates including sediment and solute budget approaches, cosmogenic radionuclide dating, and low-temperature thermochronology. My teaching philosophy is to have students apply concepts introduced in lectures through extended group projects where they learn the fundamentals of making careful field observations, analyzing time-series data, processing remotely sensed data in a Geographic Information System (GIS), and testing theory against observations using analytical and numerical models. No prior experience in these techniques is expected.", "name": "Special Topics in Earth and Planetary Science", "section": "02", "location": "Technological Institute F391", "topic": "Geomorphology", "course": "390-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4620/WCAS/EARTH/390-0/37161", "instructor": ["Matthew William Rossi"], "class_attributes": "", "id": "37161", "subject": "EARTH"}]