[{"school": "SoC", "overview_of_class": "This course explores various trajectories and developments in the general area of media, communication and the environment, with a particular focus on the upcoming national, state, and local 2016 elections in relation to concepts such as nature, the environment, and climate change. Students will complete a research project equivalent to a 20-page written paper, as is consistent with the CS 394 requirement. Potential topics include looking at the uses of media and communication by individual candidates in talking about the environment and climate change; how political parties build their media campaigns around environment and climate change; the impact of these eco-media and communication issues on a national, state, or local election, and similar. The instructor will work with each student to develop a topic for research, and the class will also provide an introduction and overview to ways in which environmental concepts can be approached and understood from the perspectives of media and communication studies.", "name": "Communication Studies Research Seminar", "section": "20", "topic": "Eco-Media: 2016 Elections", "course": "394-0", "meeting_time": ["Th 3:00PM - 5:50PM"], "path": "/class-descriptions/4620/SoC/COMM_ST/394-0/35265", "instructor": ["James J Schwoch"], "id": "35265", "subject": "COMM_ST"}, {"school": "SoC", "overview_of_class": "In the era of proliferation of on-line media and increased accessibility of information from all around the globe, the question of media censorship is as important as it has ever been. Has Internet made state censorship obsolete, or has it just changed the way it works? Are on-line technologies allowing us to access more, or curtailing our worldview through endless commercial filtering and tailoring?<br/> <br/>In this course, we will examine how new communication technologies change the dynamics between the censors and the censored, dissecting such disparate cases as the on-line regulation by the Chinese government and &quot;Twitter revolution&quot; in the Middle East. We will also examine the cases when new technologies can themselves become a censoring mechanism, and read about &quot;filter bubble,&quot; &quot;echo chamber,&quot; and the effect of the new media metrics on journalistic production. Finally, we will discuss the gray area of journalistic self-censorship that is a concern for the countries with nascent democracies, and economic censorship, which does not spare even countries with established democratic societies, such as the United States.", "name": "Communication Studies Research Seminar", "section": "21", "topic": "The Sound of Silence. Censorship and the Global Me", "course": "394-0", "meeting_time": ["We 3:00PM - 5:50PM"], "path": "/class-descriptions/4620/SoC/COMM_ST/394-0/36737", "instructor": ["Elena   Rodina"], "id": "36737", "subject": "COMM_ST"}, {"school": "SoC", "overview_of_class": "Issues in the research of web-based humor. Can memes lead to political change? Are American jokes the &quot;secret agents of globalization&quot;? What can YouTube parodies teach us about gender and identity? From the earliest days of internet use, humor played a key role in content circulation. This course examines the role web-based humor plays in contemporary society as well as the key theories, fields, challenges and opportunities underlining internet humor research. We will explore different aspects related to digital humor by looking at its position in globalization processes, marketing campaigns, social transgression, political expression, and the performance of social identities. Using a combination of readings and writing exercises, students will develop an original research project addressing a question pertaining to the use, circulation, reception or expressive characteristics of online humor.", "name": "Communication Studies Research Seminar", "section": "22", "topic": "LOLs, Deconstructed", "course": "394-0", "meeting_time": ["Tu 3:00PM - 5:50PM"], "path": "/class-descriptions/4620/SoC/COMM_ST/394-0/36738", "instructor": ["Lillian Aviva Boxman"], "id": "36738", "subject": "COMM_ST"}, {"school": "SoC", "overview_of_class": "The alleged corruption and destruction of society by &quot;new&quot; technology. Materialism and obesity, mass murders and bullying, ADHD and aggressive behavior - What do these have in common? They are all social behaviors that, according to some, have been brought about or exacerbated by our new media environment. Such deviant behaviors give some people ample reason to fear digital and social media. But is technology to blame? We will grapple with this question as we use a historical perspective to investigate how our understanding of new media is socially shaped and, in turn, how new media might influence our social behavior. By examining empirical evidence, students will develop their own research-based argument about whether technology is good or evil, or somewhere in between.", "name": "Communication Studies Research Seminar", "section": "23", "topic": "Technopanic!", "course": "394-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4620/SoC/COMM_ST/394-0/36739", "instructor": ["Fashina Mira Alade"], "id": "36739", "subject": "COMM_ST"}, {"school": "SoC", "overview_of_class": "Artisans, Musicians &amp; Fashionistas Online: Creative Entrepreneurs in the Age of Disintermediation. <br/><br/>Popular narratives often laud Internet-based technologies, particularly Web 2.0 applications?blogs, social media, and video-streaming platforms?for providing new outlets for creative expression. Through processes of disintermediation, these tools provide an opportunity for creative entrepreneurs to achieve voice, recognition, and celebrity without the help of traditional gatekeepers. While it's true that people seeking to break into the creative industries leverage digital platforms to build an audience for their work, not all creative entrepreneurs achieve recognition or financial success. In this course, we will interrogate the promises of disintermediation by examining the history and present state of a variety of creative industries, drawing on primary sources, academic literature, and journalism. We will consult empirical research to identify who is most likely to benefit from the participatory opportunities digital media affords and under what conditions they may find success. A variety of written and oral exercises will culminate in production of a final paper, in which students will draw on their analysis of primary and secondary sources to describe and evaluate how a particular creative community or individual artist draws on digital technologies to build an audience for their work.", "name": "Communication Studies Research Seminar", "section": "24", "topic": "Creative Entrepreneurs Online", "course": "394-0", "meeting_time": ["Mo 9:00AM - 11:50AM"], "path": "/class-descriptions/4620/SoC/COMM_ST/394-0/37659", "instructor": ["Erin Flynn Klawitter"], "id": "37659", "subject": "COMM_ST"}]