[{"school": "WCAS", "overview_of_class": "Topic: Inarticulacy and Reasonable Commitments<br/><br/>Experiences of value play a central role in providing reasons for our normative commitments. It is more common to hold such commitments on the basis of experience than to embrace them simply because one is convinced by some argument. Love for another person on the basis of direct experience and appreciation of him is a paradigm example. The reasons that these experiences provide standardly outstrip any attempts to capture them in propositional form. We can thus have perfectly good reason to value what we do, while being uncriticizably incapable of saying what these reasons are. To the extent that we are thus inarticulate about our reasons they cannot be fully grasped independent of the experiences in question or fully communicated to others. This calls into question a methodological assumption that lies in the background of a great deal of practical philosophy: normative commitments should be based on reasons, and these reasons should be expressible as claims that could figure in a philosophical argument. According to this ideal, if we lack such reasons, we should revise or suspend our commitments. Rejecting the ideal has far reaching implications. It apparently places limits on the possibility of interpersonal justification in both personal and political contexts, and has related implications for the communication of values in moral education. We will consider instances of the phenomenon in question, ask how to make sense of the idea that experiences could ground our normative commitments, explore the relationship between the first person standpoint of agency and articulacy about reasons, and discuss some implications of rejecting the ideal of articulacy.", "name": "Seminar in Ethical Theory", "section": "20", "topic": "Inarticulacy &amp; Reasonable Commitments", "course": "460-0", "meeting_time": ["Mo 1:00PM - 4:00PM"], "path": "/class-descriptions/4620/WCAS/PHIL/460-0/31543", "instructor": ["Kyla Sue Ebels Duggan"], "id": "31543", "subject": "PHIL"}]