[{"class_mtg_info": [{"meet_t": "MoWe 9:30AM - 10:50AM", "meet_l": "Norris Center Big Ten Room 104"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores<br/>Add Consent: Department Consent Required<br/>Drop Consent: Department Consent Required<br/>", "qtr": "Fall 2016", "name": "12220", "title": "WCAS GNDR_ST 101-6-21 First-Year Seminar", "class_attributes": "", "section": "12220", "instructors": [{"instructor_phone": "847/491-4337", "instructor_name": "Jillana B Enteen", "instructor_addr": "1800 Sherman Ave. 4th floor"}], "topic": "The Politics of Public Space", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "Are public spaces inclusive? To explore this question, this course will combine theoretical and fictional readings and films, as well as examinations of particular physical spaces and NU archives. We will query the ways in which different members of the Northwestern university student body experience access to public spaces. By focusing on a particular student building on campus and examining the specificities of access (either the Northwestern Library or the Norris Student Center, tba), the course will cover such deeply-entrenched topics as gender, sexuality, sexual identification, race, class, religion, ethnicity, and ability. The goal of this course is to query how public spaces are politically experienced in non-uniform ways as well as recognize the constructed nature of the concept of &quot;public space.&quot; Our localized focus of a campus building will suggest broader ideas, rendering visible the vicissitudes of what constitutes publics and space that might be extended to multiple environments and settings."}, {"name": "Teaching Method", "value": "DiscussionField tripsLectureSeminarWriting assignments"}, {"name": "Evaluation Method", "value": "Class participationPapersPresentations: Group Presentations<br/>Writing assignments"}, {"name": "Class Materials (Required)", "value": "Taylor, Verta, et al. Feminist Frontiers. Ninth edition. New York: McGraw Hill, 2012. ISBN: 0078026628.<br/>Select readings on Canvas."}], "lmod": "10/30/16 7:05 PM (CT)", "subject": "GNDR_ST"}]