[{"school": "WCAS", "overview_of_class": "Scoring the Avant-Garde<br/><br/>In this course, students will examine Charlotte Moorman, a critical figure in the avant-garde movement, as well as her avant-garde network and art historical influence. Coordinated with A Feast of Astonishments: Charlotte Moorman and the Avant-Garde, 1960s-1980s at the Mary and Leigh Block Museum of Art, the class will study visual and performance artists such as Dick Higgins, composer La Monte Young, choreographer Ann Halprin, and architect Lawrence Halprin, who proposed that scores extend \"in all fields of human endeavor.\" Inspired by these figures and their works, and by the wide array of scores in Northwestern Library's John Cage Notations Collection, students will analyze the score as an independent graphic art object and a contingent, preparatory step toward a performance. While this course is primarily academic, and will involve close readings of art historical texts including Hannah Higgins's Fluxus Experience and Liz Kotz's Words To Be Looked At: Language in 1960s Art, it is also composed of an experiential component where students create and perform or present their own scores.", "name": "Special Topics in the Humanities", "section": "20", "location": "Harris Hall L05", "topic": "Scoring the Avant-Garde", "course": "370-6", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4610/WCAS/HUM/370-6/23414", "instructor": ["Amanda Jane Graham"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "23414", "subject": "HUM"}, {"school": "WCAS", "overview_of_class": "Imagining Immigrant America in the 21st Century<br/><br/>\"Give me your tired, your poor, your huddled masses yearning to be free.\" Those lines from Emma Lazarus' sonnet, \"The New Colossus,\" are well known to most Americans. Alongside the Statue of Liberty (on whose pedestal Lazarus' words are etched) and Ellis Island, they are often called upon by those seeking to point out that the United States is a nation of immigrants. However, popular discourse and policies regarding immigration to the United States have consistently vacillated between welcoming newcomers and rejecting \"the immigrant menace.\" Throughout the 19th and 20th centuries, while some groups of immigrants were depicted favorably as new Americans and offered important forms of support, others were vilified and marked as forever foreign. This course will explore contemporary immigration, particularly how immigrants and immigration processes are portrayed in the public sphere. We will use ethnographic work, fiction, autobiography, popular press accounts, politicians' campaign speeches, and film to understand the significance of particular narratives of immigrant America in the 21st century.", "name": "Special Topics in the Humanities", "section": "21", "location": "University Hall 018", "topic": "Imagining Immigrant America in the 21st Century", "course": "370-6", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4610/WCAS/HUM/370-6/23415", "instructor": ["Ana L Aparicio"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "23415", "subject": "HUM"}]