[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Parkes Hall 223"}], "school": "WCAS", "overview_of_class": "Romances promise the excitement of many of our favorite literary set pieces, from \"far off places and daring sword fights\" to \"magic spells and a prince in disguise!\"  De-familiarizing our contemporary notion of romantic fiction, this course examines the literary genre of romance in Renaissance England. Although Renaissance writers often disparaged and satirized the romance narrative tradition they inherited from their Medieval predecessors, romance was both a popular form of literature and a laboratory for innovation in late 16th and early 17th century England. The enchanted world of the romance, seemingly isolated from the real world, offers a vantage point for exploring pressing questions regarding the body politic, gender and sexuality, and national identity. Students will learn to navigate these questions as well as learn conventions of the genre - from epic quests and courtly love to knights errant and long lost siblings - and investigate its limitations as a category. Beginning with a brief background in the Medieval tradition of chivalric romance, we will go on to investigate the romance in Renaissance prose and drama, including a discussion of Shakespeare's later plays, which have been described (sometimes controversially) as romances.", "qtr": "Winter 2016", "name": "Studies in Renaissance Literature", "title": "WCAS ENGLISH 338-0-20 Studies in Renaissance Literature", "lmod": "1/9/16 6:47 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Whitney Blair Taylor", "instructor_addr": ""}], "topic": "Reading the Renaissance Romance", "course": "338-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Romances promise the excitement of many of our favorite literary set pieces, from &quot;far off places and daring sword fights&quot; to &quot;magic spells and a prince in disguise!&quot; De-familiarizing our contemporary notion of romantic fiction, this course examines the literary genre of romance in Renaissance England. Although Renaissance writers often disparaged and satirized the romance narrative tradition they inherited from their Medieval predecessors, romance was both a popular form of literature and a laboratory for innovation in late 16th and early 17th century England. The enchanted world of the romance, seemingly isolated from the real world, offers a vantage point for exploring pressing questions regarding the body politic, gender and sexuality, and national identity. Students will learn to navigate these questions as well as learn conventions of the genre - from epic quests and courtly love to knights errant and long lost siblings - and investigate its limitations as a category. Beginning with a brief background in the Medieval tradition of chivalric romance, we will go on to investigate the romance in Renaissance prose and drama, including a discussion of Shakespeare's later plays, which have been described (sometimes controversially) as romances."}, {"name": "Teaching Method", "value": "Discussion and some brief lectures."}, {"name": "Evaluation Method", "value": "Class participation, two essays, and short writing assignments."}, {"name": "Class Materials (Required)", "value": "Sir Gawain and the Green Knight and selections from Sir Thomas Malory's Le Morte d'Arthur, Thomas Lodge's Rosalynde, Philip Sidney's The Old Arcadia, and Mary Wroth's The Countesse of Mountgomeries Urania; we will conclude with two plays, John Fletcher's The Island Princess, and William Shakespeare's The Winter's Tale. We may also read translated selections from the Portuguese Renaissance romance, Maiden and Modest, by Bernardim Ribeiro."}], "path": "/class-descriptions/4610/WCAS/ENGLISH/338-0/25599", "instructor": ["Whitney Blair Taylor"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "25599", "subject": "ENGLISH"}]