[{"class_mtg_info": [{"meet_t": "MoTuWeThFr 12:00PM - 12:50PM", "meet_l": "University Library 5322"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Prerequisite: Students must have passed Chinese 111-2 with at least a C- or be placed in according to placement test results.<br/><br/>Prerequisite: Students must have passed Chinese 111-2 with at least a C- or be placed in according to placement test results.", "qtr": "Spring 2017", "name": "32494", "title": "WCAS CHINESE 111-3-23 Chinese I", "class_attributes": "", "section": "32494", "instructors": [{"instructor_phone": "847/467-4792", "instructor_name": "Wen-pin   Hsieh", "instructor_addr": "1880 Campus Drive, Kresge Hall, Office 4-536"}], "topic": "", "course": "111-3", "descriptions": [{"name": "Overview of class", "value": "This three-quarter sequence of beginning college level Chinese is designed for true beginners with no previous background in the language. This course is an introduction to Chinese, its basic grammar, pinyin system, vocabulary, usage, and the Chinese writing system. It also focuses on developing basic communicative skills and knowledge of the Chinese culture. There will be extensive student-oriented practice in pronunciation, conversations, listening comprehension, and sentence structures in class. Our goal is to lay the solid ground work for your study of Chinese whether you plan to have a concentration in Chinese or enroll merely to satisfy a language requirement. Upon satisfactory completion of the course, students are expected to reach Novice-High level of the ACTFL proficiency guidelines. (http://actflproficiencyguidelines2012.org)"}, {"name": "Registration Requirements", "value": "Except for Chinese 111-1, students must pass the preceding course with C- or above, or must be placed into the course by the departmental placement test."}, {"name": "Teaching Method", "value": "There will be extensive student-oriented practice in pronunciation, conversations, listening comprehension, and sentence structures in class. English will be used mainly for instruction on sentence structures and patterns. Interaction between instructor and among students will be in Chinese."}, {"name": "Evaluation Method", "value": "Attendance and participation <br/>Written assignments<br/>Dictations<br/>Oral quizzes<br/>Written quizzes<br/>Final exam"}, {"name": "Class Materials (Required)", "value": "Textbook and Workbook: Modern Chinese 1B Simplified Characters (second edition)<br/>Publisher: Better Chinese ISBN: 978-1-60603-578-8 (textbook) 978-1-60603-579-5 (workbook)<br/>Price:$59.95(textbook) $ 29.95(workbook)"}], "lmod": "2/8/17 6:41 PM (CT)", "subject": "CHINESE"}]