[{"school": "WCAS", "overview_of_class": "This course follows important trends of thought in the Romantic century (roughly the mid-18th to mid-19th century) as they traveled among Great Britain, the European continent, the Americas, and West Africa. Addressing such topics as the Gothic, anti-slavery discourse, transcendental philosophy, and the sciences and sentiments giving rise to new understandings of \"nature,\" we will approach the continuities and differences among recognizably Romantic ideas, as they appear in authors within and beyond the canon.", "name": "Reading World Literature", "section": "20", "location": "Harris Hall L28", "topic": "Transatlantic Romanticism", "course": "201-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4610/WCAS/COMP_LIT/201-0/23193", "instructor": ["Tristram Nash Wolff"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "23193", "subject": "COMP_LIT"}, {"school": "WCAS", "overview_of_class": "We tend to take the ways in which we express and experience love for granted, yet love?like most human activities?is culturally conditioned and contextually determined. In this course, we will read and discuss erotic poems stemming from four cultures widely different from ours?Ancient Egypt, Israel, Greece, and Rome?, including texts as different as the Biblical Song of Songs, homoerotic poems sung at drinking parties in Ancient Athens, and sophisticated love elegies addressed to mysterious and probably fictional Roman addressees. Topics to be considered include the representation of male and female bodies, the construction of gender roles, desire and sexuality, and the language and poetic images associated with love.", "name": "Reading World Literature", "section": "21", "location": "University Hall 122", "topic": "", "course": "201-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4610/WCAS/COMP_LIT/201-0/23194", "instructor": ["Marianne I Hopman"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "23194", "subject": "COMP_LIT"}]