[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "University Library 5746"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "33397", "title": "WCAS HISTORY 392-0-26 Topics In History", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "33397", "instructors": [{"instructor_phone": "847 4672692", "instructor_name": "Fredrik   Meiton", "instructor_addr": "Harris Hall 231"}], "topic": "Non-Western Science and Technology in the Modern W", "course": "392-0", "descriptions": [{"name": "Overview of class", "value": "According to science's own how-to handbook, the only means of critically examining science is science itself. In this course, we will take a different approach and start from the assumptions that the context of scientific inquiry influences its content, and that history provides us with essential tools for understanding science and its relation to society. This will not only shed light on the history of modern science and technology; it should also broaden our understanding of the world beyond. This is perhaps nowhere more important than in the modern histories of the non-Western world, places that have long been regarded as inferior precisely with reference to scientific and technological innovation. This course will explore how that dynamic has played itself out globally, as well as in local non-Western contexts. Among other things, we will explore the non-West's role as a &quot;living laboratory&quot; for western science, by sampling the rich European travel and research literature on Africa and Asia. The course will also consider local histories of science and technology from a range of indigenous perspectives, by reading Indian, African, and Middle Eastern scientists and intellectuals."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Class Materials (Required)", "value": "TENTATIVE READING LIST: <br/>Postcolonial Science and Technology Studies Reader, Sandra Harding, ed. (Durham, N.C.: Duke University Press, 2011)"}, {"name": "Class Notes", "value": "HISTORY AREA OF CONCENTRATION: Global History"}], "lmod": "4/3/16 8:04 PM (CT)", "subject": "HISTORY"}]