[{"class_mtg_info": [{"meet_t": "Tu 5:00PM - 8:00PM", "meet_l": "ANTHRO Sem Rm 104 - 1810 Hinmn"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Winter 2017", "name": "23063", "title": "WCAS ANTHRO 101-6-21 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "23063", "instructors": [{"instructor_phone": "847/491-4821", "instructor_name": "Micaela   di Leonardo", "instructor_addr": "1810 Hinman Ave., Room #210, EV Campus"}], "topic": "How The Other 99% Live", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "How the 99% Live: Inequalities in American Cities This course title refers both to the famous 1889 Jacob Riis photo-documentary on poverty in New York City, How the Other Half Lives, and to the slogans of the Occupy Wall Street protests of 2011 and of Black Lives Matter today. It does so to underline the return, over the past few decades, of the extreme levels of economic inequality in the United States characteristic of the late 19th and early 20th centuries. In this seminar, students will read about, discuss, write about, and thus gain the intellectual tools to evaluate past and present American urban inequalities-including not only class, but race/ethnicity, gender &amp; sexuality, nationality. We will read across several different academic disciplines and journalism to become familiar with key analytic concepts and methods, such as political economy, the Great Compression, urban regimes, ethnography. Using them, we will explore arenas of inequality: employment; urban space, housing, and neighborhoods; schooling, criminal justice, the public sphere. And we will also consider movements to ameliorate those inequalities."}, {"name": "Teaching Method", "value": "SeminarWe will run as a seminar, with everyone taking part in discussion each meeting."}, {"name": "Evaluation Method", "value": "There will be 3 writing assignments: 1. A 5pp evaluation and response to the first week's readings and discussions 2. A 7pp book (or group of articles) review 3. A 7pp essay on one arena of or angle into American urban inequalities, making use of seminar readings and your own research. Students will present their findings from papers 2&amp;3 in seminar. Evaluation will be 40% seminar contributions and reports; 60% papers #1=10%, #2=20%, and #3=30%."}, {"name": "Class Materials (Suggested)", "value": "A large course pack from Quartet Copies"}], "lmod": "12/29/16 6:53 PM (CT)", "subject": "ANTHRO"}]