[{"class_mtg_info": [{"meet_t": "MoTuWe 2:00PM - 2:50PM", "meet_l": "ISP Sem Rm 203 - 616 Noyes St"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: ISP Majors", "qtr": "Winter 2017", "name": "21154", "title": "WCAS BIOL_SCI 241-0-20 Biochemistry for ISP", "class_attributes": "ISP Students Only<br/><br/>", "section": "21154", "instructors": [{"instructor_phone": "847/467-2178", "instructor_name": "Vinzenz M Unger", "instructor_addr": "Silverman, 4-619"}], "associated_classes": [{"component": "DIS", "room": "Technological Institute L160", "meeting_time": "Th 10:00AM - 10:50AM"}], "topic": "", "course": "241-0", "descriptions": [{"name": "Overview of class", "value": "This class seeks to provide an introductory understanding of select topics in biochemistry, including the structure and function of macromolecules, biological transport and signaling, chemical logic of metabolic reactions and select cellular pathways. The course strongly emphasizes conceptual understanding and aims to develop and integrated understanding that allows students to apply their knowledge to solve complex problems."}, {"name": "Registration Requirements", "value": "General Chemistry 171, 172. Organic Chemistry Chem 212-1 ISP Standing,"}, {"name": "Teaching Method", "value": "The class meets on M/T/W. Lectures are accompanied by a discussion section that will be taught by the course instructor. Although registration for the discussion section is required, participation is voluntary. Discussions will serve (1) to introduce studying techniques that facilitate conceptual understanding and how to connect seemingly unrelated topics, (2) to practice critical thinking skills, and (3) to develop strategies how to exploit organic chemistry knowledge to understand metabolic processes. Complementing class and discussion groups, office hours will be held twice a week, and additional 1:1 meetings can be arranged with the instructor as needed. Students should expect this class to be immersive and highly interactive at times. Active participation is strongly encouraged."}, {"name": "Evaluation Method", "value": "One group assignment, 3 quizzes (in class), 1 midterm (in class) and 1 final exam. Students should not expect to see multiple choice type questions. Content of quizzes/exams will be cumulative throughout, testing proficiency through a combination of open questions in three categories: common knowledge base, conceptual understanding, and complex problem solving skills. To do well on these tests, it is essential that students are able to make connections between disparate pieces knowledge/class content, and to apply knowledge to unfamiliar new contexts.<br/>Grading is on an absolute scale that evaluates proficiency, not class rank. A breakdown of the grading metric will be provided.<br/>No P/N for this section"}, {"name": "Class Materials (Required)", "value": "All required class materials will be provided by the instructor."}, {"name": "Class Notes", "value": "A compilation of specific topics that students ideally would be familiar with at the beginning of the class will be emailed to all registered students by the end of November 2015.<br/><br/>No P/N for this section"}], "lmod": "12/29/16 6:54 PM (CT)", "subject": "BIOL_SCI"}]