[{"school": "WCAS", "overview_of_class": "Nanotechnology involves the creation and use of small structures at the nanometer scale. This length is around a thousand times less than the diameter of a human hair. The potential of new materials with superior properties has captured the imagination of popular science culture, which has resulted in books that described the use of carbon nanotubes for tethering a space elevator to earth as well as nano-bots repairing damaged human tissue. Currently, nanotechnology is part of a wide range of consumer products, from sunscreen to tennis balls to stain-resistant clothing. This seminar will cover all aspects of nanotechnology, from the science involved to ethics and safety considerations to potential applications. Students will have opportunities to explain an idea in nanoscience to a general audience, assess whether the interest and investment in nanoscience is justified, and propose future prospects for nanoscience based on the present state of research at Northwestern.", "name": "First-Year Seminar", "section": "04", "topic": "Hope & Hype of Nanotechnology", "course": "105-6", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4650/WCAS/CHEM/105-6/25113", "instructor": ["Teri Wang   Odom"], "id": "25113", "subject": "CHEM"}, {"school": "WCAS", "overview_of_class": "In this course we will read and discuss works on technical subjects written for a general audience with no special scientific training; the authors we'll be reading include Sam Kean, John McPhee, Don Norman, Richard Rhodes, Nate Silver and Lewis Thomas.<br/><br/>Although the course is not targeted exclusively to science majors, students enrolling in it should have enough of a background in the fundamental sciences to feel comfortable writing about technical topics.", "name": "First-Year Seminar", "section": "05", "topic": "Sci & Tech Writing for Lay Aud", "course": "105-6", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4650/WCAS/CHEM/105-6/25114", "instructor": ["Larry S Trzupek"], "id": "25114", "subject": "CHEM"}]