[{"class_mtg_info": [{"meet_t": "MoWe 4:00PM - 5:20PM", "meet_l": "Tech Institute Lecture Room 4"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-requisite: Students must have completed BIOL_SCI 215, BIOL_SCI 217, BIOL_SCI 219, BIOL_SCI 308 and 1 Statistics course to register for this course.", "qtr": "Winter 2017", "name": "21309", "title": "WCAS BIOL_SCI 341-0-20 Population Genetics", "class_attributes": "Prerequisites apply, see description<br/><br/>", "section": "21309", "instructors": [{"instructor_phone": "847/491-5098", "instructor_name": "Joseph S Walsh", "instructor_addr": "Hogan Hall, Room 6-110A"}], "topic": "", "course": "341-0", "descriptions": [{"name": "Overview of class", "value": "Change in the genetic composition of populations over time is the basis of evolution. The field of population genetics describes this genetic change, both as replacement of genes within populations, and as diversification among populations which can become species. This course reviews the dynamics of genetic variation in populations through evidence from natural history, experimentation, and theory. Topics include: natural selection, genetic drift, inbreeding, mutation, and geographic structure of populations, based on single-locus models, molecular sequences, and quantitative traits. More specialized topics such as sexual selection, kin and group selection, and the evolution of sexual reproduction and recombination will be included as time allows."}, {"name": "Registration Requirements", "value": "Prerequisites: Biological Sciences 215, 216, 217, 218; A course in statistics."}, {"name": "Teaching Method", "value": "Two lectures per week."}, {"name": "Evaluation Method", "value": "Four problem sets (approximately every other week), and two midterm examinations."}, {"name": "Class Materials (Required)", "value": "The required text is: Halliburton, R. 2004. Introduction to Population Genetics. First edition. Pearson/Prentice Hall. ISBN-10: 0130163805/ISBN-13: 9780130163806. Selected readings from the primary literature as time allows."}, {"name": "Class Notes", "value": "No P/N"}], "lmod": "12/24/16 6:54 PM (CT)", "subject": "BIOL_SCI"}]