[{"class_mtg_info": [{"meet_t": "Mo 11:00AM - 1:50PM", "meet_l": "Louis Hall 105"}], "school": "SoC", "enrl_requirement": "Enrollment Requirements: Registration is reserved for Radio/TV/Film majors who have taken RTVF 190-0 and are of sophomore, junior, or senior standing.", "qtr": "Spring 2017", "name": "34737", "title": "SoC RTVF 373-0-21 Topics in Sound", "class_attributes": "Prerequisites apply, see description<br/><br/>", "section": "34737", "instructors": [{"instructor_phone": "", "instructor_name": "Stephan Michael Moore", "instructor_addr": ""}], "topic": "John Cage's 'A Dip in the Lake'", "course": "373-0", "descriptions": [{"name": "Overview of class", "value": "Topics in Sound: John Cage's &quot;A Dip In The Lake&quot;<br/><br/>In 1978, John Cage applied chance operations to a map of the city of Chicago to identify 427 discrete locations within the city, organized into small groups to create a new, geographic score. Titled &quot;A Dip In the Lake&quot;, the piece is designated &quot;for listener(s) or performer(s) or record maker(s)&quot; but is lacking in any further performance instructions. In this class we will wrestle with what it means to realize such a composition. In the course of our exploration, we will both contribute recordings to, and draw source material from, a cumulative database of field recordings of the piece's identified sites. We will meet one of the organizers of the New Music America 1982 festival where the piece was premiered. We'll learn about John Cage and the music of the 20th Century Avant-Garde, as well as the geography of the city of Chicago and environs. Ultimately, we will try our hand at creating performances, recordings, and/or installation works that realize &quot;A Dip In The Lake&quot;.<br/><br/>Students will be evaluated on the basis of their participation in the class discussions, two class presentations, participation in the audio collection process, and a final project. A limited amount of funding will be available through the Dean's Fund for covering some production costs.<br/><br/>Prerequisite: RTVF 190 or the permission of the instructor."}], "lmod": "2/21/17 6:39 PM (CT)", "subject": "RTVF"}]