[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Kresge Centennial Hall 4-410"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores<br/>Add Consent: Department Consent Required<br/>Drop Consent: Department Consent Required<br/>", "qtr": "Fall 2016", "name": "14130", "title": "WCAS RELIGION 101-6-20 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "14130", "instructors": [{"instructor_phone": "847 4612620", "instructor_name": "J Michelle   Molina", "instructor_addr": "Crowe Hall, 4-142"}], "topic": "Tolerance: A History", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "Tolerance: A Global History.<br/><br/>In this course we will explore the ways that global Christianity laid the groundwork for European ideas about diversity and tolerance. The aim of the course is to understand how the historically contingent confrontations with religious diversity were foundational to, and indeed, shaped the terms of the development of modern assumptions not only about religious tolerance, but also about tolerance of cultural diversity broadly speaking. One of the primary learning goals for students is to 1) gain the skills to interpret primary texts in order to 2) understand how the category of &quot;religious&quot; difference, while not disappearing, eventually ceded primacy of place to notions of &quot;cultural&quot; and &quot;racial&quot; differences by the end of the first era of globalization such that 3) all of these terms became foundational to understandings about the nature of human diversity, not only in the era of the European Enlightenment (18th century) but also today, as we continue to fight our own &quot;culture wars&quot; about difference and diversity. <br/><br/><ln/>We will treat the European religious wars following the Reformation, but given that the primary aim of the course is to historicize the perceived possibilities and limits of &quot;tolerance&quot; in a global context, the bulk of the readings will demonstrate how ideas about human &quot;sameness&quot; and &quot;difference&quot; emerged from face-to-face encounters and conflicts in the first era of globalization. The course will foreground the entangled histories of early modern missionary encounters as the ground for working out ideas about how one ought to think about religious diversity in the global world and how modern ideas about tolerance emerged from early modern debates about what religious differences might be tolerated and which were &quot;idolatrous.&quot;<br/> <br/><ln/>Accordingly, the course takes as its starting point the history of European expansion into the Americas and Asia under the Iberian Empires in the 15th century. Christian explorers and missionaries evaluated &quot;difference&quot; in terms of &quot;idolatry&quot; and &quot;superstition.&quot; Idolatry was to be extirpated, but &quot;superstition&quot; led to the development of concepts about &quot;cultural differences&quot; that might be tolerated, laying the groundwork for what we think of today as &quot;cultural relativism.&quot; We will take up four case studies: 1) the New World controversies about the humanity of the Indians, best represented in the polemical writings of Bartolomé de las Casas, but treated in greater depth by Jesuit missionary and proto-ethnologist, Jose de Acosta, 2) the controversies about Jesuit missionary cultural &quot;accommodation&quot; in Asia (the Chinese and Malabar Rites controversies); and 3) the experiments with religious toleration at the Mughal court under the reign of Akbar. We will end with a discussion of how 4) these global encounters influenced the ideas found in Voltaire&#39;s <i>Treatise on Tolerance</i> and in John Locke&#39;s <i>A Letter Concerning Toleration</i>."}, {"name": "Class Materials (Required)", "value": "TBA."}], "lmod": "10/30/16 7:09 PM (CT)", "subject": "RELIGION"}]