[{"school": "WCAS", "overview_of_class": "This course will introduce students to methods used in psychological research. Through readings, lectures, discussion, and hands-on activities (specifically the handling of a statistics program used for data collection and analyses), students will learn about the scientific approach to research designs and about the analysis and interpretation of data. They will participate in novel research projects and will write a report on each in the style used by research psychologists.<br/><br/>Primary goals are for students to learn (1) testing hypotheses, including data collection and statistical analyses, (2) writing effectively about research plans and findings, and (3) critically evaluating psychological research done by other people.", "name": "Research Methods in Psychology", "section": "20", "topic": "", "course": "205-0", "meeting_time": ["MoWe 11:00AM - 12:20PM"], "path": "/class-descriptions/4650/WCAS/PSYCH/205-0/25402", "instructor": ["David H Uttal"], "id": "25402", "subject": "PSYCH"}, {"school": "WCAS", "overview_of_class": "This course provides an introduction to designing, conducting, evaluating, and presenting psychological research. Among the topics to be covered are: experimental and non-experimental research; statistical analyses; writing psychological reports; ethics in research; and utilizing library resources. Students will collect and analyze data for three research projects during the quarter, and write a report on each in the style used by research psychologists.", "name": "Research Methods in Psychology", "section": "21", "topic": "", "course": "205-0", "meeting_time": ["MoWe 9:30AM - 10:50AM"], "path": "/class-descriptions/4650/WCAS/PSYCH/205-0/25403", "instructor": ["Sylvia Patrice Perry"], "id": "25403", "subject": "PSYCH"}, {"school": "WCAS", "overview_of_class": "Psychology is the science of behavior and mind. As with any science, psychology begins with scientific questions that are translated into hypotheses, which are then tested with various research methods to provide evidence for or against a theory. Whether you are conducting a survey to test how extraversion relates to political affiliation or a neuroimaging experiment to test what neural pathways are involved in memory recall, it is important that your study be scientifically sound in its design and methodology. Without rigorously scientific research methods, we cannot make strong conclusions about data or anything in psychology, and much of what we know about our behaviors, thoughts, attitudes, and development would fall apart. Thus, this course is extremely important, because it will help you to critically and scientifically think about, develop, and actually test ideas in psychology.<br/><br/>In this course, we will take a hands-on approach to evaluating, designing, conducting, and presenting psychological research. We will learn how to critically read and write about psychology, translate research questions into testable hypotheses, design empirical studies to test those hypotheses, conduct the appropriate statistical analyses on the data collected, and write research papers that detail the results in the style used by research psychologists. By the end, you will have experience with every part of the research process and completed your own psychological studies as part of a group. Because this course is not content specific, the knowledge and skills that you learn can be applied to courses and research in all areas of psychology, and even all areas of science.", "name": "Research Methods in Psychology", "section": "22", "topic": "", "course": "205-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4650/WCAS/PSYCH/205-0/25404", "instructor": ["Kevin J Hsu", "Katherine Steffen Filip Damme"], "id": "25404", "subject": "PSYCH"}, {"school": "WCAS", "overview_of_class": "This course will introduce students to research methods in psychology. Through lecture and lab sections,<br/>students will learn about both research design and data analysis. This course will include several group research projects as well as individual written assignments. Primary goals for the course include (1) improvement of scientific writing, (2) development of skills in research design (experimental and nonexperimental), (3) learning basics of data analysis (using a statistical software package), and (4) development of critical thinking skills. By the end of the class students should be better able to conduct their own research and critically interpret the results of others' research.", "name": "Research Methods in Psychology", "section": "23", "topic": "", "course": "205-0", "meeting_time": ["Tu 12:30PM - 1:50PM", "Th 12:30PM - 1:50PM"], "path": "/class-descriptions/4650/WCAS/PSYCH/205-0/25405", "instructor": ["Christopher Ryan Schmader"], "id": "25405", "subject": "PSYCH"}]