[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "University Library 4722"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Winter 2016", "name": "25423", "title": "WCAS ENGLISH 101-6-26 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "25423", "instructors": [{"instructor_phone": "", "instructor_name": "Maha Zehra Jafri", "instructor_addr": ""}], "topic": "The Many Lives of Middlemarch", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "Hailed by many as one of the greatest novels every written, George Eliot's Middlemarch is the gripping story of ambition, idealism, love, and scandal in a Victorian provincial town. Through rich depictions of characters' daily lives and relationships, Middlemarch provides a sweeping perspective on the cultural forces that influence the fortunes of individuals and societies: politics, religion, economics, gender roles, scientific innovation, and more. It is also a book that asks big questions: As members of a community, what do we owe other people? How do we measure social progress? How can we make ethical choices? We will experience Middlemarch as its first audience did: in serial form, immersing ourselves in its vibrant fictional world over the course of several weeks. Treating Middlemarch as both an object of study and a hub for investigating broader historical and philosophical concerns, we will also undertake shorter supplemental readings tied to the novel's themes and Victorian cultural context. Students will have the opportunity to savor this literary classic, which sheds a dazzling light on the past as well as the present."}, {"name": "Teaching Method", "value": "Discussion"}, {"name": "Evaluation Method", "value": "Papers, class participation, Canvas posts, and brief oral presentations. Three papers (2-3 pages, 4-5 pages, and 6-8 pages) and weekly Canvas posts. Students will engage in a process of drafting and revision for each paper."}, {"name": "Class Materials (Required)", "value": "George Eliot, Middlemarch; assorted supplementary readings."}], "lmod": "1/9/16 6:46 PM (CT)", "subject": "ENGLISH"}]