[{"school": "WCAS", "overview_of_class": "If what we do affects others around the globe, how do we decide our obligations to each other, around the globe?  That question will animate this course.  We'll examine how global justice has been theorized and some ways it can be addressed in relation to such things as poverty, the environment and the consequences of colonialism.  We'll examine difficulties in the pivot from thinking of justice locally or nationally to thinking about it globally.  We'll explore these topics and questions in articles, book chapters and a few narratives (a short story, an autobiographical essay, possibly a play).", "name": "First-Year Seminar", "section": "20", "location": "University Hall 112", "topic": "Writing about Global Justice", "course": "105-6", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4660/WCAS/ENGLISH/105-6/35057", "instructor": ["James Richard O'Laughlin"], "class_attributes": "WCAS First-Year Seminar<br/><br/>Attendance at 1st class mandatory<br/><br/>", "id": "35057", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "This course examines the framing of crises in history, the media, politics, and public opinion. What are the stakes? Who are the stakeholders? Why and how does a sense of urgency upset some prevailing sense of normalcy? We will interrogate presentations of discrete events (like the Cuban Missile Crisis) and broader trends (like the Crisis in the Humanities) as a crisis of some kind. Students will co-construct a typology of crises to inform ongoing coursework. In addition, they will focus on how to write analytically about crises, whether real, imagined, or fabricated. Finally, students will conduct research into a \"crisis\" of their own choosing and communicate the findings and their significance via oral and written communication.", "name": "First-Year Seminar", "section": "21", "location": "Shepard Hall B08/B09", "topic": "Making Sense of Crises", "course": "105-6", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4660/WCAS/ENGLISH/105-6/35058", "instructor": ["Bradley S Zakarin"], "class_attributes": "WCAS First-Year Seminar<br/><br/>Attendance at 1st class mandatory<br/><br/>", "id": "35058", "subject": "ENGLISH"}]