[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Locy Hall 301"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "22405", "title": "WCAS ASIAN_LC 390-0-21 Advanced Topics in Asian Languages and Cultures", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "22405", "instructors": [{"instructor_phone": "847/491-3408", "instructor_name": "Laura E Hein", "instructor_addr": "Harris Hall - Room 325"}, {"instructor_phone": "847/467-0283", "instructor_name": "Patrick James Noonan", "instructor_addr": "Kresge Hall - Office 4-550"}], "associated_classes": [{"component": "DIS", "room": "TBA", "meeting_time": "TBA"}, {"component": "DIS", "room": "TBA", "meeting_time": "TBA"}, {"component": "DIS", "room": "TBA", "meeting_time": "TBA"}], "topic": "The Modern Japanese City", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "The Japanese city is the main site of Japanese modernity and of its contradictions. As in many other places with leaders determined to modernize quickly, the prewar Japanese government systematically stripped the countryside of resources in order to build and display the central institutions of a modern nation, most of which were in the cities. These developments recast Tokyo as the epitome of Japan's modern success in economic and political terms and as the site of its cultural and social disintegration. Tokyo and nearly all Japanese cities then were virtually leveled during World War II. After the war, the newly reconstructed cities became the central arenas for Japanese efforts to create democracy. <br/><br/>This co-taught course examines the cultural representations of the modern Japanese city from its construction to its destruction and then regeneration. We will study the ways Japanese transformed Tokyo into an imperial capital and then recast it as a space for new forms of political and social relationships after the war. Throughout its history, Tokyo has been Japan's central site for defining and redefining class and gender identities as well as participating in mass consumption. We will consider how authors and filmmakers represented individual and collective experiences of urban life and the ways that urban space shaped the very form and possibilities of life in modern Japan."}, {"name": "Learning Objectives", "value": "Students will: <br/>- learn to identify and apply the analytical techniques and central questions of cultural history, literary studies, and film studies. <br/>- understand how writers, filmmakers, and other artists responded to the modernization of urban space in Japan <br/>- how to analyze the relationship between aesthetic representation and urban space"}, {"name": "Teaching Method", "value": "Lectures and Discussion. <br/>A special feature will be an exhibit at the Chicago Art Institute and a film program at the Block Museum."}, {"name": "Evaluation Method", "value": "Attendance and Informed Participation in Discussion (lecture and section): 15%<br/>Short Paper A (visualization of urban space): 20% <br/>Short Paper B (representation of Tokyo in literature): 20%<br/>Short Paper C (photography exhibit or experimental films): 20%<br/>Final Paper 25%"}, {"name": "Class Materials (Required)", "value": "E. Taylor Atkins, Blue Nippon: Authenticating Jazz in Japan Paperback -? Duke University Press Books; 2001) ISBN-13: 978-0822327219<br/><br/>Takashi Fujitani, Splendid Monarchy: Power and Pageantry in Modern Japan ? University of California Press (1998) ISBN-13: 978-0520213715 paperback<br/>Sanshiro by Natsume Soseki (Author), Jay Rubin (Translator), ? Penguin Classics 2010) ISBN-13: 978-0140455625<br/>Shanghai: A Novel by Yokomitsu Riichi Dennis Washburn (Translator) ? Series: Michigan Monograph Series in Japanese Studies (Book 33) Paperback: 248 pages Publisher: U of M Center For Japanese Studies (June 18, 2001) ISBN-13: 978-1929280018<br/>Out by Kirino Natsuo (Author) Stephen Snyder (Translator), Vintage; Reprint Edition (2005) ISBN-13: 978-1400078370<br/> Additional Required Readings on Canvas"}], "lmod": "12/24/16 6:54 PM (CT)", "subject": "ASIAN_LC"}]