[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "University Library 4722"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-registration - Reserved for History &amp; International Studies students.", "qtr": "Spring 2017", "name": "34263", "title": "WCAS HISTORY 392-0-26 Topics In History", "class_attributes": "", "section": "34263", "instructors": [{"instructor_phone": "", "instructor_name": "Alexandra C. Thomas", "instructor_addr": ""}], "topic": "East and West in the Renaissance", "course": "392-0", "descriptions": [{"name": "Overview of class", "value": "This seminar will explore the role of non-European peoples and states in the history of the Renaissance, roughly 1300-1650. We will explore European perceptions of the world outside what is traditionally conceived of as Europe, and what impact the interpretations of and relationships with that world had on the early modern period. The seminar will analyze the relationship between Europe and the Ottoman Empire, and how ongoing conflict and coexistence with the Ottomans shaped the Renaissance worldview; we will also discuss the realities and the limits of a shared Mediterranean world. The course will also analyze the significance of the discovery of the New World and what it meant when Europe truly became part of a global system. Should the Ottoman Empire be included as part of the geographic, sociopolitical, and cultural entity traditionally known as Europe? What is the history behind the very concept of East and West, or East versus West as in the dangerous &quot;clash of civilizations&quot; thesis? Themes of empire, warfare, and religion (as well as religious conversion and slavery) will also be addressed, in addition to perceptions of &quot;the other&quot; from both sides of the Mediterranean Sea."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Participation, Weekly One Page Reading Responses or Canvas Submitted Discussion Questions, Two Short Papers (5 pgs. each), &amp; Final Essay (12-15 pgs.)"}, {"name": "Class Materials (Required)", "value": "Brian Levack, Edward Muir, Meredith Veldman, &amp; Michael Maas. The West: Encounters and Transformations (Pearson), Vol. B, 4th edition [selections]. 9780205987696.Bisaha, Nancy. Creating East and West: Renaissance Humanists and the Ottoman Turks. 9780812219760.David R. Blanks &amp; Michael Frassetto. Western Views of Islam in Medieval and Early Modern Europe: Perception of Other. 9781349416745. Bulliet, Richard. The Case for Islamo-Christian Civilization. 9780231127974.Bartolomé de Las Casas. A Short Account of the Destruction of the Indies. 9781539797722.Davis, Robert C. Holy War and Human Bondage: Tales of Christian-Muslim Slavery in the Early-Modern Mediterranean. 9780275989507.Davis, Natalie Zemon. Trickster Travels: A Sixteenth-Century Muslim Between Worlds. 9780809094356.Dursteler, Eric R. Venetians in Constantinople: Nation, Identity, and Coexistence in the Early Modern Mediterranean. 9780801891052.Goffman, Daniel. The Ottoman Empire and Early Modern Europe. 9780521459082.Lewis, Bernard. Cultures in Conflict: Christians, Muslims and Jews in the Age of Discovery. 9780195102833.Meserve, Margaret. Empires of Islam in Renaissance Historical Thought. 9780674026568.Pagden, Anthony. European Encounters with the New World. 9780300059502.<br/>Valensi, Lucette. The Birth of the Despot: Venice and the Sublime Porte. 9780801475436. *as well as some supplemental primary sources*"}], "lmod": "2/13/17 6:45 PM (CT)", "subject": "HISTORY"}]