[{"class_mtg_info": [{"meet_t": "MoTuWeThFr 12:00PM - 12:50PM", "meet_l": "University Hall 312"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Prerequisite: Students must have passed Korean 121-2 with at least a C- or  be placed in according to placement test results.<br/><br/>Prerequisite: Students must have passed Korean 121-2 with at least a C- or  be placed in according to placement test results.", "qtr": "Spring 2016", "name": "32057", "title": "WCAS KOREAN 121-3-20 Korean II", "class_attributes": "", "section": "32057", "instructors": [{"instructor_phone": "8474671323", "instructor_name": "Eunmi   Lee", "instructor_addr": "1800 Sherman, 5th Floor, Suite 5400, Office 5410"}], "topic": "", "course": "121-3", "descriptions": [{"name": "Overview of class", "value": "This is a year-long 2nd year Korean course for continuing students who finished Korean I or who have the equivalent proficiency. The course aims to further develop students' all-around communicative ability in speaking, reading, listening and writing to the Intermediate Mid level by the ACTFFL guideline and to have students achieve the competency in the skills of Communication, Comparisons and Cultures in conjunction with the National Standards."}, {"name": "Registration Requirements", "value": "Completion of 121-2 or a departmental placement test for Spring Quarter"}, {"name": "Teaching Method", "value": "Various communicative activities will be employed with the emphasis on developing three modes of communication: Interpersonal communication will be developed by handling uncomplicated communicative tasks and engaging in simple conversations; interpretive communication will be developed by understanding messages dealing with basic information; presentational communication will be developed by writing a narration and producing a short rehearsed oral presentation. Also, various kinds of reading and video materials will be provided to enhance students reading and understanding skill."}, {"name": "Evaluation Method", "value": "Grades will be given based on attendance and class participation, vocabulary quizzes, lesson tests, assignments, oral presentation and test, and final examination."}, {"name": "Class Materials (Required)", "value": "Integrated Korean (2nd edition): Intermediate 1 &amp; 2 (University of Hawaii Press) <br/> 978-0-8248-3650-4 &amp; 978-0-8248-3813-3<br/>Integrated Korean Workbook (2nd edition): Intermediate 1 &amp; 2 (University of Hawaii Press) 978-0-8248-3651-1 &amp; 978-0-8248-3867-6"}], "lmod": "4/3/16 8:10 PM (CT)", "subject": "KOREAN"}]