[{"class_mtg_info": [{"meet_t": "Th 2:00PM - 5:00PM", "meet_l": "Technological Institute A230"}], "school": "MEAS", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Spring 2016", "name": "37790", "title": "MEAS CIV_ENV 395-0-25 Special Topics in Civil and Environmental Engrg", "class_attributes": "", "section": "37790", "instructors": [{"instructor_phone": "847/467-3896", "instructor_name": "Elie   Rekhess", "instructor_addr": "Harris Hall 223"}, {"instructor_phone": "847/491-9902", "instructor_name": "Aaron   Packman", "instructor_addr": "2145 N. Sheridan / Tech A314"}], "topic": "Water in Israel and the Middle East: Geopolitical", "course": "395-0", "descriptions": [{"name": "Overview of class", "value": "The course will provide an overview of the climatic and geographical limitations on water availability in Israel and the Middle East, discuss ancient and modern societal responses to these limitations, and define opportunities for development of sustainable solutions for regional stability and prosperity."}, {"name": "Registration Requirements", "value": "Senior or graduate standing. Permission of instructor."}, {"name": "Learning Objectives", "value": "? Understand historical, current, and projected future regional water limitations in the Middle East.<br/>? Understand how the availability of water in the Middle East has shaped the development of civilizations<br/>? Identify challenges that the nascent state of Israel faced in developing water and land resources <br/>? Understand essential requirements for societal water security and water resources sustainability<br/>? Assess the role of water resource limitations in regional political instability and conflict<br/>? Assess the role of national water resource policies in regional political instability and conflict<br/>? Explore how the combination of regional resource limitations, regional geopolitics, and national policies has driven innovation in water technologies.<br/>? Understand the spectrum of technologies available to expand and extend water resources in Israel and the Middle East<br/>? Evaluate potential for development of combined social and technological solutions for long-term water sustainability in Israel and the Middle East<br/>? Evaluate potential for new and emerging technologies to improve water sustainability regionally and globally"}, {"name": "Teaching Method", "value": "Seminar-style course meeting one day per week, 2-5 pm on Thursdays"}], "lmod": "4/3/16 6:58 PM (CT)", "subject": "CIV_ENV"}]