[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "Annenberg Hall G21"}], "school": "WCAS", "overview_of_class": "Fundamentals of neuroanatomy, neurophysiology, and neuroscientific methods. Brain processes related to sensory processing, motor control, plasticity, and memory. Students will take a quiz and exams covering the content of the course, complete short writing assignments, and actively participate during lecture (using student response system technology).", "qtr": "Fall 2016", "name": "Introduction to Neuroscience", "title": "WCAS PSYCH 212-0-20 Introduction to Neuroscience", "lmod": "10/30/16 7:09 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Eric William Gobel", "instructor_addr": ""}], "topic": "", "course": "212-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Fundamentals of neuroanatomy, neurophysiology, and neuroscientific methods. Brain processes related to sensory processing, motor control, plasticity, and memory. Students will take a quiz and exams covering the content of the course, complete short writing assignments, and actively participate during lecture (using student response system technology)."}, {"name": "Registration Requirements", "value": "Prerequisite: PSCH 110<br/>A prior course in biology is strongly recommended, but not required."}, {"name": "Learning Objectives", "value": "By the end of the course, students will be able to:<br/>1. appreciate the field of neuroscience and its historical foundations <br/>2. identify the structures of the nervous system, especially the brain, and characterize their function (functional neuroanatomy)<br/>3. outline the anatomy of neurons and explain their physiology<br/>4. describe the methods of cognitive and behavioral neuroscience research<br/>5. summarize the chemistry of the nervous system and explain the effects of various psychoactive drugs<br/>6. describe the processes that occur during development of the nervous system<br/>7. explain the brain processes related to sensory processing, motor control, neural plasticity, and memory<br/>8. explain the biological basis of various neurological conditions, psychiatric disorders, and mental illnesses<br/>9. determine the location and cause of brain damage or neuropathology, given the impaired and preserved abilities of a neurological patient, and vice versa<br/>10. read, understand, and critically evaluate research about brain and behavior as reported in both the popular media and in academic journals<br/>11. discuss the contribution of various brain processes to everyday behavior"}, {"name": "Teaching Method", "value": "Case studies: Discussion of classic neuropsychology case studies<br/>Class participation: Clicker questions integrated into lecture<br/>Films / videos: Case studies often include video footage<br/>Lecture: Two 80-minute lectures weekly<br/>Online work: Online quiz and discussion/comments<br/>Readings: Textbook and supplementary readings (posted online)<br/>Writing assignments: Several short, informal writing assignments<br/>"}, {"name": "Evaluation Method", "value": "Class participation: Low-stakes clicker questions integrated into lecture<br/>Exam, final: During finals week<br/>Exam, mid-term: One midterm exam<br/>Quizzes: Administered online<br/>Writing assignments: Several short writing assignments<br/>"}, {"name": "Class Materials (Required)", "value": "Breedlove, S. M., &amp; Watson, N. V. (2013). Biological psychology: An introduction to behavioral, cognitive, and clinical neuroscience (7th ed.). Sunderland, MA: Sinauer Associates. ISBN: 978-0-87893-927-5 (hardcover), 978-1-60535-170-4 (looseleaf)."}], "path": "/class-descriptions/4640/WCAS/PSYCH/212-0/10186", "instructor": ["Eric William Gobel"], "class_attributes": "Natural Sciences Distro Area<br/><br/>Attendance at 1st class mandatory<br/><br/>Prerequisites apply, see description<br/><br/>", "id": "10186", "subject": "PSYCH"}]