[{"class_mtg_info": [{"meet_t": "MoWeFr 11:00AM - 11:50AM", "meet_l": "University Lib B183 - PC Lab"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "27419", "title": "WCAS SWAHILI 121-2-21 Swahili II", "class_attributes": "", "section": "27419", "instructors": [{"instructor_phone": "8474912765", "instructor_name": "Richard Marshall   Lepine", "instructor_addr": "Kresge 4-404 (via 4-400)"}], "topic": "", "course": "121-2", "descriptions": [{"name": "Overview of class", "value": "Continuation from Fall Swahili 121-1 of digital humanities/social science research and presentation projects using Swahili for scholarly comparative study of primary sources."}, {"name": "Registration Requirements", "value": "Swahili 121-1 or equivalent by placement of the instructor"}, {"name": "Learning Objectives", "value": "By the end of the course, students will be expected to demonstrate proficiency in Swahili at some point on the ACTFL Intermediate level (low, mid or high). Students should be competent in using digital research and presentation tools (including collaborative production and editing of LMS-based wiki pages) to the point that they can focus on Swahili-language research work rather than technical issues."}, {"name": "Teaching Method", "value": "In the classroom, focus on developing Swahili speaking/voice performance skills; demonstrations of research project components and digital tools needed for production; display and critique of LMS-based collaborative projects. Outside the classroom, detailed assessment of interim assignments and timely return of feedback for revision purposes."}, {"name": "Evaluation Method", "value": "Attendance, 10%; good-faith effort on interim projects, midterm comprehension exam, midterm revisable multimedia project, 50%; final comprehension exam, 10%; final multimedia comparative study, 30%."}, {"name": "Class Materials (Required)", "value": "&quot;Swahili Grammar and Workbook,&quot; by Fidèle Mpiranya, Routledge/Taylor &amp; Francis, 2014, ISBN-13: 9781138808263."}, {"name": "Class Notes", "value": "No P/N Option if used to satisfy WCAS or School foreign language proficiency requirement."}], "lmod": "1/9/16 6:54 PM (CT)", "subject": "SWAHILI"}]