[{"school": "WCAS", "overview_of_class": "Who owns the past? Why and for whom do we study the past? Archaeology is performed in a variety of political and economic settings and for a variety of reasons. In this class, we will examine the multiple stakeholders involved in the archaeological enterprise, and the often conflicting demands they place on archaeologists as academics and citizens, with the goal of developing tools and strategies that can improve diversity in the subfield and communication to non-academic groups. We will consider calls for diverse &quot;archaeologies&quot; which incorporate alternate models and experiences of the past, but sometimes challenge our basic notions about the field. We will also consider the responsibilities that archaeologists have to communities, and how we might envision future, collaborative community archaeologies. Finally, we will focus on the different publics at home and abroad that impact and consume archaeological research, and how we might better reach diverse audiences.", "name": "Topics in Anthropology", "section": "21", "topic": "Archaeol, Communities, Publics", "course": "490-0", "meeting_time": ["Tu 3:00PM - 5:00PM"], "path": "/class-descriptions/4620/WCAS/ANTHRO/490-0/31985", "instructor": ["Amanda Lee Logan"], "id": "31985", "subject": "ANTHRO"}, {"school": "WCAS", "overview_of_class": "Seminar in Political Anthropology: State &amp; Subject<br/><br/>This course examines theoretical and ethnographic approaches to the state, with a particular focus on the intersection of state projects and subject-making practices. Early declarations of the state's growing irrelevance in an era of globalization have proven to be grossly premature, as any migrant worker, prisoner, Palestinian struggling for statehood, South Sudanese celebrating statehood, or person in line at the Department of Motor Vehicles will tell you. Yet many questions abound. Is the nature of the state/subject relations changing with neoliberal globalization and if so, how? What might be similar across different state/subject formations, and what might be different - not only in this particular historical juncture but in previous ones as well? Do certain state/subject relations inhere in the very structure of the modern state and/or can we disrupt the universalist notion of the modern state as a Western form that takes &quot;alternative&quot; shape in different regions? How can we think about the state, both ethnographically and theoretically, in ways that do not always presume the state as an agent, a monolith, or a set of always coherent projects? What are the myriad ways that state projects shape particular subjects, and is this shaping always complete? What fissures appear and how? How do people engage or circumvent the state in their daily lives and in particular political struggles in ways that disrupt or collude with subject-making projects? Key themes to be explored include governmentality, sovereignty, citizenship, rights, materiality, space, and development. We will be especially concerned with understanding the current Foucauldian-inspired thinking on the state and try to think productively with and past it. Finally, we will continually ask how theory informs ethnography and vice-versa.", "name": "Topics in Anthropology", "section": "22", "topic": "State &amp; Subject", "course": "490-0", "meeting_time": ["Mo 6:00PM - 8:30PM"], "path": "/class-descriptions/4620/WCAS/ANTHRO/490-0/31986", "instructor": ["Jessica R Winegar"], "id": "31986", "subject": "ANTHRO"}]