[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "Kresge Centennial Hall 3-410"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "32725", "title": "WCAS CLASSICS 350-0-1 Greek and Latin Literature", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "32725", "instructors": [{"instructor_phone": "847/491-8361", "instructor_name": "Marianne I Hopman", "instructor_addr": "Kresge Hall 4361"}], "topic": "Wine, Love, &amp; Politics: Symposia in Ancient Greece", "course": "350-0", "descriptions": [{"name": "Overview of class", "value": "Classics 350 Greek and Latin Literature - Wine, love, and politics: symposia in ancient Greece, Spring 2017<br/><br/>What happened in ancient Greece when a group of male friends came together to drink, listen to music and dance, and discuss politics in an erotically charged atmosphere? Drinking-parties, or symposia, are one of the most important and best-documented contexts for the performance of culture ?visual and aural?in ancient Greece. In fact, many of the cultural products that have been transmitted from ancient Greece to contemporary times?songs, but also beautifully painted clay vessels?were originally performed or used in symposiastic contexts. In the first part of the course, students will explore a wide range of source materials (archaeology, vase-painting, and texts) that may be adduced to reconstruct the origins, practices, and ideologies of symposiac gatherings. They will also be exposed to, and learn to read critically, a set of scholarly articles on those questions. Thereafter we will read English translations of a selection of archaic and classical poets whose songs may have been performed at symposia, including Archilochus, Theognis, Anacreon, and Simonides."}, {"name": "Registration Requirements", "value": "Previous completion of a 200-level Classics course, or instructor's permission"}, {"name": "Learning Objectives", "value": "Understanding of a social practice that was central to the culture of ancient Greece.<br/>Ability to analyze and combine a variety of sources (archaeological, visual, literary) to reconstruct an ancient practice.<br/>Ability to understand and criticize secondary literature.<br/>Speaking, writing, and reading skills."}, {"name": "Teaching Method", "value": "Class participationDiscussionOnline workPresentationsWriting assignments"}, {"name": "Evaluation Method", "value": "AttendanceClass participationExam, finalPapersPresentationsReadings"}, {"name": "Class Materials (Required)", "value": "West, Martin, ed. 1993. Greek Lyric Poetry. Oxford. 9780199540396<br/><br/>Lissarrague, François. 1990. The aesthetics of the Greek Banquet: Images of Wine and Ritual. Princeton, NJ: Princeton Univ. Press. 9780691604053"}, {"name": "Class Notes", "value": "No P/N option"}], "lmod": "2/16/17 6:45 PM (CT)", "subject": "CLASSICS"}]