[{"class_mtg_info": [{"meet_t": "MoWe 9:00AM - 11:50AM", "meet_l": "640 Lincoln St Room 135"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-registration - Reserved for Art Theory &amp; Practice, &amp; Art History majors.", "qtr": "Spring 2017", "name": "35769", "title": "WCAS ART 390-0-20 Special Topics in Art", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "35769", "instructors": [{"instructor_phone": "", "instructor_name": "Philippa Ann Skotnes", "instructor_addr": ""}], "topic": "Framing the World", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "Longer Course Description<br/>FRAMING THE WORLD, and the Book<br/><br/>Since the beginnings of architecture, and later entrenched by the development first of the codex, and finally the camera, the rectangle has been the most powerful and pervasive device for the visual representation of the world and our multiple relationships within it. The rectangle frames what we see from our windows, on TV and movie screens, on our computers, our printed pages, our books, and our cell phones. It separates and unites us - across a table - from those with whom we communicate. It shapes long traditions of painting, it creates composition. Even when we are in rectangle-free environments: camping in the desert, walking through the mountains, gazing at the ocean from the beach, the photographs we take translate the things we have seen and determine, at least in part, our relationships with them. <br/><br/>This all-pervasive framing of the world is, in terms of human creativity, a relatively recent phenomenon. For twenty thousand years (and right up to the 1800s) the Bushmen of southern African engraved dolerite boulders and made paintings on rock surfaces unconstrained by the framing devices with which we are now so accustomed. In the Upper Palaeolithic in Europe, paintings appear to follow no conventions of composition familiar to us, and even where protruding rocks or the surfaces of the caves' interiors provide an outer limit of the paintings made on them, there is no certainty that these also limit conceptions of composition. Our frames create distance, separating us from things outside of our own construction, determining our relationship to the spaces we inhabit.<br/><br/>There is also an argument to be made that the codex (and its rectangular format), the early conveyer of religious and scientific knowledge to the world, helped define the nature of the modern museum. Here cabinets and displays follow the sequence of reading, reinforcing hierarchical and sequential forms of understanding science, history and art.<br/><br/>This course will look at the legacy of the rectangle as a tool to distance ourselves from, and to shape understanding of, the world around us. It will ask how the rectangle has created conceptions of composition, and will look at the book as both a part of this legacy, and as a means to disrupt it.<br/><br/>In this course you will be asked to address your immediate environment and your daily movement through it, and to compose a creative response to it -outside of the frame. As part of this we will look at the nature of the book, at artists' books, at the ?exploded' book, and produce work that takes these into account while also accommodating other earlier, pre-architectural ways of seeing and representing.<br/><br/>There will be a mix of talks, discussions and project responses. You will all be asked to make an artist's book that both engages with these ideas and disrupts them, calling into question the nature of the book itself. As part of this we will discuss the ways in which a book can be conceptualised and realized. Part of this will be a visit to the Field Museum, as a way of understanding a book as an act of curatorship.<br/><br/><br/>Some of the discussion topics:<br/><br/>Pre-architecture<br/>? Lascaux: composition and disorientation (SW France +- 15000 BCE)<br/>? The cave of Tuc d'Audoubert as a book (SW France +- 13000 BCE<br/>? Composing hilltop and sky: Springbokoog (undated central South Africa)<br/>? Composition of territory: Bushmanskloof (3500BCE Cederberg, South Africa<br/><br/>Post-architecture<br/>? Composing fragmentary remains: Buddhist Cave of the Ring Bearing Doves 5th century BCE (remains in Dahlem, Berlin)<br/>? The Roman mosaics of Ravenna and Piazza Armerina, The Long Passage as book 4th century (Sicily)<br/>? Composition from the knees, San Marco, cell paintings of Fra Angelico 15th century<br/><br/>Contemporary composing territory<br/>? The stolpersteine of Gunter Demnig: composing memorialization in post cold-war Germany 1996-present<br/>? Michael Heizer holes (1967-77)<br/>? Christo and Jeanne-Claude Running Fence 1976<br/>? Artists' books<br/><br/><br/><br/>Projects<br/><br/>The course will include two projects.<br/><br/>1. All students will make an artist's book that interrogates or disrupts both the nature of the book and the ways in which such a ?disrupted' book can address issues of composition and the relationships composition describes.<br/><br/>2. There will be a site visit to the Field Museum. All students will create a ?composition' within the museum. This could take the form of guided route, a site-specific sound track, a pamphlet or series of smaller works that encourage alternative engagements with the collections to those presented in the displays.<br/><br/>These may form separate projects or be a part of one larger project."}, {"name": "Registration Requirements", "value": "No prerequisites."}, {"name": "Learning Objectives", "value": "This course will assist students in looking at the legacy of the rectangle as a tool to distance ourselves from, and to shape understanding of, the world around us. It will ask how the rectangle has created conceptions of composition, and will look at the book as both a part of this legacy, and as a means to disrupt it.<br/>In this course you will be asked to address your immediate environment and your daily movement through it, and to compose a creative response to it -outside of the frame. As part of this we will look at the nature of the book, at artists' books, at the ?exploded' book, and produce work that takes these into account while also accommodating other earlier, pre-architectural ways of seeing and representing. The course will include a mix of talks, discussions and project responses. You will all be asked to make an artist's book that both engages with these ideas and disrupts them, calling into question the nature of the book itself. As part of this we will discuss the ways in which a book can be conceptualised and realized. There will be a visit to the Field Museum, as a way of understanding a book as an act of curatorship. Participation in all aspects of the course will be important."}, {"name": "Evaluation Method", "value": "Students will be evaluated on the basis of performance in class, the creativity and inventiveness of their ideas, ability to think outside the frame, and the success of their artist's book in expressing the aims of the course. The bulk of the mark will be comprised of the fieldwork response, and the artist's book, but preparation will also be rewarded"}], "lmod": "2/14/17 6:42 PM (CT)", "subject": "ART"}]