[{"class_mtg_info": [{"meet_t": "Mo 6:15PM - 9:15PM", "meet_l": "Kresge Centennial Hall 4-410"}], "school": "SCS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "18597", "title": "SCS ENGLISH 378-CN-62 Studies in American Literature:", "class_attributes": "", "section": "18597", "instructors": [{"instructor_phone": "8474914965", "instructor_name": "Charles S Yarnoff", "instructor_addr": "555 Clark St., 243"}], "topic": "American Fiction 1920-1940", "course": "378-CN", "descriptions": [{"name": "Overview of class", "value": "American fiction written during the boom-and-bust era of 1920-1940 shed light on the social upheaval that we have experienced over the past decade. These works brilliantly portray characters struggling to find meaning in the face of rapid and overwhelming social change. Moreover, in experimenting with new fictional techniques and forms, the authors of this period produced some of our most memorable writing."}, {"name": "Registration Requirements", "value": "Students should have fulfilled the SPS writing requirement or taken equivalent writing courses."}, {"name": "Learning Objectives", "value": "Students will:<br/>gain an understanding of the thematic concerns in American literature during the 1920s and 30s; <br/>gain an understanding of the continuities and changes in artistic techniques used by writers during this period; <br/>develop their ability to write papers on literature."}, {"name": "Teaching Method", "value": "Class discussion<br/>Lectures<br/>Readings<br/>Writing assignments"}, {"name": "Evaluation Method", "value": "Take-home midterm exam <br/>Take-home final exam<br/>Course paper <br/>Class attendance and participation"}, {"name": "Class Materials (Required)", "value": "Ernest Hemingway, The Sun Also Rises.<br/>Willa Cather, The Professor's House.<br/>John Dos Passos, The Big Money.<br/>William Faulkner, As I Lay Dying.<br/>F. Scott Fitzgerald, Babylon Revisited and Other Stories.<br/>Zora Neale Hurston, Their Eyes Were Watching God."}, {"name": "Class Notes", "value": "You will have the opportunity to revise both your midterm exam essay and course paper after receiving feedback from the instructor. <br/><br/>For the course paper, you will have two options: (1) an analysis of a particular author's work that we've studied, or (2) a short story of your own written in the style of an author that we've studied."}], "lmod": "10/30/16 6:54 PM (CT)", "subject": "ENGLISH"}]