[{"school": "WCAS", "overview_of_class": "How the Other 99% Live: Inequalities in American Cities<br/><br/>This course title refers both to the famous 1889 Jacob Riis photo-documentary on poverty in New York City, How the Other Half Lives, and to the slogans of the Occupy Wall Street protests of 2011. It does so to underline the return, over the past few decades, of the extreme levels of economic inequality in the United States characteristic of the late 19th and early 20th centuries.<br/><br/>In this seminar, students will read about, discuss, write about, and thus gain the intellectual tools to evaluate past and present American urban inequalities-including not only class, but race/ethnicity, gender&amp;sexuality, nationality. We will read across several different academic disciplines and journalism to become familiar with key analytic concepts and methods, such as political economy, the Great Compression, urban regimes, ethnography. Using them, we will explore arenas of inequality: employment; urban space, housing, and neighborhoods; schooling, criminal justice, the public sphere.", "name": "First-Year Seminar", "section": "21", "topic": "How The Other 99% Live", "course": "101-6", "meeting_time": ["We 5:00PM - 8:00PM"], "path": "/class-descriptions/4620/WCAS/ANTHRO/101-6/31941", "instructor": ["Micaela   di Leonardo"], "id": "31941", "subject": "ANTHRO"}, {"school": "WCAS", "overview_of_class": "We recently celebrated the 200th anniversary of Charles Darwin's birth. But what would he think of our world today? We have a sophisticated understanding of genes and the ability to trace our ancestry over generations. Yet despite this knowledge, conclusive and irrefutable proof that we have or are continuing to evolve has not been found. In this course we will address where we might have come from and where we might be going. We will cover some of the major &quot;issues&quot; in biological evolution ranging from those of originating in Darwin's time to the many questions that persist today.", "name": "First-Year Seminar", "section": "22", "topic": "Making of the Fittest: Issues in Evolution", "course": "101-6", "meeting_time": ["MoWe 12:30PM - 1:50PM"], "path": "/class-descriptions/4620/WCAS/ANTHRO/101-6/31942", "instructor": ["Erin Beth Waxenbaum Dennison"], "id": "31942", "subject": "ANTHRO"}, {"school": "WCAS", "overview_of_class": "Auto Ethnography: the Anthropology of Cars<br/><br/>Since the introduction of the German motorized wagon in 1886 and later in the Ford Model T in 1908, automobile transportation has dominated the American roadways as well as streets and speedways around the globe. From changes in vehicular design, performance, safety, and style - the world of motor vehicles has grown so popular that is has become a common characteristic of independent modern everyday life. In this course, we look at the history, development, and diversity of 'car cultures' both in the United States and in contexts abroad. Through course readings, films, podcasts, and individual field research exercises, students will be introduced to anthropology and ethnographic research methods. Emphasis will be on the role of objects in social life and developing a critical tool kit - theoretical and methodological - to approach the material world we live in. Come take the ride!", "name": "First-Year Seminar", "section": "23", "topic": "Auto Ethnography: The Anthropology of Cars", "course": "101-6", "meeting_time": ["WeFr 11:00AM - 12:20PM"], "path": "/class-descriptions/4620/WCAS/ANTHRO/101-6/37696", "instructor": ["Matilda Lynn Stubbs"], "id": "37696", "subject": "ANTHRO"}]