[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "RCMA Lower Level 121"}], "school": "MUSIC", "enrl_requirement": "", "qtr": "Spring 2016", "name": "35787", "title": "MUSIC MUSIC 216-0-20 Western Music Cultures After 1800", "class_attributes": "", "section": "35787", "instructors": [{"instructor_phone": "", "instructor_name": "Scott Douglas Paulin", "instructor_addr": "s-paulin@northwestern.edu"}], "topic": "", "course": "216-0", "descriptions": [{"name": "Overview of class", "value": "As the final quarter of a yearlong sequence, this course examines significant tendencies and artifacts of European and American musical culture of the 19th, 20th, and early 21st centuries. In addition to studying the work of a wide range of composers, we will also aim to place their music in relation to the contexts (social, economic, political, technological, philosophical) within which it acquired historically specific significance and meaning. Critical issues include: the emergence of &quot;Romantic&quot; ideologies of music and their consequences; music as an emblem of cultural or national identity; changing ideas about performance and the role of the performer; the tension between experimental and traditional approaches to composition; anxieties about the boundary between &quot;Western Art Music&quot; and its others; and changing attitudes toward the musical past, including canon-formation and the writing of &quot;music history&quot; itself."}, {"name": "Registration Requirements", "value": "The course is intended for sophomore undergraduates in the School of Music. Music 214 and 215 (from which students should already have the required text listed below) are assumed as prerequisites, as are the ability to read music and a working knowledge of music theory."}, {"name": "Class Materials (Required)", "value": "Text: J. Peter Burkholder, A History of Western Music, 9th ed. W.W. Norton, 2014. ISBN 978-0393918298"}], "lmod": "4/3/16 6:34 PM (CT)", "subject": "MUSIC"}]