[{"school": "WCAS", "overview_of_class": "Prof. Richard Joseph, &quot;Global Democracy and World Disorder: Challenges in Africa and Beyond&quot; Spring 2016 co-list with AFST 390-0-21 &amp; INTL ST 390-0-24 This course will explore the evolution from the &quot;democratic euphoria&quot; of the early 1990s, to the sober analyses of democratization later in that same decade, to the current theoretical and empirical challenges. The experiences of specific countries in Africa and a few other world regions will be examined closely. After the Cold War, the number of democracies in the world increased significantly. In recent years, however, that number has stagnated and even, by some accounts, declined. The global system today is characterized by growing insecurity and uncertainty. The aim of this course is to achieve a deeper understanding of these dynamics and their implications. The expansion of liberal democracies and liberalized economies was adversely affected by the 9/11 Al Qaeda attack on the World Trade Center and the prolonged wars that followed in Iraq, Afghanistan, and Syria. The relentless upsurge in jihadist insurgencies in Africa and elsewhere has steadily shifted global priorities to the strengthening of security and political order. The rise of China and the resurgence of authoritarianism in Russia have contributed to the complexities and uncertainties. So also have the erosion of state systems, forced migrations,and the upsurge in ethnic nationalism and religious sectarianism. The failures of the Arab Spring, and the fracturing of Iraq, Syria, and Libya have had wide ramifications, particularly in sub-Saharan Africa. Is liberal democracy being eclipsed by new forms of authoritarianism, or is it proving resilient and adaptive? Where are these trends and others evident? Writing in the Journal of Democracy about the &quot;renewed struggle between democracy and authoritarianism worldwide&quot;, Christopher Walker recently wrote: [Authoritarian] regimes show solidarity and coordination with one another, at least when it comes to contesting and containing democracy and the ideas central to it. Through this more internationalist approach and authoritarian learning, China, Russia, Iran, and other illiberal regimes have developed instruments to counter the democratic West's soft power.&quot; For these developments in Africa, see an essay by this course instructor: http://www.brookings.edu/research/opinions/2016/01/07-democracy-state-power-africa-joseph.", "name": "Special Topics in Political Science", "section": "20", "topic": "Global Democracy and World Disorder", "course": "390-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4620/WCAS/POLI_SCI/390-0/34130", "instructor": ["Richard A Joseph"], "id": "34130", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "Prof. Chen, &quot;Politics Through Biography&quot; Spring 2016 co-list with SOC 376-0-20 and HUM 370-4<br/>This course aims to give Northwestern undergraduates a foundation of knowledge and critical reasoning skills that will enable them to develop and refine their own understanding of how and why public policy in the United States has developed historically in the ways that it has?and not in other ways it might have developed. Social policy, industrial relations, health care, fiscal policy, and financial regulation are among the policy areas that we will consider. Why is social spending in the United States relatively stingy? Why is so much of it channeled through the private sector? Why is the unionization rate so low? Why are so many people uninsured? Why have top marginal tax rates for personal income tended to be relatively low since the late-1980s? Why is the regulation of the U.S. financial system so fragmented and decentralized? The course will begin chronologically with the New Deal and end with the Great Recession. The main readings for the course will consist of selected biographies of major social and political figures. These biographies are meant to provide a uniquely valuable window into the policy-making process ? helping students to understand policy developments from the bottom-up as well as the top-down.", "name": "Special Topics in Political Science", "section": "21", "topic": "Politics Through Biography", "course": "390-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4620/WCAS/POLI_SCI/390-0/34131", "instructor": ["Anthony S Chen"], "id": "34131", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "Prof.Seawright, &quot;Inequality and Representation&quot; Spring 2016<br/>Political debate is filled with vital demands about inequality. We hear about the political and economic advantages of the one percent, about police brutality and indifference toward African Americans, about proposals to ban Muslim immigrants, and more. These concerns are at the center of political life, and are vital to contemporary political science.<br/><br/>In this seminar, we will analyze inequality inequality as a global phenomenon. We will look at the kinds of explanations that people give for the existence of inequality and the ways those explanations shape politics. We will study the ways that unequal resources lead to unequal political voice, and the ways in which unequal voice can reinforce societal inequality. In all of this, we will consider cross-national comparisons as a way of understanding which patterns of inequality are hard to change, and also which strategies have been most successful in creating equality.", "name": "Special Topics in Political Science", "section": "22", "topic": "Inequality &amp; Representation", "course": "390-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4620/WCAS/POLI_SCI/390-0/34132", "instructor": ["Jason W Seawright"], "id": "34132", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "Prof. Loriaux, &quot;Knowledge and Interpretation in Political Science&quot; Spring 2016<br/>Political science research relies on concepts (?country,' ?democracy,' ?voting,' ?power,' ?market') that are human constructions. Their meaning, power, and relevance depend on how they are used and understood. Knowing how they are used and understood, in turn, requires interpretation. This course introduces students to methodological issues raised by interpretation. It is not limited to interpretive work alone, but addresses problems of interpretation as they crop up generally in political science scholarship. The goals of such scholarship vary from predicting to explaining to understanding to destabilizing and contesting dominant discourses. But in all cases there is interpretation. The gathering of events or people into &quot;kinds&quot; of events or &quot;kinds&quot; of people so as to manipulate them as variables in small-n or large-n analyses, for example, is an interpretive undertaking. For this reason this course seeks not only to introduce the student to interpretive methods narrowly conceived, but to place such methods against the backdrop of broader questions regarding what knowledge is, how we acquire it, and how interpretation contributes to that effort. In so doing, this course seeks to give students a strong foundation that will allow them to read Political Science literature critically, and to conceptualize their subsequent research projects credibly. <br/>Recommended for Honors thesis writers.<br/>This course counts toward the Critical Theory minor.<br/>With written permission from the Director of Undergraduate Studies, this course counts toward the Political Science methods requirement.", "name": "Special Topics in Political Science", "section": "23", "topic": "Introduction to Interpretive Methods in Political", "course": "390-0", "meeting_time": ["Tu 2:00PM - 4:50PM"], "path": "/class-descriptions/4620/WCAS/POLI_SCI/390-0/34133", "instructor": ["Michael M Loriaux"], "id": "34133", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "Prof. Klaus, &quot;Land Rights and Conflict in a Global Perspective&quot; Spring 2016 co-list with INTL ST 390-0-23<br/>For much of the world's population, land sustains livelihoods, shapes identities, and provides a source of<br/>investment and security. Yet the centrality of land in everyday life also means that it can become a<br/>source of contentious politics and violence. This class explores how struggles over access and rights to<br/>land shape different forms of conflict and violence: between squatters and state officials, different<br/>ethnic groups, or armed groups and the state.<br/>The course explores questions of land and conflict in several parts. We begin by examining the question<br/>of land meanings: what does land, property, and territory mean to different groups of people? How<br/>does this help us understand why people organize or fight around issues of land? Second, the course<br/>takes an historical and comparative view of the rules and institutions that shape people's rights and<br/>access to land. The third part of the class explores theories that link land to conflict and violence. We<br/>then apply these theories to explore a set of case studies of land-related conflict: from the recent armed<br/>uprising in Oregon to civil war in Colombia. The last part of the class moves toward policy<br/>considerations. How, for example, can a focus on land rights improve post-conflict resolution?<br/>The course is interdisciplinary in its approach, drawing heavily on political science and political<br/>geography. It should appeal to students interested in peace and conflict issues, environmental politics,<br/>international development, and human rights.", "name": "Special Topics in Political Science", "section": "24", "topic": "Land Rights &amp; Conflict in a Global Perspective", "course": "390-0", "meeting_time": ["TuTh 9:30AM - 10:50AM"], "path": "/class-descriptions/4620/WCAS/POLI_SCI/390-0/34134", "instructor": ["Kathleen Fitzpatrick Klaus"], "id": "34134", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "Prof. Skogan, &quot;After Ferguson - Police Reform in America&quot; Spring 2016<br/>This seminar will focus on policing and police reform. In the aftermath of events around the country at the end of 2014 a national debate began about the character of American policing. This class will focus on the challenges facing policing and strategies for police reform. The topics will include police use of excessive and deadly force, police corruption, and the relationship - often broken - between police and the communities they serve. We will address proposed reforms in policing, ranging from civilian review to community policing.", "name": "Special Topics in Political Science", "section": "25", "topic": "Police Reform", "course": "390-0", "meeting_time": ["We 2:00PM - 4:50PM"], "path": "/class-descriptions/4620/WCAS/POLI_SCI/390-0/34135", "instructor": ["Wesley G Skogan"], "id": "34135", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "&quot;Satire and Political Theory: Aristophanes.&quot; Prof. Monoson Spring 2016<br/>How does satire contribute to political discourse? How far do we find substantial contributions to theorizing about politics in that format (as opposed to just clever and provocative expressions of strongly held opinions)? This course considers these questions by way of extended engagement with the work of the ancient Greek comic dramatist, Aristophanes. An Athenian and contemporary of Socrates, his masterful plays deliver blistering satirical depictions of democratic life and politics in during the long Peloponnesian War and into the fourth century BC. The course will start out observing the proliferation of satire in 21st century political discourse and then turn to examine the plays of Aristophanes. We will read all 11 surviving plays in translation but focus on close study in historical context of two ? Clouds and Lysistrata. We will also attend to the reception history of these two plays, that is, how have they been used and reimagined in contemporary times (e.g., the use of Lysistrata in Spike Lee's Chiraq). <br/>This course counts as a Classical Traditions class, pre-approved for the Classics major/minor.", "name": "Special Topics in Political Science", "section": "26", "topic": "Satire &amp; Political Theory", "course": "390-0", "meeting_time": ["Mo 3:00PM - 5:50PM"], "path": "/class-descriptions/4620/WCAS/POLI_SCI/390-0/34136", "instructor": ["Susan Sara   Monoson-Berns"], "id": "34136", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "Prof. Wilfahrt, &quot;Politics of International Aid&quot; Spring 2016 co-list with INTL ST 390-0-20 &amp; AFST 390-0-22<br/>Over the last fifty years, billions of dollars have been given to developing countries, yet critics argue that international aid is ineffectual and, worse yet, harmful to recipients. In this course, we will examine the politics surrounding the delivery of international aid, debating questions such as who gets to decides the aid agenda, which countries should receive what aid and, once delivered, how impact changes political dynamics in recipient communities. The substantive content of this course will expose students to current trends and debates in the world of international aid, highlighting how politics pervades even the most ?technical' of aid interventions.<br/><br/>The course blends traditional seminar-style discussions with the Harvard Business School case method. This teaching method asks students to collectively make a decision in a real-world case involving international aid. The case method highlights to students the complexities (including the many ethical dimensions) of aid work, encouraging students to develop their ability to articulate clear, persuasive arguments and engage in complex negotiations with their classmates in the process.", "name": "Special Topics in Political Science", "section": "27", "topic": "The Politics of International Aid", "course": "390-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4620/WCAS/POLI_SCI/390-0/34137", "instructor": ["Martha Anne Wilfahrt"], "id": "34137", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "Prof. Orloff &quot;Political Sociology&quot; Spring 2016<br/>This course will investigate the relationships among gender, society and politics. We will examine the gendered character of citizenship, political participation and representation, social rights and economic rights. We aim to understand gendered politics and policy from both &quot;top down&quot; and &quot;bottom up&quot; perspectives. What do states do, via institutions of political participation and representation, citizenship rights and policies, to shape gender relations? How do gender relations influence the nature of policy and citizenship? How has feminism emerged as a radical challenge to the androcentrism and restricted character of the democratic public sphere? We expand on conventional conceptions of political participation and citizenship rights to include the grassroots democratic activism that gave birth to the modern women's movement. We explore how women's political efforts have given rise to the creation of counter-public spheres and alternative visions of democracy, social provision and economic participation, as well as reshaping formal politics and policies. By the end of the class, students will know some of the history of gendered politics in the US, with some sense of comparative context, and will gain a basic understanding of the factors influencing gendered participation and representation as well as the character of gendered policies.", "name": "Special Topics in Political Science", "section": "28", "topic": "Political Sociology", "course": "390-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4620/WCAS/POLI_SCI/390-0/37801", "instructor": ["Ann Shola   Orloff"], "id": "37801", "subject": "POLI_SCI"}]