[{"class_mtg_info": [{"meet_t": "We 6:15PM - 9:15PM", "meet_l": "University Hall 121"}], "school": "SCS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "38083", "title": "SCS COMM_ST 270-CN-65 Theories of Mediated Communication", "class_attributes": "", "section": "38083", "instructors": [{"instructor_phone": "", "instructor_name": "Quaquilla Rhea Walker", "instructor_addr": ""}], "topic": "", "course": "270-CN", "descriptions": [{"name": "Overview of class", "value": "The primary topic of the course is mediated communication - the use of mass media to communicate cultural messages to large/diverse audiences - such as books, newspapers, magazines, radio, sound recording, movies, television and the internet (smart media are mentioned). The learning objectives of the course are: exploring/applying theories of mediated communication; understanding the history/development of mass media; using/learning the critical literacy process to help understand mass media; identifying/discussing the changes that the internet has caused in mass media especially with convergence. The student will learn to be a critical thinker about the mass media in their everyday cultural lives. The course is taught using lecture, student-led discussions, in/out of class individual/group projects, case studies, tests, guest speakers, supplemental text readings, research, and individual reflection papers."}, {"name": "Registration Requirements", "value": "Students need to be able to write a short, well-organized research paper (minimum three page single-spaced with resources cited correctly). Although not required, it is beneficial to be internet literate."}, {"name": "Learning Objectives", "value": "The learning objectives of this course are; exploring/applying theories of mediated communication; understanding the history/development of mass media; using/learning the critical literacy process to help understand mass media; identifying/discussing the changes that the internet has caused in mass media especially with convergence; experiencing communication with mass media through a Wikipedia research experience/project. The student will lean to be a critical thinker about the mass media in their everyday lives, and experience mediated communication."}, {"name": "Teaching Method", "value": "Class participation<br/>Discussion<br/>Films / videos<br/>Group work<br/>Guest speakers<br/>Lecture<br/>Online work<br/>Presentations<br/>Readings<br/>Research project<br/>Writing assignments"}, {"name": "Evaluation Method", "value": "Attendance/participation<br/>Case studies<br/>Exam, final<br/>Exam, mid-term<br/>Optional presentations based on research project"}, {"name": "Class Materials (Required)", "value": "Texts may include the following. Visit the campus bookstore or its website to confirm materials for the course:<br/><br/>Media and Culture: and introduction to mass communication by Campbell, Martin and Fabos.<br/>Additional reading are possible."}, {"name": "Class Notes", "value": "All possible accommodations will be made to help you successfully complete my course with the highest possible grade that reflects your work. I understand that you are all adult students and have busy lives outside of class. If a personal or work emergency occurs that causes your issues in completing any of the course's work, please contact/talk to me (and/or your student adviser) as soon as possible. It is your - the student's - responsibility to inform me of any concerns, issues or emergencies as soon as possible. I consider a work emergency an unusual amount of unplanned work or an unexpected change in a deadline or such. I consider a personal emergency an unexpected home living issues, illness in the family, or unexpected childcare or such. However, if you miss half or more of the course work by the end of class, your will need to retake the course. Lastly, if you cannot complete all the course work by the end of the quarter (and have completed more than half of the course), please file for an extension by talking with me and your adviser prior to the end of the quarter so that I can continue to support your completion of the course."}], "lmod": "2/21/17 6:41 PM (CT)", "subject": "COMM_ST"}]