[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "Fisk Hall 114"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "10665", "title": "WCAS ASIAN_LC 290-0-23 Introductory Topics in Asian Languages and Cultures", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "10665", "instructors": [{"instructor_phone": "", "instructor_name": "Anne Elizabeth Rebull", "instructor_addr": "Kresge Hall, 1880 Campus Drive, 4-520"}], "topic": "Romance, Reproduced, Reinvented", "course": "290-0", "descriptions": [{"name": "Overview of class", "value": "Topic: Romance, Reproduced, Reinvented: Story of the Western Wing in Late Imperial China. <br/> The story of the forbidden romance between a well-to-do young lady and the aspiring scholar who chances upon her in a country monastery has continuously captured the imaginations of readers since its earliest appearance in the 9th century. In the millennium that followed, the Western Wing story was reincarnated as musical performance, Yuan zaju drama, Ming chuanqi theater, and an oft-repeated motif of painting, illustration, and material culture. In this discussion-based seminar, we will look in depth at its most famous version, the Yuan zaju by Wang Shifu, as well as one of its precursors, the zhugongdiao (all-keys-and-modes) by Dong Jieyuan. We will also examine secondary literature on other reproductions of the Western Wing story, including its depictions in art, in order to consider issues such as representations of femininity, feminine desire, and the cult of qing; cultures of reading; intertextual practices; dramatic codes; and visual regimes in drama and in art. Throughout, we will be guided by questions of how the worlds of the Western Wing are constructed, deconstructed and reconstructed for the pleasures of the different ages."}, {"name": "Learning Objectives", "value": "Students will <br/>? Gain familiarity with the core narrative of the Western Wing story, and be able to analyze the effects of reproduction in different literary forms (in English)<br/>? Learn techniques and problems in the study of performance art traditions in imperial China, including Yuan theater (zaju) conventions <br/>? Acquire the methodological skills to read and analyze both primary texts in different genres from late imperial China and secondary literature<br/>? Develop research skills in the production of a longer research paper"}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "? Class participation 25%<br/>? Weekly (2 pg max, double-spaced) reading responses 20%<br/>? Class presentation (on final project) 20%<br/>? Final paper (10-12 page research paper) 35%"}, {"name": "Class Materials (Required)", "value": "? Wang Shifu, Story of the Western Wing (Idema/West translation), Berkeley: University of California Press, 1995. <br/>? Dong Jieyuan, Master Tung's Western Chamber Romance (Tung Hsi-hsiang chu-kung-tiao): A Chinese Chantefable (Li-li Chen translation), New York: Cambridge University Press, 1976. <br/>? Other texts made available as pdfs through canvas"}], "lmod": "10/30/16 6:58 PM (CT)", "subject": "ASIAN_LC"}]