[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Annenberg Hall G21"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "35412", "title": "WCAS POLI_SCI 390-0-20 Special Topics in Political Science", "class_attributes": "", "section": "35412", "instructors": [{"instructor_phone": "847 491 2595", "instructor_name": "Richard A Joseph", "instructor_addr": "218 Chambers Hall"}], "topic": "Governing Fractured Nations: Africa &amp; the Post-Imp", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "POLI SCI 390-0-20 Spring 2017 &quot;Governing Fractured Nations: Africa &amp; the Post-Imperial World&quot; Prof. Richard Joseph &quot;We are living through a period in which the speed of change exceeds the capacity of governmental institutions, and of political leaders, to manage it. The term &quot;fractured&quot; is frequently used today to refer to the splintering of societies, nations, and the &quot;global community&quot;. We will examine these phenomena and the challenges posed to systems of governance.<br/><br/>This era is foreshadowed in the work of particular scholars, such as Crawford Young, The Rise of Cultural Pluralism (1993), and Robert Cooper, The Breaking of Nations (2003). In the foreword to a 2001 book, The Self-Determination of Peoples, the following prescient words can be read: &quot;Unrest in one part of the world can bring bombs, terror, and refugees to another, where public sentiment may lead to intervention in the conflict one way or the other; thus local conflicts are globalized.&quot;<br/><br/>Intense conflicts take place across several axes: ethnic nationalism, religious sectarianism vs. secularism, &quot;ordinary people&quot; vs. elites, rural and small towns vs. cities, and migrants vs citizens. Ideologies that seemed triumphant after the Cold War, such as constitutional democracy and economic liberalism, are vigorously contested. New constructions are given to once familiar concepts such as sovereignty, privilege, and populism. Election contests in Britain, the United States, and several other western democracies deepen societal divisions and enhance uncertainty.<br/><br/>Some authors have grappled with the governance dimension of these challenges. They include Francis Fukuyama in several works, Daron Acemoglu and James Robinson in Why Nations Fail? (2012) and Jonathan Tepperman, in The Fix (2016). Contributing to the sense of global disarray are persistent wars and increasing reliance on shadow forms of warfare: drones, cyber-attacks, and Special Forces. The fracturing of nations is vividly conveyed by waves of refugees fleeing violence and distress in Africa and the Middle East. So also is the &quot;disintegrating of Europe&quot;, as discussed in a January 2017 essay by Timothy Garton Ash, chronicler of the post-1989 democratic transitions in Eastern Europe.<br/><br/>This course will devote special attention to the African experience. Most African countries contend with multiple lines of division: ethnic, linguistic, religious, regional, and class. How, it will be asked, have highly diverse nations maintained nationhood? How are they coping with the current fraying of the global order and economic upheavals? The experiences of Nigeria, Africa's most populous country, will be closely examined."}, {"name": "Teaching Method", "value": "A combination of teaching methods will be used, including lectures and seminar-style discussion sessions."}, {"name": "Evaluation Method", "value": "Grading will be based on two short essays (30%), class participation (20%), and a final examination or research paper (50%)."}, {"name": "Class Materials (Required)", "value": "A course packet will be available for purchase from Quartet Copies."}], "lmod": "2/21/17 6:50 PM (CT)", "subject": "POLI_SCI"}]