[{"class_mtg_info": [{"meet_t": "We 2:00PM - 4:50PM", "meet_l": "Scott Hall 212"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "34135", "title": "WCAS POLI_SCI 390-0-25 Special Topics in Political Science", "class_attributes": "", "section": "34135", "instructors": [{"instructor_phone": "", "instructor_name": "Wesley G Skogan", "instructor_addr": ""}], "topic": "Police Reform", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "Prof. Skogan, &quot;After Ferguson - Police Reform in America&quot; Spring 2016<br/>This seminar will focus on policing and police reform. In the aftermath of events around the country at the end of 2014 a national debate began about the character of American policing. This class will focus on the challenges facing policing and strategies for police reform. The topics will include police use of excessive and deadly force, police corruption, and the relationship - often broken - between police and the communities they serve. We will address proposed reforms in policing, ranging from civilian review to community policing."}, {"name": "Registration Requirements", "value": "Attendance is required at the first class."}, {"name": "Learning Objectives", "value": "The goal of all of this is to help you think critically and analytically about policing and to understand the relationship between policing and politics that lurks in the background of all discussions of police reform."}, {"name": "Teaching Method", "value": "Lecture &amp; Discussion"}, {"name": "Evaluation Method", "value": "EVALUATION There will be a mid-term exam covering reading and discussion during the first half of the quarter. This will constitute 40% of your grade. Your paper will contribute 40% of your grade. Attendance and participation (including discussion assignments during the first segment of the class) and an oral presentation based on your paper will constitute 20% of your grade. There will be no final exam. As we meet only once a week, and a research break is scheduled, you are expected to attend every class meeting."}, {"name": "Class Materials (Required)", "value": "READINGS AND COURSE MATERIALS: These are detailed on the course's web site, where you will also find a detailed weekly schedule of activities and more material about the course paper (including lots of suggestions and ideas). Early in the term there will be discussion of the required readings that are posted there. During that period there will be a required reading for each session, plus I will pre-assign a special discussion assignment for each student. Supplementary materials intended to help you get started on your research paper are also posted at the site. There is no textbook for the course; instead, all required and recommended readings will be posted on the web."}], "lmod": "4/3/16 8:17 PM (CT)", "subject": "POLI_SCI"}]