[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Dearborn Observatory 23"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores<br/>Add Consent: Department Consent Required<br/>", "qtr": "Fall 2016", "name": "17455", "title": "WCAS ASTRON 110-6-21 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "17455", "instructors": [{"instructor_phone": "847/491-4568", "instructor_name": "Michael F Smutko", "instructor_addr": "Dearborn Observatory (2131 Tech Drive), Room 9A, Evanston"}], "topic": "Perceptions of the Universe", "course": "110-6", "descriptions": [{"name": "Overview of class", "value": "Human perception and understanding of the universe has changed dramatically over the centuries. Astronomers used to believe that objects in the Heavens were attached to great crystalline spheres that moved about the Earth with accompanying music. Today, astronomers believe that the Heavens are dominated by a mysterious &quot;dark energy&quot; force that may ultimately tear the universe apart. On top of that, some physicists think that everything from electrons to gravity itself is made of vibrating loops of string-like energy moving through 11-dimensional space. Which is stranger? You decide. We will discuss (in a non-mathematical fashion) how our view of the cosmos has evolved thanks to the work of Galileo, Hubble, Einstein, Schrödinger and many others. We will explore not just their ideas, but also the intellectual struggles and the drama behind those ideas."}, {"name": "Teaching Method", "value": "Discussions, presentations, and demonstrations. Some discussions will be lead by students."}, {"name": "Evaluation Method", "value": "Grades will be based on class participation (20%), several short essays (45% total), and a final paper (35%).<br/>Several short essays (2-4 pages each), and a final paper (8-10 pages)."}, {"name": "Class Materials (Required)", "value": "Rocky Kolb, Blind Watchers of the Sky<br/>Dava Sobel, Galileo's Daughter<br/>Brian Greene, Elegant Universe and perhaps selections from Fabric of the Cosmos"}], "lmod": "10/30/16 6:58 PM (CT)", "subject": "ASTRON"}]