[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Parkes Hall 213"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores<br/>Add Consent: Department Consent Required<br/>Drop Consent: Department Consent Required<br/>", "qtr": "Fall 2016", "name": "12677", "title": "WCAS POLI_SCI 101-6-22 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "12677", "instructors": [{"instructor_phone": "847/491-3468", "instructor_name": "Lawrence L Stuelpnagel", "instructor_addr": "McCormick Foundation Building/4-135"}], "topic": "The Press &amp; the Political Process", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "Prof. Stuelpnagel &quot;Press and Political Process&quot;, Fall 2016<br/><br/>Presidents and presidential candidates often claim that the press is either &quot;liberal&quot; or &quot;conservative.&quot; But many factors drive what the public receives as news. Those factors include: the economics of the business; information biases that come from striving to be &quot;objective;&quot; work routines by journalists; and the need to tell a story in a simple fashion so that readers and viewers can easily understand the subject. This course will examine the impact of those factors have on the information that the public receives as &quot;news.&quot;"}, {"name": "Learning Objectives", "value": "There are several objectives for this class. The first is to give you a better understanding of how the press impacts presidential political campaigns and issues. The second is to give you the opportunity to do independent research in this area and to train you in the proper methods of research and writing."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Students will be required to write an 800 word Op-Ed, write and present to the class a book report, write a ten page research paper on a topic approved by the professor. Students will also be expected to actively participate in our class discussions."}, {"name": "Class Materials (Required)", "value": "News:The Politics of Illusion by W. Lance Bennett, 9th Edition. ISBN 10:0-25-08241-4 (paperback) The Political Science Student Writer's Manual, Gregory M. Scott, Stephen M. Garrison, 7th Edition ISBN 10: 0-205-830129-9"}], "lmod": "10/30/16 7:08 PM (CT)", "subject": "POLI_SCI"}]