[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Scott Hall 212"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "35453", "title": "WCAS POLI_SCI 406-0-20 Quantitative Causal Inference", "class_attributes": "", "section": "35453", "instructors": [{"instructor_phone": "847/467-1148", "instructor_name": "Jason W Seawright", "instructor_addr": ""}], "topic": "", "course": "406-0", "descriptions": [{"name": "Overview of class", "value": "In the social sciences, we often repeat the mantra, &quot;Correlation is not causation.&quot; Explaining what this saying means is nontrivial. What is causation, how is it logically and mathematically related to correlation, and how can we as social scientists do better than simply measuring observed relationships among variables?<br/><br/>This course explores the available quantitative toolkit for causal inference in the social sciences. We will consider a series of methods that are generally expected or increasingly common in applied research: experimentation, regression with control variables, instrumental variables, matching, mechanism and regression-discontinuity designs, and panel inference. Finally, we will discuss some approaches to missing data."}, {"name": "Registration Requirements", "value": "Graduate student or instructor's permission"}, {"name": "Teaching Method", "value": "Seminar and Lecture"}, {"name": "Evaluation Method", "value": "Weekly assignments and a final exam."}, {"name": "Class Materials (Required)", "value": "&quot;Stephen L. Morgan and Christopher Winship, Cambridge University Press, Counterfactuals and Causal Inference: Methods and Principles for Social Research, 2nd Edition, 2014, 978-1107694163<br/><br/>Guido W. Imbens and Donald B. Rubin, Cambridge University Press, Causal Inference in Statistics, Social, and Biomedical Sciences: An Introduction, 1st Edition, 2015, 978-0521885881<br/><br/>Joshua D. Angrist and Jörn-Steffen Pischke, Princeton University Press, Mastering 'Metrics: The Path from Cause to Effect, 1st Edition, 2014, 978-0691152837&quot;"}], "lmod": "2/6/17 8:43 AM (CT)", "subject": "POLI_SCI"}]