[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "Annenberg Hall G32"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "17490", "title": "WCAS HISTORY 300-0-30 New Lectures in History", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "17490", "instructors": [{"instructor_phone": "", "instructor_name": "Sheila Two Wille", "instructor_addr": "1800 Sherman Avenue, Suite 1-200"}], "topic": "Apocalypse: Environment, History, Science, and Rel", "course": "300-0", "descriptions": [{"name": "Overview of class", "value": "The theme of the &quot;end of days&quot; threatens to overwhelm us in popular media; even the United States government is capitalizing on the obsession with the &quot;zombie&quot; apocalypse to encourage emergency preparedness. Apocalypses are not just exciting stories, they have long roots in the Western tradition, particularly in Christianity, science, and the Enlightenment, and they have many uses. They can narrate a great victory for the morally righteous, become a foil for a critique of enlightenment or industrial progress, and unveil the gateway to utopia. Apocalyptic stories also often reinforce previously held assumptions about humans, nature, and human nature, holding within them a regenerative moment when humanity (or some select part of it) could finally get things right. As a result, the end of days not only makes an excellent category of historical analysis, but can help us think through an ominous and looming apocalypse in our own time - global climate change."}, {"name": "Registration Requirements", "value": "GRADING BASIS: ANC"}, {"name": "Teaching Method", "value": "Lecture"}, {"name": "Evaluation Method", "value": "EVALUATION METHOD: Brief assignment, midterm, final papers, and class presentation"}, {"name": "Class Materials (Required)", "value": "***Tentative until order posted to Norris website<br/>King James Bible (any)<br/>E. Kolbert, The Sixth Extinction (any edition) ISBN-13: 978-1250062185 <br/>N. Oreskes, The Collapse Of Western Civilization: A View From The Future. ISBN: 9780231169547<br/>P. Robertson, The New World Order (any edition) ISBN-13: 978-0849933943<br/>H. G. Wells, Time Machine (Norton Critical Edition) ISBN-13: 978-0393927948<br/>P. Sabin, The Bet: Paul Erlich, Julian Simon, and Our Gamble over Earth's Future (any edition) ISBN-13: <br/>978-0300198973"}], "lmod": "10/30/16 7:06 PM (CT)", "subject": "HISTORY"}]