[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "555 Clark B01"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-registration is reserved for Sociology, SHC, or Global Health students.", "qtr": "Spring 2017", "name": "37959", "title": "WCAS SOCIOL 319-0-20 Sociology of Science", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "37959", "instructors": [{"instructor_phone": "", "instructor_name": "Christine Virginia Wood", "instructor_addr": ""}], "topic": "", "course": "319-0", "descriptions": [{"name": "Overview of class", "value": "The idea that science has a history and exists in a social context may seem curious to some: we are taught, and the scientific method is thought to ensure, that scientific knowledge is objective and universal. But like other social institutions, science has rules and norms that dictate training and professionalization, the representation of findings and ideas, and minute practices in that can shape the big picture of what we know about the world. This course introduces students to the sociology of science, a field based on understanding how the natural and laboratory sciences are influenced by political and historical epochs, social identities, and cultural norms. The course has three broad aims: to introduce students to core literature in the history and sociology of science; to use case studies to better understand the social life of various scientific fields and innovations; and to apply our sociological imaginations to conceive possibilities at the limits of humanistic and social aspirations."}, {"name": "Registration Requirements", "value": "This course is open to Sociology, Global Health, and SHC students during preregistration. Open to all students during regular registration."}, {"name": "Teaching Method", "value": "Lecture and discussion"}, {"name": "Class Materials (Required)", "value": "All materials for this course will be made available on Canvas - no purchase necessary."}], "lmod": "2/6/17 6:54 PM (CT)", "subject": "SOCIOL"}]