[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Technological Institute LG62"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Winter 2017", "name": "21153", "title": "WCAS BIOL_SCI 105-6-1 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>Freshmen Only<br/><br/>", "section": "21153", "instructors": [{"instructor_phone": "847/491-4823", "instructor_name": "Tracy M Hodgson", "instructor_addr": "Tech Institute, Room MG77"}], "topic": "Chocolate: From the Biochemical to the Geopolitica", "course": "105-6", "descriptions": [{"name": "Overview of class", "value": "Topics for discussion and exploration will include (but not necessarily be limited to): The history, ecology and sociopolitical impact of cacao cultivation and chocolate production; the biology and psychology of gustation and olfaction (taste and smell); the biochemistry of the components of chocolate, and their physiological and neurological effects; chocolate in fiction/literature."}, {"name": "Registration Requirements", "value": "First-years only"}, {"name": "Teaching Method", "value": "Discussion, plus a tutorial on literature searches. One course period every 1-2 weeks will include a chocolate (mostly dark chocolate with a high concentration of cacao) tasting/discussion, led by the instructor or by 1-2 students."}, {"name": "Evaluation Method", "value": "Participation in and leadership of group discussions accounts for at least one-quarter of the grade. Written assignments (see below) and at least one oral presentation account for the remainder, in proportion to their length. There will also be at least 3 surprise quizzes based on the reading assignments and/or issues of grammar and composition.<br/><br/>There will be: 2 short papers to examine and critique either chapters from the assigned books or other texts, or papers from the primary literature (3-5 pages each); 2 creative writing assignments (1-3 pages); one short group presentation; and one research paper (6-10 pages)."}, {"name": "Class Materials (Required)", "value": "We will read selections from the books shown below:<br/><br/>Charley and the Chocolate Factory by Roald Dahl ISBN 978-0-14-241031-8<br/>Chocolat by Joanne Harris ISBN: 978-0-14-028203-0<br/>The Pleasure Instinct: Why We Crave Adventure, Chocolate, Pheromones and Music, by Gene Wallenstein ISBN: 978-0-471-61915-4<br/>Chocolate Nations: Living and Dying for Cocoa in West Africa by Orla Ryan <br/>ISBN: 978-1-78032-309-1<br/><br/>Excerpts from book (provided by instructor) Children of God's Fire: A Documentary History of Black Slavery in Brazil by Robert Edgar Conrad ISBN: 0-271-01321-4<br/><br/>We will also read a few short papers from the primary scientific literature, either chosen by the instructor or the students."}], "lmod": "12/29/16 6:54 PM (CT)", "subject": "BIOL_SCI"}]