[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Parkes Hall 223"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: PRE-REG: Reserved for African American Studies majors &amp; minors.", "qtr": "Spring 2017", "name": "32217", "title": "WCAS AF_AM_ST 218-0-1 Asian/Black Historical Relations in the U.S.", "class_attributes": "Historical Studies Distro Area<br/><br/>Interdisciplinary Distro - See Rules<br/><br/>Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "32217", "instructors": [{"instructor_phone": "847/467-0448", "instructor_name": "Nitasha Tamar Sharma", "instructor_addr": "Crowe Hall 5-133"}], "topic": "", "course": "218-0", "descriptions": [{"name": "Overview of class", "value": "Why do Asian Americans and African Americans seem to be incommensurably different groups? How can we understand the tensions between these communities? And where can we find evidence of past solidarity and commonality? This course offers an interdisciplinary, chronological, and thematic examination of the construction Asian and Black peoples in the U.S by tracing their entrance and experiences. What are the economic, social, political, and ideological causes of tensions?and alliances? Topics include: the historical and overlapping racialization and sexualization of Blacks and Asians; slavery and early immigration legislation; international &quot;Afro-Asian&quot; connections. We then focus on WWII as a crucible of new racial and economic dynamics that differentially locate Blacks and Asians in the post-war economy. In the second half, we examine the impacts of the 1965 Immigration Act and the devastating?and bifurcated effect?of 1970s deindustrialization on Americans that led to the myths of the &quot;model minority&quot; and &quot;underclass.&quot; We study ideologies that emerged from social movements of the 1960s and 1970s and the results of the Vietnam War to theorize race and identity beyond Black and White to reconceptualize inter-minority relations."}, {"name": "Learning Objectives", "value": "Critical thinking, critical reading, critical listening skills. This course is intended to uncover understudied and critical aspects of American History. It models and teaches critical thinking, close reading, analytical writing, and clear and persuasive argument building. It teaches an historical and structural approach to understanding contemporary group relations. It arms students with a lens through which to understand how they operate within institutions and how to have empathy for people across difference."}, {"name": "Teaching Method", "value": "lecture, in-class discussion"}, {"name": "Evaluation Method", "value": "Attendance around 10-15%<br/>Class participation around 10-15% <br/>Exam, midterm yes around 25-30 <br/>Papers around 25-50% <br/>Quizzes - YES"}, {"name": "Class Materials (Required)", "value": "Course pack available at Quartet"}], "lmod": "2/7/17 6:40 PM (CT)", "subject": "AF_AM_ST"}]