[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Annenberg Hall G21"}], "school": "WCAS", "overview_of_class": "Interdisciplinary analysis of the political, economic and ethical questions underlying the modern climate crisis, including discussion of sustainability concepts, a review of the evidence for human-induced climate change, political and economic analysis of mitigation scenarios, and an exploration of the ethics of resource use, conservation practices, and environmentalism.", "qtr": "Spring 2016", "name": "Climate Change and Sustainability: Economic and Ethical Dimensions", "title": "WCAS PHIL 270-0-20 Climate Change and Sustainability: Economic and Ethical Dimensions", "lmod": "4/3/16 8:13 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "847/467-2257", "instructor_name": "Bradley B Sageman", "instructor_addr": "Tech F397/F399."}, {"instructor_phone": "", "instructor_name": "Laura Lynne Kiesling", "instructor_addr": ""}], "topic": "", "course": "270-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Interdisciplinary analysis of the political, economic and ethical questions underlying the modern climate crisis, including discussion of sustainability concepts, a review of the evidence for human-induced climate change, political and economic analysis of mitigation scenarios, and an exploration of the ethics of resource use, conservation practices, and environmentalism."}, {"name": "Learning Objectives", "value": "-Students will understand the principles of sustainability and their historical development.<br/>-Students will understand the basic components and main processes of the Earth's climate system.<br/>-Students will understand the main lines of scientific evidence pertaining to the global warming hypothesis.<br/>-Students will develop an understanding of basic economic analysis and its application to environmental issues<br/>-Students will understand empirical evidence regarding the forecast economic effects of global warming<br/>-Students will understand analyses of the use and anticipated consequences of political and regulatory mechanisms<br/>-Students will develop an understanding of some of the core normative principles of ethical theory and environmental ethics.<br/>-Students will learn to utilize normative principles in the analysis of complex empirical phenomena related to climate change."}, {"name": "Class Materials (Required)", "value": "Excerpt from &quot;The Brundtland Report&quot; World Commission on Environment and Development, 1987, Our Common Future, Report of the World Commission on Environment and Development; Annex to General Assembly document A/42/427. <br/><br/>The Anthropocene, The Economist<br/><br/>Kump, L.R., Kasting, J.F., &amp; Crane, R.G., 2010, The Earth System, 3rd Ed., Prentice Hall, San Francisco, CH 1, 3.<br/><br/>Mathez, E.A., 2009, Climate Change, Columbia University Press, New York, CH 1-5, 10.<br/><br/>IPCC 2007, Summary for Policy Makers - The Physical Science, WMO, UNEP publication.<br/><br/>NRC 2012 Report on Climate Change <br/><br/>Selections from the writings of Solow, Smith, Nordhaus, Ostrom and others<br/><br/>and selected articles TBA"}, {"name": "Class Notes", "value": "FOR FURTHER INFORMATION ON THIS CLASS PLEASE CONTACT INSTRUCTOR DIRECTLY FOR THIS INFORMATION"}], "path": "/class-descriptions/4620/WCAS/PHIL/270-0/37813", "instructor": ["Bradley B Sageman", "Laura Lynne Kiesling"], "class_attributes": "Ethics &amp; Values Distro Area<br/><br/>", "id": "37813", "subject": "PHIL"}]