[{"school": "WCAS", "overview_of_class": "At its core international law is idea about how to use the tools of law to facilitate peaceful and mutually beneficial relations in the world. This course explores how the international legal system works from a legal and political perspective, shaping international relations today. <br/>The course provides an introduction to some aspects of the method and substance of international law, learning some key legal concepts like sovereign immunity, jus cogens, general principles of international law, principles of jurisdiction etc. But this is not a law course. We cover legal subjects to understand how politics and law interact in shaping international relations today. Substantively, the course examines international laws related to the oceans, the environment, human rights, trade and war. We read treaties, and use case studies to see how international law is made, why national governments and national courts at times contest international law, and why international law can be difficult to enforce. We explore the legal and political issues surrounding contemporary flashpoints in international relations: China's claims to the South China Seas, how civil conflict is fueling the poaching of elephants, the United States Supreme Court's ambivalence regarding international law, how international law regarding torture is and is not politically relevant.", "name": "Special Topics in International Studies", "section": "20", "location": "Harris Hall 107", "topic": "Politics of International Law", "course": "390-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4640/WCAS/INTL_ST/390-0/13133", "instructor": ["Karen   Alter-Hanson"], "class_attributes": "", "id": "13133", "subject": "INTL_ST"}, {"school": "WCAS", "overview_of_class": "The aim of this course is to provide students interested in Iranian studies and Middle East politics with the analytic skills necessary to succeed in these fields. This course will do so by examining the relationship between state and society in post-revolutionary Iran, concentrating on the social bases of Iranian politics. It will begin by briefly examining the history of state and society during the Pahlavi era. From the third session, we will focus on Iranian state-society relations after the 1979 Islamic Revolution and the transition to hard-line theocratic governance. From there, we will explore the nature of the Iranian state, concentrating on two of its main characteristics: personalization and militarization. We will additionally consider how the main social groups in Iran's society (the armed forces, the clergy, students, and women), as well as key social spaces such as the bazaar operate in relation to one another and the state. Social media and its simultaneous role in both suppressing and liberating Iranian society will also be a key focal point. Finally, the course will focus on the future of state-society relations in Iran with a special emphasis on the possible transition from authoritarianism to democracy", "name": "Special Topics in International Studies", "section": "21", "location": "Kresge 4531 MENA Seminar Rm", "topic": "Society and Politics in Iran", "course": "390-0", "meeting_time": ["TuTh 9:30AM - 10:50AM"], "path": "/class-descriptions/4640/WCAS/INTL_ST/390-0/13134", "instructor": ["Saeid   Golkar"], "class_attributes": "", "id": "13134", "subject": "INTL_ST"}]