[{"school": "SoC", "overview_of_class": "This section provides a general introduction to theory and research concerning health-related persuasion, especially in the context of health communication campaigns. The course covers leading theoretical frameworks that have guided health persuasion research and practice (e.g., the transtheoretical model) and research concerning health communication campaigns (campaign planning, execution, and evaluation). Students will complete a substantial research paper and contribute to class discussion of readings.", "name": "Communication Studies Research Seminar", "section": "20", "location": "Annenberg Hall G31", "topic": "Persuasion in Health Contexts", "course": "394-0", "meeting_time": ["Mo 3:00PM - 5:50PM"], "path": "/class-descriptions/4660/SoC/COMM_ST/394-0/33041", "instructor": ["Daniel James O'Keefe"], "class_attributes": "Undergraduate Students Only<br/><br/>", "id": "33041", "subject": "COMM_ST"}, {"school": "SoC", "overview_of_class": "The proliferation of information and communication technologies (e.g., social networking sites such as Facebook and Twitter) has connected people at an unprecedented level. For example, \"six degrees of separation\" (a.k.a. small world phenomena) suggests that individuals can be connected with any other individuals via six intermediaries. However, recent research suggests that individuals on Facebook can be connected via about four intermediaries. Social networks play an important role in our understanding of a wide array of human phenomena, including interpersonal interaction, organizational communication, political campaigns, public health, and social movement. Trends suggest that new networked forms of self-organizing are emerging and evolving. This course will introduce theories for analyzing and understanding how social actors (e.g., individuals, organizations, and even texts) are connected via social networks. We will review scholarship on social networks across a wide array of disciplines in order to gain insight into their structures and dynamics. We will examine how psychological, cognitive, economic, social, cultural, political, and technological factors influence our networked society. In addition, we will critically evaluate the impact of social networks on relationships, activism, management, marketing, politics, and media. Topics of this course include the antecedents (the \"why\" question), processes (the \"how\" question), and outcomes (the \"what\" question) of social networks in a variety of fields. Students will read classic and cutting edge articles and book chapters about these topics and discuss their implications. In addition, through weekly writing exercises culminating in a final research paper (15 - 20 pages) at the end of the quarter, students will learn to articulate and defend a position about the role of social networks in the networked age. In service of this goal, this class will provide an overview of the mechanics of writing a research paper. Topics covered will include how to locate and use academic source material, how to make and defend claims, how to incorporate peer reviews, and how to organize a research paper.", "name": "Communication Studies Research Seminar", "section": "21", "location": "Parkes Hall 213", "topic": "Social Networks and Society", "course": "394-0", "meeting_time": ["We 3:00PM - 5:50PM"], "path": "/class-descriptions/4660/SoC/COMM_ST/394-0/33042", "instructor": ["Jiawei   Fu"], "class_attributes": "Department Majors Only<br/><br/>Juniors/Seniors Only<br/><br/>", "id": "33042", "subject": "COMM_ST"}, {"school": "SoC", "overview_of_class": "The Science Fiction genre?notoriously hard to classify though \"we know it when we see it\"- offers its audiences ways to see beyond their real societies. The conceit of being on a different planet or talking with intelligent aliens puts enough space between reality and story that social issues can be addressed in ways it is more difficult for realist narrative. This course studies \"Social Science Fiction\", the sub-genre of Speculative Fiction (SF) which concentrates more on alternative social roles and structures than on space battles or futuristic technology. <br/>A number of approaches to SF film/TV history and criticism with an emphasis on social science fiction will be introduced. Students will be required to discover and use further research in order complete a 15-20 page term paper on social roles and structures in their object of study. This paper will make an argument about that object of study concentrating in one of three general areas: (1) History?the particulars to be negotiated with the instructor (2) Criticism- of a contemporary SF object or element [a film, tv show, series, genre, recurring character, etc] or (3) Reception- of a SF film or program or series by fans (e.g. fan-sites).<br/>Beyond furthering students' understanding of the topic, this seminar is intended to develop both academic and professional research and writing skills. Thus a good deal of the in-class work will concern formulating a clear, well focused claim (i.e. thesis), discerning and using credible, relevant and sufficient sources (both with and without Google), creating a coherent argument that follows from the claim and is supported by the research, and improving the quality of the writing itself (its flow, clarity, coherence, use of language, succinctness, etc.)<br/>Early drafts of the research question, bibliography, and the paper itself will be due during the term. These as well as the in-class participation and a one on one meeting with the instructor will constitute half the course grade. The final paper grade constitutes the second half.", "name": "Communication Studies Research Seminar", "section": "22", "location": "Kresge Centennial Hall 2-325", "topic": "Social Structure and Identity in Sci Fi Film & TV", "course": "394-0", "meeting_time": ["Tu 3:00PM - 5:50PM"], "path": "/class-descriptions/4660/SoC/COMM_ST/394-0/33043", "instructor": [""], "class_attributes": "Department Majors Only<br/><br/>Juniors/Seniors Only<br/><br/>", "id": "33043", "subject": "COMM_ST"}, {"school": "SoC", "overview_of_class": "This course will study the attributes of new media and examine how it references old media technologies. We will question the novelty of digital media by acknowledging both its limitations and its additional affordances. By historically situating digital media, we will trouble the notion of newness and investigate past media evolutions (as it relates to print, radio, and television) in order to complicate understandings of the present digital landscape. Using this lens, students will learn how to produce a 20-page research paper that demonstrates their writing, research, and critical thinking skills.", "name": "Communication Studies Research Seminar", "section": "23", "location": "Kresge Centennial Hall 3-410", "topic": "Rewinding the Future: What's New About New Media?", "course": "394-0", "meeting_time": ["Th 3:00PM - 5:50PM"], "path": "/class-descriptions/4660/SoC/COMM_ST/394-0/33044", "instructor": ["Miyanna Christine Williams"], "class_attributes": "No Freshmen<br/><br/>Undergraduate Students Only<br/><br/>", "id": "33044", "subject": "COMM_ST"}]