[{"class_mtg_info": [{"meet_t": "MoWeFr 10:00AM - 10:50AM", "meet_l": "University Hall 118"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores<br/>Add Consent: Department Consent Required<br/>", "qtr": "Fall 2016", "name": "14758", "title": "WCAS ENGLISH 105-6-22 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "14758", "instructors": [{"instructor_phone": "8474914965", "instructor_name": "Charles S Yarnoff", "instructor_addr": "555 Clark St., 243"}], "topic": "Immigrant Stories", "course": "105-6", "descriptions": [{"name": "Overview of class", "value": "In 2014, President Obama said, &quot;We are and always will be a nation of immigrants.&quot; What can we learn about the implications of that historical fact by reading stories written by and about immigrants to this country? The goal of this seminar is to answer that question as well as these others: How do immigrant experiences differ based on the era and country of origin, and in what ways are they similar? What happens to the relationships between parents and children through the process of acculturation into American society? How do social institutions and structures impact the lives of immigrants as they seek to pursue the American Dream? How do differences in national origin connect with other differences, particularly gender, race, ethnicity, and class?<br/><br/>We will read novels, memoirs, and poetry that range from the beginning to the end of the 20th century and that tell stories of immigrants from Barbados, China, Mexico, Russia, and elsewhere."}, {"name": "Teaching Method", "value": "Discussion is the primary teaching method. Students will also meet with the instructor individually outside of class throughout the quarter to discuss their papers."}, {"name": "Evaluation Method", "value": "Students will write three analytical papers, revising each one after meeting with the instructor. Students will also write short response essays to class readings. The course grade will include written work (70%) and class participation (30% including attendance and online peer comments on papers). There is no midterm or final exam."}, {"name": "Class Materials (Suggested)", "value": "The readings will include My Antonia by Willa Cather, Bread Givers by Anzia Yezierska, Brown Girl, Brownstones by Paule Marshall, Hunger of Memory by Richard Rodriguez, and other works."}], "lmod": "10/30/16 7:04 PM (CT)", "subject": "ENGLISH"}]