[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Kresge Centennial Hall 2-425"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "34756", "title": "WCAS SLAVIC 341-0-1 Structure of Modern Russian", "class_attributes": "Formal Studies Distro Area<br/><br/>", "section": "34756", "instructors": [{"instructor_phone": "847/491-8082", "instructor_name": "Elisabeth M Elliott", "instructor_addr": "Kresge Hall, 3-305, 1880 Campus Dr."}], "topic": "", "course": "341-0", "descriptions": [{"name": "Overview of class", "value": "In this course we will read about, discuss, and explore much of the most challenging parts of the grammatical structure of the Contemporary Standard Russian language from a synchronic point of view (that is, not historical). Topics to be covered include: tense, aspect, phonology (sound system), and if there's any extra time, case, morphology (prefixes, roots, suffixes). The course is designed with the needs and gaps in knowledge of Russian language students, teachers (future as well as Teaching Assistants), and native speakers of the Russian language to provide them with actual tools to understand Russian grammar thereby allowing them to be both better and more knowledgeable speakers and teachers of the language. Through covering these topics students in the course will also gain an understanding of some basic, core linguistic concepts which will add to students' general knowledge about language as a science as well as aiding in understanding why Russian grammar is the way it is (or isn't). No prior knowledge of linguistics is needed. This course is highly recommended for both undergraduate and graduate students who are serious about having better knowledge about the grammar of Russian as well as being a better speaker of Russian."}, {"name": "Registration Requirements", "value": "PREREQUISITES: SLAVIC 101-3 Elementary Russian or equivalent or permission of instructor."}, {"name": "Evaluation Method", "value": "EVALUATION METHOD: Discussions, group and individual presentations with handouts, homework sets, final presentation OR take-home final. <br/> <br/>40% Presentations &amp; handouts, other homeworks<br/>30% Discussion<br/>30% Take home final"}], "lmod": "2/21/17 6:51 PM (CT)", "subject": "SLAVIC"}]