[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "University Hall 101"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "12416", "title": "WCAS HISTORY 300-0-24 New Lectures in History", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "12416", "instructors": [{"instructor_phone": "847/467-3879", "instructor_name": "Michael J Kramer", "instructor_addr": "Harris Hall 212"}], "associated_classes": [{"component": "DIS", "room": "No Room Needed", "meeting_time": "TBA"}, {"component": "DIS", "room": "No Room Needed", "meeting_time": "TBA"}, {"component": "DIS", "room": "No Room Needed", "meeting_time": "TBA"}], "topic": "US Digital Culture Since WWII", "course": "300-0", "descriptions": [{"name": "Overview of class", "value": "Do you know why the modern computer was invented during World War II? To kill more people more accurately. How did it get from this militarized origin to its contemporary setting of social media, online shopping, algorithmic culture, and the &quot;Internet of things&quot;? This course probes the history of the &quot;computerized society&quot; and digital culture in the United States since 1945, approaching the topic from multiple angles: not only technological, but also legal, economic, political, and in terms of questions of gender, race, ethnicity, class, region, and ideology. Together, we will examine both the civilizing and the barbaric sides of computers in modern America. Students attend interactive lectures, read broadly and deeply about the topic, view films, participate in discussion, and complete three short and one longer essay for the course."}, {"name": "Registration Requirements", "value": "GRADING BASIS: P/N allowed"}, {"name": "Teaching Method", "value": "TEACHING METHOD: Lecture and discussion sections"}, {"name": "Evaluation Method", "value": "EVALUATION METHOD: Class and discussion section attendance and participation: 40%; assignment 1: 10%; assignment 2: 15%; assignment 3: 15%; final: 20%"}, {"name": "Class Materials (Required)", "value": "***Tentative until order posted to Norris website<br/>Martin Campbell-Kelly, William Aspray, Nathan Ensmenger, and Jeffrey R. Yost, Computer: A History of <br/>the Information Machine, Third Edition (New York: Westview Press, 2014), ISBN-13: 978-0813345901.<br/>Michael A. Hiltzik, Dealers of Lightning: Xerox Parc and the Dawn of the Computer Age (New York: <br/>HarperCollins, 1999), ISBN-13: 978-0887309892.<br/>Fred Turner, From Counterculture to Cyberculture: Stewart Brand, the Whole Earth Network, and the Rise <br/>of Digital Utopianism (Chicago: University of Chicago Press, 2006), ISBN-13: 978-0226817422.<br/>Andrew Blum, Tubes: A Journey to the Center of the Internet (New York: HarperCollins, 2012), ISBN-13: <br/>978-0061994951.<br/>Siva Vaidhyanathan, The Googlization of Everything (And Why We Should Worry) (Berkeley: University of <br/>California Press, 2011), ISBN-13: 978-0520272897.<br/>Additional articles, films, and websites on course website and/or on reserve at NU Library, see our <br/>Canvas course page."}], "lmod": "10/30/16 7:05 PM (CT)", "subject": "HISTORY"}]