[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Kresge Centennial Hall 3-410"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24104", "title": "WCAS FRENCH 210-0-20 Reading Literatures in French", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>Attendance at 1st class mandatory<br/><br/>Prerequisites apply, see description<br/><br/>Reading, writing, speaking proficiency<br/><br/>", "section": "24104", "instructors": [{"instructor_phone": "847/491-8255", "instructor_name": "Doris L Garraway", "instructor_addr": "1860 S. Campus Drive, Crowe Hall #2-134"}], "topic": "", "course": "210-0", "descriptions": [{"name": "Overview of class", "value": "This course introduces students to short literary works in French in three genres- novels, poetry, and theater, - that explore the theme of revolt. Against whom or what does one revolt in modern French literature, and toward what ends? Is revolt an exceptional, deviant, or nihilistic reflex or an essential precondition of modern notions of individuality, freedom, commitment, pleasure, social progress, or even authorship? To what extent does literature provide a privileged vehicle for revolt as the exception to the real? We situate our study in the nineteenth and twentieth centuries, an era of great social, political, and cultural change. Through readings of short works by authors such as Hugo, Baudelaire, Camus, Duras, and Césaire, we explore the meanings attached to various forms of revolt-socio-political, moral, ethical, irrational, existential, and aesthetic- while also considering their ambiguities and paradoxes. Taught in French."}, {"name": "Learning Objectives", "value": "-Acquire and practice skills in reading and interpreting literature in French<br/>-Develop language and writing skills useful in the analysis of literature and culture<br/>-Cultivate habits of critical thinking and reasoning in French <br/>-Gain an understanding of the complexity and resonance of the theme of revolt in modern French literature, along with exposure to some major French authors"}, {"name": "Teaching Method", "value": "Short lectures, discussion, writing assignments"}, {"name": "Class Materials (Required)", "value": "Hugo, Le dernier jour d'un condamné<br/>Camus, L'Étranger<br/>Duras, Moderato cantabile <br/>Césaire, Une Tempête<br/>Selections of poetry by Baudelaire and Lautréamont"}], "lmod": "12/29/16 6:58 PM (CT)", "subject": "FRENCH"}]