[{"class_mtg_info": [{"meet_t": "MoWe 2:30PM - 5:00PM", "meet_l": "Hogan 2-112 Cell/Tissue Cultur"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-requisite: Students must have completed NEUROSCIENCE 202 and 206, or BIOL_SCI 302, or BIOL_SCI 311 or gain consent of the instructor to enroll in this course.<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Spring 2017", "name": "34457", "title": "WCAS NEUROSCI 355-0-1 Neurogenetics of Behavior Laboratory", "class_attributes": "", "section": "34457", "instructors": [{"instructor_phone": "847/491-7039", "instructor_name": "Valerie   Kilman", "instructor_addr": "Hogan 2-160"}], "topic": "", "course": "355-0", "descriptions": [{"name": "Overview of class", "value": "This is a project-based laboratory to investigate the genetic roots of neurobiology and behavior in a simple model system. We focus on non-electrode methods to study neural circuits and behavior including mutant analysis, opto- and thermogenetics, neuroanatomical techniques, and behavioral paradigms such as courtship, aggression, circadian and sleep behavior. We will use the fruit fly as a model system because of the amazing genetic tools available to study the fly nervous system and the conservation of basic neurobiological processes between flies and humans. The course will consist of two sections with overlap. During the first section of the course you will learn a variety of techniques and assays to study the nervous system, practicing on genotypes with known phenotypes. As you learn and read, you will design a project using the techniques learned in class, to be completed in the final weeks of the course.<br/>This will be presented to the group in the final week of class. NOTE: You will need to come into the labs outside class time at least a few times a week to collect virgin flies. This is done at the beginning and the end of the day. It need not take more than 15-20 minutes once you become proficient but it is an ongoing task. You will likely also need to come to continue or finish experiments at flexibly scheduled times. Time outside lab is not expected to exceed 2 hours per week typically but motivated students are welcome to spend more time. Prerequisite: 202 and 306; or 311; or BIOL SCI 302."}, {"name": "Registration Requirements", "value": "Prerequisite: 202 and 206 (previously 306); or 311; or BIOL SCI 302, and consent of instructor."}, {"name": "Learning Objectives", "value": "Students will acquire a deep understanding of:<br/>1) Fundamental neurobiological principles arising from studies of the nervous system at the cellular and molecular level.<br/>2) History and recent developments in neuroscience research.<br/>3) Methods used to study the nervous system, including specific experimental techniques relevant to cellular and molecular neuroscience, the design, analysis and interpretation of experiments using specific techniques, and the strengths and limitations of those techniques.<br/>4) Ethical issues raised by the growing body of information generated by neuroscience research, including the use of animals."}, {"name": "Teaching Method", "value": "Laboratory"}, {"name": "Class Materials (Required)", "value": "? Fly Pushing: The Theory and Practice of Drosophila Genetics 2nd Edition by Ralph J. Greenspan. Cold Spring Harbor Laboratory Press. ISBN: 0879697113, List Price: $52.93. <br/>? Primary research articles and reviews<br/>? Public websites<br/>? Other material assembled/written by the instructor"}, {"name": "Class Notes", "value": "Pre-requisite: Students must have completed Neurosci 202 and 206 (previously 306); or 311; or BIOL SCI 302. Students must gain consent of instructor."}], "lmod": "2/19/17 6:50 PM (CT)", "subject": "NEUROSCI"}]