[{"class_mtg_info": [{"meet_t": "Mo 10:00AM - 12:50PM", "meet_l": "Scott Hall 201 Ripton Room"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "34140", "title": "WCAS POLI_SCI 395-0-21 Political Research Seminar", "class_attributes": "Department Majors Only<br/><br/>Juniors/Seniors Only<br/><br/>", "section": "34140", "instructors": [{"instructor_phone": "", "instructor_name": "Rachel Beatty Riedl", "instructor_addr": "601 University Hall, Scott Hall, #208"}], "topic": "Religion &amp; Politics", "course": "395-0", "descriptions": [{"name": "Overview of class", "value": "Prof. Riedl &quot;Religion &amp; Politics&quot; Spring 2016<br/>What is the relationship between religion and politics? This course examines the meanings of, and interactions between, religion and politics from a comparative perspective. We will begin by examining alternative theoretical understandings of the appropriate relationship between religion and state. Armed with these perspectives, we will investigate the implications of the various ways in which the religion-state relationship have been constructed for the nature of political conflict. <br/>Building on the approaches developed in the first part of the course, we will then turn our attention to several of the current issues in religion and politics: Why is religion apparently more important than ever despite an increasingly secular world? What is religious nationalism? What is fundamentalism? How can we explain the similarities and differences between religious fundamentalist movements across the globe? How should democratic states cope with the emergence of fundamentalist movements? In order to begin answering these questions, we will integrate the theoretical frameworks we develop with explorations of the historical and local context of relevant case-studies from around the world."}, {"name": "Registration Requirements", "value": "395 requirements; Juniors and seniors only. Students outside of Poli_Sci are welcome should room be available. Contact professor for permission.<br/>Attendance at first class required, No P/N Option"}, {"name": "Learning Objectives", "value": "The students will be expected to identify the key concepts in the course, problematize theories of representation and civic order, and highlight empirical examples of these general phenomenon. Students will apply these concepts and theories through original research, and present their findings to the class."}, {"name": "Teaching Method", "value": "Discussion/ Seminar / Student Research"}, {"name": "Evaluation Method", "value": "In Cass Participation and Discussion Leadership 20%; In Class Presentation on Supplementary Case Study Material 15%; Series of Short Assignments relating to final paper (Topic description, Outline, Bibliography, etc) 15%; Paper 50% (No final, the emphasis in the class will be on preparing an individual research project and written paper)."}, {"name": "Class Materials (Required)", "value": "Majority of course materials will be available on Canvas:<br/>Students will read selected portions from the following books, for ex:<br/>Appleby, R. Scott, The Ambivalence of the Sacred: Religion, Violence, and Reconciliation. Lanham: Rowman &amp; Littlefield.<br/>Durkheim, Emile. 2001. The Elementary Forms of Religious Life. New York: Oxford University Press. <br/>Gerges, Fawaz A. 2005. The Far Enemy: Why Jihad Went Global. Cambridge: Cambridge University Press.<br/>Van der Veer, Peter. 1994. Religious Nationalism: Hindus and Muslims in India. Berkeley: University of California Press.<br/>Weber, Max. 2001. The Protestant Ethic and the Spirit of Capitalism. Routledge."}], "lmod": "4/3/16 8:17 PM (CT)", "subject": "POLI_SCI"}]