[{"class_mtg_info": [{"meet_t": "We 1:00PM - 3:50PM", "meet_l": "RCMA Lower Level 113"}], "school": "MUSIC", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Fall 2016", "name": "15726", "title": "MUSIC MUS_THRY 405-0-20 Introduction to Research Methods in Music Theory and Cognition", "class_attributes": "", "section": "15726", "instructors": [{"instructor_phone": "", "instructor_name": "Mark Jonathan Butler", "instructor_addr": "mark-butler@northwestern.edu"}], "topic": "", "course": "405-0", "descriptions": [{"name": "Overview of class", "value": "<html><em>Introduction to Research in Music Theory</em> <br/><p>This course is an introduction to the research methods and scholarship of music theory, broadly construed. It will center around intensive, student-driven reading and discussion of current research. We will read widely across various areas within the field, considering questions such as the following:<br/><ul><br/><li>What is the nature of evidence in the field of music theory?</li> <br/><li>What kinds of questions has music theory asked?</li><br/><li>What kinds of agendas seem to inform or guide music theory (including unacknowledged ones)? </li><br/><li>What kinds of representations are used in music-theoretical arguments? What do they represent? </li> <br/><li>What qualities and features are involved in an effective musical analysis? In what ways might analysis be involved in developing a larger argument?</li><br/><li>What kinds of things can music-theoretical arguments accomplish? How might the scope of such arguments be expanded?</li></ul></p></html>"}, {"name": "Registration Requirements", "value": "<html><p>The course will be directed toward graduate students in the Music Theory and Cognition program, although other students with a strong interest in music theory are welcome provided that they have sufficient background and skills to engage with high-level scholarship in this area. Passage of the music theory diagnostic or successful completion of the theory review course is a prerequisite. Students wishing to enroll in the course should contact the professor to discuss suitability (mark-butler@northwestern.edu).</p></html>"}], "lmod": "10/30/16 6:35 PM (CT)", "subject": "MUS_THRY"}]