[{"class_mtg_info": [{"meet_t": "MoWeFr 9:00AM - 9:50AM", "meet_l": "Frances Searle Building 1441"}], "school": "WCAS", "overview_of_class": "This is a quantitative animal physiology course focusing on vertebrates, but the higher levels of invertebrates (mollusks and arthropods) will also be considered at some times. The emphasis will be on the physiological mechanisms used by animals to meet the common challenges of circulation, gas exchange, nutrient supply and metabolism, temperature regulation, water balance, and locomotion in the context of their environments.", "qtr": "Fall 2017", "name": "Animal Physiology", "title": "WCAS BIOL_SCI 325-0-01 Animal Physiology", "lmod": "5/9/17 7:14 PM (CT)", "section": "01", "associated_classes": [{"component": "DIS", "room": "Technological Institute L361", "meeting_time": "Tu 4:00PM - 4:50PM"}, {"component": "DIS", "room": "TBA", "meeting_time": "Tu 5:00PM - 5:50PM"}], "topic": "", "course": "325-0", "enrl_requirement": "Enrollment Requirements: PRE-REG: Reserved for Biology Majors of any concentration.<br/><br/>Pre-requisite: Students must have completed BIOL_SCI 217 to enroll in this course.", "descriptions": [{"name": "Overview of class", "value": "This is a quantitative animal physiology course focusing on vertebrates, but the higher levels of invertebrates (mollusks and arthropods) will also be considered at some times. The emphasis will be on the physiological mechanisms used by animals to meet the common challenges of circulation, gas exchange, nutrient supply and metabolism, temperature regulation, water balance, and locomotion in the context of their environments."}, {"name": "Registration Requirements", "value": "Prerequisites: BIO 117 or 217."}, {"name": "Learning Objectives", "value": "Content:<br/>1. Students will be able to describe features that characterize animals, and give essential differences in body plan and organ systems among phyla that relate to physiology.<br/>2. Students will be able to describe the central importance of energy metabolism in animal physiology, including how metabolic rate depends on animal size, phylogenetic class, body and environmental temperature, and exercise for poikilotherms and homeotherms.<br/>3. Students will be able to describe the functions of the digestive, cardiovascular, respiratory, and excretory systems for mammals, and identify important differences in these systems across the vertebrate classes.<br/>4. Students will be able to describe endocrine control of metabolism and salt and water balance, including the hormones involved, the stimuli causing release of the hormones, and the action of the hormones.<br/>5. Students will be able to identify similarities and differences of different types of muscles, and explain basic control mechanisms for them.<br/>Skills:<br/>1. Students will be able to manipulate physical, chemical, and mathematical concepts relevant to the physiological systems under consideration to solve quantitative problems that extend understanding of the physiology. Important concepts include dependent vs. independent variables, power laws, properties of oxygen and carbon dioxide in the gas and liquid phase, pressure-flow-resistance equations, osmolarity, and heat and mass transfer mechanisms.<br/>2. Students will be able to use spreadsheets to manipulate and graph data.<br/>3. Students will learn conventions of scientific writing and be able to use these to assist their reading of the literature and the development of their own scientific writing.<br/>4. Students will be able to write a paper that uses research literature in physiology to generate answers to questions and generate proposals for further research."}, {"name": "Teaching Method", "value": "Lecture and discussion section. Required attendance at some discussion sections. Students will be required to have a Turning TechnologiesTransmitter (Clicker) or a smart phone, both of which require a Turning Technologies Cloud account."}, {"name": "Evaluation Method", "value": "One midterm, a final exam, a paper, 2 or 3 homework sets, and participation with \"clickers.\" The course will not be graded on a curve, but will have fixed requirements for each grade."}, {"name": "Class Materials (Required)", "value": "Animal Physiology by Hill, 4th Edition, Richard W. Hill, Gordon A. Wyse, and Margaret Anderson, Publisher: Sinauer Associates list $160 new<br/>ISBN 978-0-87893-559-8, casebound <br/>ISBN 978-0-87893-898-8, Looseleaf Textbook <br/><br/>Some readings will also be assigned from the 217 physiology text: Human Physiology by Silverthorn, 7th, 6th or 5th edition list $140 NEW<br/><br/>Clickers $60 new"}, {"name": "Class Notes", "value": "Required attendance at some discussion sections. Students will be required to have a Turning Point Transmitter (clicker)."}], "instructor": ["Robert A Linsenmeier"], "class_attributes": "Prerequisites apply, see description<br/><br/>", "id": "14708", "subject": "BIOL_SCI"}]