[{"class_mtg_info": [{"meet_t": "We 6:15PM - 9:15PM", "meet_l": "Locy Hall 303"}], "school": "SCS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "37854", "title": "SCS CHINESE 121-C-62 Chinese II", "class_attributes": "", "section": "37854", "instructors": [{"instructor_phone": "8474918130", "instructor_name": "Chyi   Chung", "instructor_addr": "CROWE 1860 Campus Dr 1-159 EV2161"}], "topic": "", "course": "121-C", "descriptions": [{"name": "Overview of class", "value": "This intermediate Chinese three-course sequence is designed to link to the first year Chinese curriculum by continuing to provide a practical, learner-centered learning experience for intermediate level students. Conversation, listening comprehension, character practicing, grammar, communicative exercises and essay writing are included throughout the course. This third course emphasizes the building of students' abilities in the four skills of listening, speaking, reading and writing as they can reach the intermediate level of competence. The content and activities in this course are to increase students' &quot;media literacy,&quot; accomplished by including class materials in styles of newspaper, magazines, and Internet news articles."}, {"name": "Registration Requirements", "value": "Chinese 121-A,-B or equivalent. Chinese II courses are suggested to be taken in sequence."}, {"name": "Learning Objectives", "value": "While students of Intermediate Chinese need to continue to build their mastery of commonly used vocabulary and grammatical structures, this course also focuses on the building of students' abilities in the four skills of listening, speaking, reading and writing as they can reach the intermediate level of competence."}, {"name": "Class Materials (Required)", "value": "Textbook: Modern Chinese 1B 1st ed, Better Chinese LLC. ISBN: 978-1-60603-484-2"}, {"name": "Class Notes", "value": "For each lesson, students will study the new vocabulary items, grammar notes and sentence patterns, and will learn to use them in different life-like situations. Students will be actively engaged in the learning process through various kinds of in-class exercises, which include vocabulary dictations, pattern drills, listening comprehension exercises, reading practice, situational dialogue, role-play, and language games, etc."}], "lmod": "4/3/16 7:31 PM (CT)", "subject": "CHINESE"}]