[{"class_mtg_info": [{"meet_t": "We 3:30PM - 6:20PM", "meet_l": "University Library 4670"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "22906", "title": "WCAS POLI_SCI 395-0-22 Political Research Seminar", "class_attributes": "Attendance at 1st class mandatory<br/><br/>Auditing not permitted<br/><br/>Department Majors Only<br/><br/>Juniors/Seniors Only<br/><br/>", "section": "22906", "instructors": [{"instructor_phone": "", "instructor_name": "Moses   Khisa", "instructor_addr": ""}], "topic": "The Unequal Global Political Economy", "course": "395-0", "descriptions": [{"name": "Overview of class", "value": "The Unequal Global Political Economy, Prof. Moses Khisa, Winter 2017<br/>The globe is diverse, varied, and complex. But it is also highly unequal and uneven. Scholarly debates have focused mainly on global economic inequality. But there is gross political inequality too, in the regimes and institutions that govern transnational relations, in military capabilities, and in the political influences that nation-states and non-state actors wield. There are extreme inequalities in the global distribution of material resources and wealth, but there is equally wide disparities in the concentration of particularly influential ideas and political practices between the global North and the South.<br/>In this research and writing seminar, we will take up this topical and critical aspect of the global political economy and interrogate its wide-ranging causes and consequences. The first part of this seminar will survey key domains of material and political inequality, including disparities in national and cross-national income, production output, supranational organizations and global governance institutions, trade and financial flows, multilateral agreements, among others. The second part of the seminar will cover some of the major consequences of global political and economic inequality: poverty and human development, borrowing and indebtedness, global order and instability, etc."}, {"name": "Registration Requirements", "value": "Seniors and Juniors"}, {"name": "Learning Objectives", "value": "The complex and nuanced issues surrounding global inequality, both political and economic"}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "1. Seminar attendance and participation: 20%<br/>2. Leading seminar discussion once: 10%<br/>3. Peer-critique of a research synopsis: 10%<br/>4. Peer-critique of draft research paper: 10%<br/>5. Final paper: 50%"}, {"name": "Class Materials (Required)", "value": "Branko Milanovic, Global Inequality: A New Approach for the Age of Globalization (Cambridge, Mass: The Belknap Press, 2016) ISBN: 978-0-674-73713-6, hardcover; <br/>Joseph Stiglitz, Making Globalization Work (New York: Norton, 2007) ISBN-13: 978-0-393-33028-1 paperback <br/>We will also draw heavily on the works of Thomas Piketty, Dani Rodrick, Peter Singer, Lloyd Grubber, and Armtya Sen. These will be available as scanned chapters on Canvas. We will also use journal articles and Op-Ed pieces."}], "lmod": "12/25/16 7:05 PM (CT)", "subject": "POLI_SCI"}]