[{"class_mtg_info": [{"meet_t": "We 6:00PM - 8:45PM", "meet_l": "Frances Searle Building 3220"}], "school": "SoC", "overview_of_class": "Theories and intervention principles for disorders of oral language, reading, written language, mathematics, and nonverbal learning.<br/>GENERAL OUTLINE AND UNITS OF THE COURSE<br/>I. Definitions, principles of assessment, theoretical perspectives, and legal issues.<br/>II. Approaches to instruction. <br/>III. Disorders of oral language (listening and speaking).<br/>IV. Disorders of reading (decoding and comprehension).<br/>V. Disorders of written language.<br/>VI. Disorders of mathematics.<br/>VII. Nonverbal disabilities and social skills.<br/>VIII. Approaches to progress monitoring and service delivery: implications for accommodations, instruction, and transition to higher education and the world of work.<br/>IX. Long term outlook and prognosis, follow-up studies, psychosocial, educational, and vocational needs.", "qtr": "Fall 2017", "name": "Diagnostic & Remedial Approaches for Children With Learning Problems", "title": "SoC CSD 376-0-20 Diagnostic &amp; Remedial Approaches for Children With Learning Problems", "lmod": "9/12/17 6:48 PM (CT)", "section": "20", "topic": "", "course": "376-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Theories and intervention principles for disorders of oral language, reading, written language, mathematics, and nonverbal learning.<br/>GENERAL OUTLINE AND UNITS OF THE COURSE<br/>I. Definitions, principles of assessment, theoretical perspectives, and legal issues.<br/>II. Approaches to instruction. <br/>III. Disorders of oral language (listening and speaking).<br/>IV. Disorders of reading (decoding and comprehension).<br/>V. Disorders of written language.<br/>VI. Disorders of mathematics.<br/>VII. Nonverbal disabilities and social skills.<br/>VIII. Approaches to progress monitoring and service delivery: implications for accommodations, instruction, and transition to higher education and the world of work.<br/>IX. Long term outlook and prognosis, follow-up studies, psychosocial, educational, and vocational needs."}, {"name": "Learning Objectives", "value": "1. To be able to summarize the symptoms of LD that one might observe across the life span.<br/>2. To be able to list and discuss the significance of several components of the LD definition.<br/>3. To be able to compare and contrast a discrepancy model with other approaches used to identify children and adults with learning disabilities.<br/>4. To be able to do an analysis of tasks and tests using the theoretical constructs discussed in class.<br/>5. To be able to define and summarize several principles of clinical teaching and other types of instruction (e.g. Direct Instruction).<br/>6. To be able to list types of accommodations that can be provided.<br/>7. To be able to summarize instructional principles for various types of learning disabilities.<br/>8. To be able to summarize results of long-term studies."}, {"name": "Class Materials (Required)", "value": "Readings are available at Quartet Copies, 825 Clark Street in Evanston The cost is approximately $40."}, {"name": "Class Notes", "value": "BROAD GOALS:<br/>To gain an understanding of learning disabilities and the heterogeneity within the population.<br/>To become familiar with the symptomatology across the life span.<br/>To become familiar with general theoretical perspectives which are used in the field.<br/>To understand the principles of assessment and differential diagnosis.<br/>To understand several theoretical constructs (schema) on which diagnosis and intervention can be based. Emphasis will be given to clinical teaching.<br/>To become familiar with areas of learning that should be considered in a psychoeducational evaluation and to understand types of assessment that can be used for eligibility and intervention.<br/>To become aware of relationships between various learning problems and clusters of disorders that co-occur.<br/>To be able to generate hypotheses about the meaning of success and error patterns within each area of achievement.<br/>To understand principles, procedures, and techniques for instruction and accommodations that may be needed for specific types of learning disabilities.<br/>To understand the types of services and delivery systems used in schools.<br/>To understand the need for various types of progress monitoring.<br/>To understand possible long-term needs and outcomes, including risk and resilience."}], "instructor": ["Frank W. Vansanten"], "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "id": "10923", "subject": "CSD"}]