[{"school": "WCAS", "overview_of_class": "In this course we will study the relations among gender, race, and freedom in novels by Toni Morrison. We will pay special attention to the narrative forms and strategies Morrison employs to depict the (im)possibilities of freedom in the post-civil rights era. While considering how narrative strategies and structures animate depictions of freedom, we will also discuss how the novels themselves enact freedom by transgressing the limits of genre through manipulations of knowledge, space, and time. We will continually address issues of gender, race, and place in relation to African American desires for freedom. Our study will be guided by several questions: What forms does freedom take, both aesthetically and politically, in these novels? What demands do aesthetic forms of freedom, that is, innovative writing, place on the reader, in terms of literacy and ethics? How does Morrison imagine freedom differently across texts and decades and for what purposes? Our discussions will place Morrison's treatment of freedom at the center of contemporary debates over the prospects of a post-racial America, the utility of the history of slavery, and the protocols of racial representation.", "name": "American Novel", "section": "20", "location": "University Hall 102", "topic": "Toni Morrison and the Form of Freedom", "course": "371-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4640/WCAS/ENGLISH/371-0/11979", "instructor": ["Shaundra J Myers"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "11979", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "This course will involve the close reading of Faulkner's  four  great tragic novels of race and identity: The Sound and The Fury (1929), As I Lay Dying (1930), Light In August (1932),  and  Absalom, Absalom! (1936). Until very recently, these works have been considered central to the canon of modernist fiction and read as meditations on the tortured consciousness of the artist (TSATF, AILD, AA! ) or the dilemma of the outsider adrift in an alienating world (LIA).  Saturating Faulkner's novels are images of the anguished history of race relations in the American South from the 19th century to the Great Migration and Great Depression.  Yet the tragic legacy of slavery, Faulkner's abiding subject, has been understood by critics as a figure for more abstract and universal moral predicaments.  Our investigation seeks to localize Faulkner's representation of history, particularly his vision of slavery and the effects of the color line, as a specifically American crisis, embodied in the remarkable chorus of narrative voices and visions that constitute his fictive world.", "name": "American Novel", "section": "21", "location": "Parkes Hall 223", "topic": "Race & Politics in Faulkner", "course": "371-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4640/WCAS/ENGLISH/371-0/11980", "instructor": ["Julia Ann   Stern"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "11980", "subject": "ENGLISH"}]