[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Annenberg Hall G21"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-registration - Reserved for Political Science students.", "qtr": "Spring 2017", "name": "35532", "title": "WCAS POLI_SCI 377-0-20 Drugs and Politics", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "35532", "instructors": [{"instructor_phone": "", "instructor_name": "Ana Maria Arjona", "instructor_addr": "Scott Hall, Room 237"}], "associated_classes": [{"component": "DIS", "room": "University Hall 101", "meeting_time": "Th 5:00PM - 5:50PM"}, {"component": "DIS", "room": "University Hall 101", "meeting_time": "Th 5:00PM - 5:50PM"}, {"component": "DIS", "room": "University Hall 101", "meeting_time": "Th 6:00PM - 6:50PM"}, {"component": "DIS", "room": "University Hall 101", "meeting_time": "Th 6:00PM - 6:50PM"}, {"component": "DIS", "room": "Fisk Hall 114", "meeting_time": "Fr 10:00AM - 10:50AM"}, {"component": "DIS", "room": "Fisk Hall 114", "meeting_time": "Fr 11:00AM - 11:50AM"}], "topic": "", "course": "377-0", "descriptions": [{"name": "Overview of class", "value": "This course examines the links between illegal drugs and politics, from the politics of local communities to international public policy. The production, distribution, and consumption of illicit drugs affect politics in a myriad of ways by shaping individual behavior, local and national institutions, cultural practices, markets, and international relations. The aim of the course is to examine these linkstheoretically and empiricallywith a focus on North, Central, and South America. We will critically analyze public policy on &quot;the drugs problem&quot;, especially the US-led &quot;war on drugs&quot;."}, {"name": "Learning Objectives", "value": "(i) Students will acquire a critical understanding of the local, national, and regional dynamics of the illicit drug trade.<br/>(ii) Students will be able to identify relations between contemporary Latin American major problems (like corruption and violence) and the illicit drug trade.<br/>(iii) Students will acquire a critical understanding of the role that illicit drugs play in U.S.-Latin American relations.<br/>(iv) Students will acquire a critical understanding of public policy on illicit drugs.<br/>(v) Students will improve their analytical skills for studying political and social phenomena. In particular, they will improve their capacity to evaluate statements about causality.<br/>(v) Students will improve their analytical skills for studying public policy. In particular, they will improve their capacity to evaluate normative and positive statements and the links between them."}, {"name": "Teaching Method", "value": "Lecture"}, {"name": "Evaluation Method", "value": "1 midterm<br/>1 final exam"}, {"name": "Class Materials (Required)", "value": "&quot;Articles and book chapters:<br/>? David Mares, 2005. Drug Wars and Coffee Houses. CQ Press. Chapters 2, 3, 4 &amp; 5 (pp. 35-93).<br/>? Gootenberg, Paul, 2008. Andean Cocaine. Chapter 7. The University of North Carolina Press (pp. 291-324).<br/>? U.S. Department of Justice National Drug Intelligence Center, 2011. &quot;The Economic Impact of Illicit Drug Use on American Society&quot;. (pp- 1-53)<br/>? La Sierra, documentary on paramilitary gangs in Medellín, Colombia (screened in class).<br/>? Lupsha, Peter, 1991. &quot;Drug lords and narco-corruption: The players change but the game continues&quot;. Crime, Law and Social Change, 16: 41-58.<br/>? Shelley, Louise, 2001. &quot;Corruption and Organized Crime in Mexico in the Post-PRI Transition&quot;. Journal of Contemporary Criminal Justice 17: 213-231.<br/>? Lee, Rensselaer, 2001. &quot;Colmbia's cocaine syndicates&quot;. Crime, Law and Social Change, 16:3-39. <br/>? Snyder, Richard, and Angelica Duran-Martinez. 2009. &quot;Does illegality breed violence? Drug trafficking and state-sponsored protection rackets.&quot; Crime, Law and Social Change 52, (3) (Sep): 253-273.<br/>? Reuter, Peter. 2009. &quot;Systemic violence in drug markets.&quot; Crime, Law and Social Change 52, (3) (Sep): 275-284.<br/>? Arana, Ana, 2005. &quot;How the street gangs took Central America&quot;. Foreign Affairs Vol. 84, No. 3 (May - June), pp. 98-110.<br/>? Finnegan, William, 2010. &quot;Silver or Lead. The drug cartel La Familia gives local officials a choice: Take a bribe or a bullet.&quot; The New Yorker, May 31.<br/>? Cornell, Svante, 2005. &quot;The Interaction of Narcotics and Conflict&quot;. Journal of Peace Research 42: 751-760.<br/>? Kan, Paul R., 2006. &quot;Webs of smoke: Drugs and small wars&quot;. Small Wars and Insurgencies 17, (2) (June): 148-162<br/>? Felbab-Brown, Vanda, 2010. Shooting Up. Counterinsurgency and the War on Drugs. Chapters 1 &amp; 2 (pp. 1-34)<br/>? Felbab-Brown, Vanda, 2005. &quot;The Coca Connection: Conflict and Drugs in Colombia and Peru.&quot; Journal of Conflict Studies, 25:104-128. <br/>? Sánchez, Gonzalo, 2000. &quot;War and Politics in Colombian Society&quot;. International Journal of Politics, Culture, And Society, Volume 14, Number 1, 51-69.<br/>? Drugs, politics, and soccer: &quot;The two Escobars&quot;. Documentary (in class)<br/>? Guillermoprieto, Alma, 2008. &quot;Days of the Dead. The new narcocultura.&quot; The New Yorker. November 10 (pp. 1-10).<br/>? Alma Guillermoprieto, 2009. &quot;The Narcovirus&quot;. Berkeley Review of Latin American Studies Spring (pp. 1-9).<br/>? Gootenberg, Paul, 2011. &quot;Cocaine's Long March North, 1900-2010&quot;. Latin American Politics and Society.<br/>? Naim, Moises. 2009. Wasted: The American prohibition on thinking smart in the drug war. Foreign Policy (172) (May-June): 168-171.<br/>? MacCoun, Robert and Peter Reuter, &quot;Philosophical underpinnings.&quot; In Huggines (1999, op. cit.) In Huggines (1999, op. cit.) (pp. 33-50).<br/>? Szaszm, Thomas, &quot;The American Ambivalente: Liberty vs. Utopia.&quot; In Huggines (1999, op. cit.) (pp. 51-60).<br/>? Rouse, J. J. and Bruce D. Johnson, &quot;Hidden paradigms of morality in debates about drugs: historical and policy shifts in British and American drug policies&quot; (pp. 61-76).<br/>? Friedman, Milton, &quot;There is no justice in the war on drugs&quot;. In Huggins, Laura (Ed.), 1999, Drug war deadlock. The policy battle continues. Hoover Institution Press (pp. 77-80).<br/>? Bennett, William, &quot;Don't surrender: the drug war worked once. It can again.&quot; In Huggins, op. cit. (pp. 81-84).<br/>? Friedman, Milton, &quot;An open letter to William Bennett&quot;. In Huggins, op. cit. (pp. 85-87).<br/>? &quot;Report of the Global Commission on Drug Policy 2011&quot; (pp. 1-19) <br/>? The Economist, &quot;The case for legalization: Time for a Puff of Sanity&quot;. In Huggins, op. cit. (pp. 126-130)<br/>? Wilson, James !., &quot;Against the Legalization of Drugs&quot; In Huggins, op. cit. (pp. 131-150)<br/>? Staley, Sam, &quot;The decriminalization alternative&quot; In Huggins, op. cit. (pp. 157-178)<br/>? Bayer, Ronald, &quot;The great drug policy debate?what means this thing called decriminalization?&quot; In Huggins, op. cit. (pp. 179-202)&quot;"}], "lmod": "2/8/17 6:45 PM (CT)", "subject": "POLI_SCI"}]