[{"school": "WCAS", "overview_of_class": "This course is about love and desire, in the most un-sensual meanings of those words. We'll begin with Augustine, who treats love and desire as basic and characteristic of moral thinking-thought about the right and the good. We'll end with Confucius and his followers, who think that love is a skill-and so it can't be what Augustine thought it must be. In between we'll read sources outside of the normal philosophical canon, from women writing in 17th c. Britain, to Tibetan Buddhists, and perhaps some more as well.", "name": "First-Year Seminar in Philosophy", "section": "20", "location": "University Library 4670", "topic": "Desire and Mind", "course": "109-6", "meeting_time": ["MoWe 12:30PM - 1:50PM"], "path": "/class-descriptions/4660/WCAS/PHIL/109-6/34459", "instructor": ["Sean Christopher Ebels Duggan"], "class_attributes": "WCAS First-Year Seminar<br/><br/>Freshmen Only<br/><br/>", "id": "34459", "subject": "PHIL"}, {"school": "WCAS", "overview_of_class": "There are many different and incommensurable kinds of goods: consumer goods (like cars and computers and clothes), personal relationships (love and friendship), goods of status, bodily goods (health, freedom from pain), opportunities for meaningful work, leisure, and so on. We will explore the moral and political implications of the idea that the way in which a specific good should be allocated, promoted and engaged with depends on the type of good it is. In particular, we'll be interested in the contrast between marketable goods - commodities - and other sorts of goods. If there are things that should not be for sale, why is that, and what does it say about the nature of value?", "name": "First-Year Seminar in Philosophy", "section": "21", "location": "Kresge 3438 Philosophy Sem. Rm", "topic": "Love and Money", "course": "109-6", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4660/WCAS/PHIL/109-6/34460", "instructor": ["Stephen John White"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "34460", "subject": "PHIL"}]