[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Kresge Centennial Hall 2-430"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Spring 2017", "name": "33955", "title": "WCAS HUM 310-4-20 Global Humanities Lab", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "33955", "instructors": [{"instructor_phone": "847/467-5173", "instructor_name": "Anna Maree Parkinson", "instructor_addr": "1800 Campus Drive, 3-321 Kresge Centennial Hall, Evanston"}], "topic": "Charting Modern Cities: Chicago, Vienna", "course": "310-4", "descriptions": [{"name": "Overview of class", "value": "How is a city a measure of culture? What do we focus on when studying cities?<br/><br/>In this course students will explore the distinctive histories and material cultures of two modern cities: Vienna and Chicago. In Vienna, we will encounter ideas and artworks from the fin-de-siècle Vienna Modern at the heart of Central Europe, through to current political cultures of human rights and migration. In the US-American context, students will trace Chicago's brand of modernity exemplified in the history of urban planning and architectural styles, as well as domestic and transnational migration's impact on art and social movements.<br/>In tandem with excursions, students will draw on interdisciplinary approaches from urban studies, literary and film studies, sociology, art history, philosophy, psychoanalysis, political science, intellectual history, and architecture as they seek answers through their research to the questions: <em>how is the city constituted as an object of analysis; and how does a city shape?and, simultaneously, is shaped by?its inhabitants?</em><br/><br/>This course brings students to Vienna, Austria, flying roundtrip from Chicago on approximately March 18 and returning to Chicago on March 25th. The Kaplan Institute will provide transportation and lodging for all students to travel to Vienna. Students must attend this field study to Vienna as well as enroll in and complete HUM 310-0 in spring 2017.<br/><br/><strong>Enrollment in this course is by application only.</strong> The application deadline was November 28, 2016."}, {"name": "Class Notes", "value": "Enrollment in this course is by application only. The application deadline was November 28, 2016. <br/>More details can be found on the Kaplan Humanities Institute website: humanities.northwestern.edu/undergraduate/global-humanities-lab"}], "lmod": "2/21/17 6:48 PM (CT)", "subject": "HUM"}]