[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "Locy Hall 111"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "22772", "title": "WCAS ART_HIST 389-0-21 Special Topics: Arts of Asia and the Middle East", "class_attributes": "", "section": "22772", "instructors": [{"instructor_phone": "", "instructor_name": "Bilha   Moor", "instructor_addr": ""}], "topic": "", "course": "389-0", "descriptions": [{"name": "Overview of class", "value": "What is ?Islamic' in Islamic art? An introduction to art and architecture in the Islamic lands from the days of the Prophet Muhammad in the 7th century until the reign of Sultan Suleyman the Magnificent in the 16th century. The course surveys mosques, palaces, madrasas, and tombs, and also calligraphy, sculpture, ceramics, and painting in historical and literary contexts. It covers a vast geographical area, from Spain in the west to India in the east, and discusses both common and unique characteristics of architecture and figurative representations in these regions. <br/><br/>The first part of the course focuses on early Islamic art during the Umayyad and ?Abbasid periods, and examines the artists' response to Byzantine and Sassanid (pre-Islamic Persian) art and architecture. The second part of the survey begins with the Mongol invasions into the Middle East during the 13th century, and points to the changes that occurred in Islamic art as a result of the artists' acquaintance with East and Central Asian art and culture."}, {"name": "Registration Requirements", "value": "1 200 level art history class or permission from instructor"}, {"name": "Teaching Method", "value": "DiscussionLectureReadings"}, {"name": "Evaluation Method", "value": "Exam, finalPapers"}, {"name": "Class Materials (Required)", "value": "Ettinghausen, Richard, Oleg Grabar, and Marilyn Jenkins-Madina. The Art and Architecture of Islam 650-1250. New Haven and London: Yale University Press, 2001.<br/><br/>Blair, Sheila. S., and Jonathan Bloom. The Art and Architecture of Islam 1250-1800. New Haven and London: Yale University Press, 1994."}], "lmod": "1/9/16 6:43 PM (CT)", "subject": "ART_HIST"}]