[{"class_mtg_info": [{"meet_t": "Mo 2:00PM - 4:50PM", "meet_l": "Harris Hall room 101"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "25071", "title": "WCAS HISTORY 430-1-20 Field Seminar in Medieval European History", "class_attributes": "", "section": "25071", "instructors": [{"instructor_phone": "847/491-7652", "instructor_name": "Dyan H Elliott", "instructor_addr": "Harris Hall Room 337"}], "topic": "", "course": "430-1", "descriptions": [{"name": "Overview of class", "value": "This course provides an introduction to the social, cultural, and intellectual life of the high and later Middle Ages by highlighting both select primary sources as well as modern scholarship. Topics covered in primary and secondary sources will include medieval law, scholasticism, vernacular culture, hagiography, and the inquisition against heretics. The class also highlights critical debates in contemporary historiography, focusing on issues like society's margins as a historical force; the history of the emotions; and religion and coercion. Attention will be given to important theoretical considerations such as gender analysis; Foucauldian perspectives."}, {"name": "Teaching Method", "value": "Discussion and individual presentations"}, {"name": "Evaluation Method", "value": "Attendance and participation; short weekly papers"}, {"name": "Class Materials (Required)", "value": "Bynum, Caroline Walker. Holy Feast and Holy Fast: The religious Significance of Food to Medieval Women. U of California Press, 1988. 978-0520063297<br/><br/>Cohen, Esther. Modulated scream: Pain in medieval culture. Chicago UP, 2010. 978-0226112671 <br/><br/>Jordan, William Chester. From England to France: Felony and Exile in the High Middle Ages. Princeton UP, 2015. 978-0691164953<br/><br/>Karras, Ruth Mazo. Unmarriages: Women, men, and sexual unions in the Middle Ages. Philadelphia: University of Pennsylvania Press, 2012 978-0812222982<br/><br/>Moore, R.I. The War on Heresy. Belknap Press, 2014. 978-0674416895<br/><br/>Nirenberg, David. Communities of Violence. Princeton UP, 1998. 978-0801440625<br/><br/>Symes, Carol. A Common Stage: Theater and Public Life in Medieval Arras. Cornell UP, 2007. 978-0801445811<br/><br/>Witt, Ronald. Two Latin Cultures and the Foundation of Renaissance Humanism. Cambridge UP, 2013 978-0521764742"}], "lmod": "1/9/16 6:48 PM (CT)", "subject": "HISTORY"}]