[{"class_mtg_info": [{"meet_t": "MoWeFr 10:00AM - 10:50AM", "meet_l": "Technological Institute L221"}], "school": "MEAS", "overview_of_class": "Presents a method for solving simple and complex chemical equilibrium problems in aqueous solutions. The method is applied to natural as well as engineered aquatic systems.", "qtr": "Fall 2017", "name": "Aquatic Chemistry", "title": "MEAS CIV_ENV 367-0-20 Aquatic Chemistry", "lmod": "9/12/17 6:38 PM (CT)", "section": "20", "associated_classes": [{"component": "DIS", "room": "Technological Institute A110", "meeting_time": "Th 12:30PM - 1:50PM"}], "topic": "", "course": "367-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Presents a method for solving simple and complex chemical equilibrium problems in aqueous solutions. The method is applied to natural as well as engineered aquatic systems."}, {"name": "Registration Requirements", "value": "Basic Chemistry: CHEM 101, 102, & 103 or equivalent.<br/>? Thermodynamics: BMD ENG 250; CHEM 341 or equivalent.<br/>? Computer Programming/Use: may be helpful for some of the exercises. We will use a computer program<br/>available on the net: ChemEql that does not require any programming background."}, {"name": "Learning Objectives", "value": "Upon completion of this course students will be able to:<br/><br/>? Understand the tableau method used for solving equilibrium problems.<br/>? Master a computer program to find the solution of complex equilibrium problems.<br/>? Derive and use chemical thermodynamics laws & principles to determine how equilibrium properties vary<br/>with T and P.<br/>? Determine the pH of a variety of aqueous solutions, i.e., containing multiple acid/base species, and gain a<br/>detailed understanding of the carbonate system.<br/>? Compute the chemical speciation of metals in complex aqueous systems.<br/>? Determine the composition of natural waters at equilibrium with various mineral phases.<br/><br/>For the engineering student, the course primarily supports the following ABET program outcome criteria:<br/>(a) An ability to apply knowledge of Chemistry.<br/><br/>In addition it provides some support to address:<br/><br/>? (e) An ability to identify, formulate, and solve engineering problems.<br/>? (h) The broad education necessary to understand the impact of engineering solutions in a global, economic,<br/>environmental and social context.<br/>? (j) A knowledge of contemporary issues.<br/>? (k) An ability to use the techniques, skills, and modern engineering tools necessary for engineering practice,<br/>including concepts of professional practice."}, {"name": "Evaluation Method", "value": "Exam, final: 20%<br/>Exam, mid-term: 20%<br/>Group project: 20%<br/>Homework: 40%<br/>"}, {"name": "Class Materials (Suggested)", "value": "Stumm, Werner and Morgan, James J. Chemical Equilibria and Rates in Natural Waters. 3rd. ed. Wiley, 1996<br/><br/>ISBN- 978-0-471-51185-4"}], "instructor": ["Jean-Francois   Gaillard"], "class_attributes": "", "id": "11569", "subject": "CIV_ENV"}]