[{"class_mtg_info": [{"meet_t": "MoWeFr 10:00AM - 10:50AM", "meet_l": "Harris Hall 107"}], "school": "WCAS", "overview_of_class": "In this course, we will explore the major themes of early American history, from the first encounters between native people, Europeans, and Africans to the impassioned battles of the Civil War.  Our goal will be to track the variety of meanings that America had for the people who lived here: men and women, rich and poor, free and slave.  We will examine stories of growth and decay, of war and peace, of conflict and collaboration.  We will also tell a story about how thirteen disparate and unruly British colonies came to form a new kind of nation: a republic, dedicated (as Abraham Lincoln would later recall) to the proposition that all men were created equal.  Topics to be covered include colonial encounters, slavery, religion, social reform movements, sexuality, manifest destiny, the foundations of republican government, and the meanings of capitalism and democracy.", "qtr": "Winter 2016", "name": "History of the United States, Precolonial to the Civil War", "title": "WCAS HISTORY 210-1-01 History of the United States, Precolonial to the Civil War", "lmod": "1/9/16 6:48 PM (CT)", "section": "01", "instructors": [{"instructor_phone": "847/467-2906", "instructor_name": "Caitlin Annette Fitz", "instructor_addr": "Harris Hall  205"}], "associated_classes": [{"component": "DIS", "room": "Harris Hall L04", "meeting_time": "Th 9:00AM - 9:50AM"}, {"component": "DIS", "room": "University Hall 412", "meeting_time": "Th 9:00AM - 9:50AM"}, {"component": "DIS", "room": "Harris Hall L04", "meeting_time": "Th 10:00AM - 10:50AM"}, {"component": "DIS", "room": "Allison Residential Comm 1021", "meeting_time": "Th 11:00AM - 11:50AM"}, {"component": "DIS", "room": "Annenberg Hall G31", "meeting_time": "Fr 3:00PM - 3:50PM"}, {"component": "DIS", "room": "Annenberg Hall G31", "meeting_time": "Fr 4:00PM - 4:50PM"}], "topic": "", "course": "210-1", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "In this course, we will explore the major themes of early American history, from the first encounters between native people, Europeans, and Africans to the impassioned battles of the Civil War. Our goal will be to track the variety of meanings that America had for the people who lived here: men and women, rich and poor, free and slave. We will examine stories of growth and decay, of war and peace, of conflict and collaboration. We will also tell a story about how thirteen disparate and unruly British colonies came to form a new kind of nation: a republic, dedicated (as Abraham Lincoln would later recall) to the proposition that all men were created equal. Topics to be covered include colonial encounters, slavery, religion, social reform movements, sexuality, manifest destiny, the foundations of republican government, and the meanings of capitalism and democracy."}, {"name": "Teaching Method", "value": "Discussion sectionLectureLecture and discussion sections"}, {"name": "Evaluation Method", "value": "Class participationExam, finalExam, mid-termWriting assignmentsClass participation, short writing assignments, midterm exam, final exam"}, {"name": "Class Materials (Required)", "value": "Eric Foner, Give Me Liberty! Brief 4th edition, volume 1 ISBN: 978-0-393-92033-8<br/><br/><br/>Pauline Maier, Ratification: The People Debate the Constitution ISBN: 978-0684868554<br/><br/><br/>James Oakes, The Ruling Race ISBN: 9780393317053"}, {"name": "Class Notes", "value": "HISTORY AREA OF CONCENTRATION: Americas"}], "path": "/class-descriptions/4610/WCAS/HISTORY/210-1/24910", "instructor": ["Caitlin Annette Fitz"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "24910", "subject": "HISTORY"}]