[{"school": "WCAS", "overview_of_class": "Contemporary Italian culture through art - crucial topics of identity from the 1970s to the present: the body and the city. An art history interdisciplinary course in Italian studies that focuses on two crucial topics of identity, investigating their presence and meaning in the artistic imagery of the country from the 1970s to the present, as two ideally complementary spaces: the body as the space of the private, and the city as the space of the public. The course will concentrate on artistic strategies that have been challenging the traditional definition of art as an autonomous object, transforming it into an open space of expression for pluralism and a transcultural perspective. Time-based media such as performance, video art and new media, as well as society-based and participatory practices such as interactive installation and public art will be at the core of attention. Focusing on seminal ideas, events, pieces and protagonists from the period, we will analyze how the increasing development of time-based and society-related artistic practices from the 1970s to the present day mirrors broader dynamics and changes in the Italian context and its culture. The body will be investigated both as medium and as subject of artistic expression: this will allow us to address issues of gender on a physical, psychological and cultural level through topics such as sexuality, perspective and role, as in the work of women pioneers of body art such as Gina Pane or Ketty La Rocca, or in the \"tableau vivant\" staged by Luigi Ontani.<br/>The city will be addressed both as space for interaction, sharing and action, as in Mauro Staccioli's \"sculture intervento\" (intervention sculptures) or in public art projects, and as a subject of representation and narrative, as in urban photography and video or in Studio Azzurro's immersive \"ambienti sensibili\" (sensitive environments). The interdisciplinary approach uses artworks, artists' writings, documents of any kind (from paper to video) as indexes of socio-cultural issues in connection to design, architecture, photography, music, fashion, cinema and theater.", "name": "Topics in Italian Culture and Literature", "section": "20", "location": "Locy Hall 214", "topic": "Contemporary Italian Culture Through Art", "course": "349-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4620/WCAS/ITALIAN/349-0/31102", "instructor": ["Francesca   Pola"], "class_attributes": "Read &amp; Discuss in language<br/><br/>", "id": "31102", "subject": "ITALIAN"}]