[{"school": "JOUR", "overview_of_class": "Chicago, Journalism and Social Change<br/><br/>From Ida B. Wells' campaign against lynching to the acclaimed documentary &quot;The Interrupters,&quot; which examines gang violence, Chicago has long fostered journalism that tackles- and attempts to influence - the nation's most compelling and complex issues. In this course, students will analyze crucial moments in social-issues journalism in one of the world's great cities. At the same time, through a partnership with Medill's Social Justice News Nexus, students will produce reporting involving a current cluster of topics critical to Chicago: segregation, inequality and housing.", "name": "Journalism in Practice", "section": "20", "topic": "", "course": "301-0", "meeting_time": ["We 9:00AM - 1:50PM"], "path": "/class-descriptions/4610/JOUR/JOUR/301-0/26972", "instructor": ["Louise Kathryn Kiernan"], "id": "26972", "subject": "JOUR"}, {"school": "JOUR", "overview_of_class": "Journalism in Practice: Police, Race and Community<br/>Taught by Prof. Peter Slevin<br/> <br/>This is a workshop designed to tell true stories about one of the most complex and emotional challenges any diverse community faces. We will explore perspectives about policing in Evanston in the era of Black Lives Matter, building our expertise through rigorous reporting and thoughtful interviews with players on all sides of this enduring debate. In a class that will start with questions, not answers, be prepared to examine broad social stereotypes as well as your own assumptions. We will pay particular attention to interviewing techniques and the voices that inform and illuminate ambitious journalism.", "name": "Journalism in Practice", "section": "21", "topic": "", "course": "301-0", "meeting_time": ["TuTh 9:30AM - 11:50AM"], "path": "/class-descriptions/4610/JOUR/JOUR/301-0/26973", "instructor": ["Peter D Slevin"], "id": "26973", "subject": "JOUR"}, {"school": "JOUR", "overview_of_class": "Journalism in Practice: Is it Safe?<br/>Taught by Prof. Tim McNulty<br/>Our daily lives, and the news we report, are filled with questions of risk and security. In this class, the topics are both personal and national.  Is our food properly prepared, should society have more weapons or fewer, are safety measures in cars worth the cost, how dangerous is illegal immigration, and are the billions of dollars spent on airline screening thwarting potential terrorists or it is just security theater to make us feel safer?<br/> <br/>In reporting on social change, on government regulations and laws and on the political culture of fear and anxiety, it's important for journalists to understand real risks and the price we pay whether in money, convenience, privacy or civil rights.<br/> <br/>We will look at common assumptions, myths and justifications and report on the reality underneath.  After analyzing data, hearing from experts and questioning what are the multitude of risks a large society faces, you will look at the precautions we take and decide through your own reporting what's really important.", "name": "Journalism in Practice", "section": "22", "topic": "", "course": "301-0", "meeting_time": ["TuTh 9:00AM - 11:20AM"], "path": "/class-descriptions/4610/JOUR/JOUR/301-0/26974", "instructor": ["Timothy J McNulty"], "id": "26974", "subject": "JOUR"}]