[{"class_mtg_info": [{"meet_t": "MoWeFr 12:00PM - 12:50PM", "meet_l": "Technological Institute L211"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Co-Requisite:  Students must also register for Physics 136-2. <br/>Add both classes to the shopping cart and submit together for successful registration.", "qtr": "Winter 2017", "name": "20311", "title": "WCAS PHYSICS 130-2-01 College Physics", "class_attributes": "Natural Sciences Distro Area<br/><br/>", "section": "20311", "instructors": [{"instructor_phone": "847/467-7100", "instructor_name": "Andrew J Rivers", "instructor_addr": "1918 Sheridan"}], "associated_classes": [{"component": "DIS", "room": "Technological Institute L221", "meeting_time": "Th 12:00PM - 12:50PM"}, {"component": "DIS", "room": "Tech Institute Lecture Room 4", "meeting_time": "Th 12:00PM - 12:50PM"}], "topic": "", "course": "130-2", "descriptions": [{"name": "Overview of class", "value": "Equations can change the world. The synthesis of Maxwell's equations unified electricity, magnetism and light, laying the foundation for modern technology and modern physical theories. This non-calculus based course explores: charges, electric and magnetic forces, electrical potentials, batteries, circuits, capacitance, induction and inductance, and finally electromagnetic radiation. Demonstrations of many physical principles will be shown in the lecture whenever possible. Weekly quizzes emphasize problem solving. The course goals focus students on developing an understanding of the nature of the physical principles; these fundamentals govern the world around us and the universe beyond, viewed through models which draw on our everyday experiences. <br/>Topics:<br/>1. Charge and Matter<br/>2. The Electric Field<br/>3. Gauss's Law<br/>4. Electric Potential<br/>5. Capacitors and Dielectrics<br/>6. Current and Resistance<br/>7. Electromotive Forces and Circuits<br/>8. The Magnetic Field<br/>9. Ampere's Law<br/>10. Faraday's Law of Induction<br/>11. Inductors in Circuits<br/>12. Ampere-Maxwell Law<br/>13. Maxwell's Equations<br/>14. The Electromagnetic Wave<br/><br/>Laboratory Exercises:<br/>1. Electrostatics - Coulombs Law for Electrostatic force is verified.<br/>2. Equipotentials - Equipotential planes are determined around various conductor geometries.<br/>3. Ohms Law - students study the resistance of various circuit elements such as resistors light bulbs and diodes.<br/>4. Ohm's Law - study of the current and voltage for a series and parallel resistance combination.<br/>5. RC Circuits - the study of the time dependence of the voltage of a capacitor during charging and discharging.<br/>6. Measurement of the magnetic field of a current<br/>7. Electromagnetic Oscillations I - the oscilloscope is used to analyze the time dependent voltage and current in a damped oscillator.<br/>8. Electromagnetic Oscillations II - the frequency response and phase relationships between voltage and current are studied for a driven oscillator."}, {"name": "Registration Requirements", "value": "Basic knowledge of High School algebra and trigonometry and 130-1."}, {"name": "Evaluation Method", "value": "Grades for this course are based on a two 50 minute in-class midterms, a two hour comprehensive final exam, and best 5 of 6 quizzes."}, {"name": "Class Materials (Required)", "value": "Giancoli, Physics, (7th Edition), Pearson, ISBN-13: 9780321625922<br/> 2nd quarter lab manual by Stipes (available at Norris)"}], "lmod": "12/24/16 7:05 PM (CT)", "subject": "PHYSICS"}]