[{"class_mtg_info": [{"meet_t": "MoWeFr 4:00PM - 4:50PM", "meet_l": "Technological Institute F281"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "37785", "title": "WCAS BIOL_SCI 164-0-2 Genetics and Evolution", "class_attributes": "Natural Sciences Distro Area<br/><br/>", "section": "37785", "instructors": [{"instructor_phone": "", "instructor_name": "Matthew Thomas Henke", "instructor_addr": ""}], "topic": "", "course": "164-0", "descriptions": [{"name": "Overview of class", "value": "Evolution is the unifying force of all modern biology. In this course, we will delve into some of the many sources of evidence that life on Earth has changed over time. We will also investigate natural selection - the explanation for the evolution of life which was first described by Charles Darwin and Alfred Wallace in 1858. Additionally, this course is meant to explore the relevance of evolution not just to biology, but also to us as human beings and as members of a society that has been grappling with perceived and real implications and integration of evolutionary thought."}, {"name": "Learning Objectives", "value": "By the end of the quarter, my objectives are that you will be able to:<br/>1. Analyze and combine information from various sources (e.g., geologic record, allele frequencies, and isotope dating) to reconstruct a small portion of the tree of life.<br/>2. Use your knowledge of genetics and evolutionary processes to hypothesize how adaptation may have arisen.<br/>3. Evaluate and articulate the impact that evolutionary biology has had on society in realms outside of science."}, {"name": "Teaching Method", "value": "The class will be a mixture of lectures toward the beginning of the quarter, and will evolve into one primarily based in discussion toward the end."}, {"name": "Evaluation Method", "value": "Your progress in mastering the material will be evaluated by a handful of homework assignments, a collaborative project to reconstruct the tree of life, an in class exam, and an oral presentation of the impact of evolutionary theory on everyday life."}, {"name": "Class Materials (Required)", "value": "Course materials will be clippings pulled from many textbooks, so non will be required for purchasing. The free PDF &quot;Science, Evolution, and Creationism&quot; from The National Academy of Sciences will be required reading."}], "lmod": "4/3/16 7:45 PM (CT)", "subject": "BIOL_SCI"}]