[{"class_mtg_info": [{"meet_t": "Th 9:30AM - 12:30PM", "meet_l": "Frances Searle Building 2378"}], "school": "MEAS", "overview_of_class": "How might we design user experiences which delight? How do we uncover motives, desires and needs and translate those to effective interactions? In DSGN 306, User Experience Design, students will apply the design innovation process to create compelling user experiences, both individually and as a team. Students will explore everything from screen-based experiences to interactions with physical products and environment design in this hands-on studio class.", "qtr": "Fall 2017", "name": "User Experience Design", "title": "MEAS DSGN 306-0-1 User Experience Design", "lmod": "9/12/17 6:40 PM (CT)", "section": "1", "topic": "", "course": "306-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "How might we design user experiences which delight? How do we uncover motives, desires and needs and translate those to effective interactions? In DSGN 306, User Experience Design, students will apply the design innovation process to create compelling user experiences, both individually and as a team. Students will explore everything from screen-based experiences to interactions with physical products and environment design in this hands-on studio class."}, {"name": "Registration Requirements", "value": "Prior experience in team-based human-centered design is a pre-requisite for this course. Ways to get immersed in this subject include taking DSGN106 (Design Thinking & Communication) or DSGN208 (Design Thinking and Doing) or by being part of a Design for America team here at Northwestern. If you have not had any prior experience in human-centered design, we strongly suggest that you take one of these foundational classes first. This will be a rigorous and fast-paced course requiring you to produce prototypes and work in teams, and it will be a big asset to have engaged in the human-centered design process before."}], "instructor": ["Jason David George", "Pamela A. Forgianni Daniels"], "class_attributes": "", "id": "16257", "subject": "DSGN"}]