[{"class_mtg_info": [{"meet_t": "Sa 9:00AM - 12:00PM", "meet_l": "Wieboldt Hall 505"}], "school": "SCS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "37841", "title": "SCS ART_HIST 379-CN-17 Special Topics in Modern Architecture", "class_attributes": "", "section": "37841", "instructors": [{"instructor_phone": "", "instructor_name": "Kathleen A Cummings", "instructor_addr": ""}], "topic": "Chicago Architecture", "course": "379-CN", "descriptions": [{"name": "Overview of class", "value": "This course will focus upon Chicago's skyscraper history as well as the city's planning efforts. The beginning sessions will study the skyscraper decade by decade from 1872 to the 1930s, broadly exploring building technology, aesthetics, and the social and cultural milieu characteristic of each period. After studying the Plan of Chicago (1909), the class will explore its impact on the city's growth. The final class sessions will focus upon more recent building along Michigan Avenue from Oak Street to Roosevelt Road, will chart the actual development of this important street, and also will consider the spaces formed-consciously or not-around the city's skyscrapers. Field trips will be an integral part of learning."}, {"name": "Registration Requirements", "value": "A previous Art History class may be helpful. Students should be ready to use primary research materials, books available in the Northwestern University library, and sources available online."}, {"name": "Learning Objectives", "value": "Students should gain a broad knowledge of Chicago's important role in developing the modern skyscraper. They also will learn to analyze buildings, develop sophisticated research methods, and bring together their research and thinking in papers and presentations. I hope to encourage critical thinking about building design and city planning."}, {"name": "Teaching Method", "value": "Several field trips to the Loop and along Michigan Avenue are planned. Lectures will be supplemented with short exercises that bring students into groups to discuss issues concerning the city's architecture and its development issues."}, {"name": "Evaluation Method", "value": "Three papers will be assigned. The first (worth 25%) will respond to the reading by following up on the sources the author used and then critiquing his or her argument. In the second paper (worth 25%) students will rely upon newspapers and primary sources to create a study in context of one building. The final project (worth 40%) will focus upon the development of one to two city blocks and their defining buildings, especially skyscrapers built since World War II. As part of this final project, students will be required to complete a research paper and incorporate into the study a walking tour to be given in one of the last class sessions. Participation and attendance (worth 10% for both) also will be evaluated in determining the final grade."}, {"name": "Class Materials (Required)", "value": "Thomas Leslie's Chicago Skyscraper 1871 - 1934 (ISBN: 9780252037542) and Carl Smith's The Plan of Chicago (ISBN: 97880226764726) are the beginning texts. <br/><br/>The NU bookstore will order a limited number of printed copies and online access also is available to students. Many articles and links to websites will be posted on Canvas."}], "lmod": "4/3/16 7:31 PM (CT)", "subject": "ART_HIST"}]