[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "Locy Hall 214"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "26885", "title": "WCAS RELIGION 374-0-20 Contemporary Religious Thought", "class_attributes": "Ethics &amp; Values Distro Area<br/><br/>", "section": "26885", "instructors": [{"instructor_phone": "", "instructor_name": "Beverly P Mortensen", "instructor_addr": "Religious Studies Dept. Crowe hall, 5-179"}], "topic": "Evolutionary Spirituality: Science", "course": "374-0", "descriptions": [{"name": "Overview of class", "value": "<u>Evolutionary Spirituality: Science, Cooperation, Morality and God</u><br/>This course addresses the growing awareness of the universality of evolution in all existence. This awareness recognizes the sequential emergence of values-based stages in human cultural development, the development of life forms, and the development of prebiotic forms back to the big bang. We shall explore some of the impact of this way of seeing things. We shall take on the conflict between science and religion, as demonstrated in the varying ways Darwin&#39;s work is viewed today. We shall discover the ways this view assists in our interactions with others, as revealed in game theory models. And we shall ponder the new understandings of the divine that evolution stimulates. The possibilities for new syntheses and future development will emerge from these readings, along with new cooperative relationships within the world and its religions."}, {"name": "Teaching Method", "value": "This probing subject matter demands a seminar format. Students will discuss prepared material so they can integrate their reading with modern understanding."}, {"name": "Evaluation Method", "value": "Grades derive from participation (15%),<br/>three papers with discussion points (5% each) <br/>three two-page papers (15% each) <br/>and one five-page paper (25%). <br/><br/>Clear, concise thinking and writing, attention to the question, and multiple succinct arguments for your overall point earn a good grade; creative thinking and fresh insights receive an excellent one (Hint: I count the new ideas in each paper and grade accordingly). Rambling, extensive quotes, repetition of what we have already discussed or unnecessary explanation.....do not count as new ideas and take up space from your valuable points. Careless research or sloppy reasoning determines a lower grade. A late paper receives one full grade lower: i.e.: a late B paper receives a C."}, {"name": "Class Materials (Required)", "value": "A SOCIABLE GOD: TOWARD A NEW UNDERSTANDING OF RELIGION PAPERBACK, by Ken Wilber (Author), Roger Walsh (Foreword). Shambhala, February 22, 2005, ISBN-10: 1590302249, ISBN-13: 978-1590302248.<br/><br/>EVOLUTIONARIES: UNLOCKING THE SPIRITUAL AND CULTURAL POTENTIAL OF SCIENCE'S GREATEST IDEA, Carter Phipps. Harper Perennial (June 26, 2012), ISBN-10: 0061916137, ISBN-13: 978-0061916137.<br/><br/>EVOLUTION, GAMES, AND GOD: THE PRINCIPLE OF COOPERATION, Martin A. Nowak (Editor), Sarah Coakley (Editor), May 7, 2013. Harvard University Press (May 7, 2013), ISBN-10: 0674047974, ISBN-13: 978-0674047976.<br/><br/>THE UNBEARABLE WHOLENESS OF BEING: GOD, EVOLUTION, AND THE POWER OF LOVE PAPERBACK , April 1, 2013, by Ilia Delio. Orbis Books (April 1, 2013) ISBN-10: 1626980292, ISBN-13: 978-1626980297.<br/><br/>All books are available as Kindle Books through Amazon.com"}], "lmod": "1/9/16 6:53 PM (CT)", "subject": "RELIGION"}]