[{"class_mtg_info": [{"meet_t": "TBA", "meet_l": "TBA"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Spring 2017", "name": "30948", "title": "WCAS LING 483-0-20 NativeAccent Speech Training for Nonnative Speakers of English", "class_attributes": "", "section": "30948", "instructors": [{"instructor_phone": "", "instructor_name": "Kathleen Gael Hall", "instructor_addr": ""}], "topic": "", "course": "483-0", "descriptions": [{"name": "Overview of class", "value": "In this course, online speech training software provides customized training for the purpose of increasing nonnative speakers' intelligibility in oral English. At the beginning of the term, students will complete an online assessment to establish a baseline of oral proficiency. The software will generate a customized course of study that provides appropriate practice in each session to help the student acquire the language and skills needed to improve intelligibility. Students will be expected to maintain milestones of usage each week during the quarter, and will have access to both periodic and end-of-quarter feedback on their progress. Students will be asked to reflect on their own learning at the end of the term. Active participation and evidence of progress towards improved proficiency must be demonstrated in order to achieve a satisfactory grade in the course."}, {"name": "Registration Requirements", "value": "Instructor consent required."}, {"name": "Learning Objectives", "value": "By the end of the quarter, you will be expected to:<br/>? Use data from the system's assessment to identify your pre-term level of proficiency in the areas of English pronunciation, grammar, fluency, and word stress. <br/>? Compare your attempts to intelligibly read English sentences with a recording of a native speaker of English producing the same sentence.<br/>? Identify areas in which your production differs from that of a native speaker's. <br/>? Modify your production to better match the native speaker's production.<br/>? Assess whether your attempts to modify your production are successful or not.<br/>? Demonstrate progress towards improved oral English proficiency in the areas in which you have been working over the course of the quarter."}, {"name": "Teaching Method", "value": "Online exercises in pronunciation, fluency, word stress, and grammar, optional in-person support sessions."}, {"name": "Evaluation Method", "value": "Grading is based on completion of an online assessment, meeting of weekly milestones towards usage of the software, and completion of an end of quarter assessment and written end-or-quarter reflection exercise. Students can earn up to 15 additional minutes of active time logged towards their weekly milestone by attending optional drop in help sessions."}, {"name": "Class Materials (Required)", "value": "Students will be given a NativeAccent software account for use during the quarter."}, {"name": "Class Notes", "value": "Students must complete an online form from English Language Programs in order to be eligible for the class and obtain a permission number. Contact elp@northwestern.edu for specific registration instructions."}], "lmod": "2/7/17 6:45 PM (CT)", "subject": "LING"}]