[{"class_mtg_info": [{"meet_t": "TuTh 4:00PM - 5:50PM", "meet_l": "Annie May Swift Hall 103"}], "school": "SoC", "enrl_requirement": "", "qtr": "Spring 2017", "name": "37918", "title": "SoC PERF_ST 327-0-20 Performance Ethnography", "class_attributes": "", "section": "37918", "instructors": [{"instructor_phone": "", "instructor_name": "Andreea Silvia   Micu", "instructor_addr": ""}], "topic": "", "course": "327-0", "descriptions": [{"name": "Overview of class", "value": "The course is a practicum in fieldwork and performance ethnography for undergraduates. You have the option of doing autoethnography that draws from one of your particular communities or spaces of belonging (this does not mean autobiographical performance that is disconnected from a community or group of Others). The main prerequisite is that you enter the seminar with a field project/field site in mind so that you may pinpoint your site and then begin fieldwork early in the quarter. In the course, we will examine the work of experienced ethnographers and we will also apply specific concepts from critical and fieldwork theory that will guide your fieldwork. We will draw from selected illuminations within the realms of psychoanalytic, Marxists, postcolonial, critical race, feminist, queer, and poststructuralist thinking. This is a &quot;hands-on&quot; practicum so our efforts will be focused upon how to put particular theoretical concepts into action so they serve us in articulating, realizing, and experiencing the labor and love of fieldwork. As Dwight Conquergood, who developed this course, stated in his syllabus: &quot;Fieldwork is an art and a craft&quot; I will provide the guidance, readings, workshops, some lectures, a supportive and challenging learning community, and my own love and enthusiasm for fieldwork (which I hope will be contagious). The rest is up to you. Be prepared to listen and tell &quot;field stories;&quot; to make theory matter and useable; to take risks and discover communities and worlds of meanings and practices that are beyond the reach of the classroom."}], "lmod": "2/16/17 6:39 PM (CT)", "subject": "PERF_ST"}]