[{"class_mtg_info": [{"meet_t": "Tu 12:30PM - 3:20PM", "meet_l": "Locy Hall 106"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: No freshmen allowed. Pre-registration is for Global Health Studies Minor only. Registration is open to other students after pre-registration.", "qtr": "Spring 2017", "name": "33940", "title": "WCAS GBL_HLTH 305-0-1 Global Health &amp; Indigenous Medicine", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>No Freshmen<br/><br/>", "section": "33940", "instructors": [{"instructor_phone": "847/467-2780", "instructor_name": "Noelle   Sullivan", "instructor_addr": "1812 Hinman Avenue, #303, Evanston"}], "topic": "", "course": "305-0", "descriptions": [{"name": "Overview of class", "value": "Medical pluralism?therapeutic landscapes within which multiple healing modalities exist simultaneously?is largely the norm throughout most places in the world. In those places, people may choose healers or non-biomedical therapies instead of biomedical care, or even use multiple types of healers and therapies simultaneously. This seminar course explores a diversity of so-called ?indigenous' or ?traditional' medical practices and forms of healing around the world, their significance within various contexts, and their intersections with allopathic medicine. The course also delves into encounters between global health interventions, biomedicine, and other forms of healing in places characterized by medical pluralism. Questions we will explore include: In what ways do non-biomedical therapeutic practices approach the body, illness, health, and healing? Why do these so-called ?traditional' knowledge practices and healers endure despite public health and biomedical interventions? How has globalization affected how, where, and among whom these healing forms are practiced? How do patients, families, and healers balance biomedical and non-biomedical options in their quest for health and healing? How do biomedicine and other healing modalities interact, and how do they influence one another?"}, {"name": "Registration Requirements", "value": "No freshmen allowed. Pre-registration for Global Health Studies Minors only. Registration open to other students after pre-registration."}, {"name": "Class Materials (Required)", "value": "Briggs, Charles L. &amp; Clara Mantini-Briggs (2016) Tell me why my Children Died: Rabies, Indigenous Knowledge, and Communicative Justice. Duke U. Press. ISBN 9780822361244<br/><br/>Remainder of readings will be available on Canvas."}, {"name": "Class Notes", "value": "No freshmen allowed. Pre-registration for Global Health Studies Minors only. Registration open to other students after pre-registration."}], "lmod": "2/9/17 6:42 PM (CT)", "subject": "GBL_HLTH"}]