[{"school": "WCAS", "overview_of_class": "This course will be taught by visiting professor Hans-Jörg Rheinberger (Department of German) <br/>TOPIC: On Historical Epistemology<br/><br/>If the nineteenth century witnessed the rise of positivism, the twentieth century started with a crisis of positivistic thought without a clear response, or even alternative, to the nineteenth-century legacy. It was only slowly, over the course of a century, that a philosophy of science evolved in which epistemology, having been historicized in some manner, began to reconnect the separated contexts of justification and discovery. The organizing thread for this class will be the contribution that different streams of twentieth-century philosophy of science made to this overall process. The class proceeds from the assumption that historicizing epistemology captures the essence of what the past century has added to the philosophy of science.<br/><br/>The class will discuss an array of French, German, and English-speaking traditions in which historical thinking brought into philosophy of science. Readings will include Gaston Bachelard, Georges Canguilhem, Michel Foucault and Jacques Derrifda (his reading of Husserl) on the French-speaking part: Ernst Cassirer, Edmund Husserl (especially his late \"Crisis\" work), and Marin Heidegger on the German-speaking part; and the work of the Polish immunologist and philosopher Ludwik Fleck, Thomas Kuhn, Stephen Toulon and Ian Hacking on the English speaking part. Recent developments in history and philosophy science will also come under discussion throughout the class.", "name": "Studies in Literary Theory", "section": "20", "location": "University Hall 122", "topic": "", "course": "481-0", "meeting_time": ["Tu 6:00PM - 7:50PM", "Tu 5:00PM - 6:00PM"], "path": "/class-descriptions/4620/WCAS/COMP_LIT/481-0/31002", "instructor": ["Peter D Fenves", "Johanngeorg   Rheinberger"], "class_attributes": "", "id": "31002", "subject": "COMP_LIT"}, {"school": "WCAS", "overview_of_class": "This is an interdisciplinary course, drawing on literatures grounded in contemporary French philosophy and in race, gender, and sexuality studies. It considers the contemporary legacy of Michel Foucault in the following domains: critical theory, critical race studies, gender and sexuality studies (with a focus on Achille Mbembe, Wendy Brown, José Munoz, Heather Love and Jasbir Puar, Judith Butler, Lee Edelman, and Lauren Berlant). There are three foci of the course: debates concerning the politics of deconstructing and revising Foucault (with a focus on Derrida's critique of Foucault and the concept of hypergenealogy); the emergence of post-Foucauldian biopolitics (foregrounding necropolitics and thanatopolitics, with a focus on Mbembe); and third, contested evaluations of the political role of the future (particularly as seen in critical race theorists and queer theory). In this section, debates include the politics of utopianism, futurism, the anti-social thesis and critique of reproductive futurism, the critique of the latter within critical race studies, Mbembe's analyses of necropolitics and plural temporalities and alternative understanding of plural temporalities to have in feminist theory and queer of color theory.", "name": "Studies in Literary Theory", "section": "21", "location": "Crowe Hall Room 1-140", "topic": "After Focault: Sexuality and the Politics of Time", "course": "481-0", "meeting_time": ["Th 2:00PM - 4:50PM"], "path": "/class-descriptions/4620/WCAS/COMP_LIT/481-0/31003", "instructor": ["Penelope L Deutscher"], "class_attributes": "", "id": "31003", "subject": "COMP_LIT"}]