[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Locy Hall 111"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-registration is reserved for Sociology Majors and Minors.", "qtr": "Spring 2017", "name": "35572", "title": "WCAS SOCIOL 376-0-24 Topics in Sociological Analysis", "class_attributes": "", "section": "35572", "instructors": [{"instructor_phone": "847 4674139", "instructor_name": "Michael D Rodriguez", "instructor_addr": "1810 Chicago Ave, Room 323"}], "topic": "Race, Knowledge, and Latinidad", "course": "376-0", "descriptions": [{"name": "Overview of class", "value": "According to the latest statistics, the United States is home to over 55.5 million &quot;Latinos&quot; and &quot;Hispanics.&quot; In 2000, this population became the largest &quot;minority group&quot; in the country. Demographers forecast that within the century, this population will reach close to 100 million. Considerable popular and academic debate has ensued about the meaning and significance of these demographic trends. For some, Latino population growth represents a major domestic threat, and for others it is a beneficial and welcomed development. Implicated in these debates, but rarely discussed, is the sociohistorical and political process by which diverse and heterogeneous Latin American-descent communities came be imagined and understood as comprising a panethnic whole. In this course, we will examine this process with an analytic focus on the intersection of politics, race, and knowledge production."}, {"name": "Registration Requirements", "value": "No P/N option.<br/>During preregistration this course is only open to Sociology Majors &amp; Minors.<br/><br/>This course is open to all undergraduates during regular registration."}, {"name": "Class Materials (Required)", "value": "Assigned book will include this and other books:<br/>Mora, Cristina G., How Activists, Bureaucrats, and Media Constructed a New American. ISBN: 9780226033839"}], "lmod": "2/12/17 7:02 PM (CT)", "subject": "SOCIOL"}]