[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "Kresge Cent. Hall 2-380 Kaplan"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Fall 2016", "name": "12932", "title": "WCAS HUM 210-0-20 Humanities in the World I", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "12932", "instructors": [{"instructor_phone": "847/491-5679", "instructor_name": "Barbara Jane   Newman", "instructor_addr": "University Hall 215"}, {"instructor_phone": "8474676722", "instructor_name": "Amy Beth Stanley", "instructor_addr": "Harris Hall Room 203"}, {"instructor_phone": "847/467-1746", "instructor_name": "Mira   Balberg", "instructor_addr": "Crowe Hall 4-137"}], "topic": "Till Death Do Us Part (or Not)", "course": "210-0", "descriptions": [{"name": "Overview of class", "value": "Note: The course is part of the Kaplan Humanities Scholars Program and is only open to Kaplan Scholars. <br/><br/>Marriage is not only one of the oldest institutions of human civilization. It is also a quintessential meeting place of tradition and innovation, human and divine, reality and fantasy, freedom and obligation, individual and society. In the practices surrounding marriage, the tensions and complexities that underlie human experience in different times and places come to the fore in poignant and fascinating ways. Because history, law, religion, literature, politics, anthropology, sociology, and art all intersect in marriage, this topic can serve as an ideal gateway to the humanities.<br/><br/>Our class, team-taught by a historian of early modern Japan, a scholar of medieval European literature, and an expert in ancient Mediterranean religions, will achieve two central goals. First, it will acquaint students with an exciting assortment of cultural works from many times and places and help them acquire tools for close reading and analysis. Second, the class seeks to foster a critical, historical, and contextual approach to marriage by focusing on an institution that is often represented as &quot;timeless&quot; or &quot;universal,&quot; while systematically revealing its incessant permutations and inherent diversity. Among the topics we will discuss are wedding ceremonies, legal and financial aspects of marriage, alternatives to marriage (such as celibacy and polygamy), mythical and theological dimensions of marriage, divorce, same-sex marriage, and more. Field trips may include a play at the Steppenwolf Theatre and a performance at the Lyric Opera. A panel of clergy will discuss contemporary wedding arrangements in different religions, as well as secular ceremonies."}, {"name": "Class Materials (Suggested)", "value": "Readings may include selections from the Bible, Plato's Symposium, the Ramayana, the Tale of Genji, and Apuleius's Golden Ass; Chrétien de Troyes, Erec and Enide; Shakespeare, A Midsummer Night's Dream; Ha Jin's novel Waiting; articles about Shakers, Mormons, and samurai; and much, much more. We will watch such films as Ang Lee's The Wedding Banquet, Zhang Yimou's Raise the Red Lantern, and Rama Burshtein's Israeli feminist movie, Fill the Void."}], "lmod": "10/30/16 7:06 PM (CT)", "subject": "HUM"}]