[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Fisk Hall 114"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "31118", "title": "WCAS GNDR_ST 381-0-20 Queer Theory", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>Attendance at 1st class mandatory<br/><br/>", "section": "31118", "instructors": [{"instructor_phone": "847/491-4337", "instructor_name": "Jillana B Enteen", "instructor_addr": "1800 Sherman Ave. 4th floor"}], "topic": "", "course": "381-0", "descriptions": [{"name": "Overview of class", "value": "This course will introduce you to Queer Theory and theories of sexuality, emphasizing the practice of<br/>reading theory from a variety of textual sources as well as conceiving of sexualities within both local and transnatinoal contexts. We will trace the development of both the term queer and the history of queer theory, beginning with foundational texts about sexuality and its regulation by Foucault and seminal essays about queer theory by Eve Sedgwick, Judith Butler, Michael Warner and Lauren Berlant. We will then read canonical essays by a variety of queer theorists which will serve the basis for analyzing several books and films including Lawrence Chua's Gold by the Inch, Jules Rosskam's Transparent, and the British television series, Metrosexuality. Discussions will query how queer theory formulates racial, class and national identities in relation to sexuality, and how it might offer politics beyond those based on identity."}, {"name": "Teaching Method", "value": "SEMINAR; DISCUSSION"}, {"name": "Evaluation Method", "value": "WEEKLY POSTS, MIDTERM ESSAY, SEMINAR PAPER, PARTICIPATION"}, {"name": "Class Materials (Required)", "value": "Michel Foucault, History of Sexuality Vol 1 <br/>Laurence Chua, Gold by the InchEd. Hall and Jagose, Routlege Queer Studies Reader (2013)<br/>COURSE READER"}, {"name": "Class Notes", "value": "NO P/N. ATTENDANCE FIRST CLASS MANDATORY. PREVIOUS EXPERIENCE IN THEORY OR GENDER STUDIES SUGGESTED"}], "lmod": "4/3/16 8:02 PM (CT)", "subject": "GNDR_ST"}]