[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "University Hall 112"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Spring 2017", "name": "35057", "title": "WCAS ENGLISH 105-6-20 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>Attendance at 1st class mandatory<br/><br/>", "section": "35057", "instructors": [{"instructor_phone": "8474918916", "instructor_name": "James Richard O'Laughlin", "instructor_addr": "1908 Sheridan Rd., Rm. 206"}], "topic": "Writing about Global Justice", "course": "105-6", "descriptions": [{"name": "Overview of class", "value": "If what we do affects others around the globe, how do we decide our obligations to each other, around the globe?  That question will animate this course.  We'll examine how global justice has been theorized and some ways it can be addressed in relation to such things as poverty, the environment and the consequences of colonialism.  We'll examine difficulties in the pivot from thinking of justice locally or nationally to thinking about it globally.  We'll explore these topics and questions in articles, book chapters and a few narratives (a short story, an autobiographical essay, possibly a play)."}, {"name": "Teaching Method", "value": "Discussion."}, {"name": "Evaluation Method", "value": "Class participation (discussion, presentation, portfolio, etc.) Essay#1 18%; Essay #2 (draft and revision) 20%; Essay #3 (draft and revision) 27%; Essay #4 (draft, revision) 35%.<br/><br/><br/><br/>NUMBER OF WRITING ASSIGNMENTS &amp; THEIR LENGTHS: <br/>There will be four essays: a short essay (2 pp.) due at the beginning of the second week; two longer essays (3-4 pp); and a research essay (7-8 pp.) on a question of your own choosing related to our readings and discussions.  The research essay can build on and incorporate material from one of your earlier essays. There will also be a 5-minute presentation to the class of your research project later in the course, before you turn in the final version. Along the way in class we'll discuss strategies for developing and organizing analytic writing essays; for extending ideas into longer pieces; and for engaging with materials outside of the assigned readings. For each of the essays we'll have conferences to discuss your writing; the last three essays will also have required revisions."}, {"name": "Class Materials (Suggested)", "value": "Andrew Clapham, A Very Short Introduction to Human Rights (2007); Kimberly Hutchings, selection from Cosmopolitan Citizenship (1999); Martin Luther King Jr., selection from &quot;Letter from a Birmingham Jail&quot;; Evelina Zuni Lucero, &quot;On the Tip of My Tongue: An Autobiographical Essay&quot;; Thomas Pogge, from World Poverty and Human Rights (2008); Amartya Sen, selection from The Idea of Justice (2006);<br/>Iris Young, selection from Responsibility for Justice (2011)"}], "lmod": "2/8/17 6:42 PM (CT)", "subject": "ENGLISH"}]