[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:50PM", "meet_l": "Helmerich Auditorium"}], "school": "SoC", "enrl_requirement": "", "qtr": "Winter 2016", "name": "22302", "title": "SoC RTVF 398-0-20 Symposium: Issues in RTVF", "class_attributes": "", "section": "22302", "instructors": [{"instructor_phone": "", "instructor_name": "Miriam Joanna Petty", "instructor_addr": ""}], "topic": "Adaptation", "course": "398-0", "descriptions": [{"name": "Overview of class", "value": "This class explores contemporary film adapted from literature and popular fiction, primarily from African American literary sources, but also including examples of mainstream literature adapted as film targeted towards African American audiences. Students will examine and analyze the problems and possibilities of literary to film adaptation in the light of the historical politics of visibility, identity, audience, and representation that surround the Black presence in American film. Students will also consider the intertextual connections between the traditions of African American literature and film, in terms of content, themes, and style. The course may include such diverse films and texts as Beloved (1987 novel, Toni Morrison; 1998 film, Jonathan Demme), The Color Purple (1982 novel, Alice Walker; 1985 film, Steven Spielberg), The Wiz (1900 novel - The Wonderful Wizard of Oz by L. Frank Baum, 1978 film, Sidney Lumet), Malcolm X (1965 autobiography by Malcolm X and Alex Haley, 1992 film by Spike Lee) and Devil in a Blue Dress (1990 novel, Walter Mosley, 1995 film, Carl Franklin).The class will also explore the impact of race on the industry trend of adapting non fiction &quot;self-help&quot; books directed primarily at women, through reading and watching the recent best-seller/box-office hit Think Like A Man (2009 book, Steve Harvey; 2012 film, Tim Story).<br/><br/>In addition to relevant source materials, course readings may include:<br/>Robert Stam, Literature and Film: A Guide to the Theory and Practice of Film Adaptation<br/>Barbara Lupack, Literary Adaptations in Black American Cinema: From Micheaux to Morrison"}], "lmod": "1/9/16 6:39 PM (CT)", "subject": "RTVF"}]