[{"school": "DOHA", "overview_of_class": "<p>In this course, students will reflect on the various ways in which messages do rhetorical (persuasive) work and will develop a more critical (analytical and evaluative) stance from which to read persuasive messages. In the first half of the semester, they will explore some of the theories and methods that communication scholars have used to study persuasive communication. In the second half of the semester, they will employ some of these theories and methods to develop a detailed critique of a rhetorical text (literary, audio-visual, performative, interactive, multimedia) of their choice. Students will write several short papers that summarize and comment upon the various critical theories and methods. Each student will co-teach (with me) one critical theory or method. Students will write a detailed rhetorical critique of a text of their choice in four steps (Text Description, Critical Stance, Interpretation, Evaluation) and will share their critique with the class in a formal presentation.</p>", "name": "Undergraduate Seminar", "section": "70", "location": "Northwestern Qatar Room 2-201", "topic": "Rhetorical Criticism", "course": "398-0", "meeting_time": ["Th 01:30PM - 04:20PM (AST)"], "path": "/class-descriptions/4660/DOHA/MIT/398-0/30720", "instructor": ["Allwyn   Tellis"], "class_attributes": "", "id": "30720", "subject": "MIT"}, {"school": "DOHA", "overview_of_class": "<p>This course introduces students to important styles, artistic movements, and film industry developments in the cinemas of the global south. We will discuss the theories behind the different terms that have been used to name these cinemas including \"third cinema,\" \"world cinema,\" \"global cinema,\" and \"transnational cinema.\" The weekly screenings for the class will include several of the most influential feature films of their eras and regions, and their styles will range from popular melodrama to new-wave art films.</p>", "name": "Undergraduate Seminar", "section": "71", "location": "Northwestern Qatar Room 1-245", "topic": "Issues in World Cinema", "course": "398-0", "meeting_time": ["MoWe 10:30AM - 11:50AM (AST)"], "path": "/class-descriptions/4660/DOHA/MIT/398-0/30721", "instructor": ["Kaveh Travis Askari"], "class_attributes": "", "id": "30721", "subject": "MIT"}, {"school": "DOHA", "overview_of_class": "", "name": "Undergraduate Seminar", "section": "72", "location": "Northwestern Qatar Room 1-245", "topic": "Sports, Media & Society", "course": "398-0", "meeting_time": ["MoWe 12:30PM - 02:20PM (AST)"], "path": "/class-descriptions/4660/DOHA/MIT/398-0/30995", "instructor": ["Craig Llewellyn   Lamay"], "class_attributes": "", "id": "30995", "subject": "MIT"}]