[{"class_mtg_info": [{"meet_t": "MoWeFr 10:00AM - 10:50AM", "meet_l": "Swift Hall 107"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "31007", "title": "WCAS STAT 202-0-20 Introduction to Statistics", "class_attributes": "Formal Studies Distro Area<br/><br/>", "section": "31007", "instructors": [{"instructor_phone": "", "instructor_name": "Arend Matthew Kuyper", "instructor_addr": "IPR, 2040 Sheridan Road, Evanston"}], "topic": "", "course": "202-0", "descriptions": [{"name": "Overview of class", "value": "This course introduces students to the discipline of statistics as a science of understanding and analyzing data. Students will learn how to collect data, how to analyze data, and how to use data to make inferences and conclusions about real world phenomena. Students will also learn how to be better consumers of everyday statistics -news, social media, infotainment, etc."}, {"name": "Registration Requirements", "value": "Prerequisites: Mastery of high school algebra as computation and derivations to solve real data problems are routinely involved."}, {"name": "Learning Objectives", "value": "1. Recognize the importance of data collection, identify limitations in data collection methods, and determine how they affect the scope of inference.<br/>2. Use statistical software to summarize data numerically and visually, and to perform data analysis.<br/>3. Have a conceptual understanding of the unified nature of statistical inference.<br/>4. Apply estimation and testing methods to analyze single variables or the relationship between two variables in order to understand natural phenomena and make data-based decisions.<br/>5. Model numerical response variables using a single or multiple explanatory variables.<br/>6. Interpret results correctly, effectively, and in context without relying on statistical jargon.<br/>7. Critique data-based claims and evaluate data-based decisions."}, {"name": "Evaluation Method", "value": "Students will be evaluated through (1) responses to requests for discussion/comment on topics through Canvas; (2) online homework; (3) quizzes/labs/activities; (4) a midterm and; (5) a final."}, {"name": "Class Materials (Required)", "value": "free online textbook, OpenIntro Statistics 3rd Edition (https://www.openintro.org/stat/textbook.php)"}], "lmod": "2/20/17 6:51 PM (CT)", "subject": "STAT"}]