[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "Locy Hall 301"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "22739", "title": "WCAS PHIL 328-0-21 Classics of Analytic Philosophy", "class_attributes": "Graduate Students Only<br/><br/>", "section": "22739", "instructors": [{"instructor_phone": "8474912558", "instructor_name": "Axel   Mueller", "instructor_addr": "Crowe 1-111"}], "topic": "", "course": "328-0", "descriptions": [{"name": "Overview of class", "value": "In this course, we will study some of the major figures in early analytic philosophy. The basic orientation of the course is systematic, although the historical emergence of the ideas will structure the order of studying the figures in the seminar. The main systematic themes are the idea to solve traditional problems of modern philosophy by elucidation and logical and linguistic analysis, which yields the basic features associated with the linguistic turn in philosophical methodology. Another theme is the ?naturalizing' idea that the role of philosophy is that of at most a partner (if not a part) of science. The leading question tying it all together will be how the notion of what it is to be meaningful and representing the world changed throughout a stepwise process of philosophical elucidation. This course aims at illustrating how analysis first transformed genuinely philosophical problems and issues into linguistic and logical ones and so made them accessible to human (as opposed to transcendent) reason and thereby ultimately resulted in a revolutionary and promising reconception of what it takes for human beings to correctly represent, know and act within the world."}, {"name": "Learning Objectives", "value": "Students will get to know and become familiar with the core figures and themes of the currently dominant tradition of philosophy, analytic philosophy. This will acquaint them with the main intellectual moves that brought about its two revolutionary ideas, the linguistic turn and the naturalizing of some basic philosophical concepts, such as reason, representation, and normativity.<br/><br/>Students will acquire an enhanced sensitivity for method, logical analysis of theoretical and practical complexes and their connection, as well as expertise in the close written and oral analysis of complex thoughts and textual sources. <br/>Students ought to acquire a reflective awareness of the complex interrelations between foundations for linguistic, scientific, and ultimately cultural norms, as well as an ability to identify elements of rationality and objectivity claims."}, {"name": "Teaching Method", "value": "Group work: Group Presentation<br/>LectureSeminar"}, {"name": "Evaluation Method", "value": "One short paper (Midterm, ca. 1200 words), ca. 35% of final grade.<br/>One final paper (~2800 words), ca. 45% of final grade.<br/>Participation in Discussion and Lecture 20%."}, {"name": "Class Materials (Required)", "value": "Coursepack:<br/><br/>Frege, G. &quot;On Sense and Reference&quot; (1892), &quot;The Thought: A Logical Inquiry&quot; (1913)<br/>Russell, B., &quot;On Denoting&quot; (1905), &quot;The Philosophy of Logical Atomism&quot; (1918), &quot;Knowledge by Acquaintance and Knowledge by Description&quot; (1911)<br/>Moore, G.E.: Principia Ethica (1903), ch.1 (excerpts), reprinted as &quot;The Undefinability of Good&quot;, &quot;A Reply to My Critics: Analysis&quot; (1942), &quot;A Defence of Common Sense&quot; (1925)<br/>Carnap, R.: &quot;The Elimination of Metaphysics Through Logical Analysis of Language&quot; (1932), &quot;Logical Analysis of Language: Semantics and Syntax&quot; (1939), &quot;Empiricism, Semantics, and Ontology&quot; (1950)<br/>Ayer, A.J.: &quot;The Apriori&quot; (1936), Language, Truth, and Logic, ch.4<br/>Quine, W.V.O.: &quot;Two Dogmas of Empiricism&quot; (1951), &quot;Ontological Relativity&quot; (1968)<br/>Austin, J.L.: Sense and Sensibilia (1962), &quot;The Meaning of Words&quot;;<br/>Wittgenstein, L.: Excerpts from The Blue and the Brown Books, (ca.1940) &amp; Philosophical Investigations"}], "lmod": "12/29/16 7:03 PM (CT)", "subject": "PHIL"}]