[{"class_mtg_info": [{"meet_t": "MoWeFr 2:00PM - 2:50PM", "meet_l": "Technological Institute L211"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Co-requisite: Students must also register for PHYSICS 136-1. Add both classes to the shopping cart and submit together for successful registration.", "qtr": "Fall 2016", "name": "13945", "title": "WCAS PHYSICS 130-1-02 College Physics", "class_attributes": "Natural Sciences Distro Area<br/><br/>", "section": "13945", "instructors": [{"instructor_phone": "847/491-7477", "instructor_name": "Arthur Gerard   Schmidt", "instructor_addr": "Technological Institute (2145 Sheridan Road), Room F-226, Evanston"}], "associated_classes": [{"component": "DIS", "room": "Technological Institute L211", "meeting_time": "Th 2:00PM - 2:50PM"}, {"component": "DIS", "room": "Tech Institute Lecture Room 5", "meeting_time": "Th 2:00PM - 2:50PM"}], "topic": "", "course": "130-1", "descriptions": [{"name": "Overview of class", "value": "This is the first quarter of a three-quarter, algebra-based physics course with lecture. Physics is the most basic of the sciences, dealing with the behavior and structure of matter. Lectures illustrate physical principles: mechanics, motion, momentum and energy, and fluids. Continues as PHYSICS 130-2, 3. Students taking this course must also enroll in a Physics Lab 136-1. Actual demonstrations of many physical principles will be shown in the lecture when ever possible. Weekly quizzes emphasize problem solving. The goal of the course is for the student to gain an understanding of the nature of the physical principles which govern the world around us and the universe beyond, through models which draw on our everyday experiences. <br/><br/>Topics:<br/>1. Motion in One Dimension<br/>2. Vectors<br/>3. Motion in a Plane<br/>4. Particle Dynamics<br/>5. Work and Energy<br/>6. Conservation of Energy<br/>7. Conservation of Linear Momentum<br/>8. Collisions<br/>9. Rotational Kinematics<br/>10. Rotational Dynamics and Conservation of Angular Momentum<br/>11. Oscillations<br/>12. Fluids<br/><br/>Laboratory Exercises:<br/>1. Kinematics I: Uniform Acceleration. The study of an object sliding down a frictionless incline.<br/>2. Kinematics II: Acceleration-deceleration. The study of the interrelation between displacement, velocity, and acceleration for an object with changing acceleration.<br/>3. Newton's 2nd Law. Study of the relationship of mass and acceleration<br/>4. Conservation of Energy. Study of the transformation of energy from one form to another.<br/>5. Conservation of Momentum. Conservation of momentum and energy is verified for an elastic collision.<br/>6. Conservation of Momentum in 2-D. Conservation of momentum and energy is verified for an elastic collision in a plane.<br/>7. Rotation of a Rigid Body around a Fixed Axis I. Study of the relationship between torque, force, and moment of inertia.<br/>8. The Pendulum. The simple pendulum and the physical pendulum are compared."}, {"name": "Registration Requirements", "value": ".Basic knowledge of High School algebra and trigonometry."}, {"name": "Teaching Method", "value": "Lecture with demonstration. The instructor will draw on the large assortment of lecture demonstrations from the Lecture Demonstration Collection of the Department of Physics and Astronomy at Northwestern University Evanston Campus. Class participation is encouraged through use of personal response polling system, and questions are always welcome."}, {"name": "Evaluation Method", "value": "Grades for this course are based on two hour in-class midterms, final exam and quizzes are weekly."}, {"name": "Class Materials (Required)", "value": "The readings will likely be based on the following list (text is subject to change): <br/><br/>Physics by Giancoli, 7th ed, publisher- Pearson"}], "lmod": "10/30/16 7:08 PM (CT)", "subject": "PHYSICS"}]