[{"school": "SoC", "overview_of_class": "RTVF 379-0 Topics in Film/Video/Audio Production: Computer Code as Expressive Medium ?<br/>Course Description<br/>This course is specifically designed for beginners (participants who have no background in programming) and it introduces the expressiveness of computing to visual artists. We will learn the basics of procedural thinking and create interactive dynamic compositions, applets, and games by using an open source environment, Processing. The course will enable participants to create their own tools for interaction, movement, and form. Participants who do not plan to pursue programming will have the essential knowledge about procedural thinking and gain tools to communicate efficiently with programmers and establish interdisciplinary collaborations. In addition to weekly design assignments, we will explore interactive games and art works via presentations of participants along with assigned readings.<br/><br/>Required Text<br/>Processing: A Programming Handbook for Visual Designers and Artists, Edition: 2, Casey Reas, Ben Fry ISBN: 9780262028288 Publisher: MIT Press Publication Date: 12/26/2014 Amazon $59.10, Used: 42.85", "name": "Topics in Interactive Media", "section": "20", "location": "Louis Hall 118", "topic": "Computer Code as Expressive Medium", "course": "376-0", "meeting_time": ["MoWe 10:00AM - 11:20AM"], "path": "/class-descriptions/4650/SoC/RTVF/376-0/24555", "instructor": ["Ozge   Samanci"], "class_attributes": "Prerequisites apply, see description<br/><br/>", "id": "24555", "subject": "RTVF"}, {"school": "SoC", "overview_of_class": "RTVF 376-0 Topics in Film/Video/Audio Production: Drawing for Media<br/>Course Description and Objectives<br/>This course will teach basic drawing and design skills for storytellers. Participants will practice with both analog tools (drawing and collage) and digital tools (Photoshop and Illustrator) and learn to combine analog and digital tools to create static images for telling stories. Course will be particularly useful for participants who would like to follow a path in animation, comics-graphic novels, design, photography, or cinematography. Participants will keep a journal, make weekly design and drawing assignments, participate in critique sessions, and make an individual presentation about a design work. The capstone project may include a comics story or a storyboard. No drawing or software skills required for taking this course but participants must be willing to practice drawing through a range of assignments.<br/><br/>Text Books (Total $16)<br/>Text Books Ivan Brunetti, Cartooning: Philosophy and Practice, Yale University Press; Reprint edition (March 29, 2011) Book is available as an ebook through NU library.<br/> <br/>Lynda Barry, Syllabus: Notes from an Accidental Professor, Drawn and Quarterly (October 21, 2014), $16.04.<br/><br/>Class Materials (Total approximately $60-70)<br/>1. A light notebook that you can always carry with you wherever you go<br/>2. 2B pencils<br/>3. An eraser (Staedtler)<br/>http://www.dickblick.com/items/21500-0000/<br/>4. A pencil sharpener<br/>5. Drafting triangle (ruler)<br/>http://www.dickblick.com/products/blick-triangles/<br/>6. Dip Pen Nib<br/>http://www.dickblick.com/items/20913-1099/<br/>7. Standard Pen Holder<br/>http://www.dickblick.com/items/22930-0000/<br/>8. Brush Size 2 (Choose something cheap), Brush Size 6 (Choose something cheap)<br/>9. Micron pens 02, 03, 05, 08<br/>http://www.dickblick.com/products/sakura-pigma-micron-pen/<br/>10. Yasutomo Waterproof Liquid Sumi Ink<br/>http://www.dickblick.com/products/yasutomo-waterproof-liquid-sumi-ink/<br/>11. Sketch Pad Boards<br/>http://www.dickblick.com/products/blick-sketch-pad-boards/?clickTracking=true&CAWELAID=520010530000052608<br/>12. Tracing Paper<br/>http://www.dickblick.com/products/blick-tracing-paper/", "name": "Topics in Interactive Media", "section": "21", "location": "Louis Hall 118", "topic": "Drawing for Media", "course": "376-0", "meeting_time": ["TuTh 10:00AM - 11:50AM"], "path": "/class-descriptions/4650/SoC/RTVF/376-0/24556", "instructor": ["Ozge   Samanci"], "class_attributes": "Prerequisites apply, see description<br/><br/>", "id": "24556", "subject": "RTVF"}]