[{"class_mtg_info": [{"meet_t": "MoWeFr 10:00AM - 10:50AM", "meet_l": "Parkes Hall 223"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "23926", "title": "WCAS ENGLISH 324-0-20 Studies in Medieval Literature", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "23926", "instructors": [{"instructor_phone": "847/491-5679", "instructor_name": "Barbara Jane   Newman", "instructor_addr": "University Hall 215"}], "topic": "Medieval Autobiography", "course": "324-0", "descriptions": [{"name": "Overview of class", "value": "The art of life-writing is perennially popular, yet its conventions have changed much over time. In this class we will consider a range of medieval ideas about the self and reasons for writing about oneself, principally with God as a witness. Our period begins with the first Western autobiography, Augustine's Confessions (5th c.), and ends with the first autobiography in English, the Book of Margery Kempe (15th c.). In between we will read examples of spiritual and erotic autobiography as well as literary confessions by Chaucer, Langland, Hoccleve, and Christine de Pizan. Some of the fascinating characters we will meet include Hermann of Scheda, a Jewish convert to Christianity; Hildegard of Bingen, a visionary prophet; the lovers Abelard and Heloise, Dante and Beatrice; and the poet-bureaucrat Thomas Hoccleve, struggling to overcome the stigma of a mental breakdown."}, {"name": "Teaching Method", "value": "Some lecture, mostly discussion."}, {"name": "Evaluation Method", "value": "Class participation, oral presentations, and three short papers (5-7 pages). At least one of these must be an analytical essay, and one must be a creative response to the texts. Topics for the papers and presentations will be assigned."}, {"name": "Class Materials (Required)", "value": "Augustine, Confessions, trans. R. S. Pine-Coffin (Penguin) - 014044114X; A Monk's Confession: The Memoirs of Guibert of Nogent, trans. Paul Archambault (Penn State Press) - 0271014822; Making Love in the Twelfth Century, ed. Barbara Newman (Penn) - 0812248098; The Letters of Abelard and Heloise, trans. Betty Radice, rev. M. T. Clanchy (Penguin) - 0140448993; Dante, Vita Nuova, ed. and trans. Stanley Appelbaum (Dover) - 0486453499; Julian of Norwich, Revelations of Divine Love, trans. Elizabeth Spearing (Penguin) - 0140446737; The Book of Margery Kempe, trans. B. A. Windeatt (Penguin) - 0140432515."}, {"name": "Class Notes", "value": "Note: The above course is combined with COMP_LIT. If the ENGLISH side of the course is full, you may register for the course under the co-listed department and receive the same credit toward your English major."}], "lmod": "12/24/16 6:58 PM (CT)", "subject": "ENGLISH"}]