[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Garrett-Evangelic Seminary 107"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "34430", "title": "WCAS SOCIOL 376-0-25 Topics in Sociological Analysis", "class_attributes": "", "section": "34430", "instructors": [{"instructor_phone": "", "instructor_name": "Maria   Akchurin", "instructor_addr": ""}], "topic": "Environment, Politics, and Society", "course": "376-0", "descriptions": [{"name": "Overview of class", "value": "What are the social and political dimensions of environmental problems? What kinds of social responses to environmental challenges and crises have emerged worldwide? This course examines connections between the natural environment, politics, and society across the global North and South. We will begin with theories of environment-society relations and central questions about how the natural environment is defined and valued by different actors, the limits and possibilities of environmental governance, the tensions between environmental considerations and economic development, and the relationship between the environment and socioeconomic inequality. We will then consider social and political responses to environmental problems, paying special attention to grassroots mobilization around environmental justice, organized social movements and expert NGOs working on the politics of the environment, community inaction in the face of toxic risks, and changing patterns of individual consumption. We will read and analyze case studies based in Chicago, other parts of the United States, and international sites to examine how people contribute to, are affected by, and try to shape contemporary environmental problems."}, {"name": "Registration Requirements", "value": "Open to sociology majors and minors during preregistration. All undergraduate students may register during regular registration beginning February 22."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Discussion and Papers"}, {"name": "Class Materials (Required)", "value": "All materials available on Canvas. No purchase necessary."}], "lmod": "4/3/16 8:22 PM (CT)", "subject": "SOCIOL"}]