[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "University Hall 101"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "31233", "title": "WCAS INTL_ST 390-0-23 Special Topics in International Studies", "class_attributes": "", "section": "31233", "instructors": [{"instructor_phone": "847/467-2689", "instructor_name": "Kathleen Fitzpatrick Klaus", "instructor_addr": "620 Library Lane, #202"}], "topic": "Land Rights&amp;Conflict in Glbl Perspective", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "For much of the world's population, land sustains livelihoods, shapes identities, and provides a source of<br/>investment and security. Yet the centrality of land in everyday life also means that it can become a<br/>source of contentious politics and violence. This class explores how struggles over access and rights to<br/>land shape different forms of conflict and violence: between squatters and state officials, different<br/>ethnic groups, or armed groups and the state.<br/><br/>The course explores questions of land and conflict in several parts. We begin by examining the question<br/>of land meanings: what does land, property, and territory mean to different groups of people? How<br/>does this help us understand why people organize or fight around issues of land? Second, the course<br/>takes an historical and comparative view of the rules and institutions that shape people's rights and<br/>access to land. The third part of the class explores theories that link land to conflict and violence. We<br/>then apply these theories to explore a set of case studies of land-related conflict: from the recent armed<br/>uprising in Oregon to civil war in Colombia. The last part of the class moves toward policy<br/>considerations. How, for example, can a focus on land rights improve post-conflict resolution?<br/>The course is interdisciplinary in its approach, drawing heavily on political science and political<br/>geography. It should appeal to students interested in peace and conflict issues, environmental politics,<br/>international development, and human rights."}, {"name": "Evaluation Method", "value": "Class participation: 30%<br/>Paper, final: Final Research Paper - 40%<br/>Papers: Critical Review - 2 x 10%<br/>Presentations: Presentation of Research Paper - 10%<br/>"}, {"name": "Class Materials (Required)", "value": "Cotula, Lorenzo. The great African land grab? Agricultural investments and the global food system. London, UK: Zed Books, 2013<br/><br/><br/>Course packet for all other readings available for purchase."}], "lmod": "4/3/16 8:09 PM (CT)", "subject": "INTL_ST"}]