[{"school": "WCAS", "overview_of_class": "<p>*INFORMATION IS SUBJECT TO CHANGE*</p><br/><br/><p>The instructor for &quot;Entrepreneurship&quot; is: Scott Lerner.</p><br/><br/><p>This class is designed to expose you to many of the critical elements fundamental to becoming a successful entrepreneur. It will be taught from the perspective of the business world - not the perspective of the classroom, and will feature several outside speakers including local entrepreneurs, industry experts and investors.</p><br/><br/><p>The course will leverage the multidisciplinary backgrounds of the students in the class and will emphasize the importance of cross-functional thinking when building a new business or designing a new product. In the spirit of most successful ventures this course will also emphasize the importance of working in teams to solve problems and deliver against challenging objectives and timelines.</p><br/><br/><p>This class will not provide you with everything they need to run out and start your first business. It will, however, highlight fundamental components of high-growth entrepreneurship and offer you a solid step in the right direction. Most importantly it will challenge your creative thinking and push you to become a better problem solver.</p><br/><br/><p>Starting a business is difficult, all-consuming and the odds are stacked against the entrepreneur. As such, this class will also be difficult and time consuming, but for those of you who are considering starting your own business or going into a related field it might just be one of the most enjoyable and rewarding classes you take.</p>", "name": "Professional Linkage Seminar", "section": "22", "topic": "Entrepreneurial Start-Up Creation", "course": "394-0", "meeting_time": ["Mo 6:00PM - 9:00PM"], "path": "/class-descriptions/4610/WCAS/BUS_INST/394-0/20426", "instructor": ["Scott David Lerner"], "id": "20426", "subject": "BUS_INST"}, {"school": "WCAS", "overview_of_class": "*INFORMATION IS SUBJECT TO CHANGE*<br/><br/><br/>The instructor of &quot;Lessons in Non-Profit Management&quot; is: Seth Green.<br/><br/><br/>In this course, we will dive into the exciting world of non-profits and immerse ourselves in everything from how non-profits finance their efforts to how they measure their performance. We will also look at what makes a great consultant, as you serve as a consultant to a non-profit client.<br/><br/><br/>This course brings together students from a variety of academic disciplines and leverages their diverse talents in the field to consult nonprofits facing organizational challenges in addressing issues such as poverty, homelessness and education. Bridging the divide between academic experience and civic engagement, teams of five undergraduate students have the opportunity to work on ten-week engagements with nonprofits under the supervision of Kellogg MBA students.<br/><br/><br/>To inform and guide students` interaction with nonprofits, this course will provide an overview of the nonprofit sector and the growing trends towards greater accountability, transparency and performance management. Students will explore the changing roles and responsibilities of nonprofits, as shaped by both the public and private sector, and they will examine the implications of these trends. The first half of the course will be spent introducing students to the Third Sector and the present political and economic systems that influence how it serves the public good. The second half of the course will be spent examining business strategy and management and their applicability to nonprofits. The overarching goal of the course is to create a foundation of knowledge from which students can draw upon as they work together with community nonprofits. This course is an opportunity to innovate, collaborate, learn and apply a new set of skills and knowledge while impacting the community.", "name": "Professional Linkage Seminar", "section": "26", "topic": "Lessons in Non-Profit Mgmt", "course": "394-0", "meeting_time": ["Tu 2:00PM - 4:50PM"], "path": "/class-descriptions/4610/WCAS/BUS_INST/394-0/20427", "instructor": ["Seth Jacob Green"], "id": "20427", "subject": "BUS_INST"}]