[{"class_mtg_info": [{"meet_t": "Mo 6:00PM - 9:00PM", "meet_l": "Garage Workspace Classroom 1"}], "school": "WCAS", "overview_of_class": "<p>*INFORMATION IS SUBJECT TO CHANGE*</p><br/><br/><p>The instructor for \"Entrepreneurship\" is: Scott Lerner.</p><br/><br/><p>This class is designed to expose you to many of the critical elements fundamental to becoming a successful entrepreneur. It will be taught from the perspective of the business world - not the perspective of the classroom, and will feature several outside speakers including local entrepreneurs, industry experts and investors.</p><br/><br/><p>The course will leverage the multidisciplinary backgrounds of the students in the class and will emphasize the importance of cross-functional thinking when building a new business or designing a new product. In the spirit of most successful ventures this course will also emphasize the importance of working in teams to solve problems and deliver against challenging objectives and timelines.</p><br/><br/><p>This class will not provide you with everything they need to run out and start your first business. It will, however, highlight fundamental components of high-growth entrepreneurship and offer you a solid step in the right direction. Most importantly it will challenge your creative thinking and push you to become a better problem solver.</p><br/><br/><p>Starting a business is difficult, all-consuming and the odds are stacked against the entrepreneur. As such, this class will also be difficult and time consuming, but for those of you who are considering starting your own business or going into a related field it might just be one of the most enjoyable and rewarding classes you take.</p>", "qtr": "Winter 2016", "name": "Professional Linkage Seminar", "title": "WCAS BUS_INST 394-0-22 Professional Linkage Seminar", "lmod": "1/9/16 6:44 PM (CT)", "section": "22", "instructors": [{"instructor_phone": "", "instructor_name": "Scott David Lerner", "instructor_addr": ""}], "topic": "Entrepreneurial Start-Up Creation", "course": "394-0", "enrl_requirement": "Enrollment Requirements: Reserved for Juniors &amp; Seniors", "descriptions": [{"name": "Overview of class", "value": "<p>*INFORMATION IS SUBJECT TO CHANGE*</p><br/><br/><p>The instructor for &quot;Entrepreneurship&quot; is: Scott Lerner.</p><br/><br/><p>This class is designed to expose you to many of the critical elements fundamental to becoming a successful entrepreneur. It will be taught from the perspective of the business world - not the perspective of the classroom, and will feature several outside speakers including local entrepreneurs, industry experts and investors.</p><br/><br/><p>The course will leverage the multidisciplinary backgrounds of the students in the class and will emphasize the importance of cross-functional thinking when building a new business or designing a new product. In the spirit of most successful ventures this course will also emphasize the importance of working in teams to solve problems and deliver against challenging objectives and timelines.</p><br/><br/><p>This class will not provide you with everything they need to run out and start your first business. It will, however, highlight fundamental components of high-growth entrepreneurship and offer you a solid step in the right direction. Most importantly it will challenge your creative thinking and push you to become a better problem solver.</p><br/><br/><p>Starting a business is difficult, all-consuming and the odds are stacked against the entrepreneur. As such, this class will also be difficult and time consuming, but for those of you who are considering starting your own business or going into a related field it might just be one of the most enjoyable and rewarding classes you take.</p>"}, {"name": "Registration Requirements", "value": "<p>While the class has been designed with a Liberal Arts focus in mind, an understanding of basic accounting is required. <br/><br/><br/>Though ideal, it is not necessary to have your own idea for a new business in order to benefit from this class. <br/><br/><br/>Reasonable proficiency in Microsoft Excel and PowerPoint (or other presentation software) is strongly recommended.</p>"}, {"name": "Teaching Method", "value": "<p>Structure:</p><br/><br/>The structure of the course will be a blend of lecture and hands-on working sessions. <br/><br/>Students will form teams of 3 before the first week of class in order to begin planning and working together on a project that will start on day 1. <br/><br/>The culmination of this project will be a complete investment presentation for a high-growth business (real or fictional) that will be judged by a panel of seasoned entrepreneurs and investors at the end of the quarter. <br/><br/>This final project will account for the majority of the overall grade for the course.<br/><br/><br/><br/><p>Format of Class Sessions:</p><br/><br/>Each class will involve components of lecture, group discussion, mini-presentations by students, team exercises and guest speakers. The ratios of each of these components will vary week to week depending on the subject of a particular class. Teams will be asked to present something in front of the class most weeks, with every member having at least one opportunity to be the presenter.<br/><br/><p>Being responsive and open to feedback is a key part of starting a new business. As such, this class will optimize opportunities for teams to learn from each other and help each other figure out how to collaboratively solve problems and find answers.</p>"}, {"name": "Class Materials (Required)", "value": "<ul><br/><li>*&quot;The Art of the Start 2.0&quot; - Guy Kawasaki</li><br/><li>&quot;Entrepreneurial Finance: Finance and Business Strategies for the Serious Entrepreneur 3rd Edition&quot; - Steven Rogers</li><br/></ul><br/><br/><br/>Additional articles and cases may also be used from time to time.<br/><br/><br/><p>* To be read before the first day of class</p>"}], "path": "/class-descriptions/4610/WCAS/BUS_INST/394-0/20426", "instructor": ["Scott David Lerner"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "id": "20426", "subject": "BUS_INST"}, {"class_mtg_info": [{"meet_t": "Tu 2:00PM - 4:50PM", "meet_l": "Annenberg Hall G30"}], "school": "WCAS", "overview_of_class": "*INFORMATION IS SUBJECT TO CHANGE*<br/><br/><br/>The instructor of \"Lessons in Non-Profit Management\" is: Seth Green.<br/><br/><br/>In this course, we will dive into the exciting world of non-profits and immerse ourselves in everything from how non-profits finance their efforts to how they measure their performance. We will also look at what makes a great consultant, as you serve as a consultant to a non-profit client.<br/><br/><br/>This course brings together students from a variety of academic disciplines and leverages their diverse talents in the field to consult nonprofits facing organizational challenges in addressing issues such as poverty, homelessness and education. Bridging the divide between academic experience and civic engagement, teams of five undergraduate students have the opportunity to work on ten-week engagements with nonprofits under the supervision of Kellogg MBA students.<br/><br/><br/>To inform and guide students` interaction with nonprofits, this course will provide an overview of the nonprofit sector and the growing trends towards greater accountability, transparency and performance management. Students will explore the changing roles and responsibilities of nonprofits, as shaped by both the public and private sector, and they will examine the implications of these trends. The first half of the course will be spent introducing students to the Third Sector and the present political and economic systems that influence how it serves the public good. The second half of the course will be spent examining business strategy and management and their applicability to nonprofits. The overarching goal of the course is to create a foundation of knowledge from which students can draw upon as they work together with community nonprofits. This course is an opportunity to innovate, collaborate, learn and apply a new set of skills and knowledge while impacting the community.", "qtr": "Winter 2016", "name": "Professional Linkage Seminar", "title": "WCAS BUS_INST 394-0-26 Professional Linkage Seminar", "lmod": "1/9/16 6:44 PM (CT)", "section": "26", "instructors": [{"instructor_phone": "", "instructor_name": "Seth Jacob Green", "instructor_addr": ""}], "topic": "Lessons in Non-Profit Mgmt", "course": "394-0", "enrl_requirement": "Enrollment Requirements: Reserved for Juniors &amp; Seniors<br/>Add Consent: Department Consent Required<br/>", "descriptions": [{"name": "Overview of class", "value": "*INFORMATION IS SUBJECT TO CHANGE*<br/><br/><br/>The instructor of &quot;Lessons in Non-Profit Management&quot; is: Seth Green.<br/><br/><br/>In this course, we will dive into the exciting world of non-profits and immerse ourselves in everything from how non-profits finance their efforts to how they measure their performance. We will also look at what makes a great consultant, as you serve as a consultant to a non-profit client.<br/><br/><br/>This course brings together students from a variety of academic disciplines and leverages their diverse talents in the field to consult nonprofits facing organizational challenges in addressing issues such as poverty, homelessness and education. Bridging the divide between academic experience and civic engagement, teams of five undergraduate students have the opportunity to work on ten-week engagements with nonprofits under the supervision of Kellogg MBA students.<br/><br/><br/>To inform and guide students` interaction with nonprofits, this course will provide an overview of the nonprofit sector and the growing trends towards greater accountability, transparency and performance management. Students will explore the changing roles and responsibilities of nonprofits, as shaped by both the public and private sector, and they will examine the implications of these trends. The first half of the course will be spent introducing students to the Third Sector and the present political and economic systems that influence how it serves the public good. The second half of the course will be spent examining business strategy and management and their applicability to nonprofits. The overarching goal of the course is to create a foundation of knowledge from which students can draw upon as they work together with community nonprofits. This course is an opportunity to innovate, collaborate, learn and apply a new set of skills and knowledge while impacting the community."}, {"name": "Registration Requirements", "value": "Enrollment Requirements: Juniors/Seniors Only<br/><br/>Add Consent: Department Consent Required<br/><br/>Applications Only: http://www.campuscatalystnu.org<br/>"}, {"name": "Learning Objectives", "value": "1. Students will successfully develop tangible solutions to specific, measurable problems faced by community-based nonprofit organizations.<br/><br/><br/>2. Students will gain an understanding of the basics of the consulting process and how to conduct a professional business relationship.<br/><br/><br/>3. Through readings, class discussion, and interaction with guest speakers, students will gain an understanding of the social sector and trends that are changing the way nonprofit organizations and other social enterprises pursue their charitable, philanthropic and broader, mission-oriented objectives.<br/><br/>"}, {"name": "Teaching Method", "value": "This course will meet once weekly in a seminar format. Class participation and discussion will be required to make the course successful. There will be weekly reading assignments. <br/><br/><br/>The major requirements of this class, in addition to class preparation and participation, include:<br/><ul><br/><li>Group PowerPoint presentations at Weeks 4 and 8</li><br/><li>Final PowerPoint presentation at project conclusion</li><br/><li>Work with nonprofit client</li><br/><li>Weekly meeting with mentor</li><br/></ul>"}, {"name": "Evaluation Method", "value": "The Final Grade has two-parts:<br/><br/><br/>Individual: 50% <br/><br/>- 30% Participation in and evidence of preparation for class discussions - I am seeking active participation in our class discussions, clearly informed by your knowledge of our weekly readings. Part of your preparation for class participation will be writing a key question, problem or concept from the readings that particularly resonated with you or your project, and posting your thoughts on Blackboard by midnight on the Sunday before each class where readings will be discussed. As we only have 8 class discussions during the quarter (3 of the classes will be presentations), my expectation is that you will be at every class and participating in each class discussion. If you have an unexcused absence, your grade will be reduced. If you have an excused absence, then you must submit a one-page response to a weekly reading of your choice as a substitute for your class discussion grade for that week.<br/><br/><br/>- 10% Concept Paper - You will write a two-page conceptual paper (to hand in on week ten) outlining how you envision being involved in social change after you graduate from Northwestern and the skills you seek to gain to be the change you wish to see in the world.<br/><br/><br/>- 10% Team Member Evaluation - As part of your project, you will be evaluated by your teammates on your participation and work with your consulting team <br/><br/><br/>Team: 50% <br/><br/>10% Presentation #1, Week Four - After this presentation, I will meet with your team to discuss your scope of work, presentation and recommendations on how you should proceed to Presentation #2. <br/><br/><br/>10% Presentation #2, Week Eight - This grade will be based on the progress made from Presentation #1 and the methodology and workplan as you move towards your final recommendations to the client. <br/><br/><br/>25% Final Presentation and Report (including project case study), Finals Week - This grade is based on your final deliverable and case study.<br/><br/><br/>5% Client Evaluation - your team will be evaluated by your client.<br/><br/>"}, {"name": "Class Materials (Required)", "value": "&quot;The Jossey-Bass Handbook of Nonprofit Leadership and Management&quot; by David O. Renz, 3rd edition."}, {"name": "Class Notes", "value": "Application-only course. <br/><br/>Those accepted to cC (Campus Catalyst) teams will be given permission numbers for this course."}], "path": "/class-descriptions/4610/WCAS/BUS_INST/394-0/20427", "instructor": ["Seth Jacob Green"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "id": "20427", "subject": "BUS_INST"}]