[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "Parkes Hall 224"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "34919", "title": "WCAS ENGLISH 340-0-20 Restoration and 18th Century Literature", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "34919", "instructors": [{"instructor_phone": "", "instructor_name": "Helen F Thompson", "instructor_addr": ""}], "topic": "The Sensational 18th Century", "course": "340-0", "descriptions": [{"name": "Overview of class", "value": "This class is structured as an introduction both to the literature of the long eighteenth century (from the restoration of England's monarch in 1660 to the rise of Romanticism in the early 1800s) and to a topic which defined the form and content of that literature: perception. Inaugurated by the end of the English Civil War and the beginning of the Scientific Revolution, the long eighteenth century produced texts preoccupied with vision, touch, smell, and taste as well as with the transmission of feeling. This century heralded the rise of the novel, the rise of the genre of pornography, the rise of the discourse of aesthetics, and the rise of scientific experiment. In class, we'll investigate whether these various forms share a common concern with the act of perception. How might these diverse forms articulate a complex and even critical investment in perception as the act that forges a modern medium of social consensus, promises new pleasures, and mingles with the matter of external objects? We'll also ponder the contemporary legacy of this eighteenth-century preoccupation: has the eighteenth century bequeathed us literary forms which represent perception as a volatile and generative practice?"}, {"name": "Teaching Method", "value": "Discussion"}, {"name": "Evaluation Method", "value": "TBA"}, {"name": "Class Materials (Required)", "value": "Jane Austen, Pride and Prejudice;<br/>Aphra Behn, &quot;The Lucky Mistake,&quot; &quot;The Dumb Virgin&quot;;<br/>Edmund Burke, A Philosophical Enquiry into the Origin of our Ideas of the Sublime and the Beautiful;<br/>John Cleland, Memoirs of a Woman of Pleasure;<br/>William Godwin, Caleb Williams;<br/>Eliza Haywood, Fantomina;<br/>Robert Hooke, Micrographia;<br/>John Locke, An Essay concerning Human Understanding;<br/>Isaac Newton, Opticks;<br/>Jonathan Swift, Gulliver's Travels;<br/>William Wordsworth, Lyrical Ballads."}, {"name": "Class Notes", "value": "Pre 1830/ICSP/Theory"}], "lmod": "4/3/16 7:58 PM (CT)", "subject": "ENGLISH"}]