[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "Kresge Centennial Hall 2-425"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24651", "title": "WCAS RELIGION 383-0-20 Catholic Social Ethics", "class_attributes": "Ethics &amp; Values Distro Area<br/><br/>", "section": "24651", "instructors": [{"instructor_phone": "84712938", "instructor_name": "Cristina L.H. Traina", "instructor_addr": "Crowe 4-155"}], "topic": "", "course": "383-0", "descriptions": [{"name": "Overview of class", "value": "Beginning in the 1890s but stretching roots back to the medieval period, modern and contemporary Roman Catholic church teaching and academic ethics have been shaped by important domestic and international issues. This course will follow the trajectory of Roman Catholic social ethics from the late 19th century to the present. Among the trends and topics studied are the living wage movement, the Catholic Worker movement, peace and justice initiatives, liberation ethics, race, immigration, and environment. The transformation of sexuality and gender from &quot;private&quot; to &quot;social&quot; ethics will also be discussed. <br/>Our interest in this class is not to defend or defeat a particular perspective in ethics, but to use critical and analytical skills to show how an important, influential tradition in ethics has evolved over time. This is a core course for the Catholic Studies minor and for the Religion, Law. And Politics concentration in Religious Studies."}, {"name": "Registration Requirements", "value": "The course is open to all. However, a previous course in political science, religious studies, or philosophy is strongly recommended."}, {"name": "Learning Objectives", "value": "Know how to interpret the texts and subtexts of both official Catholic documents and writings in Catholic social ethics<br/>Articulate how the contexts of culture, class, politics, economy, and international conflict have shaped religious thought<br/>Trace how the meanings of apparently constant central concepts in one tradition of social ethics have changed over time <br/>Know how to interpret media reports of papal and Vatican positions on ethical questions"}, {"name": "Teaching Method", "value": "Class participation: With attendance, 20%<br/>Discussion: Every class will involve discussion of texts<br/>Group work: Groups will discuss but not produce written work<br/>Lecture: One segment of each class will be a lecture on history and/or theology<br/>Readings: Reading must be done before class daily.<br/>Writing assignments: Journals and final paper (40% each)<br/><ln/>"}, {"name": "Evaluation Method", "value": "Class participation: With attendance, 20% of grade<br/>Papers: 40% of grade<br/>Writing assignments: Journals: 40% of grade<br/>"}, {"name": "Class Materials (Required)", "value": "The following text is required. It will not be used before week 8 of the course.<br/>Bryan Massingale, Racial Justice and the Catholic Church<br/>ISBN-10: 1570757763 <br/>ISBN-13: 978-1570757761"}, {"name": "Class Materials (Suggested)", "value": "Because the readings in the following book can also be found online, this text is optional but very helpful if you prefer to mark up readings. It will not be used before week 3 of the course. <br/>O'Brien and Shannon, eds., Catholic Social Thought: The Documentary Heritage<br/>ISBN-10: 0883447878 <br/>ISBN-13: 978-0883447871<br/><br/>All other materials will be available through the internet, library databases, or Canvas.<br/>Access to a bible, which can also be an online version, is helpful."}], "lmod": "12/24/16 7:07 PM (CT)", "subject": "RELIGION"}]