[{"school": "MUSIC", "overview_of_class": "How do we talk about music? Who gets to speak about music? Taking these two questions as starting points, this class will help students develop critical listening practices and a vocabulary for talking about music in a clear and detailed way. Additionally, we will consider how gender, race, and other factors affect people's access to musical culture and their participation in musical creation and discourse. Students will be expected to prepare readings and listening assignments for each class meeting and to discuss them using the vocabulary acquired throughout the course. Students should also plan to attend and write about three concerts, and to prepare for comprehensive midterm and final exams.", "name": "Introduction to Music", "section": "20", "topic": "", "course": "170-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4610/MUSIC/GEN_MUS/170-0/21370", "instructor": ["Jenna Marie Harmon"], "id": "21370", "subject": "GEN_MUS"}, {"school": "MUSIC", "overview_of_class": "This course explores music as a phenomenon of sound and culture, providing students with foundational listening skills, cultural perspectives, and terminology for the study and appreciation of music. Making use of live and recorded performances, we will examine musical styles that have endured into the twenty-first century, traveling out of the concert hall and conservatory into the larger world via movies, television, and the Internet. In this course you will learn how to make connections between distinctive musical styles and the cultural, historical, and social factors that influenced them, while also developing tools and a vocabulary with which to explore the history, aesthetics, techniques, forms, and genres of Western classical music and beyond. Assignments will include readings, quizzes, listening, written work, and concert attendance.", "name": "Introduction to Music", "section": "21", "topic": "", "course": "170-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4610/MUSIC/GEN_MUS/170-0/21371", "instructor": ["Emily Michelle Lane"], "id": "21371", "subject": "GEN_MUS"}]