[{"school": "WCAS", "overview_of_class": "This is a studio course which will approach drawing as a viable medium for the gonzo journalist or the amateur snoop. Students will engage in idiosyncratic surveillance of subjects and subject matter of their own choosing and generate speculative sketches, diagrams, other types of drawing and handwritten commentary. Potential topics for investigation could relate to the personal, popular culture, the everyday, politics, and/or the world but must be approached with a particular point-of-view, or several. To that end, students will experiment with narration and degrees of omniscience, objectivity and reliability. Readings and conversations on artists and writers who work with creative nonfiction, unreliable narration, diagramming, handwriting, the diaristic and the culture of conspiracy theory will also be a part of the course. There will be group discussions assessing smaller assignments and a group critique on one final, long-term project, an obsessive investigation. Art majors and non-art majors are welcome to enroll. While no prerequisite is required, students should enter into the course with a serious interest in sleuthing, drawing, writing, narration and a willingness to embellish the truth.", "name": "Special Topics in Art", "section": "21", "topic": "Drawing: Obsessive Investigation", "course": "390-0", "meeting_time": ["MoWe 1:00PM - 3:50PM"], "path": "/class-descriptions/4650/WCAS/ART/390-0/21901", "instructor": ["Deborah A Sokolow"], "id": "21901", "subject": "ART"}, {"school": "WCAS", "overview_of_class": "Art 390-0 Special Topics: Project Digital Film<br/>Stephen Reinke<br/><br/>Project Digital Film is a studio class in which artists produce six short digital films, often incorporating other elements: animation, audio, installation, performance, writing, etc. The class is constructed to accommodate students at all levels of technical proficiency. The quarter is divided into six projects/challenges, each lasting three periods. First Period: Lecture, screening and discussion of artists' work. Project challenge given. Second Period: Equipment and software demos, work period. Demos are optional (depending on your knowledge/proficiency). Third Period: Screening and discussion/critique of projects. No prerequisites required.", "name": "Special Topics in Art", "section": "22", "topic": "Project Digital Film", "course": "390-0", "meeting_time": ["TuTh 1:00PM - 3:50PM"], "path": "/class-descriptions/4650/WCAS/ART/390-0/21902", "instructor": ["Stephen P Reinke"], "id": "21902", "subject": "ART"}, {"school": "WCAS", "overview_of_class": "Art 390-0 Special Topics: Performing: \"The END\"<br/>Brendan Fernandes<br/><br/>While \"the end\" often feels conclusive and brings with it a sense of finality, it is often a necessary preamble to the beginning, and for beginning again. In this course, we will focus on creating individual and collaborative art projects exploring the problem of endings in a variety of mediums including film, video, performance, and installation. An exploration of the theme will be considered through case studies of artists whose works investigate ideas of \"the end\" through topics such as love, death, war, and the environment, as well as take up Marxist and Queer theory perspectives. Critical readings will further question these ideas and meanings. The course will culminate in the presentation and critique of a final, synthesizing work. No pre-requisite is needed to take this class.<br/><br/>There is a beginning to \"The End\".", "name": "Special Topics in Art", "section": "23", "topic": "Performing: \"The END\"", "course": "390-0", "meeting_time": ["TuTh 5:00PM - 7:50PM"], "path": "/class-descriptions/4650/WCAS/ART/390-0/21903", "instructor": ["Rudolf Brendan Fernandes"], "id": "21903", "subject": "ART"}]