[{"school": "MUSIC", "overview_of_class": "GEN_MUS 175-0 Selected Topics in Music Literature: Music and Film <br/>This course surveys the history of music in the cinema, exploring questions such as: Where does the music come from? Why is it there at all? Are we meant to pay attention to it? Why this music and not some other? What does the music mean? How do we know? Are political or ethical implications attached to certain ways of using music? Does music construct our interpretation of images, or vice versa? What is its relationship to other elements of film sound? What range of functions can it serve? How and why has film-music practice changed, and what continuities have persisted? Our primary texts will consist of a wide variety of films, centered on the classical Hollywood cinema (of the 1930s-50s) but extending back to silent film (and its live musical accompaniment) and forward to today's audio technologies and globalized entertainment industries. Orchestral scores and soundtracks based on popular music will both be considered; American movies will be juxtaposed to international cinema; and the conventions of Hollywood will be contrasted with critiques and challenges to its norms. No musical background is required as prerequisite.", "name": "Selected Topics in Music Literature for Non-Majors", "section": "20", "topic": "Music and Film", "course": "175-0", "meeting_time": ["MoWeFr 2:00PM - 3:50PM"], "path": "/class-descriptions/4630/MUSIC/GEN_MUS/175-0/40293", "instructor": ["Scott Douglas Paulin"], "id": "40293", "subject": "GEN_MUS"}, {"school": "MUSIC", "overview_of_class": "GEN_MUS 175-0 Selected Topics in Music Literature: The Beatles and the Rolling Stones <br/>The Beatles versus the Stones: this course will examine what these great rock and roll bands have in common and how they differ with respect to melodies, chord progressions, lyrics, styles of singing and playing their instruments, live performances, production, and cultural context. We'll also discuss A Hard Day's Night and Gimme Shelter, the high points of these bands' legacies on film. The course will focus on the bands in the years 1962-1972, but will also touch on influences like Chuck Berry and the best of the post-Exile Stones. Assignments will include short papers and an in-class presentation. No prior musical knowledge or training is required for this class.", "name": "Selected Topics in Music Literature for Non-Majors", "section": "21", "topic": "The Beatles and the Rolling Stones", "course": "175-0", "meeting_time": ["TuTh 1:00PM - 3:30PM"], "path": "/class-descriptions/4630/MUSIC/GEN_MUS/175-0/40294", "instructor": ["David S Carter"], "id": "40294", "subject": "GEN_MUS"}]