[{"class_mtg_info": [{"meet_t": "MoWe 9:30AM - 10:50AM", "meet_l": "Allison Residential Comm 1021"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores<br/>Add Consent: Department Consent Required<br/>Drop Consent: Department Consent Required<br/>", "qtr": "Fall 2016", "name": "12675", "title": "WCAS POLI_SCI 101-6-20 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "12675", "instructors": [{"instructor_phone": "847/467-1148", "instructor_name": "Jason W Seawright", "instructor_addr": ""}], "topic": "Populism in America and Worldwide", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "Prof. Seawright, &quot;Populism in America and Worldwide&quot;, Fall 2016<br/>&quot;Selfish, incompetent political elites are ruining the country, and real Americans need to stand up and take control back!&quot; This kind of ideology, called populism, is familiar to liberals and conservatives; worldwide, it has a history as old as democracy, if not older. What makes a politician a populist? How and when does populism connect with citizens? What are the results of populists in government? These questions are always important, and they take on new urgency given current directions in American politics. In this class, we will read populists' explanations of themselves, study scholarly and journalistic accounts, and work toward a final paper presenting our own perspectives on populism."}, {"name": "Learning Objectives", "value": "By the end of the course, students will be able to identify populist ideas in political speeches and movements; will be prepared to compare new populists to traditional examples; will understand current psychological explanations of populists' appeal; and will be able to critically analyze the advantages and pitfalls of current populist ideologies."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Discussion; Two preparatory drafts and a final paper."}, {"name": "Class Materials (Required)", "value": "Michael Kazin, Cornell University Press, The Populist Persuasion: An American History, 1998, 978-0801485589."}], "lmod": "10/30/16 7:08 PM (CT)", "subject": "POLI_SCI"}]