[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Annenberg Hall G30"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "13190", "title": "WCAS LING 360-0-20 Fundamentals of Syntax", "class_attributes": "Formal Studies Distro Area<br/><br/>", "section": "13190", "instructors": [{"instructor_phone": "847/491-8052", "instructor_name": "Masaya   Yoshida", "instructor_addr": "2016 Sheridan Road, Rm. 301"}], "topic": "", "course": "360-0", "descriptions": [{"name": "Overview of class", "value": "The past 40 years have seen significant advances in the understanding of the so-called &quot;locality constraints&quot; in syntax. A great number of studies have been devoted to understand the nature of syntactic operations and they have been crucially looking at the interaction of these operations with the locality constraints. However, in this direction of research, the nature of islands has been relatively disregarded for a long time. Although Ross's studies have revealed which domains are islands and which are not, the question why islands are islands and non-islands are not islands has remained unanswered except for a few studies (Chomsky 1986, Lasnik &amp; Saito 1992, Rizzi 1991 and others). Even these attempts are facing serious challenges once we start looking at wide varieties of cross-linguistic data. The aim of this course is to learn the basics of transformational generative grammar by looking at locality constraints. In particular we are concerned with questions of what the nature of island constraints is, and what our current understanding of them is."}, {"name": "Registration Requirements", "value": "None"}, {"name": "Learning Objectives", "value": "Theories and analytical skills in syntactic research."}, {"name": "Teaching Method", "value": "Lecture"}, {"name": "Evaluation Method", "value": "ExamsHomework"}, {"name": "Class Materials (Suggested)", "value": "Research papers, which will be provided through the course website"}, {"name": "Class Notes", "value": "All the class notes will be provided through the course website."}], "lmod": "10/30/16 7:07 PM (CT)", "subject": "LING"}]