[{"class_mtg_info": [{"meet_t": "MoTuThFr 4:00PM - 4:50PM", "meet_l": "Technological Institute F281"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: PRE-REG only: Reserved for German majors.", "qtr": "Spring 2017", "name": "30868", "title": "WCAS GERMAN 101-3-25 Beginning German", "class_attributes": "", "section": "30868", "instructors": [{"instructor_phone": "8474918081", "instructor_name": "John   Paluch", "instructor_addr": "1880 Campus Drive, Kresge Hall, Rm 3315"}], "topic": "", "course": "101-3", "descriptions": [{"name": "Overview of class", "value": "This is an intensive 2-unit elementary German course that covers the material in German 101-2 and 101-3 during Spring Quarter. Many students in this course are continuing from the special course the department offered during Winter Quarter (German 101-1 MTuThF 3 or 4 p.m.) and there are others who began learning German in high school or who finished the first quarter of the 101 sequence at Northwestern. <br/><br/>German 101-2 takes place from March 27- April 28 and German 101-3 takes place from May 1-May 29. I will compute the grades for 101-2 on the weekend of April 29-30. <br/><br/>We will continue to focus on developing proficiency in all four language skills: listening, speaking, reading, and writing, while using the culture and history of the German speaking countries as basic source materials.<br/><br/>German 101-2 We will work more with texts this quarter and will be reading some poetry from Heinrich Heine and Johann Wolfgang von Goethe. Preparations during the quarter lead up to an interview with an invited guest from Germany. (Mystery Guest).<br/><br/>German 101-3 During this final quarter of elementary German, readings and class activities focus on providing interesting perspectives on German life and culture. We will work with selected writings of Grimm, Brecht and Kafka, using them for discussion, performance and language acquisition activities. The highlight of the quarter is the in-class skit performances, the best of which are chose by the students for performance at the German Department's almost famous *Evening O' Skits."}, {"name": "Registration Requirements", "value": "A student needs to have completed German 101-2 or have placed into the course after having taken the online German language placement exam. Please contact instructor with questions."}, {"name": "Learning Objectives", "value": "Students will have achieved the proficiency in German necessary to advance to German 102-1. They will be able to converse on basic topics and have the reading skills necessary to understand authentic texts and will also be able to write informative texts with demonstrated control of basic grammatical forms."}, {"name": "Teaching Method", "value": "Class participationDemonstrationsGroup workListening exercisesReadings"}, {"name": "Evaluation Method", "value": "AttendanceClass participationExamsHomeworkListening exercisesPresentationsQuizzesReadingsSimulation / role-playWriting assignments"}, {"name": "Class Materials (Required)", "value": "1. Tschirner, Erwin, Brigitte Nikolai and Tracy D. Terrell. Kontakte: A Communicative Approach. 8th edition. Boston: McGraw-Hill, 2017. ISBN: 978-1-259-30742-3.<br/>2. Arbeitsbuch (Workbook) to accompany Kontakte: A Communicative Approach. 8th edition. Boston: McGraw-Hill, 2017. ISBN-13: 978-1-259-69264-2.<br/>3. Reader sold in class"}, {"name": "Class Materials (Suggested)", "value": "Students register simultaneously for German 101-2 at 3 p.m. and German 101-3 at 4 p.m. The content of German 101-2 will be covered during the first 4.5 weeks by having class from 3-5 p.m. with a 10 minute break in between. A course grade for 101-2 will be computed after the end of the first 4.5 weeks. The content of German 101-3 will be covered during the second 4.5 weeks, at which time, a grade will be entered for 101-3."}], "lmod": "2/7/17 6:43 PM (CT)", "subject": "GERMAN"}]