[{"school": "SoC", "overview_of_class": "Movies and TV have used actual events and real-life people as the basis for stories from the beginning. This production course will explore what \"based on a true story\" means for screen actors, whether playing versions of themselves in stories based on events from their own lives (as in Mike Birbiglia's Sleepwalk With Me), or on well-known historical figures and events (as in David Oyelowo's performance for Selma), or on the lives of less publicly known figures involved in extraordinary events (such as Julia Roberts' performance for Erin Brockovich). The course will begin with students creating short dramas playing themselves and inspired by events from their own lives, based on principles established by Chicago's own Neo Futurist theatre company, and will proceed to researching, writing and performing a short film based upon actual events. Students will both perform live in class and make short video exercises. <br/><br/>Skills emphasized and evaluated will be dramatic analysis focused on articulation of character traits and objectives to be performed, research for character and story background, and dramatic performance. As in-class critique, discussion, and workshopping of scenes are essential to the subject matter, class participation will be particularly emphasized. THIS COURSE COMPLETES AN ELECTIVE REQUIREMENT FOR THE ACTING FOR SCREEN MODULE.", "name": "Topics in Acting for the Screen", "section": "20", "location": "Helmerich Auditorium", "topic": "Performanced Based on Actual Events", "course": "369-0", "meeting_time": ["TuTh 11:00AM - 12:50PM"], "path": "/class-descriptions/4610/SoC/RTVF/369-0/22386", "instructor": ["Spencer W Parsons"], "class_attributes": "", "id": "22386", "subject": "RTVF"}, {"school": "SoC", "overview_of_class": "Learning objectives: This class will examine the process of performance and narrative-creation via the increasingly utilized mode of improvisation. Utilizing long-form class exercises, students will work towards creating devised short film projects, both scripted (finally)and improvised.", "name": "Topics in Acting for the Screen", "section": "21", "location": "Louis Hall 106", "topic": "Devised Narrative", "course": "369-0", "meeting_time": ["Mo 3:00PM - 5:50PM"], "path": "/class-descriptions/4610/SoC/RTVF/369-0/22387", "instructor": ["Stephen Daniel Cone"], "class_attributes": "", "id": "22387", "subject": "RTVF"}]