[{"school": "WCAS", "overview_of_class": "The 1988 film Stand and Deliver has become part of contemporary American conversations about race, immigration, and education. But have you ever considered it as an example of the medieval literary genre of the saint's life? Or thought about the classic western 3:10 to Yuma (remade in 2007 with Russell Crowe and Christian Bale) as a version of the medieval morality play? In this course we will consider modern and contemporary cultural objects in relation to the medieval genres that inform them. We will read a selection of medieval texts designed to produce working definitions of the medieval genres of saint's life, romance, and morality play before exploring modern instantiations of those genres in a variety of media. Beyond finding often-surprising traces of the modern in the medieval and the medieval in the modern, we will consider ways in which characteristically medieval genres and tropes are brought to bear on modern problems. In what contexts and to what ends is the medieval cited as a source of timeless truth, or as paradigmatically backward? When and why is it evoked as a site of moral or cultural purity, or as a site of unspeakable barbarity?", "name": "Studies in Medieval Literature", "section": "20", "topic": "Medieval Genres, Modern Texts", "course": "324-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4640/WCAS/ENGLISH/324-0/11970", "instructor": ["Katharine Helen Breen"], "id": "11970", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "What are the Seven Deadly Sins, how did they come into being, and how can we make sense of the role they continue to play the 21st century popular imagination? What is the nature of moral and ethical transgression: is sin a disposition, a thought, an action, or an external force? And how does one make amends for such a transgression? Over the course of the quarter, we will attempt to answer these questions by exploring the shifting representations of sin, secrets and confession that pervade late medieval literature. Analyzing the texts of preachers and poets alike, we will investigate the ways in which medieval writers adapted their depictions of sin to address the major social and political issues of their day, highlighting certain sins while hiding others as the moment required. Along with sin, we will examine the practice of confession in its historical and literary contexts, discovering how priests, poets, and playwrights exploited and transformed this pastoral tool for narrative and social ends. While giving students a background in confessional practice and the discourse of Seven Deadly Sins, this course will also provide an introduction to some of the major works of the late Middle Ages: Dante's Purgatory, Langland's Piers Plowman, Sir Gawain and the Green Knight, and Everyman. We will also explore how David Fincher's 1995 film, Se7en reworks these medieval concepts for a contemporary audience.", "name": "Studies in Medieval Literature", "section": "21", "topic": "The Seven Deadly Sins", "course": "324-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4640/WCAS/ENGLISH/324-0/11971", "instructor": ["Susan E Phillips"], "id": "11971", "subject": "ENGLISH"}]