[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "Garrett-Evangelic Seminary 207"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "32072", "title": "WCAS ASIAN_LC 390-0-21 Advanced Topics in Asian Languages and Cultures", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "32072", "instructors": [{"instructor_phone": "847/467-0283", "instructor_name": "Patrick James Noonan", "instructor_addr": "1800 Sherman, 5th Floor, Suite 5400, Office 5419"}], "topic": "Cyber-Japan", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "This course explores the interaction between cybernetic technologies and cultural production in modern Japan. We focus on how visual and literary media have been used to represent such technologies (robotics, cybernetics, and the Internet) as well as how these technologies have shaped forms of cultural production in late 20th and early 21st century Japan. The notion of the &quot;cyber&quot; - its origins in cybernetics and ensuing proliferation of meanings - forms the conceptual core of the course. After considering early definitions of this term, we turn to how Japanese manga, animation, film, and cultural theory explore the ways in which cybernetic technologies, like cyborgs and cyberspace, have expanded our understanding of human subjectivity and agency, transformed social relations, and blurred boundaries between the human and the animal, the biological and the artificial, and the physical and non-physical."}, {"name": "Learning Objectives", "value": "This course is designed to introduce students to humanistic approaches to analyzing visual media and the representation of digital technologies in modern Japan. The primary objectives of this course are: <br/>1. To learn to interpret the multiple possible meanings of manga and animation through formal analysis <br/>2. To develop a firm and sophisticated grasp of the concepts - such as &quot;cybernetics,&quot; &quot;post-human,&quot; and &quot;subjectivity&quot; - at core of the course<br/>3. To gain an understanding of how manga and animation reflect these concepts and how these concepts can inform an analysis of these media<br/>4. To learn to write clearly and incisively about these media and concepts."}, {"name": "Teaching Method", "value": "Lecture and discussion"}, {"name": "Evaluation Method", "value": "Attendance and Participation: 20% (an engaged presence, preparation of materials and contributions to discussions) <br/>Short Writing Assignments: 30%<br/>Midterm Exam (Short and Long Essays): 20%<br/>Final Exam(Short and Long Essays): 30%"}, {"name": "Class Materials (Required)", "value": "A course reader will be available before the course begins. Books will be available for purchase through the campus bookstore. Films will be available to stream through CANVAS and will be on reserve in the Multimedia Center."}], "lmod": "4/3/16 7:44 PM (CT)", "subject": "ASIAN_LC"}]