[{"class_mtg_info": [{"meet_t": "MoWe 12:30PM - 1:50PM", "meet_l": "Annenberg Hall G21"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "27576", "title": "WCAS SOCIOL 327-0-20 Youth and Society", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "27576", "instructors": [{"instructor_phone": "847/467-0517", "instructor_name": "Karrie A Snyder", "instructor_addr": "1808 Chicago, Room 106"}], "topic": "", "course": "327-0", "descriptions": [{"name": "Overview of class", "value": "The course will be a critical examination of how &quot;childhood&quot; and &quot;adolescence&quot; have been defined in the U.S. We will consider how modern and historical conceptions of childhood and adolescence have evolved and how these definitions have been shaped by societal forces and institutions such as the economy, religion, and politics. We will also look at the lives of children themselves and how individuals experience being children, kids, teens, and so forth in a particular time and place.<br/><br/>As a class, we will also be very critical of cultural and media portrayals of children and teenagers and ask how these representations have reflected and shaped how society views youth. We will also look at how childhood itself has been viewed as a social problem. Children and adolescents and their behavior have often been considered to be the root of many social concerns (such as teen pregnancy, suicide, and bullying). But also many social problems arise because of society's feeling that children and young people need to be protected (such as calls to end child labor and the &quot;missing child&quot; awareness movement). <br/><br/>The final topic for the course will be how adolescents make the transition to adulthood socially, emotionally, and economically, and how this transition has changed over time - particularly over the last several decades."}, {"name": "Registration Requirements", "value": "Pre-registration is reserved for Sociology Majors &amp; Minors. <br/>This course is open to all students during regular registration."}, {"name": "Learning Objectives", "value": "Learning objectives for the course:<br/>To understand the historical and cultural development of youth life stages (such as teenager, 'tween etc.) <br/>To critically think about how young people are portrayed in cultural stereotypes and debates, media/entertainment,- Students will learn the historical roots of contemporary conceptions of youth and childhood.<br/>- Students will understand how the experience of being a young person has varied by historical period, but also by race/ethnicity, gender, and socioeconomic status.<br/>- Students will learn how cultural representations of young people are shaped and how they influence our expectations of young people. <br/>- Finally, students will understand how young people transition to adulthood today and how this transition is different than for earlier generations of young people."}, {"name": "Teaching Method", "value": "Lecture, Discussion, Online work, presentations, readings, and writing assignments"}, {"name": "Evaluation Method", "value": "Participation/Attendance 15%, in class midterm 30%, take home final 30%, final paper 25%"}, {"name": "Class Materials (Required)", "value": "This is a tentative booklist. Please confirm all books before purchase.<br/>Palladino, Teenagers: An American History (978-0465007660)<br/>Mintz, Huck's Raft, (978-0674019980)<br/>Simmons, Odd Girl Out (0547520190) <br/>Rios, Policing the Lives of Black and Latino Boys (0814776388) <br/><br/>Additional readings will be available through Course Reserves."}], "lmod": "12/24/16 7:08 PM (CT)", "subject": "SOCIOL"}]