[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "Kresge Centennial Hall 2-425"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "32486", "title": "WCAS ASIAN_AM 276-0-1 Topics in Literary and Cultural Studies", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "32486", "instructors": [{"instructor_phone": "847/467-7114", "instructor_name": "Douglas Sadao Ishii", "instructor_addr": "Crowe Hall, Room 1117"}], "topic": "Asian American Music", "course": "276-0", "descriptions": [{"name": "Overview of class", "value": "The recent popularity of international forms like Hallyu and new artists like Mitski make it seem like Asians are newcomers to the U.S. music scene. People usually seem far more familiar with the Orientalist tropes and cultural appropriation of some U.S. popular music, but in this course, we will examine the rich tradition that Asian American musicians have created across the 20th- and 21st-centuries as a form of expression, representation, and political critique. From the transformation of &quot;traditional&quot; folk songs, to the soundtracks of past and current Asian American activisms, to the rise of the Asian American YouTube generation, this class will examine the racial, cultural, and genre-based contexts that shape how Asian Americans make themselves heard through an intersectional lens."}, {"name": "Registration Requirements", "value": "None"}, {"name": "Learning Objectives", "value": "? Understand the broad methodological concerns of ethnomusicology, cultural studies, and Asian American studies ? Apply race, class, gender, sexuality, and citizenship as key analytics of identity and difference in U.S. culture ? Interrogate how ideas of art, talent, pleasure, spectacle, and feeling have been used to reflect<br/>and produce racism and racial privilege ? Develop theoretically informed case studies of cultural production using interdisciplinary methods ? Practice presentation and writing skills for scholarly and general audiences"}, {"name": "Evaluation Method", "value": "Class participation: 10%<br/>Presentations: 25%<br/>Quizzes: 15%<br/>Writing assignments: 50%<br/>"}, {"name": "Class Materials (Required)", "value": "All materials for this course will be made available on Canvas - no purchase necessary."}, {"name": "Class Notes", "value": "Attendance at first class is mandatory."}], "lmod": "2/21/17 6:44 PM (CT)", "subject": "ASIAN_AM"}]