[{"school": "MUSIC", "overview_of_class": "Classical concert music composed since 1945 encompasses a mind-boggling diversity of styles and techniques that range from the structures of high modernism to the rhythmic drive of minimalism, the wit of postmodernism, the nihilism of new complexity, the disorientation of experimentalism, and the eclecticism of the present, among many others. Likewise, never had musical performance and musical sound interacted with constructed spaces in so many different ways, including reconfigurations and reinventions of 19th-century concert hall aesthetics, music composed or installed to accentuate attributes of specific buildings, or music merging with the landscapes outside of buildings. This course will explore ways in which the aesthetics of music and architecture intersect in the second half of the twentieth century by engaging case studies of: music compositions representative of distinct \"isms\" in music history; buildings representative of parallel movements in architecture such as High Modernism and Brutalism; acoustics; and, most importantly, musical compositions intended to interact with constructed space. We will also look at the history of concert spaces over the past seventy years and predict where and how classical music performances take place in coming decades. Although the special focus of the class is on architecture, the class also serves as a survey of representative works written since 1945 that gives students fluency in multiple strands of contemporary music. Projects in this class include weekly preparation of assignments, fieldwork visiting Chicago area structures, a program note project on a specific work; and a profile paper discussing a recently constructed music venue. Music studies, music performance, and others interested in the topic are welcome in this course.", "name": "Topics in 20th Century Music", "section": "20", "location": "RCMA 1-172", "topic": "Music and Architecture Since 1945", "course": "355-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4610/MUSIC/MUSICOL/355-0/27466", "instructor": ["Drew Edward Davies"], "class_attributes": "", "id": "27466", "subject": "MUSICOL"}]