[{"class_mtg_info": [{"meet_t": "MoWe 6:30PM - 9:00PM", "meet_l": "ANTHRO Sem Rm 104 - 1810 Hinmn"}], "school": "WCAS", "overview_of_class": "AFST 390-0 Special Topics: Anthropology of African Civil Wars (Combined with ANTHRO 390-0-20)<br/><br/>Understanding civil war is a central intellectual (and political) challenge of the contemporary global world, involving insistent questions about terrorism, genocide, child soldiers, sexual violence, etc. This course examines a variety of cases of contemporary African civil wars but is framed by general questions about the logic of violence in any social context. The course focuses on: (a) the micro-practices of violence in the daily organization of civil war, especially the language and ideology of violence invoked in those social practices, and (b) the relationship between everyday social practices of violence and macro-level structural forces of politics and economics. Readings are mainly from anthropology but other social sciences that use ethnographic methods to study civil war will be discussed.", "qtr": "Summer 2016", "name": "Topics in African Studies", "title": "WCAS AFST 390-0-20 Topics in African Studies", "lmod": "5/1/16 6:30 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "William P Murphy", "instructor_addr": "515 Clark St."}], "topic": "Anthropology of African Civil Wars", "course": "390-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "AFST 390-0 Special Topics: Anthropology of African Civil Wars (Combined with ANTHRO 390-0-20)<br/><br/>Understanding civil war is a central intellectual (and political) challenge of the contemporary global world, involving insistent questions about terrorism, genocide, child soldiers, sexual violence, etc. This course examines a variety of cases of contemporary African civil wars but is framed by general questions about the logic of violence in any social context. The course focuses on: (a) the micro-practices of violence in the daily organization of civil war, especially the language and ideology of violence invoked in those social practices, and (b) the relationship between everyday social practices of violence and macro-level structural forces of politics and economics. Readings are mainly from anthropology but other social sciences that use ethnographic methods to study civil war will be discussed."}, {"name": "Registration Requirements", "value": "No prerequisites required."}, {"name": "Teaching Method", "value": "Classes will be organized as a combination of lecture and seminar discussion, with an emphasis on a case study approach that focuses on applying key concepts and analytical principles to particular ethnographic cases. Segments of ethnographic films will also be used as case material for discussion in class."}, {"name": "Evaluation Method", "value": "Four short papers - &quot;problem sets&quot; - of 2- 2 ½ double-spaced papers are required as targeted analytical and ethnographic exercises for students to clarify the conceptual framework being built up in the course as applied to the case material. Students will present and discuss their problem sets in class. The final is a take-home term paper of 8 - 10 double-spaced pages. The final paper will allow students to relate key analytical themes of the course to the documentation of civil war and child soldiers in the novel and film called &quot;Beasts on No Nation.&quot; The four short papers are each worth 10 points of the grade, and the final paper is worth 50 points. Ten points of the grade is based on seminar participation."}, {"name": "Class Materials (Required)", "value": "Iweala, U., Beasts of No Nation (ISBN: 978-0-06-079867-3)<br/>Simon, H. Administrative Behavior: A Study of Decision-Making Processes in Administrative Organization (4th edition; 1997) (ISBN: 0-684-83582-7)<br/>Weinstein, J., Inside Rebellion: the Politics of Insurgent Violence (ISBN: 978-0-521-67797-4)<br/><br/>**other selected readings will be uploaded on &quot;Canvas&quot;"}], "path": "/class-descriptions/4630/WCAS/AFST/390-0/40052", "instructor": ["William P Murphy"], "class_attributes": "", "id": "40052", "subject": "AFST"}]