[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "ANTHRO Sem Rm 104 - 1810 Hinmn"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores<br/>Add Consent: Department Consent Required<br/>Drop Consent: Department Consent Required<br/>", "qtr": "Fall 2016", "name": "10070", "title": "WCAS ANTHRO 101-6-22 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "10070", "instructors": [{"instructor_phone": "847/491-4564", "instructor_name": "Amanda Lee Logan", "instructor_addr": "1812 Hinman Ave. Room 203"}], "topic": "Food &amp; Culture", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "Food is on everyone's minds these days. On the one hand, we have an unprecedented panoply of choices on supermarket shelves, while on the other, food activists call attention to issues of food politics, sustainability, and inequality. This class explores food through the lens of cultures past and present, to examine alternatives to and the roots of our modern food system. Anthropology is uniquely positioned to address the complexity of factors that define and motivate food practices. Food is at once culturally defined, biologically necessary, and historically situated. Some of the questions we will address in this class include: How do people decide what is edible, and what is not? What roles does food play in different cultures? What do our current concerns with food, from the obesity epidemic to the push for local, sustainable food sources, tell us about our own culture(s)?"}, {"name": "Teaching Method", "value": "Discussion."}, {"name": "Evaluation Method", "value": "METHOD OF EVALUATION <br/>Class participation = 100 points (30% of final grade)<br/>Reaction papers = 10 points each (40% of final grade)<br/>Final = 100 points (30% of final grade)"}, {"name": "Class Materials (Required)", "value": "READING LIST <br/>A course packet will be put together and distributed through Quartet Copy.<br/><br/><br/>Anderson, E.N. (2014) Everyone Eats: Understanding Food and Culture, Second Edition?<br/><br/>ISBN: 9780814760062"}], "lmod": "10/30/16 6:58 PM (CT)", "subject": "ANTHRO"}]