[{"class_mtg_info": [{"meet_t": "Sa 9:00AM - 12:00PM", "meet_l": "Wieboldt Hall 705"}], "school": "SCS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "27811", "title": "SCS ORG_BEH 301-CN-17 Organization Behavior", "class_attributes": "", "section": "27811", "instructors": [{"instructor_phone": "", "instructor_name": "Robert C Ernest", "instructor_addr": ""}], "topic": "", "course": "301-CN", "descriptions": [{"name": "Overview of class", "value": "Organizations are a part of our everyday lives. Whether at work, school, church etc., similar interpersonal and group behaviors and dynamics apply. The focus of this course is to examine several aspects of organizations from an integrated perspective, including how the formal organization, culture, people and work can all connect to transform inputs to outputs. Emphasis will be placed on understanding individual differences as the foundation of our interpersonal and managerial effectiveness. Case studies, classroom and online discussions, team assignments and presentations will all be part of the learning. At the end of the class, it is anticipated that students will have a better understanding of today's complex organizations and more equipped to navigate the workplace."}, {"name": "Learning Objectives", "value": "After completing this course, you will be able to:<br/><br/>? Discuss the dynamic nature of today's organizations as a product of the external environment and individual differences. <br/>? Describe your behavioral, communication and &quot;generational&quot; style, along with strengths and areas of development.<br/>? Apply your knowledge of performance and development to increase your leadership and personal effectiveness.<br/>? Discuss the management of talent and teams as central to high performing organizations.<br/>? Use the &quot;congruence model&quot; in diagnosing the effectiveness of organizations."}, {"name": "Teaching Method", "value": "Case studies; class participation; discussion group work; online work; written work; presentations<br/><br/>Students are divided into groups and remain in groups for team projects."}, {"name": "Evaluation Method", "value": "Class participation/online work; individual and group papers; presentations; research project (real world application of learning): final case study"}, {"name": "Class Materials (Required)", "value": "Text: Organizational Behavior (either 8th, 9th or 10th editions) by Robert Kreitner and Angelo Kinicki found in NW bookstores. Additional articles assigned throughout quarter posted on Canvas."}, {"name": "Class Notes", "value": "This course combines classroom lecture and discussion with an online component. For the lecture and discussion components, this course is paired with an afternoon session of ORG BEH 311-CN taught by Marina Davis, and the in-class meetings are on alternate Saturdays: 1/9, 1/23, 2/6, 2/20, 3/5 For the online component, students must have ready access to the Internet. This course is open to Organization Behavior: Business Leadership year one cohort students only."}], "lmod": "1/9/16 6:42 PM (CT)", "subject": "ORG_BEH"}]