[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "University Hall 112"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-registration - Reserved for International Studies students.", "qtr": "Spring 2017", "name": "36775", "title": "WCAS INTL_ST 390-0-26 Special Topics in International Studies", "class_attributes": "", "section": "36775", "instructors": [{"instructor_phone": "", "instructor_name": "Kimberlee Saer Guenther", "instructor_addr": ""}], "topic": "Community-based Partnership Research in Internatio", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "Community-­?based research partnerships can produce innovative solutions to community challenges and create a dynamic learning experience. Such research can take on many forms, incorporating explicit action and policy goals or documenting narratives that diverge from the dominant discourse. Critically, community-­?based research partnerships give non-­?academic partners an active role in the setting the research agenda. This course will introduce you to approaches, methods, and ethical concerns related to conducting community-­?based research. <br/><br/>The course is designed for students interested in conducting community-­?based participatory research (CBPR) with either an established international development organization or a marginalized group within the U.S. We will explore issues of power, privilege, knowledge production, activism, and community engagement through the lens of research, and interrogate the protection of human subjects. Throughout the quarter, we will return to the ways power and trust shape relationships and thus influence research findings. You will also be required to reflect on your own interest in international development and CBPR. <br/><br/>As part of your coursework, you will learn how traditional research methods are adapted for work with communities, and become oriented to an asset-­?based approach. You are also required to interact with a local community to gain experience using CBPR methods and experience some of the realities and uncertainties you are likely to encounter in the field. The course will prepare you to weave community stakeholder perspectives into research design and produce actionable, accessible findings that can improve the lives of individuals and communities."}, {"name": "Learning Objectives", "value": "? Understand and practice theories and strategies of community-­?based participatory research<br/>? Complete the planning, implementation, and evaluation of a collaborative, community-­?based research project<br/>? Learn and apply the asset-­?based community development principles of building on the skills of local residents, the power of local associations, and the supportive functions of local institutions to create sustainable communities"}, {"name": "Evaluation Method", "value": "Class Participation - 20% <br/>Class Facilitation - 15% <br/>Photovoice Project and Presentation - 25% <br/>Final Research Proposal - 40%"}, {"name": "Class Materials (Required)", "value": "All required readings will be posted on Canvas."}], "lmod": "2/14/17 6:46 PM (CT)", "subject": "INTL_ST"}]