[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Kresge Centennial Hall 4-410"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores<br/>Add Consent: Department Consent Required<br/>Drop Consent: Department Consent Required<br/>", "qtr": "Fall 2016", "name": "12304", "title": "WCAS HISTORY 101-6-21 First-Year Seminar-European History", "class_attributes": "WCAS First-Year Seminar<br/><br/>Attendance at 1st class mandatory<br/><br/>Freshmen/Sophomores Only<br/><br/>", "section": "12304", "instructors": [{"instructor_phone": "467/491-3150", "instructor_name": "Tessie P Liu", "instructor_addr": "Harris Hall Room 327"}], "topic": "Wild Child: Sep Humans/Animals", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "Through the autumn and winter of 1799 in central France, a naked boy was seen swimming and drinking in streams, climbing trees, digging for roots and bulbs, and running at great speed on all fours. He was captured in January 1800 by local farmers and brought to Paris. This &quot;wild boy&quot; from Aveyron became an overnight sensation, the object of curiosity and endless speculations about the relationship between instinct and intelligence and questions about the differences between humans and animals. The young doctor Jean-Marc-Gaspard Itard, who undertook the task of socializing and educating the wild child, carefully recorded the boy's progress. Itard's work ultimately transformed the treatment of mental retardation and to a revolution in childhood education that is reflected in every preschool program in our time. This course introduces students to the philosophical and attitudinal changes regarding nature, childhood, and family life that enabled society to view the &quot;wild boy&quot; not as a freak or savage, but as a person inherently capable of civility, sensibility, and intelligence. The course material is designed for students interested in intellectual history, psychology and education."}, {"name": "Registration Requirements", "value": "GRADING BASIS: ANC"}, {"name": "Teaching Method", "value": "DiscussionDiscussion, two films, and one Saturday field trip"}, {"name": "Evaluation Method", "value": "Three short papers (each of which will be three to five pages in length) and one longer final essay (ten pages in length), class presentations, class participation"}, {"name": "Class Materials (Required)", "value": "***Tentative until order posted to Norris website<br/>Roger Fouts, Next of Kin: My Conversations with Chimpanzees. 9780380728220.<br/>Julien Offray de la Mettrie, Man, A Machine and Man, A Plant. 9780872201941.<br/>Maria Montessori, The Secret of Childhood. 9780345305831.<br/>Jean-Jacques Rousseau, Emile. 9780465019311.<br/>Jean-Jacques Rousseau, Discourse on the Origins of Inequality. 9781909735071.<br/>Roger Shattuck, The Forbidden Experiment: The Story of the Wild Boy of Aveyron. 9781568360485.<br/>Barbara Bennett Woodhouse, Hidden in Plain Sight: The Tragedy of Children's Rights. 9780691146218.<br/>Course reader of articles and documents."}], "lmod": "10/30/16 7:05 PM (CT)", "subject": "HISTORY"}]