[{"class_mtg_info": [{"meet_t": "MoWe 12:30PM - 1:50PM", "meet_l": "University Hall 102"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "17459", "title": "WCAS GNDR_ST 361-0-21 Gender, Sexuality, and Literature", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "17459", "instructors": [{"instructor_phone": "", "instructor_name": "Whitney Blair Taylor", "instructor_addr": ""}], "topic": "The Transgender Renaissance", "course": "361-0", "descriptions": [{"name": "Overview of class", "value": "The Renaissance is full of cross-gendered and transgendered people, from the cross-dressing boy actor to the female poet labeled a &quot;hermaphrodite.&quot; In his English Grammar, Ben Jonson even creates the grammatical category of &quot;epicene nouns,&quot; words that may refer to either sex and which allow for more fluidity across male and female genders. This course examines how early modern texts treat gender with a particular focus on gender hybridity, transgender figures, and transvestism. We will begin by considering - through As You Like It - the familiar Shakespearean paradigm in which women briefly cross-dress as young men before they are re-<br/>inscribed into traditional heteronormative relationships (at which point they usually shed their masculine disguises). We will go on to scrutinize plays ranging from The Roaring Girl to Gallathea and Epicene that subvert this popular narrative by denying both heteronormative endings and stable gender identities. The class will investigate how in-between figures are taken up and represented in other literary texts as we think about how the English might have identified with these &quot;monstrous&quot; figures even as they marginalized them. <br/>Throughout the class, we will supplement our examination of literary texts with investigations of early modern <br/>gender difference in the medical writings of Galen and Vesalius as well as nonliterary accounts of <br/>hermaphrodites, transvestites, and transgender individuals."}, {"name": "Teaching Method", "value": "DiscussionLecture"}, {"name": "Evaluation Method", "value": "Class participationPaper, finalPaper, mid-term"}, {"name": "Class Materials (Required)", "value": "Beaumont's Salmacis and Hermaphroditus; Middleton and Dekker's The Roaring Girl; selections from Golding's Metamorphoses; Shakespeare's As You Like It, Lear, and Sonnet 20; selections from Barnfield's The Affectionate Shepherd; Jonson's Epicene, or The Silent Woman; Lyly's Gallathea; Beaumont and Fletcher's Love's Cure, or The Martial Maid."}], "lmod": "10/30/16 7:05 PM (CT)", "subject": "GNDR_ST"}]