[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "University Library 3322"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Prerequisite: Students must have passed Japanese 211-3 with at least a C- or  be placed in according to placement test results.", "qtr": "Spring 2017", "name": "32516", "title": "WCAS JAPANESE 314-1-20 Japanese IV: Japanese Essay Writing", "class_attributes": "", "section": "32516", "instructors": [{"instructor_phone": "8474912764", "instructor_name": "Yumi   Shiojima", "instructor_addr": "1880 Campus Drive, Kresge Hall, Office 4-349"}], "topic": "Essay Writing", "course": "314-1", "descriptions": [{"name": "Overview of class", "value": "This Japanese Essay Writing course focuses on refining students' writing skills. Students will be introduced to three types of writing samples (narrative, descriptive, and persuasive) and will practice writing skills through various steps. For each writing project, students engage in native writing sample reading, different types of pre-writing brainstorming activities, multiple draft writing, self and peer editing, and writing clinics. Throughout the quarter, students create a writing portfolio and observe their own writing processes and writing skills development in order to develop effective writing strategies. This is a bridge course to the courses in students' academic disciplines in which students may choose paper topics from their fields of study, such as literature, science, and social science. Past narrative paper genres include humor, love stories, memoirs, and mysteries. Past descriptive paper topics include stem cell research, Food Pyramid, Electoral College, history of jazz, and religious beliefs (Christianity and Judaism). Past argumentative paper topics include freedom of speech, affirmative action, gender roles, and influence of video games on children."}, {"name": "Registration Requirements", "value": "Students must pass 211-3 with C- or above, or must be placed into the class by the departmental placement test."}, {"name": "Learning Objectives", "value": "The course aims to bring students' writing proficiency to the advanced level of the ACTFL proficiency guidelines, using narrative, descriptive, and persuasive essays. According to the guidelines, advanced-level writers are characterized by the ability to: write routine informal and some formal correspondence, narratives, descriptions, and summaries of a factual nature, narrate and describe in major time frames, using paraphrase and elaboration to provide clarity, in connected discourse of paragraph length, and express meaning that is comprehensible to those unaccustomed to the writing of non-natives, primarily through generic vocabulary, with good control of the most frequently used structures."}, {"name": "Teaching Method", "value": "This course is conducted only in Japanese. The students will be introduced to three types of writing samples (narrative, descriptive, and persuasive) and will practice their writing skills through various steps: 1) Reviewing how to differentiate three writing styles (polite, plain and expository forms), <br/>2) Trying different types of pre-writing brainstorming activities to find the most effective strategies for themselves, 3) Identifying and improving their own writing processes through a writing portfolio, 4) Learning to identify errors in their language use, 5) Learning to self-correct errors. The instructor will help the students through these processes with oral and written feedback. The instruction of writing will be supplemented by the review of grammar, vocabulary, and expressions, as well as writing clinics."}, {"name": "Evaluation Method", "value": "Multiple drafts and final papers, Writing Portfolio, class participation and performance"}, {"name": "Class Materials (Required)", "value": "Japanese for International College/Graduate Students 2: Composition. Tokyo: Alc, Inc. ISBN: <br/>978-4-7574-0500-4; Supplemental handouts."}, {"name": "Class Materials (Suggested)", "value": "Makino, S. &amp; Tsutsui, M. (1995). A Dictionary of Intermediate Japanese Grammar. Tokyo: The Japan <br/>Times. ISBN: 978-4-7890-0775-7."}], "lmod": "2/6/17 6:51 PM (CT)", "subject": "JAPANESE"}]