[{"class_mtg_info": [{"meet_t": "Mo 9:00AM - 11:50AM", "meet_l": "Scott Hall 201 Ripton Room"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "23048", "title": "WCAS POLI_SCI 460-0-20 Comparative Politics Proseminar II", "class_attributes": "", "section": "23048", "instructors": [{"instructor_phone": "", "instructor_name": "Rachel Beatty Riedl", "instructor_addr": "601 University Hall, Scott Hall, #208"}], "topic": "", "course": "460-0", "descriptions": [{"name": "Overview of class", "value": "This survey of major topics in comparative politics is designed for Ph.D. students to gain a broad overview of the contemporary state of the subfield, its evolution, and emerging research questions and controversies. Each week we will focus on a major thematic area, generally through the lens of a theoretical controversy. We will deconstruct the readings to identify the central issues at stake, the principal arguments of the works, the theoretical and empirical strengths and weaknesses, the methodological approach and means of marshaling evidence in support of the argument, the relation to scholarly disputes, and remaining work on this topic. The course will consider works of theoretical importance in all regions, both in the developed and developing world."}, {"name": "Registration Requirements", "value": "PhD Candidates; Advanced undergraduates or PhD candidates in other departments interested in the course should please contact the instructor directly via email."}, {"name": "Learning Objectives", "value": "1). How to critically evaluate arguments and evidence<br/>2). How to relate a specific work to a larger body of related literature<br/>3). Analysis of a range of substantive and methodological approaches in comparative politics"}, {"name": "Teaching Method", "value": "Seminar based upon student participation, discussion"}, {"name": "Evaluation Method", "value": "Discussion, Class presentation on one week's materials and written summary and analysis of the works, Final exam (simulated comprehensive exam or research paper)"}, {"name": "Class Materials (Required)", "value": "All readings will be provided by Professor"}, {"name": "Class Notes", "value": "Attendance at first class required, No P/N Option"}], "lmod": "12/25/16 7:05 PM (CT)", "subject": "POLI_SCI"}]