[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Harris Hall L28"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "25675", "title": "WCAS HISTORY 393-0-26 Approaches to History", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "25675", "instructors": [{"instructor_phone": "847/491-3153", "instructor_name": "Leslie Maria Harris", "instructor_addr": "Harris Hall - Room 340"}], "topic": "The Slave's Narrative", "course": "393-0", "descriptions": [{"name": "Overview of class", "value": "The idea of the &quot;slave narrative&quot; usually brings to mind the published works of antebellum fugitive slaves like Frederick Douglass and Harriet Jacobs. But enslaved and formerly enslaved people created testimonials to their experiences in a variety of ways, and not only for publication. This course will explore the range of ways enslaved and formerly enslaved people provided or enabled written accounts of their lives in the 19th and 20th centuries?letters, interviews, published accounts, etc. We will also examine how the mainstream historical profession viewed those accounts, moving from skepticism in the early twentieth century, to cautious acceptance today. Are slave testimonials any more difficult to work with than other historical sources? What have literary scholars taught historians about using slave testimony?"}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Class participationPapers: (three short papers)<br/>Research project: (one primary source analysis presentation &amp; paper)<br/>"}, {"name": "Class Materials (Required)", "value": "***Tentative until posted to Norris website***<br/>Primary Source Selections <br/>John W. Blassingame. Slave Testimony. 9780807102732.<br/>The North American Slave Narratives section of the Documenting the American South website<br/>The Library of Congress website that contains a selection of the WPA Slave Narratives and the instructions given to those interviewing former slaves. <br/><br/><br/>Secondary Sources <br/>Chapters from Charles T. Davis &amp; Henry Louis Gates. The Slave's Narrative. 9780195066562.<br/>Marion Wilson Starling. The Slave Narrative: Its Place in American History. 9780882581651.<br/>Peter Parish. Slavery Remembered. <br/>Relevant journal articles; <br/>Selections from classic histories of slavery that ignored, used or commented on materials produced by enslaved of formerly enslaved people."}, {"name": "Class Notes", "value": "AREA OF CONCENTRATION: Americas"}], "lmod": "12/29/16 6:59 PM (CT)", "subject": "HISTORY"}]