[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "555 Clark B03"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Prerequisite: Any combination of ECON 201/ECON 311/AP-IB Macro AND ECON 202/ECON 310/MMSS 211-1/AP-IB Micro credit is required to register for this course.", "qtr": "Spring 2017", "name": "32611", "title": "WCAS BUS_INST 302-0-20 Marketing Management", "class_attributes": "Attendance at 1st class mandatory<br/><br/>Prerequisites apply, see description<br/><br/>", "section": "32611", "instructors": [{"instructor_phone": "847/467-3041", "instructor_name": "Ginger L. Pennington", "instructor_addr": "Swift Hall, 2029 Sheridan Road, Evanston"}], "topic": "", "course": "302-0", "descriptions": [{"name": "Overview of class", "value": "<strong>Course formerly listed as: BUS_INST 239</strong><br/><br/> <br/><br/>*INFORMATION IS SUBJECT TO CHANGE*<br/><br/>The instructor of &quot;Marketing Management&quot; is: Ginger Pennington.<br/><br/> <br/><br/>This course introduces students to the basic principles and framework of strategic marketing, with an emphasis on analytical skills useful in a business environment. Market segmentation, target marketing, brand positioning, consumer behavior, marketing research, basic quantitative analyses, distribution channels and internet/mobile marketing are among the topics discussed. You will gain experience applying the core concepts through short assignments and case studies. Small group case work will give you the opportunity to work collaboratively - putting skills to use analyzing situations confronted by real managers. By the end of this term, you will have acquired a sound conceptual and theoretical &quot;tool kit&quot; for marketing analysis and gained experience analyzing real-world marketing problems."}, {"name": "Registration Requirements", "value": "Prerequisites: ECON 201 &amp; 202"}, {"name": "Learning Objectives", "value": "By the end of this course, you will understand the basic processes involved in marketing management - how to determine which customers your organization should serve, which products and services it should offer them, and how. You will know how to read and interpret marketing case studies, and have experience applying strategic frameworks to analyze business situations."}, {"name": "Class Materials (Required)", "value": "Please check Norris bookstore or course syllabus."}, {"name": "Class Notes", "value": "*For CTEC information, please look up: BUS_INST 239*"}], "lmod": "2/20/17 6:44 PM (CT)", "subject": "BUS_INST"}]