[{"class_mtg_info": [{"meet_t": "Tu 2:00PM - 4:50PM", "meet_l": "Crowe 4-130 Rel Studies Sem Rm"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "14158", "title": "WCAS RELIGION 349-0-20 Topics in Christianity", "class_attributes": "Ethics &amp; Values Distro Area<br/><br/>", "section": "14158", "instructors": [{"instructor_phone": "847/491-2616", "instructor_name": "Christine M Helmer", "instructor_addr": "Crowe Hall, Room 4-148"}], "topic": "Why College?", "course": "349-0", "descriptions": [{"name": "Overview of class", "value": "This seminar will give undergraduates the opportunity to reflect critically, thoughtfully, and together with peers, on the question: why go to college? There are many expectations that parents and society place on the college experience. But now that we are in college, how shall we think about it? Is it an experience or is it an education? Is it a ticket to a job or is it the pursuit of knowledge? What do professors do? How is contemporary culture reflected in the university? We address various facets of college life, from diversity and justice to sex and sexism on campus, from the &quot;party pathway&quot; to technology. We explore the value of the humanities. We survey the history of the university, investigate its religious origins, and learn about the &quot;crisis&quot; of the contemporary university."}, {"name": "Learning Objectives", "value": "The student will read texts on the contemporary college experience, be able to explain what the main arguments of these texts are, and provide thoughtful and critical reflections on the texts.<br/>The student will become familiar with the history of the university, particularly its religious origins. <br/>The student will be able to make a case for the value of the humanities in the contemporary university."}, {"name": "Teaching Method", "value": "Class participation: Absolutely<br/>Group work: We will work together as a group<br/>Readings: Readings for every class<br/>Seminar: Once a week<br/>Writing assignments: Writing assignments on a weekly basis<br/>"}, {"name": "Evaluation Method", "value": "Class participation: 15%<br/>Films / videos: 1 film and questionnaire (5%)<br/>Paper, mid-term: 2 5-page papers (30%)<br/>Readings: Preparation study guides (30%)<br/>Writing assignments: Reflections (20%)<br/>"}, {"name": "Class Materials (Required)", "value": "Elizabeth A. Armstrong and Laura T. Hamilton, Paying for the Party: How College Maintains Inequality. Harvard UP 2013. ISBN: 978-0-674-04957-4<br/>Mark Edmundson, Why Teach? In Defense of a Real Education. Bloomsbury, 2013. ISBN:978-1-62040-642-7.<br/><br/>William Deresiewicz, Excellent Sheep: The Miseducation of the American Elite. Free Press, 2014. ISBN: 978-1476702728.<br/><br/>Andrew Delbanco, College, What it was, What it is, and What it Should Be. Princeton University Press, 2012. ISBN: 978-0691130736.<br/><br/>Sherry Turkle, Reclaiming Conversation: The Power of Talk in a Digital Age. Penguin 2015. ISBN: 978-1-10198-046-0"}, {"name": "Class Materials (Suggested)", "value": "Please bring your curiosity, your enthusiasm, and your willingness to dedicate a few hours a week during the quarter to focus on the question of &quot;Why college?&quot;"}], "lmod": "10/30/16 7:09 PM (CT)", "subject": "RELIGION"}]