[{"class_mtg_info": [{"meet_t": "MoWeFr 10:00AM - 10:50AM", "meet_l": "Technological Institute F285"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "23804", "title": "WCAS EARTH 390-0-02 Special Topics in Earth and Planetary Science", "class_attributes": "", "section": "23804", "instructors": [{"instructor_phone": "847/491-3459", "instructor_name": "Wayne Theodore Marko", "instructor_addr": "Tech F293"}], "associated_classes": [{"component": "LAB", "room": "Technological Institute F389", "meeting_time": "Mo 11:00AM - 11:50AM"}], "topic": "Mineral Resources", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "Class Title: Mineral Resources: Evaluation, Formation, and Environmental Consequences of Exploitation<br/><br/>Class Description: This course provides an introduction to the field of economic geology. Broad topics include resource evaluation, the global distribution and formation of economic deposits, mineral processing techniques and mining and the environment. Topics in resource evaluation will include an introduction to the economic principles behind metals production and consumption, ore body description, the statistical approach to sampling deposits and the determination of cut-off grades. A large portion of this course is dedicated to understanding the physical and geochemical processes that concentrate earth materials into metallic deposits, industrial mineral and salt deposits, and fossil energy materials. Topics in mineral processing will focus on the separation and extraction of minerals from ore and will include crushing, gravity concentration, and flotation processes. The course will conclude with an examination of mining-related environmental issues such as acid mine drainage, heavy metal contamination and the deep disposal of dangerous waste."}, {"name": "Registration Requirements", "value": "One year of chemistry OR EARTH 201 OR consent of the professor is required for enrollment."}, {"name": "Class Materials (Required)", "value": "Introduction to Ore-Forming Processes <br/><br/>Laurence Robb<br/><br/>ISBN: 978-0-632-06378-9<br/><br/>Publisher: Wiley-Blackwell<br/><br/>Copyright: 2005<br/><br/>Suggested retail price: $123.00"}], "lmod": "12/24/16 6:57 PM (CT)", "subject": "EARTH"}]