[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "ANTHRO Sem Rm 104 - 1810 Hinmn"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "27694", "title": "WCAS ANTHRO 383-0-20 Environmental Anthropology", "class_attributes": "", "section": "27694", "instructors": [{"instructor_phone": "", "instructor_name": "Stefanie Toney Graeter", "instructor_addr": "Room 105, 1812 Hinman"}], "topic": "", "course": "383-0", "descriptions": [{"name": "Overview of class", "value": "In the 21st century, what we call &quot;environment&quot;, &quot;ecology&quot;, or &quot;nature&quot; in the Euro-Atlantic world consists of complex and fraught assemblages of social and material connections that have a history. While the meaning of these terms may appear static or straightforward, the significance, value, and even materiality of what falls under the designation of &quot;environment&quot; is under constant socio-political and scientific negotiation. Nothing makes this more evident than today's ongoing political battles over climate change, resource use, contamination, and conservation. To situate the terms that describe the more-than-human world around us, this course examines both the historical construction of the terms in the title, as well as other configurations of human-nonhuman relations of other societies and cultures. Doing so will trouble our assumed separation between &quot;nature&quot; and &quot;culture&quot; and challenge us to think through present-day environmental politics in new and different ways. As a survey-type course, we will read a variety of socio-cultural anthropology texts, including classic studies and recent publications. A familiarity with basic concepts of sociocultural anthropology is assumed."}, {"name": "Learning Objectives", "value": "50-80 pages of reading per/week<br/>Active participation in class<br/>Weekly reading responses<br/>Midterm paper (6-8 pages)<br/>Final exam"}, {"name": "Teaching Method", "value": "Lecture and Discussion<br/>PowerPoint usage minimal<br/>Occasional film selections<br/>Screen-free classroom unless permission previously granted"}, {"name": "Evaluation Method", "value": "Class Participation: 25%<br/>Reading Responses: 20%<br/>Midterm Paper: 30%<br/>Final Exam: 25%"}, {"name": "Class Materials (Required)", "value": "Two of the following books will be required (TBD), chapter selections of the remaining and other materials will be available as PDFs online.<br/> <br/>Ana Lowenhaupt Tsing, &quot;The Mushroom at the End of the World: On the Possibility of Life in Capitalist Ruins.&quot;<br/> <br/>Candis Callison, &quot;How Climate Change Comes to Matter: The Communal Life of Facts.&quot;<br/> <br/>Hugh Raffles, &quot;In Amazonia: A Natural History.&quot;<br/> <br/>Paige West, &quot;Conservation is our Government Now: The Politics of Ecology in Papua New Guinea.&quot;<br/> <br/>Mark Carey, &quot;In the Shadow of Melting Glaciers: Climate Change and Andean Society.&quot;"}, {"name": "Class Notes", "value": "Graduate Credit also."}], "lmod": "1/9/16 6:43 PM (CT)", "subject": "ANTHRO"}]