[{"school": "WCAS", "overview_of_class": "The purpose of this course is to thoughtfully consider psychological theory, methodology, and empirical data relating to questions such as the following: What is it that makes us find beautiful people beautiful? How can evolutionary psychology explain why we find certain features beautiful?  Where does this theory fail in terms of predicting perceptions of beauty? Is beauty really in the eye of the beholder? How have beauty ideals shifted over history? How are gender roles and sexual orientation related to beauty and its pursuit? Why is beauty associated with femininity? What cultural biases help those perceived as beautiful and hurt those perceived as lacking in beauty? Are beautiful people happier or more successful? In what ways are beauty standards sometimes destructive? How do cultural standards of beauty affect disorders such as anorexia nervosa, bulimia nervosa, and body dysmorphic disorder?", "name": "Special Topics in Psychology", "section": "20", "location": "Technological Institute L251", "topic": "Psychology of Beauty", "course": "314-0", "meeting_time": ["Mo 6:00PM - 8:50PM"], "path": "/class-descriptions/4610/WCAS/PSYCH/314-0/20941", "instructor": ["Renee Suzanne Engeln"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "id": "20941", "subject": "PSYCH"}, {"school": "WCAS", "overview_of_class": "In this seminar we will examine the nature of the mind from both Buddhist and traditional Western psychological perspectives. We will employ a Buddhist technique for investigating mental activity by incorporating a brief meditation period into class and homework activities. We will also examine written materials from both traditions, and these will form the primary basis for class discussion and examinations.", "name": "Special Topics in Psychology", "section": "21", "location": "Annenberg Hall G21", "topic": "Buddhist Psychology", "course": "314-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4610/WCAS/PSYCH/314-0/20942", "instructor": ["Marcia F Grabowecky"], "class_attributes": "", "id": "20942", "subject": "PSYCH"}, {"school": "WCAS", "overview_of_class": "The human brain is severely limited in how much it can process and remember. How many times have you watched presenters ignore these limits, producing an information 'fire hose' effect where their audience understands and retains far too little? This class will survey techniques for avoiding this problem in your presentations, by understanding why and where our cognitive and perceptual limitations arise. We will focus on harnessing the power of a processing system that occupies over 40% of your viewer's brain - their visual system. We will explore visual presentation strategies that keep an audience's attention engaged, and a speaker's message understood and remembered.", "name": "Special Topics in Psychology", "section": "22", "location": "Harris Hall 107", "topic": "Presenting Data & Ideas", "course": "314-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4610/WCAS/PSYCH/314-0/20943", "instructor": ["Steven   Franconeri"], "class_attributes": "", "id": "20943", "subject": "PSYCH"}, {"school": "WCAS", "overview_of_class": "Clinical psychology is the application of theoretical perspectives to an individual, couple or group for the purpose of psychological healing. This course will investigate, within a biological-psychological-social framework, the major theoretical perspectives and their views on normal, abnormal development and their therapeutic interventions. Special focus will be given to competing and controversial perspectives both between and within paradigms. The emphasis will be on Psychodynamic, Cognitive-Behavioral, Dialectical (DBT), Humanistic, and Psychopharmacological approaches with some background discussion on recent developments in Neuroscience.", "name": "Special Topics in Psychology", "section": "23", "location": "Technological Institute F280", "topic": "Intro to Schools of Psychotherapy", "course": "314-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4610/WCAS/PSYCH/314-0/20944", "instructor": ["Carol M Donnelly"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>Prerequisites apply, see description<br/><br/>", "id": "20944", "subject": "PSYCH"}]