[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "Pancoe Building Abbott Aud"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-requisite: Students must have completed BIOL_SCI 215, BIOL_SCI 217, BIOL_SCI 219, BIOL_SCI 308 and 1 Statistics course to register for this course.", "qtr": "Spring 2017", "name": "33453", "title": "WCAS BIOL_SCI 342-0-20 Evolutionary Processes", "class_attributes": "Prerequisites apply, see description<br/><br/>", "section": "33453", "instructors": [{"instructor_phone": "847/491-5098", "instructor_name": "Joseph S Walsh", "instructor_addr": "Hogan Hall, Room 6-110A"}], "topic": "", "course": "342-0", "descriptions": [{"name": "Overview of class", "value": "Change in the genetic composition of populations over time is the basis of evolution. Evolution occurs when mutation introduces new alleles that replace existing alleles in populations via one of two mechanisms. Replacement can occur by chance (genetic drift) or by encoding a superior phenotype (natural selection). Natural selection produces one of the major features of the living world, adaptation. We will examine several adaptations (life history, sex, cooperation) in depth. When populations are separated from one another geographically, they inevitably take different evolutionary paths; it is in this manner that most species are formed. These latter processes-change within lineages and diversification among lineages-have been iterated over staggeringly long periods of time, producing another major feature of the living world, its breathtaking biodiversity. We will familiarize ourselves with the history and diversity of life on earth by examination of the fossil record, and by inferring relationships among species using phylogenetic methods."}, {"name": "Registration Requirements", "value": "Prerequisites: BIO 215, 217, 219, 308. One course in statistics"}, {"name": "Learning Objectives", "value": "By the end of the term, students will be able to explain the scope and applications of modern evolutionary biology, analyze scientific research methods that are applied to elucidate evolutionary patterns, and identify research problems that must take into account known evolutionary processes."}, {"name": "Teaching Method", "value": "Lecture, discussion, and in-class exercises."}, {"name": "Evaluation Method", "value": "Grades will be based on paper quizzes, in-class activities, and cumulative final exam."}, {"name": "Class Materials (Required)", "value": "TBA"}], "lmod": "2/21/17 6:44 PM (CT)", "subject": "BIOL_SCI"}]