[{"school": "WCAS", "overview_of_class": "Is beauty a site of political struggle? Certainly the last presidential election presented many opportunities to debate the question. Applying the critical frameworks developed by writers and theorists as different as Naomi Wolf, Kathy Davis, bell hooks, Michele Wallace, and Judith Butler, this course asks why has there been such heated disputes among feminists over whether beauty culture is oppressive or liberatory? Is beauty the source of delusion and false values or the source of self-expression and empowerment? Could it be a site of critical destabilizing practices? To better understand the deeper stakes in this debate, the class sets these questions historically, tracing them from 17th and 18th century moral philosophy and aesthetics to 19th century physiognomics, anthropology, medicine, phrenology, and comparative anatomy. A crucial component of this project is to uncover how elites as spectators, philosophers, connoisseurs, and scientists have constituted racial and sexual hierarchies through their aesthetic judgments of others. <br/> Through case studies on beauty pageants, cosmetic surgeries, bar and club cultures, as well as sports and modern/postmodern concert dance, we will study the counter-discourses and self-fashioning strategies of groups and individuals. Focusing on the performative and bodies in motion, we will ask whether corporeal meaning can be remade from within and by \"marked\" bodies. Instead of developing simple resistance models of opposition, we will focus on how communities establish their aesthetics to communicate their goals, hopes, and pain.", "name": "Race, Gender, and Sexuality", "section": "20", "location": "Locy Hall 111", "topic": "Politics of Beauty", "course": "382-0", "meeting_time": ["MoWe 11:00AM - 12:20PM"], "path": "/class-descriptions/4660/WCAS/GNDR_ST/382-0/33917", "instructor": ["Tessie P Liu"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "33917", "subject": "GNDR_ST"}, {"school": "WCAS", "overview_of_class": "This course explores the construction of gender in the Middle East. Drawing on the historical, sociological and anthropological research in the region, the course aims to question stereotypes about the subordination of Muslim women and to offer a systematic reading and an analytical discussion of the political, economic and cultural structures that inform gender relations and sexuality. The course starts with an examination of early Islam and religious sources with regard to women's status, then moves on to nationalist and modernization movements in the 19th and 20th centuries, and finally focuses on women and men's lives in contemporary Egypt, Turkey and Iran. In this framework, special attention is given to Islamist mobilizations, the family, sexuality, neoliberalism, women's labor and LGBT.", "name": "Race, Gender, and Sexuality", "section": "21", "location": "Kresge 4531 MENA Seminar Rm", "topic": "Gendr&SexualityinMidEst", "course": "382-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4660/WCAS/GNDR_ST/382-0/33918", "instructor": ["Ayca   Alemdaroglu"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "33918", "subject": "GNDR_ST"}]