[{"class_mtg_info": [{"meet_t": "TuTh 1:00PM - 2:50PM", "meet_l": "Louis Hall 119"}, {"meet_t": "Tu 6:00PM - 8:50PM", "meet_l": "Louis Hall 119"}], "school": "SoC", "enrl_requirement": "", "qtr": "Spring 2016", "name": "31678", "title": "SoC RTVF 398-0-20 Symposium: Issues in RTVF", "class_attributes": "", "section": "31678", "instructors": [{"instructor_phone": "", "instructor_name": "Jacob Arnaud Smith", "instructor_addr": ""}], "topic": "Children's Media Culture", "course": "398-0", "descriptions": [{"name": "Overview of class", "value": "When we consider the subject of children's media culture, we quickly discern a host of contradictory behaviors and attitudes: childhood is seen as a period of timeless wonder, but children are bombarded with all the latest fads and newest gadgets; we try to insulate children from the adult world, but provide them with media technologies that allow them unprecedented access to it; we want kids to be kids, but are thrilled to introduce them to the consumer marketplace through toys, advertisements, and media franchises. This class will explore contradictions such as these by placing discourses about childhood and children's media within their broader cultural, social, and historical contexts. We will encounter a sample of media texts ranging from film adaptations of classic children's literature to contemporary children's television and online digital games. These case studies will allow us to engage with debates about contemporary media culture and interrogate differing perspectives on the nature of childhood. Children are often understood to be a particularly vulnerable part of the media audience, and the investigation of children's media has much to tell us about regimes of media censorship, theories about media influence on behavior and identity, and debates about the media's role in education and marketing. Our goal will be to gain insight into children's media culture and the social institutions and practices that shape it, while also empowering us to speak back to that culture through critical analysis."}, {"name": "Evaluation Method", "value": "A key objective of the class is to develop skills in researching and writing about the social and cultural meanings of the media through the use of a range of research materials. Students are required to write two essays. In order to give you the time to explore your topic in depth and to gain experience revising written work, the second essay will consist of a substantially revised and expanded version of the first essay."}, {"name": "Class Materials (Required)", "value": "Sharon Mazzarella ed. 20 Questions About Youth and The Media (Lang 2007)<br/> <br/>Reading Pack (available at Quartet Copies)."}], "lmod": "4/3/16 7:23 PM (CT)", "subject": "RTVF"}]