[{"class_mtg_info": [{"meet_t": "Mo 9:00AM - 11:50AM", "meet_l": "Harris Hall L40"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "24979", "title": "WCAS HISTORY 492-0-20 Topics in History", "class_attributes": "Attendance at 1st class mandatory<br/><br/>Graduate Students Only<br/><br/>", "section": "24979", "instructors": [{"instructor_phone": "847 4673032", "instructor_name": "Haydon Leslie Cherry", "instructor_addr": "Harris 217"}], "topic": "Modern Hist. of Southeast Asia", "course": "492-0", "descriptions": [{"name": "Overview of class", "value": "This seminar is an introduction to the most important figures, works, and debates in the history of Southeast Asia. It begins by considering the arguments for and against regional history and area studies. It then turns to an assessment of some of the most influential ideas in the study of the region, such as Oliver Wolters's notions of &quot;localization,&quot; the &quot;mandala&quot; state, and the &quot;man of prowess&quot;; Anthony Reid's &quot;Age of Commerce&quot;; Clifford Geertz's formulation of the &quot;theatre state&quot;; James C. Scott's analysis of the &quot;moral economy of the peasant&quot; and &quot;weapons of the weak&quot;; J.S. Furnivall's notion of the &quot;plural society&quot;; and Thongchai Winichakul's conception of the &quot;geo-body,&quot; among others. Students will gain a critical understanding of the historiography of modern Southeast Asia and its animating ideas."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Participation and Discussion; Response Papers; Final Paper"}, {"name": "Class Materials (Required)", "value": "Michael Adas, The Burma Delta: Economic Development and Social Change on an Asian Rice Frontier. ISBN: 978-0299283544<br/><br/>Bendedict Anderson, Imagined Communities: Reflections on the Origins and Spread of Nations. ISBN: 978-1844670864<br/><br/>Clifford Geertz, Negara: The Theatre State in Nineteenth Century Bali. ISBN: 978-0691007786<br/><br/>Reynaldo C. Ileto, Pasyon and Revolution: Popular Movements in the Philippines, 1840-1910. ISBN: 978-9715502320<br/><br/>E.R. Leach, Political Systems of Highland Burma: A Study of Kachin Social Structure. ASIN: B0017GQHXK<br/><br/>Rudolf Mrazek, Engineers of Happy Land: Technology and Nationalism in a Colony. ISBN: 978-0691091624<br/><br/>Anthony Reid, Southeast Asia in the Age of Commerce, 1450-1680: Volume One: The Lands Below the Winds. ISBN: 978-0300047509<br/><br/>Anthony Reid, Southeast Asia in the Age of Commerce, 1450-1680: Volume Two: Expansion and Crisis. ISBN: 978-0300065169<br/><br/>James C. Scott, The Moral Economy of the Peasant: Rebellion and Subsistence in Southeast Asia. ISBN: 978-0300021905<br/><br/>James C. Scott. Weapons of the Weak: Everyday forms of Peasant Resistance. ISBN: 978-0300036411<br/><br/>James C. Scott, The Art of Not Being Governed: An Anarchist History of Upland Southeast Asia. ISBN: 978-0300169171<br/><br/>Thongchai Winichakul, Siam Mapped: A History of the Geo-body of a Nation. ISBN: 978-0824819743<br/><br/>Oliver Wolters, History Culture and Region in Southeast Asian Perspective. ISBN: 978-0877277255<br/><br/>Reading Packet"}, {"name": "Class Notes", "value": "HISTORY AREA OF CONCENTRATION: Asian/Middle East"}], "lmod": "1/9/16 6:49 PM (CT)", "subject": "HISTORY"}]