[{"school": "WCAS", "overview_of_class": "Landscapes of Desolation in the Age of the Chinese Economic Miracle : In the eyes of many, China's post-Mao economic ?miracle' has transformed the nation from communist hinterland into a menacing capitalist juggernaut that aspires to global political and economic hegemony. Increasingly, however, the power of this narrative lies as much in visions of scorched earth and fetid waterways as it does in nightmares of a new world order. This course explores how artists, filmmakers and writers, from China and elsewhere, have responded to actual and imagined environmental degradation in China and how they have come to produce a new mode of  ?Chinese landscape,' the landscape of desolation.", "name": "Advanced Topics in Asian Languages and Cultures", "section": "20", "location": "Parkes Hall 224", "topic": "Landscapes of Desolation", "course": "390-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4610/WCAS/ASIAN_LC/390-0/22842", "instructor": ["Corey   Byrnes"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "22842", "subject": "ASIAN_LC"}, {"school": "WCAS", "overview_of_class": "Travel Writing and Modern India: How do we know what we know about India? How do residents of India themselves know what they know about the vast land they inhabit, with its various sub-cultures and ethnic groups? As a perennially popular literary genre, travel writing has played a prominent role in the production of this knowledge. In this course, we will read travel writing on and from South Asia to ask how it produces representations of India and offers it to readers for consumption. Course materials will include both historical travel writing from authors like Mark Twain, Rabindranath Tagore and Queen Sikandar Begum, as well as more contemporary works like Eat, Pray, Love and City of Djinns. By the end of the course, students should have a clear understanding of the place of travel writing in modern literature on India, and how this genre has helped structure the way we know this region today.", "name": "Advanced Topics in Asian Languages and Cultures", "section": "21", "location": "Fisk Hall 114", "topic": "Travel Writing and Modern India", "course": "390-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4610/WCAS/ASIAN_LC/390-0/22843", "instructor": ["Daniel Joseph Majchrowicz"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "22843", "subject": "ASIAN_LC"}, {"school": "WCAS", "overview_of_class": "Asia as Method: A Research Workshop: If you wish to pursue some combination of gainful employment, political activism, or academic research, you will need three fundamental abilities: 1) the ability to understand how knowledge has been produced in the past, 2) the ability to develop methods for producing knowledge on your own and with others, and 3) the ability to communicate that knowledge to future audiences. This course offers an intensive training program in these three abilities, a program geared towards students in Asian and comparative literary studies who wish to pursue independent research projects (and thereby demonstrate the higher-level research skills prized by employers, granting agencies, and graduate admissions committees). <br/>At the most basic level, this is a classic research methods course, where you will strengthen the skills necessary to complete a full, ten-week research project. Through short weekly exercises, we will break down and workshop each component of the research process?e.g., how to convert an area of interest into a specific topic, how to apply for research funding, how to write an abstract, how to compile a bibliography, etc. These exercises will culminate in a twelve-page research paper (or its equivalent in other formats). Our work in research methods will provide a springboard for readings and discussion about how we can critique or change existing methods for producing knowledge. Such questions include: How do problems of orientation provide the basis for making the Orient an object of knowledge and power? How do different media exert and distribute \"soft\" and \"hard\" power? What kinds of knowledge production have supported colonialism and imperialism? And what alternatives exist for decolonizing or democratizing knowledge?<br/> <br/>Note: As a class of this kind has not been offered in DALC before, students interested in reading evaluations of a similar course in English may wish to consult the instructor's CTECs for English 397.", "name": "Advanced Topics in Asian Languages and Cultures", "section": "22", "location": "555 Clark B03", "topic": "Asia as Method", "course": "390-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4610/WCAS/ASIAN_LC/390-0/22844", "instructor": ["Andrew Way Leong"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "22844", "subject": "ASIAN_LC"}]