[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Kresge Centennial Hall 4-410"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Winter 2017", "name": "21610", "title": "WCAS ART_HIST 101-6-1 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "21610", "instructors": [{"instructor_phone": "", "instructor_name": "Rebecca Elizabeth Zorach", "instructor_addr": ""}], "topic": "Wall of Respect and Chicago's Mural Movement", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "In 1967, the Organization of Black American Culture painted a huge mural &quot;guerrilla-style&quot; on the wall of a decaying building on the South Side of Chicago. They called it the Wall of Respect. This mural, which grew out of the Black Liberation Movement of the 1960s, was controversial from the start and only survived a few years?but in that time it inspired a community movement that went on to paint vivid colors on walls across the city and beyond. <br/> <br/>The Wall of Respect's 50th anniversary is 2017, and many events in the Chicago area will commemorate it this coming year. Using photographs and documents relating to the Wall of Respect and other murals, students in the seminar will?as their final project?collectively curate an exhibition to be held at the Block Museum in the spring. Each student will also create an individual digital mini-exhibition of their own.<br/><br/>We will explore the mural movement in Chicago in its historical context, studying how race and class have intersected with the spatial politics of the city. Students will gain skills in the analysis of works of art, learn digital tools for mapping, image presentation, and storytelling, and develop an understanding of how exhibitions are created. No prior knowledge is expected, but students must be willing to engage with all aspects of the class (including a Saturday or Sunday field trip)."}, {"name": "Evaluation Method", "value": "Participation in class discussion; many small writing and image-based assignments; final exhibition projects (group and individual)."}, {"name": "Class Materials (Required)", "value": "PDF readings provided on Canvas."}], "lmod": "12/24/16 6:54 PM (CT)", "subject": "ART_HIST"}]