[{"school": "WCAS", "overview_of_class": "We will spend the term delving deeply into the meaning and significance of a play often said to be at the heart of Shakespeare's canon and of modern Western culture more generally.  Devoting a full course to one play will allow us to read this enduringly important, exceptionally enigmatic tragedy intensively, scene by scene, sometimes line by line.  At the same time, it will allow us to see the many and sometimes conflicting Hamlets that have existed since about 1600, when it was first written and performed.  We will read the three early (and different) printed versions of the play from Shakespeare's time.  We will also encounter the play through the lenses and tools of several modern critical approaches that have sought to address the mystery of the play and its central character: psychoanalytic Hamlet, post-structuralist Hamlet, Marxist Hamlet, new historicist Hamlet, feminist and queer Hamlets, alongside the critical perspectives of some film versions and Tom Stoppard's ingenious revision.  &quot;To be or not to be,&quot; as we will see, is not the only question.", "name": "Special Topics in Shakespeare", "section": "20", "topic": "Hamlet: That is the Question", "course": "339-0", "meeting_time": ["TuTh 9:30AM - 10:50AM"], "path": "/class-descriptions/4610/WCAS/ENGLISH/339-0/25456", "instructor": ["Jeffrey A Masten"], "id": "25456", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "One of Shakespeare's most famous stage directions, &quot;Exit, pursued by a bear,&quot; occurs in one of his late tragicomedies, The Winter's Tale. This strange beast can be taken as a symbol of tragicomedy itself: many of Shakespeare's contemporaries preferred the classical division of drama into comedy, tragedy, and history, and repeatedly characterized tragicomedy as a &quot;mongrel&quot; devaluation of these categories. Shakespearean tragicomedies defy the formal boundaries and tonal expectations of more settled genres; by reading several of these hybrid plays, we'll form a picture of how dramatic genre shapes plot?and how Shakespeare's tragicomic plots blend genres. We'll also consider how genres and Shakespeare's blending of them influence dramatic representations of gender, social class, and ethnicity; why Renaissance literary theorists disliked tragicomedy, sometimes fiercely; and what the often-spectacular stage effects required by tragicomedy?from statues coming to life to characters' being chased off stage &quot;pursued by a bear&quot;?reveal about Renaissance theatrical practice. By the end of the course, we will have developed an understanding of Renaissance dramatic genre theory and the theatrical practices that challenged that theory, especially Shakespeare's.", "name": "Special Topics in Shakespeare", "section": "21", "topic": "Pursued by a Bear: Shakespeare's Tragicomedies", "course": "339-0", "meeting_time": ["MoWe 12:30PM - 1:50PM"], "path": "/class-descriptions/4610/WCAS/ENGLISH/339-0/25457", "instructor": ["Christopher Daniel Shirley"], "id": "25457", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "What can you do with Shakespeare's plays?  Perform them, behold them, read them, interpret them, imitate them, adapt them? Track them as they travel the globe and mutate into new forms? Shakespeare's infinite variety?in diverse applications?has traveled everywhere: in Renaissance London and Germany, nineteenth and twentieth century India, South Africa before and after apartheid, Israel, modern China. In this class we will reflect on the unique position of Shakespeare in cultures of the world at every scale, from local to global, and through a range of media?from the digital to traditional forms like print, theater, or opera. Learning in this course will take place in the classroom, the computer lab, and spaces for experiencing Shakespeare around Chicago, from rare book rooms at the Newberry Library, to the Lyric Opera and the Chicago Shakespeare Theater.  Students will discuss The Tempest, Othello, and The Merchant of Venice not only in Shakespeare's time but across the globe in many eras and in many media  (visual arts, film, print, and performing arts).  Our study will culminate with students collaborating to create a digital interactive map of Shakespeare's influences over time and across the globe.", "name": "Special Topics in Shakespeare", "section": "22", "topic": "Shakespeare's Circuits: Local, Global, Digital", "course": "339-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4610/WCAS/ENGLISH/339-0/27447", "instructor": ["Wendy L Wall", "William N West"], "id": "27447", "subject": "ENGLISH"}]