[{"school": "WCAS", "overview_of_class": "This class aims to introduce students to the history and culture of Berlin from 1900 to the present. Drawing on a wide range of media, from maps through film to music, the class concentrates on a series of transformative moments in German cultural history seen through the prism of Berlin. Students will engage with the varied historical, socio-political, and artistic changes in German culture throughout the twentieth century, including the vibrant and provocative culture of the 1920s and early 1930s, with a focus on changing forms of gender identity (the \"New Woman\") and sexual subcultures (as in the film Cabaret). Further, students will examine the everyday and extraordinary history of German-Jews in Germany around the devastating caesura of the Jewish genocide executed by the National Socialists. After examining the megalomaniacal plans that the Nazis made for Berlin, the class turns to the devastated city of 1945 and the divided city of the Cold War, where the conflict between \"East\" and \"West\" emerges in the \"concrete\" form of the Berlin Wall. The final weeks concentrate on the events surrounding the collapse of the Wall and the creation of the Berlin Republic. Students will also encounter the changing face of national culture in light of the migration of the so-called Turkish \"guest workers\" of the post-War years, particularly through the art of later generations of Turkish-German authors and filmmakers in Berlin. In addition to reading major works of 20th-century literature, students will engage with visual media, in particular film, photography, and other visual art, to acquire a sense of the breathtaking scope of change in the urban context peculiar to twentieth century Berlin. Field trips to Berlin-related events in larger Chicago are an integral part of the syllabus. This course will demonstrate why cosmopolitan Berlin continues to attract attention and remains a magnetic international destination with a biography and personality all its own.", "name": "Berlin and the Culture of Democracy", "section": "20", "location": "Kresge Centennial Hall 2-415", "topic": "", "course": "230-0", "meeting_time": ["MoWe 1:00PM - 1:50PM"], "path": "/class-descriptions/4650/WCAS/GERMAN/230-0/20546", "instructor": ["Anna Maree Parkinson"], "class_attributes": "Historical Studies Distro Area<br/><br/>Interdisciplinary Distro - See Rules<br/><br/>Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "20546", "subject": "GERMAN"}]