[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "Harris Hall L06"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "21884", "title": "WCAS ASIAN_AM 247-0-1 Asian Americans and Popular Culture", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "21884", "instructors": [{"instructor_phone": "847/467-7114", "instructor_name": "Douglas Sadao Ishii", "instructor_addr": "Crowe Hall, Room 1117"}], "topic": "", "course": "247-0", "descriptions": [{"name": "Overview of class", "value": "In this course, using theoretical frameworks developed in the study of popular culture and the field of Ethnic Studies, we will look into the complexities, compromises, and negotiations that go into Asian Americans representing themselves and being represented through U.S. mass culture and locally based grassroots cultural production. We will explore primary &quot;texts&quot; in Asian American popular cultures, and pair them with the theoretical analyses of Asian American popular culture studies, thinking about race at the intersection of class, gender, sexuality, and citizenship. If there is an Asian American popular culture, what is it? Who is engaging in it? Who is producing it and who is consuming it? And how does this shape our understanding of Asian American communities?"}, {"name": "Registration Requirements", "value": "None."}, {"name": "Learning Objectives", "value": "? To consider popular culture as a form of knowledge, in all of its cultural, social, and political implications ? To apply cultural theory and cultural analysis to understand meaning-making in Asian American communities and cultures at the level of everyday life ? To think critically about what constitutes an &quot;Asian American&quot; popular culture in terms of race, ethnicity, class, gender, cultural nationalism, diaspora, and transnationality ? To understand the ideological and material foundations of &quot;diversity,&quot; difference, and race ? To practice advanced reading, writing, and research skills through conceptual and creative thought"}, {"name": "Teaching Method", "value": "DiscussionLecture"}, {"name": "Evaluation Method", "value": "Class participation: 10%<br/>Paper, final: 15%<br/>Papers: 60%<br/>Presentations: 15%<br/>"}, {"name": "Class Materials (Required)", "value": "Eds. Shilpa Dave, LeiLani Nishime, and Tasha Oren. Global Asian American Popular Cultures (NYU Press, 2016). ISBN: 9781479815739 Eds. Jeff Yang, Parry Shen, Keith Chow, and Jerry Ma. <br/>Secret Identities: The Asian American Superhero Anthology (New Press, 2009). ISBN: 978-1595583987"}], "lmod": "12/29/16 6:54 PM (CT)", "subject": "ASIAN_AM"}]