[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "Locy Hall 111"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "22528", "title": "WCAS CLASSICS 250-0-1 Literatures of the Ancient World", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "22528", "instructors": [{"instructor_phone": "847/491-8361", "instructor_name": "Marianne I Hopman", "instructor_addr": "Kresge Hall 4361"}], "associated_classes": [{"component": "DIS", "room": "Kresge Centennial Hall 2-415", "meeting_time": "Fr 10:00AM - 10:50AM"}, {"component": "DIS", "room": "Kresge Centennial Hall 2-415", "meeting_time": "Fr 11:00AM - 11:50AM"}], "topic": "Love in Antiquity", "course": "250-0", "descriptions": [{"name": "Overview of class", "value": "We tend to take the ways in which we express and experience love for granted, yet love?like most human activities?is culturally conditioned and contextually determined. In this course, we will read and discuss erotic poems stemming from four cultures widely different from ours?Ancient Egypt, Israel, Greece, and Rome?, including texts as different as the Biblical Song of Songs, homoerotic poems sung at drinking parties in ancient Athens, and sophisticated love elegies addressed to mysterious and probably fictional Roman addressees. Topics to be considered include the representation of male and female bodies, the construction of gender roles, desire and sexuality, and the language and poetic images associated with love."}, {"name": "Learning Objectives", "value": "Critical perspective on our own culture; familiarity with the texts studied in the course; speaking, writing, and reading skills."}, {"name": "Class Materials (Required)", "value": "Bing, P. and R. Cohen 1991. Games of Venus: An Anthology of Greek and Roman Erotic Verse from Sappho to Ovid. New York and London: Routledge. 978-0415902618<br/><br/>Green, P. 1982. Ovid, The Erotic Poems: The Amores, the Art of Love, Cures for Love, On Facial Treatment for Ladies. Translated with an Introduction and Notes by Peter Green. Harmondsworth: Penguin. 978-0140443608"}, {"name": "Class Notes", "value": "No P/N for undergraduate students."}], "lmod": "12/24/16 6:56 PM (CT)", "subject": "CLASSICS"}]