[{"class_mtg_info": [{"meet_t": "TuFr 8:00AM - 9:20AM", "meet_l": "Frances Searle Building 1421"}], "school": "SoC", "overview_of_class": "", "qtr": "Fall 2017", "name": "Clinical Neuroanatomy and Physiology", "title": "SoC CSD 456-0-20 Clinical Neuroanatomy and Physiology", "lmod": "5/1/17 9:06 AM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Belma   Hadziselimovic", "instructor_addr": ""}], "associated_classes": [{"component": "LAB", "room": "Frances Searle Building 1421", "meeting_time": "Tu 6:00PM - 7:00PM"}], "topic": "", "course": "456-0", "enrl_requirement": "", "descriptions": [{"name": "Learning Objectives", "value": "At the conclusion of the course, students will be able to:<br/>1. Describe components and functions of neurons and glial cells, and cellular layers in various brain regions.<br/>2. Describe development of the normal human brain; describe disorders resulting from abnormal development.<br/>3. Describe neural circuits involved in motor and somatosensory functions (including swallowing), including structures in the peripheral and central nervous systems.<br/>4. Describe neural circuits involved in olfactory, gustatory, visual, auditory, and vestibular functions, including structures in the central nervous systems and organs of the special senses.<br/>5. Describe neural circuits involved in motivation, emotion, and memory, including structures in the hypothalamus and limbic system.<br/>6. Identify cortical and subcortical neuroanatomic correlates of language, attention, executive functions, and learning.<br/>7. Describe structures and functions of the cerebrovascular system.<br/>8. Explain physiologic and behavioral consequences of lesions across structures and pathways of the nervous system."}, {"name": "Evaluation Method", "value": "All exams are cumulative and will be completed in class. Specific letter grade will then be assigned as indicated below:<br/>· 94.00% or higher = A; 90.00%-93.99% = A-<br/>· 87.00%-89.99% = B+; 83.00%-86.99% = B; 80.00%-82.99% = B-<br/>· 77.00%-79.99% = C+; 73.00%-76.99% = C; 70.00%-72.99% = C-<br/>· 60.00%-69.99% = D (assigned to undergraduate students only)<br/>· 59% (or 69.99% for graduate students) or below = F<br/><br/>Any student who receives a grade below a B- (or \"fail\" for students who are taking the course on a pass/no credit basis) on any exam is required to take a remediation exam. This is for the purposes of demonstrating competency only, not for changing any numeric scores or grades. Regardless of the final numeric score, failing to follow these procedures will result in an F for the course.<br/>You have 1 business day from when the graded exam is returned to you to dispute your grade. To do so, you will need to submit a written argument to the TA's office. Note that the entire exam will be reviewed; this may result in an increase or decrease of the original grade."}, {"name": "Class Materials (Required)", "value": "Nolte, J. (2009). The Human Brain: An Introduction of Its Functional Anatomy 6th Edition. St. Louis, MO: Mosby. $81.95<br/><br/>Nolte, J. (2009). Essentials of the Human Brain, 6th Edition. St. Louis, MO: Mosby. $42.95"}], "path": "/class-descriptions/4680/SoC/CSD/456-0/10917", "instructor": ["Belma   Hadziselimovic"], "class_attributes": "", "id": "10917", "subject": "CSD"}]