[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Fisk Hall 114"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "17370", "title": "WCAS AFST 276-0-20 African Literature in Translation", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "17370", "instructors": [{"instructor_phone": "847 4917323", "instructor_name": "Richard Marshall   Lepine", "instructor_addr": "620 Library Place"}], "topic": "", "course": "276-0", "descriptions": [{"name": "Overview of class", "value": "AFST 276-0-20 &quot;African Literature in Translation &quot; , Fall 2016, Richard Lepine <br/><br/>The course is primarily a survey of African oral verbal arts traditions, with an additional focus on the links between these traditions and African films. The original works of art, the objects of study in the course, are not literature in the strict sense of the term-verbal art in the medium of writing-but rather take form in oral performance or electronic media like film, TV, radio, recorded disks, and web-based digital media. However, as printed texts in English translation, the course examples from various genres of African oral verbal arts performances (riddles, lyric poetry, proverbs, praise poetry, folktales, trickster tales, hero tales, epics) are all experienced as literature for purposes of analysis and interpretation. A primary focus of the course is exploring the analytic approaches employed by scholars Harold Scheub and Robert Cancel, specialists in African oral traditions and their relationships with other arts media. In addition to printed materials, course members will have in common the experience of viewing four African films: &quot;Wend Kuuni&quot; (1982; Gaston Kaboré, dir.; Burkina Faso), &quot;Keita: Heritage of the Griot&quot; (1995; Dani Kouyaté, dir.; Burkina Faso); &quot;La vie est belle/Life Is Rosy&quot; (1987; Ngangura Mweze and Bernard Lamy, dirs.; Zaïre [Democratic Republic of Congo]), and &quot;Yeelen&quot; (Souleymane Cissé, Mali, 1987, 105 min.)."}, {"name": "Teaching Method", "value": "This &quot;digital humanities&quot; course is a blend of group class meetings (two 75-minute sessions weekly) and interaction outside class facilitated by a dedicated Canvas LMS website. In class and on the course's Canvas site, the teaching method consists of the presentation of the artistic and scholarly texts; guidance through the multimedia learning resources connected to the material; classroom questions and discussion; ongoing assessment and feedback on individual contributions to collaborative Canvas-based projects; and a revisable draft process for the midterm and final compositions. There is a significant amount of outside-of-class reading and digital media viewing and listening; these assignments are linked to Canvas-based quizzes designed as directed self-study exercises. Quizzes contain a mix of questions with preprogrammed and scored answers (formats are multiple choice, matching, true-false, fill-in-the-blank) and that offer immediate display of feedback after submission, but sometimes also contain short essay questions that must await assessment and scoring by the instructor. Quiz exercises are tools for self-assessment; scores are not intended as and should not be viewed as achievements or failures. Exercise scores are not grades-ignore Canvas labeling to the contrary?but rather indicators of what has been learned successfully and of what needs further investigation in order to make course work more efficient and profitable. Since the three major composition assignments offer opportunities to display research data and analysis using both Canvas web pages and traditional word processing and slide show tools that employ embedded media, coursework also involves exercises in media production and editing using Weinberg MultiMedia Learning Center resources that can be duplicated on Mac and Windows personal computers."}, {"name": "Evaluation Method", "value": "Three major presentation assignments are required: one is a collaborative project on Yoruba divination poetry posted to (separate) blog and wiki areas on the course's Canvas site, and the other two are traditional-style research and presentation compositions-one on the folk tale genre due at midterm, and the other on the individualist hero tale genre due in the last week of classes. The bulk of instructor assessment involves student performance on the three major writing projects whose final &quot;project grades&quot; are each worth 30% of the final course grade. The remaining 10% of the final course grade is based on the instructor's quantification of classroom participation, and of documented good faith effort (rather than score) on Canvas quizzes."}, {"name": "Class Materials (Required)", "value": "Required texts available at Norris Bookstore: <br/><br/>&quot;Sixteen Cowries,&quot; William Bascom and Maranoro Salako, Indiana University Press, 1993 or later edition, paper, ISBN-13: 978-0253208477; <br/><br/>&quot;Storytelling in Northern Zambia: Theory, Method, Practice and Other Necessary Fictions,&quot; Robert Cancel, Open Book Publishers, 2013, paper, ISBN-13: 978-1909254596;<br/><br/>&quot;The Epic of Son-Jara/A West African Tradition&quot; by John William Johnson and Fa-Digi Sisoko, Indiana University Press, 1992, paper, ISBN-13: 978-0253207135. <br/><br/>There are many additional required and recommended readings, but these will all be posted, mostly in pdf format, on the course's Canvas site."}], "lmod": "10/30/16 6:58 PM (CT)", "subject": "AFST"}]