[{"school": "WCAS", "overview_of_class": "This course draws on perspectives from anthropology, related social scientific fields, and the humanities to provide a critical introduction to psychological trauma and its increasingly significant place in contemporary global health discourses and agendas. We will explore the history of the concept and its applications in Western literature, science, and medicine; consider the relatively recent construction of Post-Traumatic Stress Disorder (PTSD) as a diagnostic category and the clinical approaches developed to treat it; and examine the politics and effects of applying the concept abroad through humanitarian psychiatry and/or global mental health projects. Key questions of the course will include: how and why has trauma become one of the most important signifiers of our era?and a key criterion of \"victimhood?\" What politics and debates have shaped the development and application of the PTSD diagnosis in recent decades? And how have notions of trauma and their varied applications transformed politics, suffering, and care in diverse communities around the world?", "name": "Special Topics in Global Health", "section": "21", "location": "Parkes Hall 224", "topic": "Trauma and its Afterlives", "course": "390-0", "meeting_time": ["Tu 9:30AM - 12:20PM"], "path": "/class-descriptions/4660/WCAS/GBL_HLTH/390-0/33932", "instructor": ["Peter Andrew Locke"], "class_attributes": "No Freshmen<br/><br/>", "id": "33932", "subject": "GBL_HLTH"}, {"school": "WCAS", "overview_of_class": "Reducing chronic diseases and controlling infectious diseases are no longer just the responsibility of national governments, private health care institutions, city departments of public health, or community physicians. Heart disease, strokes, cancer, chronic respiratory diseases, obesity and diabetes, substance abuse such as tobacco and alcohol, and a range of health safety issues are now the major causes of death throughout the world. In addition, especially in low resource countries and communities, people are especially vulnerable to infectious diseases such as HIV and AIDS, malaria, tuberculosis, diarrheal diseases, as well as viruses and parasites. With the understanding that a healthy society is also a more economically productive society, there is an increased emphasis on reducing the burden of disease throughout the world. As a result, there is an enormous increase in the number of organizations and programs that are being implemented by the three sectors of society, public, private and civil society. This course is designed for those global health students who are seeking ways to have an impact on these global health issues by engaging in local programs and organizations which are addressing these global health challenges.<br/> <br/>Students will study global and local mechanisms and patterns of the circulation of disease, and their relation to environmental, cultural, socio-economic and political influences. Students will explore roles and programs of global and local public, private and civil society sectors in addressing specific health issues. ?<br/><br/>Each student will be expected to identify a local organization or program prior to the start of the course, with which they would like to engage. Students will examine the programs and the geographical regions of these organizations and identify the specific opportunities and roles that are available to them as volunteers, and as professionals. Special attention will be given to understanding due diligence, accountability and qualitative and quantitative mechanisms for measuring impact.", "name": "Special Topics in Global Health", "section": "22", "location": "TBA", "topic": "Achieving Global Impact through Local Engagement", "course": "390-0", "meeting_time": ["Mo 6:00PM - 9:00PM"], "path": "/class-descriptions/4660/WCAS/GBL_HLTH/390-0/33933", "instructor": ["Michael W Diamond"], "class_attributes": "No Freshmen<br/><br/>", "id": "33933", "subject": "GBL_HLTH"}, {"school": "WCAS", "overview_of_class": "Native Americans experience significant disparities in health and in access to health care. This course introduces students to Native American health by exploring the social, cultural, political, and environmental determinants influencing Native health both historically and today. This course is a reading intensive, discussion-based seminar, drawing upon research and contributions from a variety of disciplines including anthropology, sociology, history, American Indian studies, population and public health, and medicine. Some seminar topics will include Native medicine, infectious diseases and the Columbian Exchange, Federal obligations to Native communities, substance abuse, intergenerational/historic trauma, environmental health, and indigenous health globally.", "name": "Special Topics in Global Health", "section": "23", "location": "Parkes Hall 215", "topic": "Native American Health", "course": "390-0", "meeting_time": ["Tu 9:00AM - 11:50AM"], "path": "/class-descriptions/4660/WCAS/GBL_HLTH/390-0/33934", "instructor": ["Margaret Ellen Pollak"], "class_attributes": "No Freshmen<br/><br/>", "id": "33934", "subject": "GBL_HLTH"}]