[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "Cresap Laboratory 101"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Registration reserved for undergraduates who have taken and passed LING270 or LING370, graduate students, or permission of instructor.", "qtr": "Spring 2017", "name": "30943", "title": "WCAS LING 371-0-20 Reference", "class_attributes": "Formal Studies Distro Area<br/><br/>", "section": "30943", "instructors": [{"instructor_phone": "847/491-8055", "instructor_name": "Gregory L Ward", "instructor_addr": "2016 Sheridan Rd., Room 203"}], "topic": "", "course": "371-0", "descriptions": [{"name": "Overview of class", "value": "An interdisciplinary investigation of reference from a philosophical/linguistic/psychological perspective, with the goal of explaining how speakers produce (and hearers comprehend) contextually-appropriate referring expressions in natural language. More generally, theories of reference attempt to answer the two interrelated questions: how do we acquire knowledge of the world through language? and what is the nature of the relationship between language and reality? Specific topics to be covered include: (in)definiteness, genericity, deixis/indexicality, the referential/attributive distinction, deferred reference, and anaphora."}, {"name": "Registration Requirements", "value": "PREREQUISITES: a course in linguistic meaning (e.g., LING 270, 370, 372), a course in the philosophy of language (e.g., PHIL 353), or permission of Instructor. ATTENDANCE AT FIRST CLASS MANDATORY."}, {"name": "Learning Objectives", "value": "To understand current theoretical issues in reference specifically and, more broadly, the philosophy of language, with the goal of explaining the basic principles of reference, i.e. how speakers can refer to the same object in real time using different linguistic expressions, and how the same linguistic expression can be used to refer to different objects on different occasions."}, {"name": "Teaching Method", "value": "Discussion format with some lecture. Each student will lead 1-2 class discussions."}, {"name": "Evaluation Method", "value": "Several reaction papers and a term paper on a topic chosen in consultation with the instructor."}, {"name": "Class Materials (Required)", "value": "Reference by Barbara Abbott. 2010. Oxford University Press; ISBN #978-0-19-920345-1 and an on-line course reading packet."}], "lmod": "2/21/17 6:49 PM (CT)", "subject": "LING"}]