[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "Harris Hall L06"}], "school": "WCAS", "overview_of_class": "This course presents an overview of how archaeology and cultural heritage have been employed for various political agendas in the Middle East since the 19th century. Although it was first introduced to the region as a colonial enterprise by European powers, the discipline of archaeology became a pivotal tool for the local populations of the Middle East to construct new histories and identities during the period of intensive nation building after the dissolution of the Ottoman Empire. To understand this process, we will first look at the establishment of archaeological practice in the late Ottoman Empire as a foreign and elite practice. Then we will move on to individual case studies in Turkey, Iraq, Egypt, and Israel to understand the role of archaeology and cultural heritage in the formation of these countries as modern nation-states with a shared identity. Finally, we will try to answer questions like \"What do pharaohs mean to modern Egyptians? Who suggested that Hittites were the ancestors of Turks? Why do modern Assyrian Christians still celebrate ancient festivals? How do archaeological projects in Israel-Palestine attempt to verify Biblical texts? Why did Saddam Hussein consider himself the last Babylonian king?\" The course will also include a field trip to the Oriental Institute Museum of the University to Chicago.", "qtr": "Spring 2016", "name": "Advanced Topics in Middle East & North African Studies", "title": "WCAS MENA 390-4-20 Advanced Topics in Middle East &amp; North African Studies", "lmod": "4/3/16 8:12 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Oya   Topcuoglu", "instructor_addr": ""}], "topic": "Archaeology, Cultural Heritage & Politics in the M", "course": "390-4", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "This course presents an overview of how archaeology and cultural heritage have been employed for various political agendas in the Middle East since the 19th century. Although it was first introduced to the region as a colonial enterprise by European powers, the discipline of archaeology became a pivotal tool for the local populations of the Middle East to construct new histories and identities during the period of intensive nation building after the dissolution of the Ottoman Empire. To understand this process, we will first look at the establishment of archaeological practice in the late Ottoman Empire as a foreign and elite practice. Then we will move on to individual case studies in Turkey, Iraq, Egypt, and Israel to understand the role of archaeology and cultural heritage in the formation of these countries as modern nation-states with a shared identity. Finally, we will try to answer questions like &quot;What do pharaohs mean to modern Egyptians? Who suggested that Hittites were the ancestors of Turks? Why do modern Assyrian Christians still celebrate ancient festivals? How do archaeological projects in Israel-Palestine attempt to verify Biblical texts? Why did Saddam Hussein consider himself the last Babylonian king?&quot; The course will also include a field trip to the Oriental Institute Museum of the University to Chicago."}, {"name": "Teaching Method", "value": "The course is based primarily on lectures, which will be supplemented by classroom discussion focusing on assigned readings. The students are also required to participate in collaborative projects, such as building a glossary, writing a Wikipedia article, and making a poster presentation on a topic of their own choice."}, {"name": "Evaluation Method", "value": "Students are required to attend all classes and do all assigned reading prior to class. One sentence summaries or one minute essays will be assigned periodically at the beginning of a class to assess the general level of learning. There will be regular class discussions based on assigned readings. Students' contribution to these discussions will determine the participation aspect of their overall grade for the course. Students are expected to demonstrate that they have done the reading and to support their arguments with evidence from the lectures and readings.<br/>There are no midterm and final exams. Three research projects (group Wiki, group poster, individual paper) are required for the successful completion of the course."}, {"name": "Class Materials (Required)", "value": "Readings consist of individual articles and book chapters. All readings will be made available in pdf format on Canvas. There will also be a library reserve for the course."}], "path": "/class-descriptions/4620/WCAS/MENA/390-4/38376", "instructor": ["Oya   Topcuoglu"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "38376", "subject": "MENA"}]