[{"school": "WCAS", "overview_of_class": "How do we know what we know about India? How do residents of India themselves know what they know about the vast land they inhabit, with its various sub-cultures and ethnic groups? As a perennially popular literary genre, travel writing has played a prominent role in the production of this knowledge. In this course, we will read travel writing on and from South Asia to ask how it produces representations of India and offers it to readers for consumption. Course materials will include both historical travel writing from authors like Mark Twain, Rabindranath Tagore and Queen Sikandar Begum, as well as more contemporary works like Eat, Pray, Love as well as representations of travel in other media, such as the like Queen (2013). By the end of the course, students should have a clear understanding of the place of travel writing in modern literature on India, and how this genre has helped structure the way we know this region today.", "name": "Advanced Topics in Asian Languages and Cultures", "section": "20", "location": "Harris Hall L28", "topic": "Travel Writing and Modern India", "course": "390-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4650/WCAS/ASIAN_LC/390-0/22404", "instructor": ["Daniel Joseph Majchrowicz"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "22404", "subject": "ASIAN_LC"}, {"school": "WCAS", "overview_of_class": "The Japanese city is the main site of Japanese modernity and of its contradictions. As in many other places with leaders determined to modernize quickly, the prewar Japanese government systematically stripped the countryside of resources in order to build and display the central institutions of a modern nation, most of which were in the cities. These developments recast Tokyo as the epitome of Japan's modern success in economic and political terms and as the site of its cultural and social disintegration. Tokyo and nearly all Japanese cities then were virtually leveled during World War II. After the war, the newly reconstructed cities became the central arenas for Japanese efforts to create democracy. <br/><br/>This co-taught course examines the cultural representations of the modern Japanese city from its construction to its destruction and then regeneration. We will study the ways Japanese transformed Tokyo into an imperial capital and then recast it as a space for new forms of political and social relationships after the war. Throughout its history, Tokyo has been Japan's central site for defining and redefining class and gender identities as well as participating in mass consumption. We will consider how authors and filmmakers represented individual and collective experiences of urban life and the ways that urban space shaped the very form and possibilities of life in modern Japan.", "name": "Advanced Topics in Asian Languages and Cultures", "section": "21", "location": "Locy Hall 301", "topic": "The Modern Japanese City", "course": "390-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4650/WCAS/ASIAN_LC/390-0/22405", "instructor": ["Laura E Hein", "Patrick James Noonan"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "22405", "subject": "ASIAN_LC"}, {"school": "WCAS", "overview_of_class": "The Mughal Empire (1526-1857) is widely remembered as one of the most powerful, opulent empires of the early modern world, renowned both for the atmosphere of cultural pluralism that it promoted as well as the magnificient monuments (such as the famed Taj Mahal) that it produced. Less well known, however, are the remarkably rich - and remarkably diverse - literary cultures that the Mughal court promoted, and which saturated the cultural, political, and religious life of early modern India more generally. This course will introduce students to some of the basic features of these intersecting Indo-Persian, Sanskrit, and Hindi-Urdu literary worlds (in translation, of course), as well as to their lasting - and sometimes controversial - legacies in modern South Asian culture and politics, from British India to Bollywood.", "name": "Advanced Topics in Asian Languages and Cultures", "section": "22", "location": "Fisk Hall 114", "topic": "Literary Cultures of Mughal India", "course": "390-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4650/WCAS/ASIAN_LC/390-0/27548", "instructor": ["Rajeev Kumar Kinra"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "27548", "subject": "ASIAN_LC"}]