[{"class_mtg_info": [{"meet_t": "Fr 9:00AM - 11:50AM", "meet_l": "Harris Hall L04"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-registration - Reserved for Political Science students.", "qtr": "Spring 2017", "name": "35413", "title": "WCAS POLI_SCI 390-0-21 Special Topics in Political Science", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "35413", "instructors": [{"instructor_phone": "8474912648", "instructor_name": "Hendrik   Spruyt", "instructor_addr": "601 University Place # 316"}], "topic": "Variations in International Order", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "POLI SCI 390-0-21 Spring 2017 &quot;Variations in Regional Order&quot; Prof. Hendrik Spruyt<br/>The seminar will examine various forms of international order. It will take both a historical and a contemporary look at how states and non-state actors have constructed &quot;rules of the game&quot; to facilitate trade, foster peace, and engage in cultural interaction. We will primarily look at Western centered orders but to some extent also at non-Eurocentric systems. The historical analyses will reveal a variety of modes of how such stable orders might be created. The contemporary focus will turn to examining the international order as it emerged after 1945 in a variety of issue areas, such as trade, security, and international norms. Finally, we will examine whether changes might occur given the rise of new states and relative shifts in power, particularly with regards to China"}, {"name": "Registration Requirements", "value": "Intro IR , Poli Sci 240 required"}, {"name": "Learning Objectives", "value": "&quot;The student will work closely with the professor to complete a final review paper in addition to writing and presenting several shorter papers during the quarter. The course has several objectives: <br/>1) learn how to write and critically evaluate some of the key scholarly works.<br/>2) develop a clearer understanding of how to evaluate different theoretical points of view<br/>3) familiarize oneself with how to present one's own point of view in a public forum and respond to critique and questions (Note critique is not simply criticism.)<br/>4) acquire a basic knowledge of some of the key scholarly work in this area<br/><br/>&quot;"}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Two short papers will each count for 1/6 of the final course grade (thus 1/3 of the total); class participation and discussant's role will similarly account for 1/3. The final 1/3 of the course grade will be based on the critical review essay."}, {"name": "Class Materials (Required)", "value": "1) Keohane, Robert, ed. Neorealism and Its Critics. Columbia UP, 1986<br/>2) Gilpin, Robert, War and Change in World Politics, Cambridge, 1981<br/>3), Ikenberry, John, After Victory,Princeton UP, 2001.<br/>4) Bull, Hedley, The Anarchical Society, New York: Columbia UP, 1977<br/>5) Kang, David, East Asia before the West, Columbia UP, 2010<br/>6) Zakaria, Fareed, From Wealth to Power, Princeton 1998.<br/><br/>All are paperbacks."}], "lmod": "2/13/17 6:47 PM (CT)", "subject": "POLI_SCI"}]