[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "University Hall 101"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: REASON: Pre-registration is not allowed for this class. Please try again during regular registration.", "qtr": "Spring 2017", "name": "33426", "title": "WCAS ENGLISH 306-0-20 Advanced Poetry Writing", "class_attributes": "", "section": "33426", "instructors": [{"instructor_phone": "847/467-1066", "instructor_name": "William Reginald   Gibbons Jr", "instructor_addr": "University Hall 215"}], "topic": "Theory &amp; Practice of Poetry Translation", "course": "306-0", "descriptions": [{"name": "Overview of class", "value": "A combination of seminar and workshop. Together we will translate several short poems and study theoretical approaches to literary translation and practical accounts by literary translators. We will approach language, poems, poetics, culture and theoretical issues and problems in relation to each other. Your written work will be due in different forms during the course. In your final portfolio, you will present revised versions of your translations and a research paper on translation.<br/><br/>Prerequisite: A reading knowledge of a second language and experience reading literature in that language. If you are uncertain about your qualifications, please e-mail the instructor at rgibbons@northwestern.edu to describe them. Experience writing creatively is welcome, especially in poetry writing courses in the English Department."}, {"name": "Teaching Method", "value": "Discussion; group critique of draft translations; oral presentations by students."}, {"name": "Evaluation Method", "value": "Written work (&quot;Canvas&quot; responses to reading, draft translations, revised translations, and final papers) as well as class participation should demonstrate students' growing understanding of translation as a practice and as a way of reading poetry and engaging with larger theoretical ideas about literature."}, {"name": "Class Materials (Required)", "value": "Essays on translation by a number of critics, scholars and translators, in two published volumes and on the Course Management web site (&quot;Canvas&quot;)."}, {"name": "Class Notes", "value": "The above course is combined with COMP_LIT 311-0 and COMP_LIT 414-0. If the ENGLISH side of the course is full, you may register for the course under the co-listed department and receive the same credit toward your English major."}], "lmod": "2/14/17 6:44 PM (CT)", "subject": "ENGLISH"}]