[{"class_mtg_info": [{"meet_t": "MoWe 5:00PM - 6:20PM", "meet_l": "Meets in Non-General PurposeRm"}], "school": "MEAS", "enrl_requirement": "Enrollment Requirements: Students must have taken BMD_ENG 327-0 in order to register for this course.", "qtr": "Spring 2017", "name": "30580", "title": "MEAS BMD_ENG 427-0-20 Advanced MR Imaging", "class_attributes": "", "section": "30580", "instructors": [{"instructor_phone": "", "instructor_name": "Michael   Markl", "instructor_addr": ""}], "topic": "", "course": "427-0", "descriptions": [{"name": "Overview of class", "value": "Theory, design, and applications of pulse sequences and Magnetic Resonance Imaging.<br/><br/>This is a project based course in the use of MRI for imaging living tissue. The flexibility of MRI to determine image contrast through altering pulse sequences results in MR being used in a broad range of clinical applications. This course will develop an understanding of the use and design of MR techniques and pulse sequences, image reconstruction, and advanced MRI data analysis concepts. The course will be split into three sections: The first section will revisit fundamentals and basic concepts of MRI and their applications to disease diagnosis. The second section will cover the some of the more widely used MR image acquisition strategies and applications areas. The state of the art in MRI will be present by faculty guest lectures. Finally, each student will select a project (Matlab based development or literature review). The course will culminate with a series of student presentations that will consist of 40-minute literature review seminars or project pretentions which will count as a final project."}, {"name": "Registration Requirements", "value": "Doctoral and Masters Degree students. Advanced Undergraduate students may register with permission of the instructor."}, {"name": "Learning Objectives", "value": "Revisit Fundamentals of MRI<br/> MRI Image Formation and Pulse Sequences<br/> Hands-on MRI Imaging on Human MRI Systems<br/> Fast Imaging, Imaging Accelration and Reconstuction<br/> Flow and Motion<br/> Cardiovasular MRI<br/> Functional MRI"}, {"name": "Class Materials (Suggested)", "value": "&quot;Magnetic Resonance Imaging, Principles and Sequence Design&quot;, Haacke et al.<br/> &quot;Principles of Magnetic Resonance Imaging, A Signal Processing Perspective&quot;, by Liang and Lauterbur.<br/> &quot;Magnetic Resonance Imaging&quot;, by Vlaardingebroek and den Boer."}], "lmod": "2/9/17 6:34 PM (CT)", "subject": "BMD_ENG"}]