[{"school": "WCAS", "overview_of_class": "Often described as one of the most dominant cultural forces this world has seen, Hip-hop occupies a paradoxical space within the Western cultural imagination. It is positioned as both a bastion of incisive social, economic, and political criticism and a primary venue for misogyny, homophobia, hypermasculinity, and gross consumerism. In light of this paradoxical position, this course considers black feminist critiques of the abovementioned issues, traces the formation of \"Hip-hop feminist\" criticism, and interrogates issues central to Hip-hop feminism, including the representation and performance of race, class, gender and sexuality in Hip-hop; the pleasures, dangers, and contradictions inherent in a Hip-hop feminist politics; and the sexual economies produced by and within Hip-hop Culture (e.g., strip club culture, sex tape culture, and Hip-hop pornography), among other issues. Students will leave the course with a firm understanding of the histories of Hip-hop Culture, particularly music, film, and literature, black and Hip-hop feminisms, and performance in the contemporary U.S., as well as key concepts in studies of race and representation, black feminisms, black sexuality, and literary and cultural studies <br/><br/>We will consider texts in a wide variety of mediums, including films such as My Mic Sounds Nice: The Truth About Women in Hip-hop, Pariah, and Straight Outta Compton, television episodes of Love & Hip Hop: Atlanta and Empire, music videos by Nicki Minaj, Tink, and The Internet, music by Lil' Kim and FKA Twigs, and fiction by Joan Morgan and Sister Souljah.", "name": "Gender, Sexuality, and Popular Culture", "section": "20", "location": "University Hall 118", "topic": "Hip Hop Culture and Black Feminisms", "course": "371-0", "meeting_time": ["MoWe 11:00AM - 12:20PM"], "path": "/class-descriptions/4620/WCAS/GNDR_ST/371-0/31115", "instructor": ["Shoniqua   Roach"], "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "id": "31115", "subject": "GNDR_ST"}]