[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Technological Institute L160"}], "school": "MEAS", "overview_of_class": "<p>Fundamentals of surface contact: surface topography, asperity contact, interfacial phenomena. Friction theories and wear mechanisms. Temperatures in sliding contacts. Hydrodynamic, hydrostatic, elastohydrodynamic and boundary lubrication.</p><br/><p>Surface failure due to rubbing is a critical problem that affects the life and reliability of modern machinery. The knowledge of surface interaction is essential to mechanical and material designs. This course is taken by students from Mechanical Engineering, Civil Engineering, and Material Sciences.</p>", "qtr": "Fall 2017", "name": "Introduction to Tribology", "title": "MEAS MECH_ENG 346-0-1 Introduction to Tribology", "lmod": "9/12/17 6:43 PM (CT)", "section": "1", "topic": "", "course": "346-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "<p>Fundamentals of surface contact: surface topography, asperity contact, interfacial phenomena. Friction theories and wear mechanisms. Temperatures in sliding contacts. Hydrodynamic, hydrostatic, elastohydrodynamic and boundary lubrication.</p><br/><p>Surface failure due to rubbing is a critical problem that affects the life and reliability of modern machinery. The knowledge of surface interaction is essential to mechanical and material designs. This course is taken by students from Mechanical Engineering, Civil Engineering, and Material Sciences.</p>"}, {"name": "Learning Objectives", "value": "<p>Introduction to Tribology is a cross-disciplinary course that introduces the basic principles of tribology to engineering students. The course focuses on phenomena of friction and wear caused by the relative motion between interacting elements, basic principles of lubrication, and tribological designs of elements and systems. The goal of the course is to introduce the tribological aspect of mechanical systems.</p> <br/>It includes: <br/>Understanding the surface phenomena related to relative motion, the nature of friction and mechanisms of wear. <br/>Studying engineering problems related to friction, wear, and lubrication. <br/>Learning basic skills for tribological analyses. <br/>Practicing tribological design of mechanical elements and systems. <br/><p>The approach of the course is to integrate theories with student research and design. Theories and principles will be introduced through lectures. Instruments and experimental apparatus for tribology will be introduced through laboratory visits and homework exercises.</p>"}, {"name": "Evaluation Method", "value": "A research-design project will be assigned."}, {"name": "Class Materials (Suggested)", "value": "Reference books: <br/><br/>Tribology, Principles and Design Applications, by Arnell et al. <br/>Fundamentals of Machine Elements, by Hamrock, Jacobson, and Schmid <br/>Principles and Applications of Tribology, by B. Bhushan <br/>Tribology Handbook, by B. Bhushan <br/>Fluid Film Lubrication, By B. Hamrock"}, {"name": "Class Notes", "value": "http://www.mech.nwu.edu/dept/courses/index.html"}], "instructor": ["Qian   Wang"], "class_attributes": "", "id": "17372", "subject": "MECH_ENG"}]