[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Kresge Centennial Hall 2-415"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "13880", "title": "WCAS PHIL 330-0-20 Practical Reasoning and Choice", "class_attributes": "", "section": "13880", "instructors": [{"instructor_phone": "847/491-2555", "instructor_name": "Fabrizio   Cariani", "instructor_addr": "Crowe 1-113"}], "topic": "", "course": "330-0", "descriptions": [{"name": "Overview of class", "value": "Suppose I am deliberating whether or not buy a plane ticket to visit an exotic country. Would I be rational to do so? Obviously, we have not said enough to answer this question. We can however ask a different, broader, question: what general principles and what sorts of information are required to determine whether or not my buying the ticket is a rational choice? This course will explore answers to this question, with special attention to their philosophical underpinnings. The course has three parts: Part I : we will motivate and develop a framework that philosophers (as well as gamblers, economists, mathematicians and computer scientists) have used to represent various theories of rational-decision making. This framework is probabilistic, but it will be a central concern to introduce it without presupposing more than high-school algebra and elementary logic (of the sort one learns in Phil 150). Part II: we will elaborate on puzzles and paradoxes that have arisen surrounding the various theories of rational decision (we focus in particular on two famous paradoxes: Newcomb's paradox and the Allais paradox) Part III: we will study the works of major philosophers (B. Pascal, D. Davidson, D. Lewis, F. Jackson) with an eye to questions regarding the philosophical significance of decision theory. Can a decision-theoretic argument be given for religious belief (as Pascal suggested)? What is the relation between decision-theory and ethics? Can the concept of rationality captured by decision-theory help us understand the concepts of belief, desire and preference?"}, {"name": "Learning Objectives", "value": "By the end of class, students will be expected to have acquired the key ideas of Bayesian Decision Theory; they will be aware of its varieties, as well as its problems and potential philosophical implications."}, {"name": "Teaching Method", "value": "Lecture"}, {"name": "Evaluation Method", "value": "weekly homework, a take home mid-term, a take-home exam and a final paper. The take-home exams will consist mosty in short (1 page) essays that are intended to form the basis for the final paper."}, {"name": "Class Materials (Required)", "value": "Title: Making Better Decisions: Decision Theory in Practice Author: Itzhak Gilboa Publisher: Wiley Blackwell ISBN-13: 978-1444336528"}], "lmod": "10/30/16 7:08 PM (CT)", "subject": "PHIL"}]