[{"class_mtg_info": [{"meet_t": "Th 6:15PM - 9:15PM", "meet_l": "Wieboldt Hall 247"}], "school": "SCS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "38051", "title": "SCS MKTG 390-CN-16 Topics In Marketing:", "class_attributes": "", "section": "38051", "instructors": [{"instructor_phone": "", "instructor_name": "Michael Kevin Shmarak", "instructor_addr": ""}], "topic": "Introduction to Public Relations", "course": "390-CN", "descriptions": [{"name": "Overview of class", "value": "Public relations is a core management function for every type of organization, whether public or private. Public relations spans a wide range of marketing disciplines including media relations, corporate reputation, community affairs, issues/crisis management, investor relations, and government affairs. PR is one of the primary tools used to reinforce a company's brand and support its competitive position. Students learn the essential components of an effective PR strategy; how to evaluate and manage outside PR counsel; essentials of media relations and crisis management; and how to draft PR messages. Students select a &quot;beat&quot; or coverage area to investigate as part of the class homework projects. This course involves heavy writing; it may not be audited. This course is cross-listed as ADVT 370-CN."}, {"name": "Registration Requirements", "value": "This course involves heavy writing; it may not be audited."}, {"name": "Learning Objectives", "value": "In taking this class, you will learn:<br/>-the essential components of an effective PR strategy; <br/>-how to evaluate and manage outside PR counsel; <br/>-where and how social media influences traditional PR programming;<br/>-essentials of media relations and crisis management; and <br/>-how to draft PR messages."}, {"name": "Class Materials (Required)", "value": "Texts may include the following. Visit the campus bookstore or its website to confirm materials for the course:<br/><br/>PRACTICE OF PUBLIC RELATIONS | Edition: 12TH<br/>Author: SEITEL <br/>ISBN: 978-0133083576 <br/><br/>You will also be asked to read the business sections of Chicago's top media outlets (e.g., CHICAGO TRIBUNE, CRAIN'S CHICAGO BUSINESS, CHICAGO SUN-TIMES)"}], "lmod": "2/19/17 6:43 PM (CT)", "subject": "MKTG"}]