[{"class_mtg_info": [{"meet_t": "We 3:00PM - 5:50PM", "meet_l": "Parkes Hall 213"}], "school": "SoC", "enrl_requirement": "", "qtr": "Spring 2017", "name": "33042", "title": "SoC COMM_ST 394-0-21 Communication Studies Research Seminar", "class_attributes": "Department Majors Only<br/><br/>Juniors/Seniors Only<br/><br/>", "section": "33042", "instructors": [{"instructor_phone": "", "instructor_name": "Jiawei   Fu", "instructor_addr": ""}], "topic": "Social Networks and Society", "course": "394-0", "descriptions": [{"name": "Overview of class", "value": "The proliferation of information and communication technologies (e.g., social networking sites such as Facebook and Twitter) has connected people at an unprecedented level. For example, &quot;six degrees of separation&quot; (a.k.a. small world phenomena) suggests that individuals can be connected with any other individuals via six intermediaries. However, recent research suggests that individuals on Facebook can be connected via about four intermediaries. Social networks play an important role in our understanding of a wide array of human phenomena, including interpersonal interaction, organizational communication, political campaigns, public health, and social movement. Trends suggest that new networked forms of self-organizing are emerging and evolving. This course will introduce theories for analyzing and understanding how social actors (e.g., individuals, organizations, and even texts) are connected via social networks. We will review scholarship on social networks across a wide array of disciplines in order to gain insight into their structures and dynamics. We will examine how psychological, cognitive, economic, social, cultural, political, and technological factors influence our networked society. In addition, we will critically evaluate the impact of social networks on relationships, activism, management, marketing, politics, and media. Topics of this course include the antecedents (the &quot;why&quot; question), processes (the &quot;how&quot; question), and outcomes (the &quot;what&quot; question) of social networks in a variety of fields. Students will read classic and cutting edge articles and book chapters about these topics and discuss their implications. In addition, through weekly writing exercises culminating in a final research paper (15 - 20 pages) at the end of the quarter, students will learn to articulate and defend a position about the role of social networks in the networked age. In service of this goal, this class will provide an overview of the mechanics of writing a research paper. Topics covered will include how to locate and use academic source material, how to make and defend claims, how to incorporate peer reviews, and how to organize a research paper."}, {"name": "Class Materials (Required)", "value": "No textbook."}], "lmod": "2/16/17 6:38 PM (CT)", "subject": "COMM_ST"}]