[{"class_mtg_info": [{"meet_t": "MoTuThFr 4:00PM - 4:50PM", "meet_l": "Technological Institute M128"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "23356", "title": "WCAS GERMAN 101-1-27 Beginning German", "class_attributes": "", "section": "23356", "instructors": [{"instructor_phone": "8474918081", "instructor_name": "John   Paluch", "instructor_addr": "1800 Sherman, Suite 106, Room 103"}], "topic": "", "course": "101-1", "descriptions": [{"name": "Overview of class", "value": "This is the first quarter of the Beginning German sequence: a systematic introduction to basic German. All four language skills - speaking, listening comprehension, reading and writing- are stressed to insure that students acquire a basic command of German. Classes are conducted in German, except when explanations of grammar or other material require the use of English. Key features of this quarter: 1) short individual interviews at the end of the quarter and 2) cultural focus on Germany."}, {"name": "Registration Requirements", "value": "This is a beginning level course. If you have acquired some previous knowledge of German in high school, spoken German at home, or learned German abroad, you are required to take a placement exam. Please consult the university's web page in order to access the test at http://placement-test.mmlc.northwestern.edu or speak with the John Paluch paluch@northwestern.edu."}, {"name": "Learning Objectives", "value": "Students will be prepared to enroll in a 2-unit intensive course during Spring quarter. German 101-2 and German 101-3 will be offered together in Spring 2014 as an intensive 2-unit course. Students will have basic conversational skills, be able to ask and answer simple questions about themselves, will be able to describe people and clothing and activities and will have a basic understanding of the following grammatical concepts: present tense, the present perfect tense, the nominative and accusative cases, the use of modal verbs and"}, {"name": "Teaching Method", "value": "Class participationLabListening exercisesReadingsSimulation / role-playWriting assignments"}, {"name": "Evaluation Method", "value": "AttendanceClass participationExam, final: Final oral interview<br/>ExamsHomeworkListening exercisesQuizzesWriting assignments"}, {"name": "Class Materials (Required)", "value": "Kontakte 7th edition McGraw Hill <br/><br/>Kontakte Workbook"}, {"name": "Class Materials (Suggested)", "value": "Three ring binder and paper for notes and hand-out materials"}], "lmod": "1/9/16 6:47 PM (CT)", "subject": "GERMAN"}]