[{"class_mtg_info": [{"meet_t": "Tu 6:15PM - 9:15PM", "meet_l": "Wieboldt Hall 413"}], "school": "SCS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "27537", "title": "SCS BIOL_SCI 316-CN-14 Human Structure and Function", "class_attributes": "", "section": "27537", "instructors": [{"instructor_phone": "", "instructor_name": "Brian T Shea", "instructor_addr": ""}], "topic": "", "course": "316-CN", "descriptions": [{"name": "Overview of class", "value": "Students will gain a good working knowledge of the function of the musculoskeletal system in modern humans in this course, along with a comparative perspective emphasizing the adaptive contexts of the evolutionary transformations leading to our modern anatomy. The course examines the structural, functional, and evolutionary anatomy of humans, with primary focus on the musculoskeletal system of the postcranium. The regional anatomy of the muscles, bones and joints in the human body serves as a basis for more general biomechanical principles of anatomical systems. Discussions of the development evolution and clinical significance of human structure complement the functional emphasis on these anatomical regions. Class lectures are supplemented by selected prosections of human cadavers, in-class lab sessions examining bones and models, and computer animations and exercises."}, {"name": "Registration Requirements", "value": "Prerequisite: BIOL SCI 313, equivalent anatomy course, or permission of instructor. Class is limited to 15 students. Check with instructor if you are unsure about your background or course suitability."}, {"name": "Learning Objectives", "value": "This introductory course is designed to provide an integrated understanding of the structure and function of the postcranial musculoskeletal system. Muscles and bones for each subregion are learned in the context of movements at key joints, along with primary biomechanical and loading inputs. Common clinical conditions are reviewed in order to aid the student in understanding related structural issues in each area."}, {"name": "Teaching Method", "value": "Lectures are regularly supplemented by in-class small group work using skeletons and models, completing special exercises (movements, biomechanics, etc.), working through imaging and clinical case study modules, and undertaking surface anatomy examinations. Weekly out-of-class exercises and the viewing of digital dissection anatomy resources are required."}, {"name": "Evaluation Method", "value": "Midterm and Final Examinations<br/>In-class and Out-of-Class Exercises <br/>Paper"}, {"name": "Class Materials (Required)", "value": "Texts may include the following. Visit the campus bookstore or its website to confirm materials for the course. <br/><br/>Floyd, R.T. (2012 ) Manual of Structural Kinesiology, 18th ed. .<br/><br/>Short readings may accompany text assignments for certain weeks.<br/><br/>On-line and digital resources complement the readings."}], "lmod": "12/24/16 6:49 PM (CT)", "subject": "BIOL_SCI"}]