[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "University Hall 122"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-registration - Reserved for English students.", "qtr": "Spring 2017", "name": "33286", "title": "WCAS ENGLISH 332-0-20 Renaissance Drama", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "33286", "instructors": [{"instructor_phone": "", "instructor_name": "Rebecca Lynn Fall", "instructor_addr": ""}], "topic": "Bad Girls in Renaissance Drama", "course": "332-0", "descriptions": [{"name": "Overview of class", "value": "Anxiety about &quot;bad girls&quot; and rebellious women has a very long history. We have all heard the old question: why do &quot;good girls&quot; go &quot;bad&quot;? But what makes a woman &quot;good&quot; or &quot;bad&quot; in the first place? What is a &quot;bad girl,&quot; anyway? This course will examine dramatic representations of unruly, cruel, and otherwise tough women as they appear in Renaissance English drama. We may consider the luxurious sexuality of Cleopatra in Shakespeare's Anthony and Cleopatra or the stubborn independence?and abusive &quot;taming&quot;?of Katherine in The Taming of the Shrew; the cross-dressing, hard-drinking, gutter-dwelling Moll Cutpurse in Middleton and Dekker's The Roaring Girl; and/or the incestuous Annabella in Ford's 'Tis Pity She's a Whore. We will focus on Renaissance texts, but will also ask what &quot;bad girls&quot; on the seventeenth-century stage can teach us about the performance of female rebelliousness today by regularly assessing their similarities and dissimilarities from present-day narratives, including Rihanna's self-presentation as &quot;Bad Gal Riri&quot; and the tragicomic tales of incarcerated women in Netflix's Orange is the New Black."}, {"name": "Teaching Method", "value": "Seminar discussion and occasional short lectures."}, {"name": "Evaluation Method", "value": "Regular short writing assignments; two essays; class participation."}, {"name": "Class Materials (Required)", "value": "Potential plays include: Shakespeare, Antony &amp; Cleopatra and/or Macbeth, and/or The Taming of the Shrew; Fletcher, The Woman's Prize, or The Tamer Tamed; Webster, The Duchess of Malfi; Middleton &amp; Dekker, The Roaring Girl; Ford, 'Tis Pity She's a Whore; Middleton &amp; Rowley, The Changeling."}, {"name": "Class Notes", "value": "The above course is combined with GNDR_ST 361-0. If the ENGLISH side of the course is full, you may register for the course under the co-listed department and receive the same credit toward your English major."}], "lmod": "2/6/17 6:42 PM (CT)", "subject": "ENGLISH"}]