[{"school": "WCAS", "overview_of_class": "Genetics and evolution is an introductory course that provides and overview of the evolutionary process to non-science majors. No college-level background in biology is necessary. In this course we will learn about the topics of Mendelian, molecular and population genetics, as well as the underlying biological processes. Both the basic principles and current commercial and medical applications of genetics and evolution will be explored throughout the course. Students will discuss common ethical issues and public misconceptions surrounding evolution and critically evaluate these ideas in light of scientific evidence.", "name": "Genetics and Evolution", "section": "1", "location": "Technological Institute L158", "topic": "", "course": "164-0", "meeting_time": ["MoWeFr 4:00PM - 4:50PM"], "path": "/class-descriptions/4620/WCAS/BIOL_SCI/164-0/32136", "instructor": ["Kyle Patrick Obergfell"], "class_attributes": "Natural Sciences Distro Area<br/><br/>", "id": "32136", "subject": "BIOL_SCI"}, {"school": "WCAS", "overview_of_class": "Evolution is the unifying force of all modern biology. In this course, we will delve into some of the many sources of evidence that life on Earth has changed over time. We will also investigate natural selection - the explanation for the evolution of life which was first described by Charles Darwin and Alfred Wallace in 1858. Additionally, this course is meant to explore the relevance of evolution not just to biology, but also to us as human beings and as members of a society that has been grappling with perceived and real implications and integration of evolutionary thought.", "name": "Genetics and Evolution", "section": "2", "location": "Technological Institute F281", "topic": "", "course": "164-0", "meeting_time": ["MoWeFr 4:00PM - 4:50PM"], "path": "/class-descriptions/4620/WCAS/BIOL_SCI/164-0/37785", "instructor": ["Matthew Thomas Henke"], "class_attributes": "Natural Sciences Distro Area<br/><br/>", "id": "37785", "subject": "BIOL_SCI"}]