[{"class_mtg_info": [{"meet_t": "Mo 10:00AM - 12:50PM", "meet_l": "Sound Tank Comp Lab - RTVF FSL"}], "school": "SoC", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Fall 2016", "name": "17812", "title": "SoC SAI 501-0-20 Introduction to Sound Production", "class_attributes": "", "section": "17812", "instructors": [{"instructor_phone": "", "instructor_name": "Stephan Michael Moore", "instructor_addr": ""}], "topic": "", "course": "501-0", "descriptions": [{"name": "Overview of class", "value": "This course covers the central concepts and vocabulary used by sound professionals working across a variety of audio-related professions. The class will be divided into three main sections: 1) acoustics and psychoacoustics, 2) analog audio technology, and 3) digital audio technology. In each section, learning will be reinforced by hands-on demonstrations in the studio and the classroom, and in projects to be completed both in and outside of class."}, {"name": "Registration Requirements", "value": "This class is exclusively for students enrolled in the Sound Arts and Industries MA program."}, {"name": "Learning Objectives", "value": "? to lay the groundwork for a solid understanding of the central concepts of acoustics and audio production<br/>? where possible, to connect these concepts to the cultural, historical, and scientific contexts where they originated, and where they are found today.<br/>? to establish a familiarity with the dominant tools of audio production, in software and hardware, in the studio, in the editing suite, and in the field.<br/>? to familiarize students with the operation and application of all available audio facilities and resources in the Department of Radio, Television, and Film, and beyond."}, {"name": "Evaluation Method", "value": "Class participation, several small projects, 3 mini-exams, and a final project."}, {"name": "Class Materials (Suggested)", "value": "USB drive, deposit required for studio keys. Students may be asked to acquire materials for some class assignments, the total cost of which will not exceed $25 over the course of the quarter."}], "lmod": "10/30/16 6:51 PM (CT)", "subject": "SAI"}]