[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "University Hall 312"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "34405", "title": "WCAS HISTORY 393-0-22 Approaches to History", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "34405", "instructors": [{"instructor_phone": "847/491-3152", "instructor_name": "Geraldo L Cadava", "instructor_addr": "Harris Hall - Room 210"}], "topic": "What is Transnational History?", "course": "393-0", "descriptions": [{"name": "Overview of class", "value": "Since the 1990s, historical scholarship has taken a &quot;transnational turn,&quot; meaning that historians increasingly work across borders?literally and conceptually?as they craft stories about the past. The transnational historian's core belief is that the history of no nation on earth takes place in a vacuum; all nations have developed through their relationships with others. Therefore, the histories of countries such as the United States, Russia, Great Britain, India, Mexico, and many others in addition, have fundamentally been rewritten in a way that highlights their connections to the rest of the world. The profession's leading journal, The American Historical Review, has published dozens of articles with the word &quot;transnational&quot; in their title. New courses at universities around the globe have emerged, with titles such as &quot;Asia and the World,&quot; &quot;Africa and the World,&quot; the &quot;United States and the World,&quot; and &quot;Insert Name of Country Here and the World.&quot; As historians-in-the-making, your goal in this course is to gain an understanding of what has arguably been the most important scholarly trend in a generation; to assess whether transnational history is new or just the current iteration of older scholarly approaches; and to make sense of the global politics driving transnational history. You will do so by reading theoretical essays about transnational history, and examples of transnational scholarship by historians of the United States, Latin America, Europe, Asia, and other parts of the world."}, {"name": "Teaching Method", "value": "Discussion"}, {"name": "Evaluation Method", "value": "Participation, One Short Paper (5 pgs.), &amp; Final Paper (10 pgs.)"}, {"name": "Class Materials (Required)", "value": "Course Packet"}], "lmod": "2/8/17 6:43 PM (CT)", "subject": "HISTORY"}]