[{"school": "DOHA", "overview_of_class": "<p>The course combines thematic analysis and case studies. Islamists' perceptions of history and nation, religion and politics, and modernity and morality will be discussed, along with on-going debates concerning equality, democracy, women, non-Muslims, citizenship and civil constitutions. The course surveys a wide spectrum of Islamism, from 'moderate' and nonviolent movements such as the Muslim Brotherhood organizations and the Justice and Development Party in Turkey to 'radical' and violent movements such as Al-Qaeda and Hizbullah. The role of the media is also analyzed.</p>", "name": "Topics in Political Science", "section": "70", "location": "Northwestern Qatar Room 2-201", "topic": "Islamism and Politics in the Middle East", "course": "242-0", "meeting_time": ["TuSu 03:30PM - 04:50PM (AST)"], "path": "/class-descriptions/4660/DOHA/POLI_SCI/242-0/30750", "instructor": ["Khaled   Al Hroub"], "class_attributes": "", "id": "30750", "subject": "POLI_SCI"}, {"school": "DOHA", "overview_of_class": "<p>The course examines various aspects of the Arab-Israeli conflict with specific focus on Palestine and the Palestinians. It starts with looking at the history of Zionism and the idea of establishing a Jewish homeland in Palestine; then it moves to discuss the consequences of the implementation of this idea within colonial and postcolonial contexts. Particular importance is given to the Palestine war in 1948, the subsequent creation of Israel, and regional conflicts between Israel and neighbouring Arab countries that have had devastating impacts. Chief among them are the emergence of the Palestinian refugees issue and the lack Palestinian statehood. Following the chronology of the conflict with its war and peace episodes, the course intends to critically discuss conflicting narratives, the role of regional and international players, and the long-lasting ramifications of the conflict that have affected the shape and politics of the Middle East.</p>", "name": "Topics in Political Science", "section": "71", "location": "Northwestern Qatar Room 2-201", "topic": "Palestine and the Arab-Israeli Conflict", "course": "242-0", "meeting_time": ["TuSu 01:30PM - 02:50PM (AST)"], "path": "/class-descriptions/4660/DOHA/POLI_SCI/242-0/30751", "instructor": ["Khaled   Al Hroub"], "class_attributes": "", "id": "30751", "subject": "POLI_SCI"}]