[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "Locy Hall 106"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-registration - Reserved for Political Science students.", "qtr": "Spring 2017", "name": "35419", "title": "WCAS POLI_SCI 390-0-27 Special Topics in Political Science", "class_attributes": "", "section": "35419", "instructors": [{"instructor_phone": "", "instructor_name": "Makram   Abbes", "instructor_addr": ""}], "topic": "War &amp; Peace in Islam", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "POLI SCI 390-0-27 Spring 2017 &quot;War and Peace in Islam&quot;, Prof. Makram ABBES<br/>Often tinged with essentialism, approaching the theme of war in Islam conveys the image of an arbitrary activity subjected only to religion and worried about scrupulously applying commands. By placing us in a perspective which tries to question concepts and locate various forms of rationalities (legal, governmental, economic, etc.) which determined approaches to war, this course aims at deconstructing the notion of &quot;jihâd&quot; to show that its technical sense of military combat followed, according to the texts, authors and historic situations by very complex semantic trajectories, and that this notion could be defined by abstract and contradictory inflections. The study of the plasticity of this notion - which can indicate holy war, just war, terrorism or war led by the partisan (whether he is territorialized or not territorialized) - could greatly contribute to the de-essentialization of the debate on war in Islam, at the same time as it would restore to this theme the place which it deserves within the field of political philosophy by connecting it to the central questions of this discipline, such as the theory of sovereignty, the art of government or the theologico-political problem. Based mainly on legal texts and those of the Mirrors for princes, this course will pay particular attention to the forms of rationalization and the humanization of warrior activity at the classic age of Islam, whether it is through the study of the strategies of peaceful resolution of conflicts (cunning, diplomacy) or from the presence, in these texts, of the fundamental distinction between combatants and noncombatants, which is at the origin of contemporary humanitarian law."}], "lmod": "2/12/17 7:00 PM (CT)", "subject": "POLI_SCI"}]