[{"class_mtg_info": [{"meet_t": "MoTuWeThFr 1:00PM - 1:50PM", "meet_l": "Kresge Centennial Hall 2-325"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Prerequisite: Students must have passed Korean 111-1 with at least a C- or  be placed in according to placement test results.<br/><br/>Prerequisite: Students must have passed Korean 111-1 with at least a C- or  be placed in according to placement test results.", "qtr": "Winter 2017", "name": "22392", "title": "WCAS KOREAN 111-2-22 Korean I", "class_attributes": "", "section": "22392", "instructors": [{"instructor_phone": "8474671323", "instructor_name": "Eunmi   Lee", "instructor_addr": "1880 Campus Drive, Kresge Hall, Office 4-421"}, {"instructor_phone": "847/491-2767", "instructor_name": "Ihnhee L Kim", "instructor_addr": "1880 Campus Drive, Kresge Hall, Office 4-417"}], "topic": "", "course": "111-2", "descriptions": [{"name": "Overview of class", "value": "This is a year-long first-year course designed for beginning learners without previous knowledge in Korean language. The course aims to develop students' all-around communicative ability in speaking, reading, listening and writing with slightly more emphasis on speaking. The goal of this course is to achieve oral proficiency at the Novice High level of the ACTFFL guideline as well as to achieve the competency in interpersonal, presentational and interpretive communication and culture in conjunction with the National Standards."}, {"name": "Registration Requirements", "value": "None for Fall Quarter; Completion of 111-1or a departmental placement test for Winter Quarter; Completion of 111-2 or a departmental placement test for Spring Quarter"}, {"name": "Teaching Method", "value": "Students will learn the basic elements of Korean language such as pronunciation, vocabulary, grammar, and sentence structure. In this student-centered class, students will actively participate in speaking, reading, writing and listening activities. Related supplemental materials such as video clips and reading texts will be incorporated to enhance students' listening and reading skills as well as the cultural understanding."}, {"name": "Evaluation Method", "value": "Grade will be based on attendance and participation, vocabulary quizzes and lesson tests, assignments, oral tests and performance, and final examination."}, {"name": "Class Materials (Required)", "value": "Integrated Korean (Second Edition): Beginning 1 &amp; 2 (University of Hawaii Press)<br/>978-0-8248-3440-1 &amp;978-0-8248-3515-6<br/><br/>Integrated Korean Workbook (Second Edition): 1 &amp; 2 (University of Hawaii Press)<br/>978-0-8248-3450-0 &amp;978-0-8248-3516-3"}], "lmod": "12/25/16 7:02 PM (CT)", "subject": "KOREAN"}]