[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Technological Institute F285"}], "school": "WCAS", "overview_of_class": "Studies of Quaternary climate (e.g., climate of the past 2.6 million years) have provided unique perspectives on Earth's climate system, for example illuminating the role that greenhouse gases play in climate change.  The Quaternary ice ages also shaped the landscape of Illinois and Evanston.  This course will cover methods for reconstructing and dating past environmental change, causes of natural climate change, major climatic events of the Quaternary up to present-day, and their relevance for understanding current climate change.", "qtr": "Winter 2016", "name": "Quarternary Climate Change: Ice Ages to the Age of Oil", "title": "WCAS EARTH 341-0-01 Quarternary Climate Change: Ice Ages to the Age of Oil", "lmod": "1/9/16 6:46 PM (CT)", "section": "01", "instructors": [{"instructor_phone": "", "instructor_name": "Yarrow Larue Axford", "instructor_addr": "Technological Institute F394/F395"}], "topic": "", "course": "341-0", "enrl_requirement": "Enrollment Requirements: Pre-Requisite: Students must have completed, be currently enrolled in, or enroll simultaneously in EARTH 201 to enroll in this course.", "descriptions": [{"name": "Overview of class", "value": "Studies of Quaternary climate (e.g., climate of the past 2.6 million years) have provided unique perspectives on Earth's climate system, for example illuminating the role that greenhouse gases play in climate change. The Quaternary ice ages also shaped the landscape of Illinois and Evanston. This course will cover methods for reconstructing and dating past environmental change, causes of natural climate change, major climatic events of the Quaternary up to present-day, and their relevance for understanding current climate change."}, {"name": "Registration Requirements", "value": "Prerequisite: EARTH 201 or consent of instructor."}, {"name": "Class Materials (Required)", "value": "1. W.F. Ruddiman, Earth's Climate: Past and Future, Third edition (2013), W.H. Freeman &amp; Company. ISBN-13: 9781429255257 List price: $160.65<br/><br/><br/>2. Coursepack."}, {"name": "Class Notes", "value": "Prerequisite: EARTH 201 or consent of instructor"}], "path": "/class-descriptions/4610/WCAS/EARTH/341-0/23255", "instructor": ["Yarrow Larue Axford"], "class_attributes": "Natural Sciences Distro Area<br/><br/>", "id": "23255", "subject": "EARTH"}]