[{"class_mtg_info": [{"meet_t": "MoWeFr 11:00AM - 11:50AM", "meet_l": "University Library 4670"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "22468", "title": "WCAS LATIN 201-2-21 Introduction to Latin Literature", "class_attributes": "", "section": "22468", "instructors": [{"instructor_phone": "847/491-8029", "instructor_name": "Francesca   Tataranni", "instructor_addr": "Kresge Hall 4363"}], "topic": "", "course": "201-2", "descriptions": [{"name": "Overview of class", "value": "The goal of second-year Latin (201-1,2,3) is the development of proficiency in reading Latin through the introduction of the student to major works of Latin literature. Latin 201-2 is designed to improve students' understanding of Latin language by close reading of major poetic texts such as Vergil's Aeneid and Ovid's works, with special attention to grammar, vocabulary and style. Class activities will include careful reading and translation of the Latin text combined with literary discussion and interpretation. The course also provides a systematic introduction to the basics of Latin metrics and versification."}, {"name": "Registration Requirements", "value": "Latin 201-1 or by placement test. Students who have studied Latin prior to Northwestern must take the online Latin placement exam. For further information see the director of Latin instruction Francesca Tataranni in the Dept. of Classics or visit http://www.classics.northwestern.edu/undergraduate/language_placement.htm"}, {"name": "Learning Objectives", "value": "In connection with further developing their reading skills through close examination of increasingly lengthy and more challenging unadapted works of classical authors, students are expected to develop an interest and familiarity with the cultural and historical background of classical antiquity and gain a full appreciation of the meaning of Latin literary culture to the culture of the western world."}, {"name": "Teaching Method", "value": "Class participation; discussion; weekly lectures; readings"}, {"name": "Evaluation Method", "value": "Preparation and Class Participation 10% (two assignments excused)<br/>Midterm Exam 25%<br/>Quizzes 40% (lowest one dropped)<br/>Final Exam 25%<br/><br/>Class attendance and participation will be factored into the final letter grade. Attendance will be taken at every class session. If you are more than ten minutes late, you will be considered `absent' for that class (although you should still attend class). More than three absences will result in the loss of one full letter grade for the quarter. Five absences will result in automatic failure of the class. Missing a class does not excuse you from the material covered. Your success in this course is your responsibility. Furthermore, enthusiastic participation in class is required!"}, {"name": "Class Materials (Required)", "value": "Required: <br/>B. Weiden Boyd, Vergil's Aeneid. Selections from books 1, 2, 4, 6, 10, and 12 (Bolchazy-Carducci 2004) - ISBN-13: 978-0865165847; <br/>The Aeneid of Virgil. A verse translation by A. Mandelbaum (Bantam Classics/ Mass Market Paperback 1981) - ISBN-13: 978-0553210415"}, {"name": "Class Materials (Suggested)", "value": "Recommended: Allen and Greenough's New Latin Grammar, by Anne Mahoney (Focus Publ./R. Pullins Co. 2001) - ISBN-13: 978-1585100279"}, {"name": "Class Notes", "value": "For all students beginning the study of Latin at the 200-level or lower at Northwestern in September, 2002 or later, the WCAS foreign language requirement must be satisfied with a grade of C- or better in Latin 201-3.<br/><br/>No P/N"}], "lmod": "12/25/16 7:02 PM (CT)", "subject": "LATIN"}]