[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "Harris Hall L28"}], "school": "WCAS", "overview_of_class": "Legal Studies 398-1,2 is a two-quarter sequence required for all Legal Studies majors. This seminar exposes students to a variety of theoretical and methodological approaches to law and legal institutions; over two quarters, students will develop their own research paper on a topic of interest.", "qtr": "Fall 2017", "name": "Advanced Research Seminar 1", "title": "WCAS LEGAL_ST 398-1-20 Advanced Research Seminar 1", "lmod": "5/9/17 7:30 PM (CT)", "section": "20", "topic": "", "course": "398-1", "enrl_requirement": "Enrollment Requirements: REASON: Pre-registration is not allowed for this class. Please try again during regular registration.<br/>Add Consent: Department Consent Required<br/>", "descriptions": [{"name": "Overview of class", "value": "Legal Studies 398-1,2 is a two-quarter sequence required for all Legal Studies majors. This seminar exposes students to a variety of theoretical and methodological approaches to law and legal institutions; over two quarters, students will develop their own research paper on a topic of interest."}, {"name": "Registration Requirements", "value": "Legal Studies Majors only"}, {"name": "Learning Objectives", "value": "Once you complete the Advanced Research Seminar, you should be able to: <br/>o Read and analyze diverse primary legal and political sources carefully and accurately, with attention to the author's perspective, position, and credibility, and to the source's general context.<br/>o Be familiar with research methods and best practices regarding qualitative and quantitative data, written materials, and electronic databases.<br/>o Read, evaluate, summarize, and engage with scholarly works by others, and be able to analyze authors' arguments for evidence, context, strength, and credibility. <br/>o Understand how to work with and situate one's own work within existing scholarship and how to properly cite facts, ideas, and scholarship.<br/>o Generate original research questions regarding the relationship of law and society and devise research strategies for answering research questions.<br/>o Make clearly written and organized arguments that are well supported by primary sources. <br/>o Design and execute an original research project."}, {"name": "Teaching Method", "value": "Lectures, seminars, and individual meetings"}, {"name": "Evaluation Method", "value": "Participation, writing, assignments."}, {"name": "Class Materials (Required)", "value": "Please contact the instructor directly for more information on possible course materials and their costs."}, {"name": "Class Notes", "value": "Attendance at first class required, no P/NP option"}], "instructor": ["Laura B Nielsen"], "class_attributes": "", "id": "12084", "subject": "LEGAL_ST"}]