[{"school": "DOHA", "overview_of_class": "<p>Students in this course will explore the ways constant technological change and the digital economy continue to redefine the ways in which journalism is reported, written, produced and distributed. Early in the course you will build knowledge of the structure, evolution and philosophy of the Internet to help understand how and why it continues to be such a force for journalism. From there you will delve into the key areas for opportunity and change that this has created for journalism, paying particular attention to: Transformations in the way news and information is distributed digitally, including present-day channels like social media, mobile and wearable technology and potential future channels like virtual reality and mobile holography; The evolving relationship between news organizations and their audiences, including emerging research about the behavior of online audiences and how news organizations endeavor to better understand those audiences to engage them; Ongoing innovations in the production of journalistic content: new methods of news- and information-gathering using sophisticated digital tools like robots, sensors and drones; and innovative methods for digital storytelling. The course will be rooted in the practical experiences of digital journalists and digital news organizations and will feature guest lectures and case studies of future-oriented digital news organizations like VICE, Reportedly and BuzzFeed.</p>", "name": "Special Topics", "section": "70", "location": "Carnegie Mellon Room 3069", "topic": "Exploring the Future of Digital Journalism", "course": "390-0", "meeting_time": ["MoTuThSu 09:00AM - 11:50AM (AST)"], "path": "/class-descriptions/4620/DOHA/JOUR/390-0/30561", "instructor": ["Andrew B Mills"], "class_attributes": "", "id": "30561", "subject": "JOUR"}, {"school": "DOHA", "overview_of_class": "<p>This independent study addresses the topic of how financial services firms promote their investment products in Qatar. The study will focus on marketing activities and strategies used for both conventional and Islamic investment products. The course is divided in three distinct modules. It will first deepen the students' understanding of financial products and their markets. The second module will be a combination of studies of financial services marketing techniques and the construction of a generic model to analyze the financial investment products market in Qatar. The last module will be a research on the ground aimed at testing the model previously elaborated and interviewing financial advisory specialists at local Banks and Financial Institutions.</p>", "name": "Special Topics", "section": "71", "location": "Carnegie Mellon Room 3048", "topic": "Research:Financial Investment Products Mktg in Qtr", "course": "390-0", "meeting_time": ["Tu 06:00PM - 07:50PM (AST)"], "path": "/class-descriptions/4620/DOHA/JOUR/390-0/30562", "instructor": ["Giovanni   Bandi"], "class_attributes": "", "id": "30562", "subject": "JOUR"}]