[{"class_mtg_info": [{"meet_t": "Tu 1:00PM - 3:50PM", "meet_l": "Frances Searle Building 1483"}], "school": "SoC", "enrl_requirement": "", "qtr": "Winter 2016", "name": "26804", "title": "SoC MTS 525-0-22 Special Topics Research Seminar", "class_attributes": "", "section": "26804", "instructors": [{"instructor_phone": "", "instructor_name": "Noshir   Contractor", "instructor_addr": ""}], "topic": "", "course": "525-0", "descriptions": [{"name": "Overview of class", "value": "Noshir Contractor, Northwestern University<br/>Joseph N. Cappella, University of Pennsylvania<br/>Dhavan Shah, University of Wisconsin Madison<br/> <br/>Time: 1:00-4:00 CST / 2:00-5:00 EST on Tuesdays between 1/12/16 to 5/10/16<br/>Class meetings will be synchronous across locations<br/> <br/>Schedule: Sixteen instructional sessions are slotted on Tuesdays at the specified time during the specified dates. Each registering students is required to attend at least thirteen (13) of the sixteen (16) scheduled meetings. Given the three-hour meeting time of the seminar, that will generate 39.0 hours of instructional time at each participating institution. The formal meeting dates will be bookended with an optional kickoff meeting and an optional closing meeting. See a complete schedule below, including weeks by coordinating faculty member, topic areas, and tentative guest speaker. <br/> <br/>Structure: After the introductory session when we discuss goals and explore points of collaboration, each participating faculty member will be responsible for programing five sessions, with a commitment to lead at least one session and secure four leading researchers in the domain of computational social science as speakers. Northwestern will handle the technology support, with each participating unit securing a room with a large monitor (for simulcasting), a conference calling center, and a webcam (for interaction), Each weekly session will have one hour dedicated to hearing a presentation from a distinguished researcher on the topic, followed by an hour of Q&amp;A and joint discussion that will include the presenter, the participating faculty, and the students from each institution. After that, instructors will go offline for a focused session of one hour with the students at their institution.<br/> <br/>Class will culminate with a workshop hosted at Northwestern University:<br/> <br/>June 21-22, 2016 at Evanston, IL<br/> <br/>The workshop is scheduled to preceed the 2016 International Conference on Computational Social Science, June 23-26 at Northwestern University http://www.kellogg.northwestern.edu/news-events/conference/ic2s2/2016.aspx<br/> <br/>Profile: Students who take this class should have some familiarity with computational methods and tools, and an active research project or program that involves use of these approaches in social science inquiry.<br/> <br/>Topics: Data acquisition, management and preparation<br/>Data ethics, retention, and privacy protections<br/>Computational approaches to language processing<br/>Computational approaches in network science<br/>Computational approaches to social media data<br/>Computational approaches to recommendation systems<br/> Emerging computational models and modeling tools"}], "lmod": "1/9/16 6:39 PM (CT)", "subject": "MTS"}]