[{"school": "WCAS", "overview_of_class": "This seminar is an introduction to the most important figures, works, and debates in the history of Southeast Asia.  It begins by considering the arguments for and against regional history and area studies.  It then turns to an assessment of some of the most influential ideas in the study of the region, such as Oliver Wolters's notions of &quot;localization,&quot; the &quot;mandala&quot; state, and the &quot;man of prowess&quot;; Anthony Reid's &quot;Age of Commerce&quot;; Clifford Geertz's formulation of the &quot;theatre state&quot;; James C. Scott's analysis of the &quot;moral economy of the peasant&quot; and &quot;weapons of the weak&quot;; J.S. Furnivall's notion of the &quot;plural society&quot;; and Thongchai Winichakul's conception of the &quot;geo-body,&quot; among others.  Students will gain a critical understanding of the historiography of modern Southeast Asia and its animating ideas.", "name": "Topics in History", "section": "20", "topic": "Modern Hist. of Southeast Asia", "course": "492-0", "meeting_time": ["Mo 9:00AM - 11:50AM"], "path": "/class-descriptions/4610/WCAS/HISTORY/492-0/24979", "instructor": ["Haydon Leslie Cherry"], "id": "24979", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "How do socio-cultural conditions shape distinct mystical worldview and why? Why do mystical ideas travel from the periphery of an ethnic group to the center, galvanizing the masses and triggering the rise of new sects and messianic movements? What is the impact of mystical beliefs and practices on the emerging modernity and anti-modernity? Why has the deeply Kabbalistic concept tikkun olam (fixing the world) become a major thinking tool of modern liberal Jews? To answer these questions, we will discuss Jewish mysticism-in-the-making after the destruction of the Second Temple, explore the formation of Kabbalah in late medieval Spain, and travel to the circle of the Lurianic mystics in Safed (Tzfat). We will study specific early modern and modern historical contexts in which various forms of mystical practices emerged, underscore the historicity of mystical texts and practices, and introduce Judaic sectarian and messianic movements built on these practices?including the Kabbalists (Judaic and Christian), the Sabbateans, the Frankists, the Hasidim, and the Religious Zionists. This course will focus mainly on the socio-cultural, political, and practical/behavioral aspects of the mystical groups and messianic movements. Explore how Judaic mystical endeavors helped early modern and modern Jews revisit their traditional texts, redefine their rites and practices, and change the profile of the Jewish people in their encounter with modernity.", "name": "Topics in History", "section": "22", "topic": "Mysticism and Hasidism", "course": "492-0", "meeting_time": ["Tu 5:00PM - 7:50PM"], "path": "/class-descriptions/4610/WCAS/HISTORY/492-0/24980", "instructor": ["Yohanan   Petrovsky-Shtern"], "id": "24980", "subject": "HISTORY"}]