[{"class_mtg_info": [{"meet_t": "Tu 6:15PM - 9:15PM", "meet_l": "Wieboldt Hall 514"}], "school": "SCS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "18428", "title": "SCS ECON 201-CN-14 Introduction to Macroeconomics", "class_attributes": "", "section": "18428", "instructors": [{"instructor_phone": "", "instructor_name": "Emily Anne Engel", "instructor_addr": ""}], "topic": "", "course": "201-CN", "descriptions": [{"name": "Overview of class", "value": "This course familiarizes students with the basic principles of macroeconomics including the role of the government, the role of banks, the importance of interest rates, and the effects of policies involving trade, tax, and other concepts. The course covers a variety of economic topics, including why auction markets are so common, why countries would desire to trade with one another, how currencies are valued and traded, why shortages and surpluses occur, and why some people earn high incomes while others earn low incomes. Also discussed will be classificatory and taxonomical concepts and the role of classifications and rankings. Topics include: supply and demand, competition vs. monopoly, inflation, unemployment, recessions, booms and recessions, fiscal and monetary policy, budget deficits, international trade, and exchange rates."}, {"name": "Registration Requirements", "value": "A basic understanding of descriptive statistics, while helpful, is not required. While this course does not require difficult mathematics, mathematical notation is used during lectures and to explain certain concepts. Familiarity with reading the kinds of charts and graphs one might find in the Economist or the Financial Times is valuable. Though microeconomics is not a prerequisite, students who have already taken microeconomics may have an advantage in understanding these concepts."}, {"name": "Learning Objectives", "value": "- To be able to explain concepts like interest rates or unemployment rates and speak intelligently about what a change in these rates might mean for the economy generally.<br/>- To have the vocabulary and historical knowledg e to explain major schools of economic thought, or to be able to answer questions like, &quot;What would a liberal think about this policy?&quot;<br/>- To confidently read and digest charts and graphs showing basic aspects of economic activity and to draw reasonable conclusions about what these data are and what they might mean.<br/>- To understand the differences between two countries' policies and to be able to describewhy divergent economic policies exist.<br/>- To work with and apply concepts like comparative advantage and treaty-tariff systems; the student will be able to understand why countries' policies may be influenced by the policies of other countries."}, {"name": "Class Materials (Required)", "value": "To be announced."}], "lmod": "10/30/16 6:54 PM (CT)", "subject": "ECON"}]