[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Harris Hall L06"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Juniors &amp; Seniors<br/>Add Consent: Department Consent Required<br/>", "qtr": "Fall 2016", "name": "10739", "title": "WCAS BUS_INST 394-0-26 Professional Linkage Seminar", "class_attributes": "Attendance at 1st class mandatory<br/><br/>Juniors/Seniors Only<br/><br/>", "section": "10739", "instructors": [{"instructor_phone": "", "instructor_name": "Verinder Kumar Syal", "instructor_addr": ""}], "topic": "Leadership and Ethics", "course": "394-0", "descriptions": [{"name": "Overview of class", "value": "*INFORMATION IS SUBJECT TO CHANGE*<br/><br/><br/>The instructor for &quot;Leadership and Ethics&quot; is: Verinder Syal.<br/><br/><br/>Who is a leader and what is leadership? Are leaders born or can leaders be made or make themselves? What does it take to become a leader? <br/><br/><br/>Some leaders have conquered vast lands; others have produced profound thought. Some assimilated all that they encountered; others destroyed everything they touched. Some were heroes; others despots. Even today, some build their people and institutions; others focus on their ego and their net worth. Some serve, some take. Why? <br/><br/><br/>We will search for answers by studying historical and current leaders, their character, traits, and methods. In our quest for clarity we will ask: Are there any Universal Principles of Leadership (&quot;UPL&quot;)? We will examine the role ethics, integrity, and character play in leadership? Are these a handicap or are they the very essence of leadership, and perhaps even life? <br/><br/><br/>We will use real life case studies to think about situations that you are likely to encounter in the actual world that awaits you out there. We will think about ethical challenges, crucibles, and grappling with the purpose of leadership and life. We will discuss some of the necessary tools for leadership including Vision, Aligning, Motivating, and Execution (as in getting things done.) <br/><br/><br/>But the most important question that you will address will be about yourself: &quot;What kind of leader do I plan to be?&quot; Ultimately life is not about what others do, or what is done to you; it is about you, what you do, how you choose to lead, and how you choose to live your life. Yes, it is a choice. And you make the choice."}, {"name": "Registration Requirements", "value": "Juniors and Seniors. The Pre-Class (May 31) and the 1st class are both mandatory. <br/>Final presentations mandatory.<br/><br/><br/>Application Only: http://goo.gl/forms/yVYJoHUprk"}, {"name": "Teaching Method", "value": "Participant Centered Learning: which means that the students will be responsible for leading most of the discussions. We will use a combination of cases, and presentations by the students, guests, and the professor. Active participation will be the norm and the workload will be heavy."}, {"name": "Evaluation Method", "value": "Class Participation - 30%, Presentations - 20%, Papers - 50%."}, {"name": "Class Materials (Required)", "value": "Please check with the Norris Bookstore"}, {"name": "Class Notes", "value": "BIP will no longer keep any wait lists in the office or on CAESAR. Any open slots will be at the professor's discretion.<br/><br/><br/>&quot;Leadership and Ethics&quot; is now an application only class. Please contact bip@northwestern.edu for application information."}], "lmod": "10/30/16 7:01 PM (CT)", "subject": "BUS_INST"}]