[{"class_mtg_info": [{"meet_t": "MoWe 10:00AM - 11:20AM", "meet_l": "Parkes Hall 224"}], "school": "SoC", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24503", "title": "SoC RTVF 398-0-23 Symposium: Issues in RTVF", "class_attributes": "", "section": "24503", "instructors": [{"instructor_phone": "", "instructor_name": "Maureen E. Ryan", "instructor_addr": ""}], "topic": "Food, Media, and Culture", "course": "398-0", "descriptions": [{"name": "Overview of class", "value": "Description This introductory course brings together a range of approaches and theories from the fields of media studies, communication, anthropology, and cultural studies, as well as objects in modern art, film, television, and digital media, to examine how food, and representations of food, play a critical yet diaphanous and evolving role in contemporary media culture. We begin from the premise that media and food are connected on two interrelated levels: food is both the subject of media and is a medium itself, through which ideas about gender, race, nation, domesticity, and the world beyond home are conveyed. Our guiding questions throughout the term will be: How does food serve as a point of entry for considering issues such as globalization, poverty, wealth, capitalism, leisure, work, identity, family, and belonging? How do food media, such as restaurant reviews, cookbooks, documentaries, and cooking shows, seek to intervene in public understandings of health, cuisine, and culture more broadly? And how are global food cultures represented, celebrated, or marginalized in American media? <br/><br/><br/><br/>Course Objectives: By the end of this course, students will:<br/><br/>Understand, evaluate, and be able to discuss a number of different lenses for the study of food media and culture, including semiotic, structural, performative, anthropological, and feminist approaches<br/>Apply these methods to their own written analyses of food media<br/>Sustain a lively critical community via class discussions<br/>Critically evaluate, via written assignments, the construction of food semiotics as they are mobilized to convey meanings and ideological messages<br/>Critically evaluate, via written assignments, the concepts and theories elaborated in the scholarly work we read<br/>Course Evaluations: attendance and participation, two papers, reading responses, final paper presentation<br/><br/>Books required: Polan, Dana B. Julia Child's the French Chef. Spin Offs. Durham, NC: Duke University Press, 2011. Frederick Errington, Deborah Gewertz, Tatsuro Fujikura. The Noodle Narratives: The Global Rise of an Industrial Food into the Twenty-First Century. Durham, NC: Duke University Press, 2013."}], "lmod": "12/25/16 6:48 PM (CT)", "subject": "RTVF"}]