[{"school": "WCAS", "overview_of_class": "AFST 390-0-20 \"Contemporary African Politics\" Martha Wilfahrt, Spring 2017 (also POLI_SCI 360)<br/><br/>Students will develop a rich understanding of African politics from the pre-colonial period to the present, and will be able to analyze and discuss contemporary African politics in light of historical forces. Specifically, students will be able to analyze and discuss: local experiences of democracy and governance; the challenges of economic development; and national as well as international policy responses. The topics will be considered in light of: varied colonial experiences; nationalist and independence movements; international political economy; and informal sources of political power.", "name": "Topics in African Studies", "section": "20", "location": "555 Clark 230", "topic": "Contemporary African Politics", "course": "390-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4660/WCAS/AFST/390-0/32230", "instructor": ["Martha Anne Wilfahrt"], "class_attributes": "", "id": "32230", "subject": "AFST"}, {"school": "WCAS", "overview_of_class": "AFST 390-0-21 \"Governing Fractured Nations: Africa & the Post-Imperial World\" Richard Joseph, Spring 2017 (also Poli_Sci 390)<br/><br/>\"We are living through a period in which the speed of change exceeds the capacity of governmental institutions, and of political leaders, to manage it. The term \"fractured\" is frequently used today to refer to the splintering of societies, nations, and the \"global community\". We will examine these phenomena and the challenges posed to systems of governance.<br/><br/>This era is foreshadowed in the work of particular scholars, such as Crawford Young, The Rise of Cultural Pluralism (1993), and Robert Cooper, The Breaking of Nations (2003). In the foreword to a 2001 book, The Self-Determination of Peoples, the following prescient words can be read: \"Unrest in one part of the world can bring bombs, terror, and refugees to another, where public sentiment may lead to intervention in the conflict one way or the other; thus local conflicts are globalized.\"<br/><br/>Intense conflicts take place across several axes: ethnic nationalism, religious sectarianism vs. secularism, \"ordinary people\" vs. elites, rural and small towns vs. cities, and migrants vs citizens. Ideologies that seemed triumphant after the Cold War, such as constitutional democracy and economic liberalism, are vigorously contested. New constructions are given to once familiar concepts such as sovereignty, privilege, and populism. Election contests in Britain, the United States, and several other western democracies deepen societal divisions and enhance uncertainty.<br/><br/>Some authors have grappled with the governance dimension of these challenges. They include Francis Fukuyama in several works, Daron Acemoglu and James Robinson in Why Nations Fail? (2012) and Jonathan Tepperman, in The Fix (2016). Contributing to the sense of global disarray are persistent wars and increasing reliance on shadow forms of warfare: drones, cyber-attacks, and Special Forces. The fracturing of nations is vividly conveyed by waves of refugees fleeing violence and distress in Africa and the Middle East. So also is the \"disintegrating of Europe\", as discussed in a January 2017 essay by Timothy Garton Ash, chronicler of the post-1989 democratic transitions in Eastern Europe.<br/><br/>This course will devote special attention to the African experience. Most African countries contend with multiple lines of division: ethnic, linguistic, religious, regional, and class. How, it will be asked, have highly diverse nations maintained nationhood? How are they coping with the current fraying of the global order and economic upheavals? The experiences of Nigeria, Africa's most populous country, will be closely examined.\"", "name": "Topics in African Studies", "section": "21", "location": "Annenberg Hall G21", "topic": "Governing Fractured Nations: Africa & the Post-Imp", "course": "390-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4660/WCAS/AFST/390-0/32231", "instructor": ["Richard A Joseph"], "class_attributes": "", "id": "32231", "subject": "AFST"}, {"school": "WCAS", "overview_of_class": "AFST 390-0-22 \"Framing the World and the Book\" (also ART390-0-20) Pippa Skotnes (Spring 2017) <br/><br/>This course will engage with the artist's book and the way in which composition reflects a human view of the world. Through making, discussions and lectures it will examine the ways in which the rectangle has been the most powerful and pervasive device for the visual representation of the world and our multiple relationships within it. Since the beginnings of architecture, and later entrenched by the development first of the codex, and finally the camera, the rectangle frames what we see from our windows, on digital screens, in books, and our cell phones. It shapes long traditions of painting, it creates composition. In this course we will be looking specifically at the way in which the medium of the artist's book can potentially disrupt conventions of both composition and reading and produce creative work that does not take for granted received forms of representation. The course will include a site visit (to the Field Museum) and the making of an artist's book.", "name": "Topics in African Studies", "section": "22", "location": "640 Lincoln St Room 135", "topic": "Framing the World", "course": "390-0", "meeting_time": ["MoWe 9:00AM - 11:50AM"], "path": "/class-descriptions/4660/WCAS/AFST/390-0/32232", "instructor": ["Philippa Ann Skotnes"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "id": "32232", "subject": "AFST"}, {"school": "WCAS", "overview_of_class": "AFST 390-0-23 \"Other Histories and the Limits of Archive\" Pippa Skotnes, Spring 2017 (Also HISTORY 392-0-40)<br/><br/>In many colonial contexts, the pre-colonial has been cast as outside of history. And yet there are places where individuals and their lives have survived the oblivion of history and where something of their lived experience can be recovered. These places indicate productive sites of knowing not only about the small histories of the past, but how these speak to, and elucidate, relations of power and aspects of global history. While this course will focus specifically on an archive assembled in the 1870s and 1880s in colonial South Africa (the Bleek and Lloyd Archive), comprising thousands of pages of interviews with several prisoners described at the time as indigenous hunter-gatherers, or \"Cape Bushmen\" (now known as |xam), and 4 young displaced boys from northern Namibia, it will also be attentive to the importance of thinking about archives in unconventional ways. The course will give students the opportunity to work with primary sources, - including photographs, maps, genealogies and drawings, as well as stories of origin, of conflict with settlers and relationships with animals, of murder, hunting, personal histories, and of times stretching into the pre-colonial past - to consider visual and object sources, and to think about the effect the making of an archive has on the histories it is able to generate.", "name": "Topics in African Studies", "section": "23", "location": "University Hall 121", "topic": "Other Histories and the Limits of Archive", "course": "390-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4660/WCAS/AFST/390-0/32233", "instructor": ["Philippa Ann Skotnes"], "class_attributes": "", "id": "32233", "subject": "AFST"}, {"school": "WCAS", "overview_of_class": "AFST 390-0-24 \"North African Literature in the Age of Social Media\" (MENA 390-6-21) Driss Kisikes (Spring 2017)<br/> <br/><br/>This is not a literary text analysis course, but a literary course on context analysis. The starting point is that novels, poems, short stories, plays, may reveal, with a lot of sensitivity and panache, not only personal realms but, sometimes unconsciously, what Jacques Lacan calls « subjectivity of an era » or as Michel Foucault puts it, « the episteme ». Through this seminar, I am willing to share with you, through text excerpts, critical essays and some Internet materials (webpages, videos), what has been at stake in North African societies, since the eve of the 21st century, which corresponds roughly to the advent of social media. I will particularly focus on the tide and flow between fragmented representations of reality by masses of connected individuals and idiosyncratic expressions produced by literary actors. How do writers deal with this sudden popularization of speech and discourses on line? Do they take care of it within their texts? And how do social media users deal with elite oriented literary outputs? How does this new ecosystem of discourse production affect the literary world, in terms of content, format and communication? And finally, how do literary texts interact with collective upheavals, like 2011 uprisings, largely echoed and accelerated by social media?", "name": "Topics in African Studies", "section": "24", "location": "Kresge 4531 MENA Seminar Rm", "topic": "N. African Lit in the Age of Social Media", "course": "390-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4660/WCAS/AFST/390-0/32234", "instructor": [""], "class_attributes": "", "id": "32234", "subject": "AFST"}, {"school": "WCAS", "overview_of_class": "AFST 390-0-25 \"State, Ethnicity, and Class\" (Sociol 376-0-22) Baris Unlu (Spring 2017)<br/><br/>This class advances your understanding of power dynamics that underpin the ethnic and racialized identities within which we all live. Drawing on four different historical experiences and cases (the Armenian and Kurdish issues in Turkey, racism and white supremacy in the United States as well in as South Africa, and the colonial/post-colonial links between France and Algeria) this course examines the links among state structures, social class formation, and ethnic/racialized identity construction through a comparative lens. We begin by considering sociological conceptualizations of the state, boundary-making, ethnicity, and race. The cases of Turkey, France, Algeria, South Africa, and the United States -although crucially different from each other with respect to social, political, and economic structures- display remarkable similarities when analyzed through the concepts of power, privilege, violence, boundary-making, and modern governmentality. Having investigated concepts and ways of thinking about boundary-making and identities, we then turn to questioning the dynamics of power that operate at multiple and over-lapping levels: from the level of capitalist world-system to nation-state, from the state structures to local instances of ethnic/racial boundary making, from individual interests to individual strategies of ignorance and indifference.", "name": "Topics in African Studies", "section": "25", "location": "TBA", "topic": "State, Ethnicity, and Class", "course": "390-0", "meeting_time": ["TBA"], "path": "/class-descriptions/4660/WCAS/AFST/390-0/37353", "instructor": [""], "class_attributes": "", "id": "37353", "subject": "AFST"}, {"school": "WCAS", "overview_of_class": "This class explores how struggles over land and territory shape different forms of conflict and violence between, for example, squatters and state officials, different ethnic or religious communities, or rebel groups and the state. The course examines questions of land and conflict such as: What does land, property, and territory mean to different groups of people? What are the institutions that shape land access and security? How can land explain different conflict dynamics? And what policy implications emerge from a close study of land rights around issues of economic development, food security, peacebuilding, or environmental conversation? We apply these questions to different regional contexts and country-specific case studies including Kenya, China, Indonesia, Colombia, and Afghanistan. The course is interdisciplinary in its approach, drawing from political science, as well as economics and anthropology. It should appeal to students interested in peace and conflict issues, environmental politics, international development, and human rights.", "name": "Topics in African Studies", "section": "26", "location": "Garrett-Evangelic Seminary 107", "topic": "Land Rights & Conflict in Global Perspective", "course": "390-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4660/WCAS/AFST/390-0/38011", "instructor": ["Kathleen Fitzpatrick Klaus"], "class_attributes": "", "id": "38011", "subject": "AFST"}, {"school": "WCAS", "overview_of_class": "AFST 390-0-27 \"Democacy, Autocracy, and Disorder: A New Global Era\" (POLI SCI 395-0-24)<br/>Prof. Richard Joseph (Spring 2017)<br/><br/>This course will explore the evolution from the \"democratic euphoria\" of the early 1990s to critical analyses of democratization. It will examine debates on the \"democratic recession\" and upsurge of authoritarianism, and draw on analyses of various regions, especially Africa, Eastern Europe, and the Middle East. After the Cold War, the number of democracies in the world increased significantly. In recent years, that number has stagnated and, by some accounts, declined. The aim of the course is to achieve a deeper understanding of these dynamics and their implications. It will be achieved by reading and discussing the works of leading scholars of these processes. Students will write a research paper on a country or region of their choice, apply these frameworks of analysis, and probe further the questions raised in the readings and in class. The first course reading is a comprehensive article by Michael J. Boyle, \"Illiberalism Ascendant: Obama's Tragic Legacy.\" (Current History, Jan. 2017) It captures the travails of western democracy and the \"liberal international order\". These commitments ebbed and flowed during the last century and are now more contested. The collapse of the Soviet Union led to several years of Western ideological hegemony. The spread of jihadist insurgencies, the 9/11 destruction of the World Trade Center, prolonged wars in Iraq, Afghanistan, and Syria, and violent conflicts in many areas have shifted global priorities. Counter-terrorism, and the strengthening of political order and security, are now ascendant. Nationalist authoritarianism in China and Russia, the rise and collapse of the \"Arab Spring\", mass migrations, and religious sectarianism have contributed to a sense of \"global disarray\". In recent years, scholars such as Christopher Walker debated the \"renewed struggle between democracy and authoritarianism worldwide\" (Journal of Democracy, 2016). They acknowledged the reversal of trends just decades old now reflected in the rise of Illiberal regimes. They explored if liberal democracy was being eclipsed by new forms of authoritarianism, and whether the liberal international order was losing ground to an illiberal global order. The upsurge of authoritarian \"populist\" nationalism in the West is apparent in a number of countries. Political parties based on such movements are altering the composition of governments, including in \"Old Europe\". The Brexit vote in Britain, the election of Donald Trump as U.S. president, the defeat of a constitutional amendment and a reformist Prime Minister in Italy, and prospects of political upheavals in France and Germany signal the fracturing of the liberal democratic consensus. This course will also trace the commitment to \"democracy promotion\" from the presidency of George W. Bush to that of Barack Obama. It will examine how the dysfunction, and \"failure to deliver\", of western democracies have contributed to the erosion of their popular support. Essentials of political thought and practice, regarding democracy and autocracy, are again contested. Students will deepen their knowledge of these developments and, in their individual research, examine the ramifications in specific countries.", "name": "Topics in African Studies", "section": "27", "location": "TBA", "topic": "", "course": "390-0", "meeting_time": ["Mo 9:00AM - 11:50AM"], "path": "/class-descriptions/4660/WCAS/AFST/390-0/38324", "instructor": ["Richard A Joseph"], "class_attributes": "", "id": "38324", "subject": "AFST"}]