[{"class_mtg_info": [{"meet_t": "We 11:00AM - 1:50PM", "meet_l": "University Hall 318"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Sociology/MORS PhD Students", "qtr": "Winter 2017", "name": "24698", "title": "WCAS SOCIOL 406-2-20 Modern Theory in Sociological Analysis", "class_attributes": "", "section": "24698", "instructors": [{"instructor_phone": "847 467 1252", "instructor_name": "Wendy N Espeland", "instructor_addr": "1808  Chicago Ave"}], "topic": "", "course": "406-2", "descriptions": [{"name": "Overview of class", "value": "This class investigates modernity. It includes selections that illustrate how various thinkers have conceived of what it means to &quot;be modern&quot; or &quot;post-modern,&quot; critiques of modernity that have profoundly shaped our images of it, and skeptics who challenge the idea of modernity. It also includes sections that investigate in detail what I call &quot;mechanisms&quot; of modernity: procedures, devices, approaches or strategies that people adopt or promulgate in their efforts to be rational, manage uncertainty and conflict, or attain efficiency in various institutional arenas. Readings will include works by Michel Foucault, Larraine Daston, Anthony Giddens, Bruno Latour, Jurgen Habermas, James Scott and Ted Porter, among others."}, {"name": "Registration Requirements", "value": "Restricted to graduate students."}, {"name": "Learning Objectives", "value": "My goal for this class is to help students become familiar with important theoretical traditions in modern social theory and to improve their critical reading, thinking and writing. I also want students to learn to think comparatively and synthetically about core questions in sociology."}, {"name": "Teaching Method", "value": "discussion"}, {"name": "Evaluation Method", "value": "weekly response papers; final paper"}, {"name": "Class Materials (Required)", "value": "Please contact instructor for a list of books."}], "lmod": "12/25/16 7:07 PM (CT)", "subject": "SOCIOL"}]