[{"class_mtg_info": [{"meet_t": "MoWeFr 2:00PM - 2:50PM", "meet_l": "Technological Institute F281"}], "school": "WCAS", "overview_of_class": "Fundamentals of Neurobiology will explore the structure and function of the central nervous system, from the molecular to the systems/behavioral level.  This course will provide an introduction to a number of concepts in cellular and systems neurobiology, including (but not limited to):  ion channel structure and function; the structure and function of neurons and glia; the ionic basis of the membrane potential, graded potential and action potential; synaptic physiology; neuromodulation; neuronal networks; brain regions and pathways; sensory systems and multisensory integration; neural plasticity, including learning and memory; the molecular and cellular correlates of neurological disorders such as Alzheimer's, schizophrenia and bipolar disorder.", "qtr": "Winter 2016", "name": "Fundamentals of Neurobiology", "title": "WCAS BIOL_SCI 302-0-1 Fundamentals of Neurobiology", "lmod": "1/9/16 6:43 PM (CT)", "section": "1", "instructors": [{"instructor_phone": "847/491-4823", "instructor_name": "Tracy M Hodgson", "instructor_addr": "Tech Institute, Room MG77"}], "topic": "", "course": "302-0", "enrl_requirement": "Enrollment Requirements: Prerequisite: Students must have completed the entire sequence of BIOL_SCI 215, 216, 217, 218, 220, 221, and 222 to register for this course.", "descriptions": [{"name": "Overview of class", "value": "Fundamentals of Neurobiology will explore the structure and function of the central nervous system, from the molecular to the systems/behavioral level. This course will provide an introduction to a number of concepts in cellular and systems neurobiology, including (but not limited to): ion channel structure and function; the structure and function of neurons and glia; the ionic basis of the membrane potential, graded potential and action potential; synaptic physiology; neuromodulation; neuronal networks; brain regions and pathways; sensory systems and multisensory integration; neural plasticity, including learning and memory; the molecular and cellular correlates of neurological disorders such as Alzheimer's, schizophrenia and bipolar disorder."}, {"name": "Registration Requirements", "value": "Prerequisites: BIO 215, 216, 217, 218, 220, 221 and 222"}, {"name": "Teaching Method", "value": "A combination of lectures plus active learning/discussion sessions, and use of the NEURON simulation program (some simulations will be run in class, some out of class) to gain further understanding of concepts in neurobiology such as the membrane potential, action potential and synaptic interactions."}, {"name": "Evaluation Method", "value": "3 exams (multiple choice, short answer, short essay), an assignment based on the NEURON simulation program, and 1 short research paper"}, {"name": "Class Materials (Required)", "value": "Neuroscience: Exploring the Brain, 3rd edition. ISBN: 978-0-7-817-6003-4 <br/><br/>Neurons in Action 2: Tutorials and Simulations using NEURON ISBN: 978-0-87893-548-2<br/><br/>Supplementary materials or journal articles will be posted to CANVAS"}, {"name": "Class Notes", "value": "No P/N option <br/><br/>Cannot be taken in place of NEUROSCI 202 in the Neuroscience Concentration, nor is course credit possible for both"}], "path": "/class-descriptions/4610/WCAS/BIOL_SCI/302-0/20515", "instructor": ["Tracy M Hodgson"], "class_attributes": "Prerequisites apply, see description<br/><br/>", "id": "20515", "subject": "BIOL_SCI"}]