[{"school": "WCAS", "overview_of_class": "In this seminar, students will develop their own research projects on manga, comics, or graphic novels while working together through a comparative reading list of Jewish, Japanese, and American graphic narratives. Although the course readings will focus primarily on documentary, historical, and realist works, students are encouraged to pursue interests in other genres and styles.<br/><br/>The point of departure for our collective readings will be the rhetorical figure of &quot;metastasis&quot; or displacement. We will examine metastasis not only in formal terms?as the production of narrative movement through sequences of static images, but also in historical terms?as psychological and physical displacements wrought by Japanese and Jewish immigration to the United States, Japanese American internment, and the Holocaust.", "name": "Topics in Combined Studies", "section": "20", "topic": "Manga &amp; The Graphic Novel", "course": "385-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4620/WCAS/ENGLISH/385-0/34928", "instructor": ["Andrew Way Leong"], "id": "34928", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "This course examines the varieties of audio/visual discourse native to and sustained by the Internet and the World Wide Web. Topics may include memes, selfies, supercuts, animated .gifs, comments, search engines, trolling, casual games, etc. While &quot;sharing&quot; and &quot;connection&quot; typically rule discussions of what networks do or enable, our aim will be to analyze how web-based genres promote affects that diverge from conventional accounts but nonetheless constitute much of networked life, e.g. boredom, cuteness, disinhibition, etc. We will proceed by pairing readings in critical theory and new media studies alongside artworks.", "name": "Topics in Combined Studies", "section": "21", "topic": "Critical Internet Studies", "course": "385-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4620/WCAS/ENGLISH/385-0/37727", "instructor": ["James Joseph Hodge"], "id": "37727", "subject": "ENGLISH"}]