[{"school": "WCAS", "overview_of_class": "The Talmud is one of the most important works of Jewish literature. For the last millennium, Talmud study has been a central part of Jewish religious and cultural practice. Despite the splintering of Judaism into different denominations, Jews the world over are unified by their commitment to studying Talmud. The Talmud is an unusual work of literature, and it has been credited as an influence on codes of law, sermons, modern works of Jewish literature, and even Seinfeld. This course will explain the Talmud's import and durability within Jewish culture while introducing students to the rigors of legal analysis that lie at the heart of most talmudic passages. The course is ideal for those interested in religion, law, logic games and questions of textual interpretation. The course will study the Talmud entirely in English translation; there is neither a language prerequisite nor an expectation of prior experience reading the Talmud.<br/><br/>THIS COURSE WILL COINCIDE WITH A LAUNCHING OF A MOOC (MASSIVE OPEN ONLINE COURSE) ON TALMUD AT NORTHWESTERN. THERE WILL BE SOME FLIPPED CLASSROOM CLASSES THAT UTILIZE THE MOOC MATERIALS AND STUDENTS FROM THE COURSE WILL HAVE THE OPTION TO SERVE AS MOOC DISCUSSION LEADERS.", "name": "Topics in Judaism", "section": "20", "topic": "The Talmud: A Methodological Introduction", "course": "339-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4620/WCAS/RELIGION/339-0/34732", "instructor": ["Barry Scott Wimpfheimer"], "id": "34732", "subject": "RELIGION"}, {"school": "WCAS", "overview_of_class": "In this course, students will be challenged to think about feminism through the lens of women committed to traditional, at times even fundamentalist, religious values. We will investigate the ways in which such women negotiate their status and examine the evolving feminist movements that have arisen within traditional religious life. More specifically, we will focus on a case study of feminist activism among Orthodox Jewish women in Israel, in a comparative perspective with Evangelical women and Muslim women in the USA. Some of the central questions we will engage are: how are the forms of feminist identity and activism among women in traditional religious traditions similar? In what ways can feminist activism within religious life be compared with secular feminist activism?", "name": "Topics in Judaism", "section": "21", "topic": "Women in Trad'l ReligiousMvmts", "course": "339-0", "meeting_time": ["MoWe 12:30PM - 1:50PM"], "path": "/class-descriptions/4620/WCAS/RELIGION/339-0/34733", "instructor": ["Yael   Israel-Cohen"], "id": "34733", "subject": "RELIGION"}]