[{"class_mtg_info": [{"meet_t": "Mo 4:00PM - 6:50PM", "meet_l": "Locy Hall 110"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "23334", "title": "WCAS GNDR_ST 394-0-20 Professional Linkage Seminar", "class_attributes": "", "section": "23334", "instructors": [{"instructor_phone": "", "instructor_name": "Joan K Sherman", "instructor_addr": ""}], "topic": "International Development and the Politics of Gend", "course": "394-0", "descriptions": [{"name": "Overview of class", "value": "This course provides students with a practitioners' perspective on how gender and the development field have progressed from the paternalism of colonization to the ambitious platform of the United Nations Decade of Woman to the more recent United Nations Strategic Development Goals. The goals and mechanisms of including women in development programs continue to be greatly scrutinized. Both in theory and in practice, the field of development has had to recognize that economic and social change is never gender neutral: that power struggles over resources whether between ministries or within a family are greatly affected by gender issues.<br/><br/>We will examine what occurs when institutions make deliberate decisions regarding development using a women/gender lens. How have the competing objectives of different organizations, state policies, and philosophies challenged practical implementation? What happens to finite resources when a &quot;new&quot; actor is suddenly given center stage? How well have program and development specialists understood gender? How reluctantly or willingly have they responded to the mandate of prioritizing gender when engaging in economic development? Case examples and student research papers will explore both the desired and unanticipated effects that development projects have had on the quality of life and availability of opportunities for women in the developing world."}, {"name": "Teaching Method", "value": "DiscussionThis course is designed around student interaction and discussion. Students are strongly encouraged to bring in articles from the general media on a topic of relevance to the field of development. <br/><br/>Response papers (minimum 2 pages) that offer a student's opinion and response to one or more of the assigned readings for that class will be required. <br/><br/>The final paper (minimum 15 pages) provides students the opportunity to explore a topic of their interest in greater depth. This paper serves as the final assessment for the course."}, {"name": "Evaluation Method", "value": "Participation/media: 25%<br/>Weekly Papers: 25%<br/>Case study: 10%<br/>Final Paper: 40%"}], "lmod": "1/9/16 6:48 PM (CT)", "subject": "GNDR_ST"}]