[{"school": "WCAS", "overview_of_class": "This seminar explores the ways in which historians strive to understand the political ideas and practices of Islamic activists since the late 19th century. While the course will allow students to familiarize themselves with various Muslim intellectuals and modern currents of thought (Islamic modernism, Islamism, post-Islamism, Wahhabism and Salafism), our primary goal will be to reflect on how scholars approach the history of mental constructs, how underlying assumptions about modernity, religion in general and Islam in particular shape the narratives that scholars produce, and how these narratives may determine the judgments we make about the \"evolution\" of Islamic thought and activism (often described in terms of progress and regress).", "name": "Approaches to History", "section": "20", "topic": "Islamic Political Thought & Activism in Modern Mid", "course": "393-0", "meeting_time": ["We 6:00PM - 9:00PM"], "path": "/class-descriptions/4650/WCAS/HISTORY/393-0/25707", "instructor": ["Henri   Lauziere"], "id": "25707", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "Vietnamese refugees and Korean immigrants came to the United States with experiences of war that are passed to younger generations as both silence and memory. How can we understand and represent the experiences of both the older and younger generations? How do their experiences transform the history of Asian Americans as well as the broader history of the United States? What does war mean in the American experience? This research seminar focuses on Vietnamese American and Korean American communities in the Chicago area in an attempt to answer these and other questions through focused oral history research and public presentations.", "name": "Approaches to History", "section": "24", "topic": "Memories of War", "course": "393-0", "meeting_time": ["Tu 3:30PM - 6:20PM"], "path": "/class-descriptions/4650/WCAS/HISTORY/393-0/25708", "instructor": ["Ji-Yeon   Yuh"], "id": "25708", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "The idea of the \"slave narrative\" usually brings to mind the published works of antebellum fugitive slaves like Frederick Douglass and Harriet Jacobs. But enslaved and formerly enslaved people created testimonials to their experiences in a variety of ways, and not only for publication. This course will explore the range of ways enslaved and formerly enslaved people provided or enabled written accounts of their lives in the 19th and 20th centuries?letters, interviews, published accounts, etc. We will also examine how the mainstream historical profession viewed those accounts, moving from skepticism in the early twentieth century, to cautious acceptance today. Are slave testimonials any more difficult to work with than other historical sources? What have literary scholars taught historians about using slave testimony?", "name": "Approaches to History", "section": "26", "topic": "The Slave's Narrative", "course": "393-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4650/WCAS/HISTORY/393-0/25675", "instructor": ["Leslie Maria Harris"], "id": "25675", "subject": "HISTORY"}]