[{"school": "WCAS", "overview_of_class": "This course explores the history of women in the United States from 1865 to the present. We will examine women's changing roles as wage earners, mothers, and activists.  We will also explore how prevailing ideas about race, gender, work, and the family shaped women's lives, in both the public and private arenas.", "name": "Gender, Sexuality and History", "section": "1", "location": "Loder Hall Lower Level 023", "topic": "American Women's History", "course": "321-0", "meeting_time": ["MoWe 12:30PM - 1:50PM"], "path": "/class-descriptions/4610/WCAS/GNDR_ST/321-0/23339", "instructor": ["Katherine   Masur"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "23339", "subject": "GNDR_ST"}, {"school": "WCAS", "overview_of_class": "Christian theorists were convinced that human sexuality underwent an irreversible debasement as a result of the sin of Adam and Eve. Their negative assessment has remained with us until the present day. This course will grapple with the both the origins of this negative bequest as well as some of the anomalies of the medieval tradition. For example, despite the insistence that heterosexuality was ordained by God, the disparagement of physicality and women led to the institutionalization of clerical celibacy in the West. This, in turn, fostered a gay subculture. Likewise, despite the theoretical insistence on a separation between the sexes that was even present in the afterlife, these same theorists not only praised \"virile women,\" but occasionally celebrated cross-dressing in female saints! This course will examine the institutions and ideas that dominated the construction of gender in the Middle Ages. It will also lend insight into not one, but many, \"sexualities.\"", "name": "Gender, Sexuality and History", "section": "2", "location": "Locy Hall 301", "topic": "Medieval Sexuality", "course": "321-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4610/WCAS/GNDR_ST/321-0/23340", "instructor": ["Dyan H Elliott"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "23340", "subject": "GNDR_ST"}]