[{"school": "WCAS", "overview_of_class": "Until the middle of the nineteenth century, there existed no single knowledge system that dominated the planet. Arguably, even today there is not one science, not one therapeutic framework, and not one form of technology, but myriad, overlapping, and even contradictory systems. Yet whether in Asia, Africa, Europe, or the Americas, certain baseline assumptions about the material universe do prevail and are combined with ways of knowing and intervening that began to predominate globally from the eighteen-fifties onwards. This course foregrounds the historical geographies of the sciences, explaining their diverse genealogies and unevenness around the world. We will explore both the large and small-scale struggles over knowledge and technology, including therapeutics, that took place over the last several centuries to create the epistemological and technoscientific terrain in which we live. If economic historians have been animated by questions of a \"great divergence\" between Asian and European standards of living in the modern era, historians of science have circled around questions of a great divide, since the so-called \"revolutions\" in science of the early modern period, between ethnoscience and technoscience. This seminar is designed for graduate students interested in area studies, global and transnational history, and science and technology studies and should offer a set of critical methods and concepts with which to pursue these interests. We will consider why dominant perspectives have taken shape, how they have circulated, what they explain or allow, and the ways in which they have been modified over time and place. Students will be encouraged to use their existing expertise as a point of departure, approaching course questions and texts from the region and/or time period that most interests them.", "name": "Topics in History", "section": "20", "location": "Harris Hall L40", "topic": "Ethnoscience and Technoscience in Global History", "course": "492-0", "meeting_time": ["We 2:00PM - 4:50PM"], "path": "/class-descriptions/4640/WCAS/HISTORY/492-0/17510", "instructor": ["Helen Louise Tilley"], "class_attributes": "", "id": "17510", "subject": "HISTORY"}]