[{"class_mtg_info": [{"meet_t": "MoWeFr 10:00AM - 10:50AM", "meet_l": "University Hall 101"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "12353", "title": "WCAS HISTORY 370-1-1 History of the Islamic Middle East: 600-1200", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "12353", "instructors": [{"instructor_phone": "847/491-7448", "instructor_name": "Carl Forbes   Petry", "instructor_addr": "Harris Hall Room 329"}], "associated_classes": [{"component": "DIS", "room": "University Hall 412", "meeting_time": "We 2:00PM - 2:50PM"}, {"component": "DIS", "room": "University Hall 118", "meeting_time": "Th 9:00AM - 9:50AM"}, {"component": "DIS", "room": "University Library 3622", "meeting_time": "Fr 3:00PM - 3:50PM"}, {"component": "DIS", "room": "TBA", "meeting_time": "TBA"}, {"component": "DIS", "room": "TBA", "meeting_time": "TBA"}, {"component": "DIS", "room": "TBA", "meeting_time": "TBA"}], "topic": "", "course": "370-1", "descriptions": [{"name": "Overview of class", "value": "The course surveys the period of Middle Eastern History which witnessed the emergence of Islam, as a religion, political system and cultural tradition. During the Middle Ages (ca. 550-1250 C.E.), Islam united the disparate regions of North Africa and Western Asia and provided the stimulus for unprecedented cultural fluorescence and economic growth, as depicted in the opulence of The Arabian Nights. We shall examine the career of the Prophet Muhammad, who functioned as God's messenger, and subsequently consider the critical social and intellectual issues resulting from the evolution of Muhammad's legacy into a world civilization. The course will terminate with an analysis of the first serious external challenges to this civilization: the Crusades from Western Europe and the Mongol Invasion from Central Asia."}, {"name": "Registration Requirements", "value": "GRADING BASIS: No P/N option (ANC only)"}, {"name": "Teaching Method", "value": "TEACHING METHOD: Lecture and discussion, supplemented by video/slide presentations."}, {"name": "Evaluation Method", "value": "EVALUATION METHOD: There will be a mid-term and a final examination, both in-class. The mid-term will be modified take-home (questions distributed in advance but written in class). The final (covering the second half of the course) will not involve questions distributed in advance. N.B.: twenty percent of the grade will be based on active participation in discussion sections."}, {"name": "Class Materials (Required)", "value": "***Tentative until order posted to Norris website<br/>V. O. Egger - A History of the Muslim World to 1405 - Pearson/Prentice Hall - 9780130983893A. Knysh - Islam in Historical Perspective - Prentice Hall - 9780321398772W. H. McNeill - The Islamic World - U. Chicago - 9780226561554"}, {"name": "Class Notes", "value": "NOTES: Mandatory attendance at first class and discussion sections"}], "lmod": "10/30/16 7:06 PM (CT)", "subject": "HISTORY"}]