[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Technological Institute F285"}], "school": "WCAS", "overview_of_class": "The increasing worldwide demand for energy presents a number of complex interdisciplinary challenges, from resource depletion to climate change. This class will challenge students to answer the question, How shall we power the world in the 21st century? We will examine the history and geography of energy use; links between energy and climate change; challenge of sustainability; and the fundamental science of climate change.", "qtr": "Fall 2017", "name": "Contemporary Energy and Climate Change", "title": "WCAS EARTH 342-0-01 Contemporary Energy and Climate Change", "lmod": "5/9/17 7:20 PM (CT)", "section": "01", "topic": "Contemp Energy/Clim Chng", "course": "342-0", "enrl_requirement": "Enrollment Requirements: Pre-Registration is reserved for EARTH majors &amp; minors and ENVR_SCI majors.<br/><br/>Registration reserved for Graduate students or seniors majoring in Physics, Chemistry, Biology, Math, EPS, Biol Anthro, Mat Sci, Chem Eng, Mech Eng, Civ Eng, Envir Eng, Envr Sci, or Electrical Eng.", "descriptions": [{"name": "Overview of class", "value": "The increasing worldwide demand for energy presents a number of complex interdisciplinary challenges, from resource depletion to climate change. This class will challenge students to answer the question, How shall we power the world in the 21st century? We will examine the history and geography of energy use; links between energy and climate change; challenge of sustainability; and the fundamental science of climate change."}, {"name": "Registration Requirements", "value": "Open to graduate students from all disciplines, senior undergraduates majoring in natural sciences or engineering, and other interested undergraduates by instructor consent."}, {"name": "Learning Objectives", "value": "- Consider the history of energy use and industrialization, and how this shapes the modern world<br/>- Track & quantify their own energy consumption and the energy embodied in products and services<br/>- Discuss the benefits and drawbacks of historical and present-day patterns of global energy consumption in terms of social costs/benefits and sustainability<br/>- Evaluate the scientific evidence regarding human-caused climate change<br/>- Survey practical aspects of major alternative energy technologies<br/>- Monitor and critique news media coverage of energy-related topics<br/>- Research and discuss the trade-offs associated with various energy technologies and proposals"}, {"name": "Teaching Method", "value": "Two 80 minute lectures per week"}, {"name": "Evaluation Method", "value": "Exam(s)<br/>Homeworks<br/>One group project"}, {"name": "Class Materials (Required)", "value": "1. Wolfson, R. SECOND EDITION, 2012. Energy, Environment and Climate, Norton & Company, available at the Norris bookstore or through online sellers) $50-$80.<br/> Please let me know if you would like access to a reserve copy at the library.<br/>2. Coursepack-$25<br/>3. Additional readings will be posted on Canvas."}, {"name": "Class Notes", "value": "Course is for graduate standing or senior undergrads in the sciences or engineering. Instructor permission is required for all other undergrads."}], "instructor": ["Bradley B Sageman"], "class_attributes": "Natural Sciences Distro Area<br/><br/>Seniors/Grad Students Only<br/><br/>", "id": "16378", "subject": "EARTH"}]