[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "Parkes Hall 223"}], "school": "WCAS", "overview_of_class": "An encyclopedic epic that tracks three Dubliners' criss-crossing adventures on 16 June 1904, James Joyce's landmark Ulysses captures a day in the life of a semicolonial city in a wealth of analytic-in his word, vivisective-detail. Proposing that Ulysses has much to teach us about how to read our own everyday worlds, we'll study the book's eighteen episodes alongside sources, annotations, and commentaries. In thinking about all the fictional Dubliners who populate Ulysses, we'll consider Joyce's translation of Homer's Odyssey into a modern epic quest; Ireland's long colonial history and its struggle to throw off British rule; the characters' sometimes conflicting dreams of a sovereign Ireland; the resonances of home, exile, and homecoming; psychoanalytic theory of the unconscious and what Freud called \"the psychopathology of everyday life\"; scapegoat dynamics in theory and everyday practice; relations among bodies, desire, gender, representational strategies, and social power; performance-studied and unconscious-and theatricality; the pain and mourning of loss; the power of love; the scalpel of wit; the social life?and, often, political bite-of comedy and humor; the socio-economic sex/gender system, including marriage and prostitution, as key to political authority, including Joyce's comment on women's emancipation as \"the greatest revolution of our time\"; the characters' subjective and intersubjective dynamics; and the power and pleasure of language within the book's play of voices and styles:  interior monologue, dialogue, reported speech, omniscient authority, poetry, news, advertising, jokes, parody, obfuscation, song, music, play script, letters, catechism, allusion, citation, non-English words, &c. We'll approach this challenging, maddening, amazing, exhilarating, deeply rewarding book in ways playful and critical, jocoserious and analytic; and we'll seek revelation by engaging it with serious purpose and imaginative freedom.", "qtr": "Winter 2016", "name": "Studies in 20th-Century Literature", "title": "WCAS ENGLISH 368-0-20 Studies in 20th-Century Literature", "lmod": "1/9/16 6:47 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Christine   Froula", "instructor_addr": ""}], "topic": "Joyce's \"Ulysses\"", "course": "368-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "An encyclopedic epic that tracks three Dubliners' criss-crossing adventures on 16 June 1904, James Joyce's landmark Ulysses captures a day in the life of a semicolonial city in a wealth of analytic-in his word, vivisective-detail. Proposing that Ulysses has much to teach us about how to read our own everyday worlds, we'll study the book's eighteen episodes alongside sources, annotations, and commentaries. In thinking about all the fictional Dubliners who populate Ulysses, we'll consider Joyce's translation of Homer's Odyssey into a modern epic quest; Ireland's long colonial history and its struggle to throw off British rule; the characters' sometimes conflicting dreams of a sovereign Ireland; the resonances of home, exile, and homecoming; psychoanalytic theory of the unconscious and what Freud called &quot;the psychopathology of everyday life&quot;; scapegoat dynamics in theory and everyday practice; relations among bodies, desire, gender, representational strategies, and social power; performance-studied and unconscious-and theatricality; the pain and mourning of loss; the power of love; the scalpel of wit; the social life?and, often, political bite-of comedy and humor; the socio-economic sex/gender system, including marriage and prostitution, as key to political authority, including Joyce's comment on women's emancipation as &quot;the greatest revolution of our time&quot;; the characters' subjective and intersubjective dynamics; and the power and pleasure of language within the book's play of voices and styles: interior monologue, dialogue, reported speech, omniscient authority, poetry, news, advertising, jokes, parody, obfuscation, song, music, play script, letters, catechism, allusion, citation, non-English words, &amp;c. We'll approach this challenging, maddening, amazing, exhilarating, deeply rewarding book in ways playful and critical, jocoserious and analytic; and we'll seek revelation by engaging it with serious purpose and imaginative freedom."}, {"name": "Teaching Method", "value": "Lecture and discussion."}, {"name": "Evaluation Method", "value": "Attendance and participation, blackboard posts, class presentation, option of two shorter papers or one longer paper or project."}, {"name": "Class Materials (Required)", "value": "Required: Joyce, Ulysses (Modern Library); Don Gifford with Robert J Seidman, Ulysses Annotated (California); Homer, The Odyssey (Fitzgerald translation); recommended: Joyce, Dubliners; R. Ellmann, James Joyce (Oxford, 1982); Joyce, Occasional, Critical, and Political Writing, ed. K. Barry (Oxford, 1991)."}], "path": "/class-descriptions/4610/WCAS/ENGLISH/368-0/25462", "instructor": ["Christine   Froula"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "25462", "subject": "ENGLISH"}, {"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "University Hall 122"}], "school": "WCAS", "overview_of_class": "The founding slogan of second-wave feminism, \"the personal is political,\" fuses the prospect of revolutionary transformation to the details of intimate life.  At its peak in the 1970s, second-wave feminism unites radical politics and the challenge of reimagining how everyday life may be lived.  As both utopia and dystopia, the genre of science fiction plays a vital role in second-wave feminism's visions of new world orders and new modalities of power, gender, embodiment, sensation, love, and obligation.  This class will explore the literary, formal, and theoretical centrality of science fiction to second-wave feminist thought.  We will begin with Sylvia Plath's The Bell Jar, which plots the collision of feminine normativity and the novel's realist representational form.  We'll then read a series of second-wave utopian/ dystopian texts that far exceed the bounds of realism:  Ursula K. Le Guin, The Left Hand of Darkness; Monique Wittig, Les Guérillières; Joanna Russ, The Female Man; Margaret Atwood, The Handmaid's Tale; Octavia Butler, Dawn; Marge Piercy, He, She and It; Nalo Hopkinson, Brown Girl in the Ring.<br/><br/>We will read shorter accompanying second-wave and contemporary theory to further our exploration of embodiment, technology, feminist utopia, and/ or feminist critical methodology, including:  Donna Haraway, \"The Cyborg Manifesto\"; Monique Wittig, The Straight Mind; Kimberlé Crenshaw, \"Demarginalizing the Intersection of Race and Sex\"; Malini Johar Schueller, \"Analogy and (White) Feminist Theory:  Thinking Race and the Color of the Cyborg Body\"; Shulamith Firestone, Dialectic of Sex; Jane Bennett, Vibrant Matter; Karen Barad, \"Posthumanist Performativity\"; Anne Fausto-Sterling, Sexing the Body; Elizabeth Grosz, Coming Undone.", "qtr": "Winter 2016", "name": "Studies in 20th-Century Literature", "title": "WCAS ENGLISH 368-0-21 Studies in 20th-Century Literature", "lmod": "1/9/16 6:47 PM (CT)", "section": "21", "instructors": [{"instructor_phone": "", "instructor_name": "Helen F Thompson", "instructor_addr": ""}], "topic": "Utop & Dyst Sci-Fi of 2nd Wave", "course": "368-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "The founding slogan of second-wave feminism, &quot;the personal is political,&quot; fuses the prospect of revolutionary transformation to the details of intimate life. At its peak in the 1970s, second-wave feminism unites radical politics and the challenge of reimagining how everyday life may be lived. As both utopia and dystopia, the genre of science fiction plays a vital role in second-wave feminism's visions of new world orders and new modalities of power, gender, embodiment, sensation, love, and obligation. This class will explore the literary, formal, and theoretical centrality of science fiction to second-wave feminist thought. We will begin with Sylvia Plath's The Bell Jar, which plots the collision of feminine normativity and the novel's realist representational form. We'll then read a series of second-wave utopian/ dystopian texts that far exceed the bounds of realism: Ursula K. Le Guin, The Left Hand of Darkness; Monique Wittig, Les Guérillières; Joanna Russ, The Female Man; Margaret Atwood, The Handmaid's Tale; Octavia Butler, Dawn; Marge Piercy, He, She and It; Nalo Hopkinson, Brown Girl in the Ring.<br/><br/>We will read shorter accompanying second-wave and contemporary theory to further our exploration of embodiment, technology, feminist utopia, and/ or feminist critical methodology, including: Donna Haraway, &quot;The Cyborg Manifesto&quot;; Monique Wittig, The Straight Mind; Kimberlé Crenshaw, &quot;Demarginalizing the Intersection of Race and Sex&quot;; Malini Johar Schueller, &quot;Analogy and (White) Feminist Theory: Thinking Race and the Color of the Cyborg Body&quot;; Shulamith Firestone, Dialectic of Sex; Jane Bennett, Vibrant Matter; Karen Barad, &quot;Posthumanist Performativity&quot;; Anne Fausto-Sterling, Sexing the Body; Elizabeth Grosz, Coming Undone."}, {"name": "Teaching Method", "value": "Discussion"}, {"name": "Class Materials (Required)", "value": "Please see the course description above for details."}], "path": "/class-descriptions/4610/WCAS/ENGLISH/368-0/25463", "instructor": ["Helen F Thompson"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "25463", "subject": "ENGLISH"}]