[{"school": "SoC", "overview_of_class": "Learning objectives: The first portion of this course is focused on documentary cinematography, lighting and sound. Using the Canon C100 camera, students will learn the technical and aesthetic challenges and opportunities of shooting non-fiction.<br/><br/> <br/><br/>The second portion of the course will center on the basic theoretical, organizational, and practical aspects of editing documentary - using Avid Media Composer.<br/><br/> <br/><br/>By the end of the course, students will have a practical grasp of shooting and editing workflows using each of these technologies and they will be able to communicate in the language of cinematography.<br/><br/> <br/><br/>Evaluation method: Class participation &amp; discussion, partnered collaboration, readings, shooting &amp; editing assignments.<br/><br/> <br/><br/>Class materials: The Shut Up and Shoot Documentary Guide (2nd Ed.), by Anthony Q. Artis.; Additional texts TBD.<br/><br/> <br/><br/>2TB Thunderbolt or USB 3.0 external drive. Add'l backup drive strongly recommended.<br/><br/> <br/><br/>Class notes: Registration is reserved for Documentary Media MFA Students.", "name": "Seminar: Studies in Film and Video Prod", "section": "20", "topic": "Doc Cinematography/Editing", "course": "479-0", "meeting_time": ["Tu 9:00AM - 11:50AM"], "path": "/class-descriptions/4640/SoC/RTVF/479-0/14291", "instructor": ["James Christian Jensen"], "id": "14291", "subject": "RTVF"}, {"school": "SoC", "overview_of_class": "Learning objectives: This course focuses primarily on audio recording outside of the studio environment and introductory digital audio processing within Pro Tools. We will learn methods and technologies of field recording through a series of demonstrations, hands-on experiences, and assignments. The audio collected in these assignments will become the subject of Pro Tools projects designed to explore the most relevant aspects of the software for documentary audio production.<br/><br/> <br/><br/>Evaluation method: Class participation, partnered collaboration, readings, field recording &amp; sound mixing assignments.<br/><br/> <br/><br/>Class materials: A portable hard drive with 250 gig of free space.<br/><br/> <br/><br/>Class notes: Registration is reserved for Documentary Media MFA Students.", "name": "Seminar: Studies in Film and Video Prod", "section": "21", "topic": "Doc Field Recording/Pro Tools", "course": "479-0", "meeting_time": ["Th 9:00AM - 11:50AM"], "path": "/class-descriptions/4640/SoC/RTVF/479-0/14292", "instructor": ["James Christian Jensen"], "id": "14292", "subject": "RTVF"}, {"school": "SoC", "overview_of_class": "", "name": "Seminar: Studies in Film and Video Prod", "section": "22", "topic": "HD Cinematography", "course": "479-0", "meeting_time": ["Tu 6:00PM - 8:50PM"], "path": "/class-descriptions/4640/SoC/RTVF/479-0/14293", "instructor": ["Jeff Clayton Brown"], "id": "14293", "subject": "RTVF"}]