[{"class_mtg_info": [{"meet_t": "Mo 6:00PM - 8:50PM", "meet_l": "ANTHRO Sem Rm 104 - 1810 Hinmn"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "23083", "title": "WCAS ANTHRO 332-0-20 The Anthropology of Reproduction", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "23083", "instructors": [{"instructor_phone": "847/491-4825", "instructor_name": "Caroline H Bledsoe", "instructor_addr": "1810 Hinman Ave., Room 201, EV Campus"}], "topic": "", "course": "332-0", "descriptions": [{"name": "Overview of class", "value": "The goal of sociocultural anthropology, the largest subfield of anthropology and the core of the discipline, is to understand the dynamics of human variation in social action and cultural thought. A key question is how these variations are produced and reproduced, whether we speak of society (subsistence, ideas) or individuals (biology, psychology, social identity). Conversely, what happens when reproduction fails to occur, or does so when and how it should not. Because reproduction is so strongly associated with biology in our society, viewing it through a cultural lens poses significant challenges to some of our most basic tenets. Tensions arise in questions of agency vs. control, nature vs. culture, identity construction, reproducing under varying conditions, and so on. The study of reproduction, therefore, offers a window into the heart of anthropology itself. The goals of this course are (1) to expose students to just a few of the many sociocultural approaches to reproduction by ranging broadly across topics, time, and place; and (2) to identify and evaluate concepts and theories embedded in writings on the dynamics of reproduction. While the concept of &quot;reproduction&quot; can refer to societal reproduction, emphasis will be on the reproduction of children. To this end, possible topics may include fostering/adoption, AIDS orphans, fatherhood, technologies of fertility control, assisted reproduction, obstetrics, gender imbalances in Asia, debates over abortion, etc."}, {"name": "Registration Requirements", "value": "One course in sociocultural anthropology."}, {"name": "Evaluation Method", "value": "Class sessions will be a mix of lectures and seminar, with three main components. 1. A final take-home exam will be worth about half of the grade. 2. The remainder of the grade will be in two or more short papers (no more than 4 pages each) on the readings, with class presentations. For the short papers, students are welcome to include findings from the Web or other outside sources. NOTE: In all cases, these sources must be properly cited. 3. Quality of class participation in general."}, {"name": "Class Materials (Required)", "value": "1) Kahn, Susan Martha. Reproducing Jews: A Cultural Account of Assisted Conception in Israel. Durham: Duke 2000. 978-0822325987<br/>2) Kertzer, David. The Kidnapping of Edgardo Mortara. Vintage [or] Knopf 1997/8. 978-0679768173<br/>3) Fong, Vanessa. Only Hope: Coming of Age under China's One-Child Policy. Stanford University Press. 2004. 978-0804753302"}, {"name": "Class Notes", "value": "No P/N allowed. Preference given majors. For others, at least one course in sociocultural anthropology is required. Email Prof. Bledsoe at cbledsoe@northwestern.edu if you are concerned about whether you meet this general prerequisite."}], "lmod": "12/25/16 6:54 PM (CT)", "subject": "ANTHRO"}]