[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Locy Hall 110"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Winter 2016", "name": "23670", "title": "WCAS PHIL 109-6-20 First-Year Seminar in Philosophy", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "23670", "instructors": [{"instructor_phone": "8474677536", "instructor_name": "David Buckley Ebrey", "instructor_addr": "Crowe 1-103"}], "topic": "Homer &amp; Plato: Phil, Poetry Heroic Ideal", "course": "109-6", "descriptions": [{"name": "Overview of class", "value": "Plato admired Homer, but frequently finds himself criticizing him. In this course, we will read Homer alongside Plato in order to think about the value of literature and the substantive ethical ideals represented in these two authors. Is literature good for us? If so, how? Is it dangerous to read literature that puts forward a bad ethical model? What value, if any, do myths have in helping us to understand the world? What is it to be courageous? How do we understand courage within and outside of war? What role does knowledge or wisdom have in living a good life?"}, {"name": "Registration Requirements", "value": "First-year students only"}, {"name": "Learning Objectives", "value": "The primarily goal is to learn how to think through philosophical issues, how to discuss what you understand and what puzzles you, and how to craft a paper that articulates a puzzle and presents a solution. In all of these activities, we will work on being exceptionally clear and careful. The secondary goal is to think through central questions about how to live and the value of literature that are raised by Homer and Plato."}, {"name": "Evaluation Method", "value": "Two short reaction papers (25%), a final paper (50%), presentations and class discussion (25%)"}, {"name": "Class Materials (Required)", "value": "Plato: Complete Works (edited by John Cooper) ISBN: 860-1401282075<br/>The Illiad of Homer (trans. Lattimore) ISBN: 978-0226470498<br/>The Odyssey of Homer (trans. Lattimore) ISBN: 860-1404209468"}], "lmod": "1/9/16 6:51 PM (CT)", "subject": "PHIL"}]