[{"class_mtg_info": [{"meet_t": "Th 5:00PM - 7:50PM", "meet_l": "Harris Hall L07"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "22648", "title": "WCAS LEGAL_ST 376-0-20 Topics in Legal Studies", "class_attributes": "", "section": "22648", "instructors": [{"instructor_phone": "", "instructor_name": "Laura B Nielsen", "instructor_addr": "Legal Studies: 620 Lincoln St #204, Sociology: 1808 Chicago Ave # 209"}, {"instructor_phone": "847 491 3987", "instructor_name": "Joanna Lynn Grisinger", "instructor_addr": "620 Lincoln St #201"}], "topic": "Hamilton: Bullets, Banks, &amp; Broadway", "course": "376-0", "descriptions": [{"name": "Overview of class", "value": "Legal St 376-0-20 &quot;HAMILTON: BULLETS, BANKS, AND BROADWAY&quot;, Winter 2017, Prof. Laura Beth Nielsen &amp; Prof. Joanna Grisinger<br/><br/>This interdisciplinary course examines Alexander Hamilton (the founding father) and Hamilton: An American Musical (the Tony, Grammy, and Pulitzer-winning musical) from an interdisciplinary perspective. Taught in Legal Studies, with the help of faculty from Theater, African-American Studies, Communications, Political Science, SESP, and History, the course examines topics including Building a Constitution: Who's Included and Not Included in Story of the Founding; Dueling Culture, Reputation, and Honor in Early America and Today; Founders' Chic: What would Hamilton, Jefferson, Madison, and Washington Think if They Were Alive Today? And Should We Care?; Theater and Social Change: Cultural Output and Adaptation; Hamilton and the Building of the American Economy; and the Law and Economics of the Hip Hop Aesthetic: Sampling, Fan Fiction, and Fair Use. All students enrolled in the course will receive a complimentary ticket to see the show in Chicago on January 12, 2017."}, {"name": "Registration Requirements", "value": "Priority registration for students in Legal Studies, History, Political Science, Sociology, African American Studies, Theater, and SESP. More details at http://www.legalstudies.northwestern.edu/courses/Hamilton.html"}, {"name": "Learning Objectives", "value": "By the end of the course, students will be expected to understand Alexander Hamilton as a historical figure; understand the legal, political, economic, and social context of Hamilton's era; and understand &quot;Hamilton: An American Musical&quot; as a text."}, {"name": "Teaching Method", "value": "Lecture and discussion"}, {"name": "Evaluation Method", "value": "Multiple short papers."}, {"name": "Class Materials (Required)", "value": "? Ron Chernow, Alexander Hamilton (Penguin, 2005) ISBN # 0143034758<br/>? Additional reading will be available via Canvas"}, {"name": "Class Notes", "value": "Attendance at First Class Required. Reading required for first day of class.<br/>You must be able to attend the Hamilton Musical show in Chicago on the evening of January 12, 2017.<br/><br/>For more information, see the Hamilton Course webpage: http://www.legalstudies.northwestern.edu/courses/Hamilton.html"}], "lmod": "12/29/16 7:01 PM (CT)", "subject": "LEGAL_ST"}]