[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "Parkes Hall 214"}], "school": "WCAS", "overview_of_class": "With the number of refugees, asylum-seekers and internally displaced people worldwide, for the first time in the post-World War II era, exceeding 65 million people, countries are closing their borders. In the United States the Trump Administration issued Executive Orders suspending refugee admission for four months and reducing the country's total refugee admissions for the fiscal year 2017 by more than half. Across Europe the situation for refugees is just as bleak. Through this course you will better understand the politics of international responses to refugee crises. We will learn about the obligations of signatory states to the Refugee Convention, the role of refugee hosting states, the ways in which the humanitarian system of refugee protection contributes to global cooperation and its shortcomings. In our course we will focus on six case studies - Vietnam, Burma (Myanmar), Afghanistan, Iraq, Somalia, Rwanda in order to consider the differences in the kinds of refugee situations we have today and learn about what it means to be a refugee. Through the lens of refugee movement and the lived experience of refugees in trying to seek a safe haven in a world of nation states, we will critically examine key terms in comparative politics such as national sovereignty, cooperation and rule of law and the relationship between refugee movement, democratic stability and state building.", "qtr": "Fall 2017", "name": "Refugee Crises and Human Rights", "title": "WCAS POLI_SCI 380-0-20 Refugee Crises and Human Rights", "lmod": "5/8/17 2:18 AM (CT)", "section": "20", "topic": "", "course": "380-0", "enrl_requirement": "Enrollment Requirements: Pre-registration - Reserved for Political Science students.", "descriptions": [{"name": "Overview of class", "value": "With the number of refugees, asylum-seekers and internally displaced people worldwide, for the first time in the post-World War II era, exceeding 65 million people, countries are closing their borders. In the United States the Trump Administration issued Executive Orders suspending refugee admission for four months and reducing the country's total refugee admissions for the fiscal year 2017 by more than half. Across Europe the situation for refugees is just as bleak. Through this course you will better understand the politics of international responses to refugee crises. We will learn about the obligations of signatory states to the Refugee Convention, the role of refugee hosting states, the ways in which the humanitarian system of refugee protection contributes to global cooperation and its shortcomings. In our course we will focus on six case studies - Vietnam, Burma (Myanmar), Afghanistan, Iraq, Somalia, Rwanda in order to consider the differences in the kinds of refugee situations we have today and learn about what it means to be a refugee. Through the lens of refugee movement and the lived experience of refugees in trying to seek a safe haven in a world of nation states, we will critically examine key terms in comparative politics such as national sovereignty, cooperation and rule of law and the relationship between refugee movement, democratic stability and state building."}, {"name": "Learning Objectives", "value": "1. To encourage you to reflect on the challenges and ethical concerns of responding to refugee crisis.<br/><br/>2. To introduce you to the international framework for the protection of refugees. <br/><br/>3. To learn about and critically assess the politics of refugee protection and provide you with case studies and analytical tools to examine and appreciate the responsibilities, challenges and constraints of state cooperation and burden sharing.<br/><br/>4. To help you appreciate and critically analyze multiple perspectives on the themes and topics.<br/><br/>5. To encourage you to develop your own understanding on refugee protection and the challenges of promoting human rights and social justice.<br/><br/>6. To help you pose research questions and communicate your ideas, both oral and written, clearly and with confidence."}, {"name": "Teaching Method", "value": "Lecture and Discussion"}, {"name": "Evaluation Method", "value": "Participation, reading responses, refugee situation presentation and final paper"}, {"name": "Class Materials (Required)", "value": "William Maley, What is a Refugee (Oxford University Press, 2016)"}], "instructor": ["Galya Benarieh Ruffer"], "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "id": "13731", "subject": "POLI_SCI"}]