[{"school": "WCAS", "overview_of_class": "This seminar pairs a series of key texts in the history of critical thought with canonical fiction and poetry of the Romantic era. You'll learn about critical movements?psychoanalysis, Marxism, feminism, and post-structuralism or deconstruction?by testing their substantive and methodological claims against poems, novels, plots, images, and fictions. As the class proceeds, you'll be able to mix and match critical and literary texts to experiment with the kinds of interpretations and arguments their conjunctions make possible. How do entities like history, class struggle, the unconscious, manifest versus latent content, patriarchy, the body, sex, gender, signification, and textuality continue to engender literary meaning and galvanize the claims we make for the poems and novels we read?<br/><br/>We'll pair Karl Marx's Communist Manifesto and William Blake's Songs of Innocence and Songs of Experience; Sigmund Freud's The Interpretation of Dreams and Mary Shelley's Frankenstein; William Wordsworth's Lyrical Ballads and key essays in Jacques Derrida's theory of deconstruction; and Jane Austen's Pride and Prejudice and Simone de Beauvoir's The Second Sex. There will be short supplemental critical or historical materials to flesh out some of these methodologies and provide context for the literary texts. Again, you'll be encouraged to recombine authors and approaches as we proceed. A central aim of this class will be to facilitate your appreciation of not only the substantive claims made by Marx, Freud, Derrida, and Beauvoir, but also the methodological possibilities that their challenging worldviews open for the interpretation of literature. At the same time, we'll appreciate that Blake, Shelley, Wordsworth, and Austen are also critical thinkers: indeed, perhaps their poetic and fictional texts anticipate the methodological and historical provocations offered by Marx and the rest. As we gain facility with some of the dominant methodological strands of literary analysis, we'll think about their historical roots in the Romantic era and ponder the still urgent critical possibilities they open for us today.", "name": "Introductory Seminar in Reading & Interpretation", "section": "20", "location": "Harris Hall L05", "topic": "Romanticism and Criticism", "course": "298-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4620/WCAS/ENGLISH/298-0/34911", "instructor": ["Helen F Thompson"], "class_attributes": "", "id": "34911", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "Unexplained disappearances, stolen treasures, shocking murders: to solve such mysteries, detectives must interpret the clues. In this course on detective fiction and literary interpretation, we'll follow various fictional sleuths as they encounter secret letters and broken locks, inscrutable puzzles and explosive twists, devious criminals and revelations about themselves. We'll see that detective work echoes literary criticism in many ways: detectives identify relevant details, track signs and patterns, scrutinize character, and look closely as well as broadly to determine the implications of their evidence?just as we do when analyzing the images, metaphors, and narrative structures that supply proof for our scholarly claims. How do fictional detectives model the art of interpretation, and what are the limits of their methods? We will read classics drawn from the American, Victorian, and contemporary traditions, as well as secondary scholarship on the history and formal trademarks of detective fiction. We'll trace the 19th-century origins of the genre in short works by Arthur Conan Doyle and Edgar Allan Poe, study the relationship between detection and narration in Wilkie Collins' The Moonstone, and examine how postmodernism transforms the quest for truth in Thomas Pynchon's The Crying of Lot 49. How do these texts play on our ideas about knowledge, criminality, and narrative form? What makes a mystery solvable? How does detective fiction comment on cultural questions of gender, class, race, and nationality? To fully explore such questions and expand students' methodological repertoires, this course will also include readings drawn from several schools of literary theory, including psychoanalysis, post-structuralism, Marxism, feminism, and postcolonial studies.", "name": "Introductory Seminar in Reading & Interpretation", "section": "21", "location": "University Library 4670", "topic": "Mysteries, Detectives, Clues", "course": "298-0", "meeting_time": ["MoWe 12:30PM - 1:50PM"], "path": "/class-descriptions/4620/WCAS/ENGLISH/298-0/34912", "instructor": ["Maha Zehra Jafri"], "class_attributes": "", "id": "34912", "subject": "ENGLISH"}]