[{"class_mtg_info": [{"meet_t": "Tu 2:00PM - 4:50PM", "meet_l": "Scott Hall 201 Ripton Room"}], "school": "WCAS", "overview_of_class": "This seminar focuses on the parallel development of international law and capitalism since the industrial revolution, considering this development from both a normative and historical perspective. In particular, we will explore tensions between the principles of peace and protection of human rights that guide international law as a system of sovereign states, on the one hand, and the complex set of laws and policies that regulate global market economies and empower private actors, on the other. In our discussions, we will weave together normative debates on the justification of property rights, the proper role of the State vis-à-vis society, and the legitimacy of international law (from classic authors like Locke, Kant and Grotius to contemporaries like Milton Friedman, Rawls and Habermas) with historical and sociological analyses of the development of capitalism and international law (from classic authors like Braudel and Polanyi to more recent but still historically oriented scholars like Watson and Bull). A question we will be investigating is if and how debates about national and global capitalism have changed over time. Our historical and normative focus should help us address in the last part of the seminar some of the current challenges that the development of global capitalism poses to the system of states at the core of international law: from non-territorial intellectual property rights to denationalized rights and obligations of corporations and other non-state actors, the role of the State vis-à-vis society in current systems of multilevel governance, democratic deficits of global governance institutions, etc.", "qtr": "Winter 2017", "name": "Seminar in Contemporary Philosophy", "title": "WCAS PHIL 423-0-20 Seminar in Contemporary Philosophy", "lmod": "2/5/17 6:46 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "8474912550", "instructor_name": "Cristina   Lafont", "instructor_addr": "Crowe 1-127"}, {"instructor_phone": "847/491-4842", "instructor_name": "Karen   Alter-Hanson", "instructor_addr": "Scott Hall #318"}], "topic": "Global Capitalism and Law", "course": "423-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "This seminar focuses on the parallel development of international law and capitalism since the industrial revolution, considering this development from both a normative and historical perspective. In particular, we will explore tensions between the principles of peace and protection of human rights that guide international law as a system of sovereign states, on the one hand, and the complex set of laws and policies that regulate global market economies and empower private actors, on the other. In our discussions, we will weave together normative debates on the justification of property rights, the proper role of the State vis-à-vis society, and the legitimacy of international law (from classic authors like Locke, Kant and Grotius to contemporaries like Milton Friedman, Rawls and Habermas) with historical and sociological analyses of the development of capitalism and international law (from classic authors like Braudel and Polanyi to more recent but still historically oriented scholars like Watson and Bull). A question we will be investigating is if and how debates about national and global capitalism have changed over time. Our historical and normative focus should help us address in the last part of the seminar some of the current challenges that the development of global capitalism poses to the system of states at the core of international law: from non-territorial intellectual property rights to denationalized rights and obligations of corporations and other non-state actors, the role of the State vis-à-vis society in current systems of multilevel governance, democratic deficits of global governance institutions, etc."}, {"name": "Registration Requirements", "value": "Professor consent for non-philosophy graduate students and undergraduates."}, {"name": "Learning Objectives", "value": "The goals of the seminar are (1) to analyze the development of global capitalism and international law from a normative and historical perspective, (2) to explore the normative tensions between the principles of peace and protection of human rights that guide international law, on the one hand, and the complex set of laws and policies that regulate global market economies, on the other, and (3) to deepen the students' understanding of contemporary debates on the possibilities of a more democratic international order while enhancing their oral debate and writing skills."}, {"name": "Teaching Method", "value": "Group work: Group Presentations<br/>Seminar"}, {"name": "Evaluation Method", "value": "Presentation and class discussion (30%), final paper (70%)"}, {"name": "Class Materials (Required)", "value": "Books, and provided articles and excerpts.<br/><br/>Books <br/>Rawls, J., The Law of Peoples, Harvard University Press, 1999. ISBN 9780674005426<br/>Polanyi, K., The Great Transformation, Beacon Press, 1957. ISBN 9780807056431<br/>Articles &amp; Book Excerpts <br/>Alter, K., The New Terrain of International Law: Courts, Politics, Rights, Princeton University Press 2014, 335-344, 351-365.<br/>Braudel, F., &quot;Capitalism and Dividing up the World&quot;, in Afterthoughts on Material Civilization and Capitalism, Johns Hopkins University Press, 1977, 79-117.<br/>Bull, H., &quot;The Importance of Grotius in the Study of International Relations,&quot; in H. Bull, B. Kingsbury and A. Roberts, eds., Hugo Grotius and International Relations, Clarendon Press,1990, 65-94.<br/>Bull, H., &quot;The Emergence of an International Society,&quot; in H. Bull and A. Watson's The Expansion of International Society, Oxford University Press, 1985, 117-126.<br/>Fakhir, M., Sugar and the making of international trade law, Cambridge University Press, 2015, 211-214.<br/>Freeman, S., &quot;Illiberal libertarians: Why Libertarianism Is Not a Liberal View&quot;, Philosophy and Public Affairs 30/2 (2001), 105-151.<br/>Friedman, M., Capitalism and Freedom, The University of Chicago Press, 1962, 1-36.<br/>Habermas, J., &quot;A Political Constitution for the Pluralist World Society?&quot; in Between Naturalism and Religion, MIT Press, 2008, pp. 312-53, <br/>Habermas, J., &quot;From the international to the cosmopolitan community,&quot; in The Crisis of the European Union. A Response, Polity Press, 2012, pp. 53-70.<br/>Hayek, F., &quot;The Economic Conditions of Interstate Federalism,&quot; in Individualism and the Economic Order, The University of Chicago Press, 1948, 255-72.<br/>Harmes, A., &quot;New Constitutionalism and Multilevel Governance&quot; in Gill &amp; Cutler, eds. New Constitutionalism and World Order, 143-158.<br/>Holmes S. and C. Sunstein, The Cost of Rights. Why Liberty Depends on Taxes, Norton &amp; Company, 1999, 13-48.<br/>Kant, I., &quot;Private Right&quot;, §§1-17, 41-42, in The Metaphysics of Morals, ed. by M. Gregor, Cambridge University Press, 1996, 37-56, 84-86. <br/>Kant, I., &quot;Perpetual Peace&quot; in Political Writings, ed. by H. S. Reiss, Cambridge University Press, 1991, 93-130. <br/>Lafont, C., &quot;Alternative visions of a new global order: what should cosmopolitans hope for?&quot; Ethics &amp; Global Politics 1/2 (2008), 41-60.<br/>Lafont, C., &quot;Human Rights, Sovereignty, and the Responsibility to Protect,&quot; Constellations 22/1 (2015), 68-78.<br/>Locke, J., &quot;On Property&quot; in Two Treatises of Government, P. Laslett, ed., Cambridge University Press, 1988, 285-302, 350-53. <br/>Ripstein, A., Force &amp; Freedom. Kant's Legal and Political Philosophy, Harvard University Press, 2009, 86-106, 145-181. <br/>Shue, H., &quot;Correlative Duties&quot;, in Basic Rights, 1996, 2nd edition, Princeton University Press, 35-64. <br/>Trubek, D., &quot;Max Weber on Law and the Rise of Capitalism,&quot; Wisconsin Law Review 3 (1972), 720-753.<br/>Waldron, J., The Right to Private Property, Clarendon Press, 1988, 137-252.<br/>Watson, A., &quot;European International Society and its Expansion,&quot; in H. Bull and A. Watson, The Expansion of International Society, Oxford University Press, 1985, 13-32. <br/>Walker, N., Intimations of Global Law, Cambridge University Press, 2015, 1-28, 178-205."}], "path": "/class-descriptions/4650/WCAS/PHIL/423-0/22786", "instructor": ["Cristina   Lafont", "Karen   Alter-Hanson"], "class_attributes": "Graduate Students Only<br/><br/>", "id": "22786", "subject": "PHIL"}]