[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Meets in Non-General PurposeRm"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Spring 2016", "name": "37796", "title": "WCAS GEN_LA 280-6-26 Residence-Linked Seminar - VI (Literature and Fine Arts)", "class_attributes": "Permission of Instructor<br/><br/>", "section": "37796", "instructors": [{"instructor_phone": "", "instructor_name": "John M Haas", "instructor_addr": ""}], "topic": "Musical Theatre Reportoire: The Golden Age, 1940-1", "course": "280-6", "descriptions": [{"name": "Overview of class", "value": "The purpose of this course is to expose students to the somewhat lost musicals and the greatest hits of music theatre in the era commonly referred to as the Golden Age of musicals. Through class discussion, lecture, listening exams, and screenings, the students will leave learning over 100 songs and the history of some of the most important musicals of the 20th century and how those musicals forever shaped the art of music theatre."}, {"name": "Learning Objectives", "value": "<ul><br/><li> Students will be able to identify approximately 100 songs from musicals from The Golden Age when provided the music, lyrics, or both together. This has a benefit of not only enhancing a performer's repertoire, but expanding the knowledge of musical structure for non-performers. </li><br/><li> Students will develop a working knowledge of the structure of significant musicals in The Golden Age so that they can identify common and distinctive features in plot, story themes, and cultural evolution.</li><br/><li> Students will learn about the history and writing process of the composers of these musicals, including the most important collaborations, so they can trace the influences and styles within and across musicals<br/></li><br/><ul>"}, {"name": "Evaluation Method", "value": "4 - 25 SONG LISTENING QUIZZES; 3 - 2 PAGE PERFORMANCE COMPARISON PAPERS; 1 - GROUP PRESENTATION ON A GOLDEN AGE SHOW"}], "lmod": "4/3/16 8:01 PM (CT)", "subject": "GEN_LA"}]