[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Harris Hall L05"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores<br/>Add Consent: Department Consent Required<br/>", "qtr": "Fall 2016", "name": "14762", "title": "WCAS ENGLISH 105-6-26 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>Attendance at 1st class mandatory<br/><br/>", "section": "14762", "instructors": [{"instructor_phone": "847/467-5592", "instructor_name": "Kathleen   Carmichael", "instructor_addr": "555 Clark St., #239"}], "topic": "The Credible Writer", "course": "105-6", "descriptions": [{"name": "Overview of class", "value": "What makes a writer credible? In other words, how do readers determine what writers deserve their trust? Every day we place our confidence in strangers who advise us on matters that range from the immediate (movies and restaurants) to the long-term (our money and our health). Yet high-profile scandals?such as fraudulent reporting at the New York Times?remind us that we must not place our faith too casually. In this course, we will examine the relationship between writers and their readers with an eye to understanding how the style, social context, and unspoken assumptions of a written work help inspire our confidence or elicit our disbelief in both the context of fiction and non-fiction. Students will be asked to consider the ethical responsibilities both of readers, alert to the possibility of misrepresentation or fraud, and of writers seeking to establish their own credibility and authority. <br/><br/>Course readings will include works of fiction, journalism, and writings from the natural and social sciences. We will also consider practical topics such as how University library resources and experts can help students locate and evaluate key sources and develop authoritative arguments."}, {"name": "Teaching Method", "value": "Discussion and workshop"}, {"name": "Evaluation Method", "value": "This course requires three papers and periodic writing assignments in the class portfolio (approximately 25 pages total). All papers will be written in stages and revised. Quarter grades will cover writing (approximately 70%) and class participation (30%, including attendance and in-class presentations)."}, {"name": "Class Materials (Suggested)", "value": "Readings will be selected from: David Foster Wallace, A Supposedly Fun Thing I'll Never Do Again and selected essays; Amy Tan , The Opposite of Fate; Tracy Kidder, Mountains Beyond Mountains and selected essays; Paul Farmer, selected essays; Short pieces by Mark Kramer and others"}], "lmod": "10/30/16 7:04 PM (CT)", "subject": "ENGLISH"}]