[{"class_mtg_info": [{"meet_t": "We 2:00PM - 4:50PM", "meet_l": "Annenberg Hall G29"}], "school": "SoC", "enrl_requirement": "Enrollment Requirements: Reserved for Comm Studies juniors.  Majors who study abroad a full year may enroll senior year.  Comm_ST 394-0 may not be repeated.", "qtr": "Winter 2017", "name": "23538", "title": "SoC COMM_ST 394-0-21 Communication Studies Research Seminar", "class_attributes": "Attendance at 1st class mandatory<br/><br/>Department Majors Only<br/><br/>Juniors Only<br/><br/>", "section": "23538", "instructors": [{"instructor_phone": "", "instructor_name": "James J Schwoch", "instructor_addr": ""}], "topic": "Eco-Media: Alaska", "course": "394-0", "descriptions": [{"name": "Overview of class", "value": "This course explores various trajectories and developments in the general area of media, communication and the environment, with a particular focus on Alaska. Students will complete a research project equivalent to a 20-page written paper, as is consistent with the CS 394 requirement. Alaska is the central theme of the seminar, although students also have the opportunity to explore other media-communication-environment themes. 2017 marks the 150th anniversary of the Alaska Purchase, and two Northwestern University were centrally involved in the events that led up to the USA purchase of Alaska Territory from Russia in 1867. There is a glacier in Alaska named in honor of Northwestern University. Topics discussed in class, and possible research topics, include attempts to build a telegraph and cable system across Alaska to Siberia in the 1860s, and the role of Northwestern faculty as scientific researchers for that project; the emergence of electronic communication networks in Alaska over the past 150 years, including both commercial and military networks; the recent rise of &quot;Alaska TV shows&quot; on American television; the indigenous peoples of Alaska and their self-representation through media production; and studies about Alaska, the Arctic, and global climate change. The instructor will work with each student to develop a research topic. The class will also provide an introduction and overview to ways in which environmental concepts can be approached and understood from the perspectives of media and communication studies."}], "lmod": "12/29/16 6:45 PM (CT)", "subject": "COMM_ST"}]