[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "University Hall 312"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "24963", "title": "WCAS HISTORY 392-0-22 Topics In History", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "24963", "instructors": [{"instructor_phone": "", "instructor_name": "Aram Gregory Sarkisian", "instructor_addr": ""}], "topic": "1917: One Year That Shook the World", "course": "392-0", "descriptions": [{"name": "Overview of class", "value": "This course presents the events of 1917 to probe the fundamental and lasting impact of this pivotal year on global history. We will examine the factors which prompted a broad cast of historical actors to reorganize their social, political, and religious worlds in new and unprecedented ways, including the rise of Bolshevism in Russia, the contentious politics of immigration and racial difference in the United States during the Progressive Era, the horrific ravages of the Great War, and the remapping of the Middle East following the Balfour Declaration, to name but a few examples. We will use a variety of primary and secondary sources, as well as works of literature, art, music, and film, to explore how the 365 days of 1917 irrevocably transformed global conceptions of modernity, altered the processes and ramifications of international conflict and war, and helped to usher in new challenges of a shrinking, increasingly interconnected world. This course proposes that as a result, historical actors in 1917 set the stage for many of the conflicts and debates of our twenty-first century."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "AttendanceClass participationPapersTwo short primary source responses (1-2 pages), a short midterm essay (8-10 pages), a long final essay (15-20 pages), and attendance and engaged participation"}, {"name": "Class Materials (Required)", "value": "John Reed, Ten Days That Shook the World (2007 Penguin Classics edition)<br/>ISBN: 978-0141442129<br/><br/><br/>David Kennedy, Over Here: The First World War and American Society<br/>ISBN: 978-0195173994<br/><br/><br/>Jonathan Schneer, The Balfour Declaration: The Origins of the Arab-Israeli Conflict<br/>ISBN: 978-0812976038<br/><br/><br/>Sheila Fitzpatrick, The Russian Revolution ISBN: 978-0199237678<br/><br/><br/>Coursepack"}, {"name": "Class Notes", "value": "Attendance at first class is mandatory plus required attendance at two evening film screenings (Warren Beatty's Reds (1981) and David Lean's Lawrence of Arabia (1962). Laptops and electronic devices are prohibited in class meetings.<br/><br/>HISTORY AREA OF CONCENTRATION: Americas, Europe, Global"}], "lmod": "1/9/16 6:48 PM (CT)", "subject": "HISTORY"}]