[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "University Hall 121"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "11970", "title": "WCAS ENGLISH 324-0-20 Studies in Medieval Literature", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "11970", "instructors": [{"instructor_phone": "", "instructor_name": "Katharine Helen Breen", "instructor_addr": ""}], "topic": "Medieval Genres, Modern Texts", "course": "324-0", "descriptions": [{"name": "Overview of class", "value": "The 1988 film Stand and Deliver has become part of contemporary American conversations about race, immigration, and education. But have you ever considered it as an example of the medieval literary genre of the saint's life? Or thought about the classic western 3:10 to Yuma (remade in 2007 with Russell Crowe and Christian Bale) as a version of the medieval morality play? In this course we will consider modern and contemporary cultural objects in relation to the medieval genres that inform them. We will read a selection of medieval texts designed to produce working definitions of the medieval genres of saint's life, romance, and morality play before exploring modern instantiations of those genres in a variety of media. Beyond finding often-surprising traces of the modern in the medieval and the medieval in the modern, we will consider ways in which characteristically medieval genres and tropes are brought to bear on modern problems. In what contexts and to what ends is the medieval cited as a source of timeless truth, or as paradigmatically backward? When and why is it evoked as a site of moral or cultural purity, or as a site of unspeakable barbarity?"}, {"name": "Teaching Method", "value": "Mostly discussion, some lecture."}, {"name": "Evaluation Method", "value": "Papers, quizzes, short exercises, class participation."}, {"name": "Class Materials (Required)", "value": "Athanasius, &quot;The Life of Saint Anthony;&quot; Sulpicius Severus, &quot;The Life of Saint Martin&quot;; The Life of Christina of Markyate; Ramón Menéndez, Stand and Deliver; Sir Gawain and the Green Knight; Ramon Chandler, The Big Sleep; Mankind; Everyman; Delmer Daves, 3:10 to Yuma; James Mangold, 3:10 to Yuma."}], "lmod": "10/30/16 7:04 PM (CT)", "subject": "ENGLISH"}]