[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "Technological Institute LG68"}], "school": "MEAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "13703", "title": "MEAS MECH_ENG 417-0-20 Multi-scale Modeling and Simulation in Solid Mechanics", "class_attributes": "", "section": "13703", "instructors": [{"instructor_phone": "847/491-7094", "instructor_name": "Wing K Liu", "instructor_addr": "Technological Institute, Rm A326, 2145 Sheridan Rd, EV CAMPUS"}], "topic": "Nanostruct, Polymer Composite", "course": "417-0", "descriptions": [{"name": "Overview of class", "value": "Projects typically include a multi-scale simulation aspect and some preliminary theoretical concepts on the expected observations. There will be one midterm project and one final project. Topics of midterm project is nanowire. Topics for the final project: students will have the opportunity to apply the concepts that they have learned in class to a research problem of their own interest."}, {"name": "Learning Objectives", "value": "1) Understand the underlying principles of molecular dynamics (equations of motion for atoms, atomic interactions).<br/>2) Gain proficiency in designing molecular dynamics simulations using available software (LAMMPS). <br/>3) Understand the connection between information available on small (atomistic) and large (continuum) scales. <br/>4) Be able to use molecular dynamic simulation (MD) data in a finite element simulation (ABAQUS), and be able to explain the results. <br/>5) Applications<br/>a. Nanostructure materials: Nanowires: single crystal Si; Nano Carbons: nanotube, graphite, and nano-diamond.<br/>b. Polymer nano-composite: polymer mechanics, polymer and polymer-fillers modeling, Multi-scale modeling (MD, Continuum)"}, {"name": "Evaluation Method", "value": "Homework<br/>There will be two homework assignments during the term. The purpose of the homework is to provide the students with an opportunity to apply theoretical and computational concepts to multi-scale problems."}, {"name": "Class Materials (Suggested)", "value": "There is no required textbook. Some resources relevant to this class are provided below: <br/>Liu, Wing Kam, Karpov, Eduard G., and Park. Harold S., Nano Mechanics and Materials: Theory,<br/>Multiscale Methods and Applications. John Wiley &amp; Sons, Ltd, 2006.<br/>Schroeder, Daniel V. An Introduction to Thermal Physics. Addison Wesley Longman, 1999.<br/>Fish, Jacob and Belytschko, Ted, A First Course in Finite Elements. John Wiley &amp; Sons, Ltd, 2007.<br/>Belytschko, Ted, Liu, Wing Kam, and Moran, Brian, Nonlinear Finite Elements for Continua and<br/>Structures. John Wiley &amp; Sons, Ltd, 2000."}, {"name": "Class Notes", "value": "Software: LAMMPS and ABAQUS will be used for the simulations.<br/>Lab session will be held on Wed (if needed) or mutually agreeable time."}], "lmod": "10/30/16 6:44 PM (CT)", "subject": "MECH_ENG"}]