[{"school": "WCAS", "overview_of_class": "This course will provide an introduction to conversations in the field of Black Studies that grapple with theories of blackness, as they relate to the concepts of gender, and to a lesser degree, sexuality. The course will use sound recordings, visual art, and performance art to facilitate emerging conversations around the relationship of blackness to conceptualizations of gender and sexuality.", "name": "Topics in African-American Studies", "section": "1", "topic": "Theories of Black Gender and Black Sexuality", "course": "380-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4650/WCAS/AF_AM_ST/380-0/21731", "instructor": ["Brittnay Louise Proctor"], "id": "21731", "subject": "AF_AM_ST"}, {"school": "WCAS", "overview_of_class": "This seminar explores the relationship between race and the state, specifically focusing on the extraordinary but contradictory role of government laws, policies, and regulations in defining and manipulating racial classification schemas, creating and maintaining circumstances of racial oppression, and alleviating and redressing racial inequality through anti-discrimination protections. Topics include the political development of racial census classifications, the New Deal and the emergence of the welfare state, criminal justice and mass incarceration, neoliberalism and poverty governance, and affirmative action policies and jurisprudence. Ultimately, we will examine the ways that the state and its political institutions actively produce categories of race, class, and gender, transform their meanings, and redefine their relationships to democratic ideals and prevailing models of U.S. politics and citizenship.", "name": "Topics in African-American Studies", "section": "2", "topic": "The Racial State", "course": "380-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4650/WCAS/AF_AM_ST/380-0/21732", "instructor": ["Debra Elizabeth Thompson"], "id": "21732", "subject": "AF_AM_ST"}, {"school": "WCAS", "overview_of_class": "This course will examine how sexuality?together with race, gender, and class?figures into contemporary urban political economy in North American cities. Taking a historical sociological approach, the course will ask students to consider the shift from the assimilation politics of the middle twentieth century to the multicultural politics of neoliberalism as a major factor in the racialization of the &quot;Gayborhood.&quot; Taking into account the broad cultural shift from compulsory whiteness and heteronormativity to anti-black multiculturalism and the embrace of the &quot;creative class,&quot; students will consider how certain axes of difference are incorporated in the race to attract young white professionals to cities, towns, and suburbs, and which modes of difference blunt that very project. Which types of difference?in terms of race, gender, class, and sex?remain on the wrong side of urban political economy? By the end of this course, students should be able to critically assess the ways sexual and racial difference are deployed to create, maintain, and resist power in the neoliberal city.", "name": "Topics in African-American Studies", "section": "3", "topic": "(Race and) Sex and the City", "course": "380-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4650/WCAS/AF_AM_ST/380-0/21733", "instructor": ["Jackson Christopher Bartlett"], "id": "21733", "subject": "AF_AM_ST"}]