[{"class_mtg_info": [{"meet_t": "Mo 5:00PM - 7:50PM", "meet_l": "Kresge 3354 German Seminar Rm."}], "school": "WCAS", "overview_of_class": "Described as a fundamental \"break in civilization\" (Dan Diner) or a caesura in Enlightenment humanism, the term \"Holocaust\" designates the systematic persecution and murder of over two-thirds of the European Jews by the Nazi regime and its collaborators. More than half a century later, a vast body of fiction and non-fiction writing has been dedicated to recording, imagining, extrapolating from, and attempting to comprehend these catastrophic events. It has been argued that the Holocaust cannot be represented (aesthetic limitations), that it should not be represented (Bilderverbot/ban on graven images), and that it must be born witness to and never forgotten (ethical imperatives). So, what exactly is Holocaust writing? This course seeks to answer this question through the analysis of both canonical and lesser-known variants of autobiographical as well as fiction writing about and by Holocaust survivors, such as Primo Levi, Tadeusz Borowski, Jorge Semprun, Grete Weil, and Elie Wiesel. We will explore genres, styles, and tropes associated with Holocaust writing by examining the use of irony, satire, and hyperbole (Hans Keilson, Georges Perec), as well as the grotesque or even pornographic in fiction (Edgar Hilsenrath, Ka-Tzetnik 135633), through to the critical circumscription of the essay form (Jean Améry, Primo Levi, T.W. Adorno); up to its ongoing impact in the field of continental philosophy (Robert Antelme, Marguerite Duras, Sarah Kofman, Maurice Blanchot, Jacques Derrida, Jean-François Lyotard, Giorgio Agamben). Other topics that will be addressed include the question of authenticity (the Wilkomirski affair); the \"era of the witness\" and the status of testimony (Shoshana Felman, Dori Laub, Annette Wieviorka); copyright and the reproduction of memory (Anne Frank, Marianne Hirsch); revenge and fantasy (Aharon Appelfeld, Wolfgang Hildesheimer), the connection between writing and affect in postwar therapeutic and psychoanalytic writing (Hans Keilson, Bruno Bettelheim, Viktor Frankl); and, finally, what might be called Holocaust writing of the second degree (David Grossman, D.M. Thomas, W.G. Sebald).", "qtr": "Spring 2017", "name": "German Literature, Critical Thought, and New Media since 1945", "title": "WCAS GERMAN 404-0-20 German Literature, Critical Thought, and New Media since 1945", "lmod": "2/26/17 6:46 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "847/467-5173", "instructor_name": "Anna Maree Parkinson", "instructor_addr": "1800 Campus Drive, 3-321 Kresge Centennial Hall, Evanston"}], "topic": "Holocaust Writing", "course": "404-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Described as a fundamental \"break in civilization\" (Dan Diner) or a caesura in Enlightenment humanism, the term \"Holocaust\" designates the systematic persecution and murder of over two-thirds of the European Jews by the Nazi regime and its collaborators. More than half a century later, a vast body of fiction and non-fiction writing has been dedicated to recording, imagining, extrapolating from, and attempting to comprehend these catastrophic events. It has been argued that the Holocaust cannot be represented (aesthetic limitations), that it should not be represented (Bilderverbot/ban on graven images), and that it must be born witness to and never forgotten (ethical imperatives). So, what exactly is Holocaust writing? This course seeks to answer this question through the analysis of both canonical and lesser-known variants of autobiographical as well as fiction writing about and by Holocaust survivors, such as Primo Levi, Tadeusz Borowski, Jorge Semprun, Grete Weil, and Elie Wiesel. We will explore genres, styles, and tropes associated with Holocaust writing by examining the use of irony, satire, and hyperbole (Hans Keilson, Georges Perec), as well as the grotesque or even pornographic in fiction (Edgar Hilsenrath, Ka-Tzetnik 135633), through to the critical circumscription of the essay form (Jean Améry, Primo Levi, T.W. Adorno); up to its ongoing impact in the field of continental philosophy (Robert Antelme, Marguerite Duras, Sarah Kofman, Maurice Blanchot, Jacques Derrida, Jean-François Lyotard, Giorgio Agamben). Other topics that will be addressed include the question of authenticity (the Wilkomirski affair); the \"era of the witness\" and the status of testimony (Shoshana Felman, Dori Laub, Annette Wieviorka); copyright and the reproduction of memory (Anne Frank, Marianne Hirsch); revenge and fantasy (Aharon Appelfeld, Wolfgang Hildesheimer), the connection between writing and affect in postwar therapeutic and psychoanalytic writing (Hans Keilson, Bruno Bettelheim, Viktor Frankl); and, finally, what might be called Holocaust writing of the second degree (David Grossman, D.M. Thomas, W.G. Sebald)."}, {"name": "Learning Objectives", "value": "? Evaluation and critique of a body of primarily Western European canonical literature and critical theoretical approaches to the Holocaust. <br/>? Examination of the Holocaust both as historical event and as an ethical rupture in regard to questions of proper and improper forms of representation (the so-called \"Bilderverbot\"), West European humanist, existentialist postwar, as well as postmodern philosophical approaches, and political discourses on power and sovereignty. <br/>? Exploration of the relationship between fact and fiction, ethics and fantasy, in fiction/literature, theoretical and autobiographical accounts.<br/>? Interpretation of the significance of the essay form in Holocaust writing.<br/>? Articulation of significant rhetorical forms and tropes particular to well-known Holocaust literature in contrast with lesser-known, non-canonical literature that deploys irony, satire, and the grotesque in startling and incisive ways. <br/>? Formulation of an abstract, collation of a bibliography, presentation of planned research paper, discussion of ideas with peers, and the production of an independent research paper on a subject of the student's choice."}, {"name": "Teaching Method", "value": "Class participation: 10%<br/>Discussion: 10%<br/>Other: Research Paper: 50%<br/>Presentations: 20%<br/>ReadingsSeminar: 3-hour seminar<br/>Writing assignments"}, {"name": "Evaluation Method", "value": "Class participation: 10%<br/>Other: Discussion: 10%<br/>Paper, final: 50%<br/>Presentations: 20%<br/>"}, {"name": "Class Materials (Required)", "value": "? Agamben, Giorgio, Remnants of Auschwitz: The Witness and the Archive. Zone, 2002. ISBN: 978-1890951177.<br/>? Aharon, Appelfeld, The Iron Tracks: A Novel. Schocken, 1999. ISBN: 978-0805210996.<br/>? Antelme, Robert, The Human Race. Marlboro, 1998. ISBN: 978-0810160613.<br/>? Blanchot, Maurice and Jacques Derrida, The Instance of My Death/Demeure: Fiction and Testimony. Stanford University Press, 200o. ISBN: 978-0804733250.<br/>? Duras, Margeurite, The War: A Memoir. The New Press, 1994. ISBN: 978-1565842212.<br/>? Hildesheimer, Wolfgang, Tynset. Dalkey Archive Press, 2016. ISBN: 978-1628971422.<br/>? Hilsenrath, Edgar, The Nazi and the Barber. Barber Press, 2013. ISBN: 978-3981609219.<br/>? Ka-tzetnik 135633, The House of Dolls. Mass Market Paperback, Pyramid Books, 1977. ASIN: B000NZQQG4. <br/>? Keilson, Hans, Comedy in a Minor Key: A Novel. Farrar, Straus and Giroux, 2010. ISBN: 978-0374126759. <br/>? Kofman, Sara, Smothered Words. Northwestern University Press, 1998. ISBN: 978-0810115057.<br/>? Levi, Primo, Survival in Auschwitz. Touchstone, 1996. ISBN: 978-0684826806.<br/>? Perec, Georges, W, or the Memory of Childhood. Verba Mundi, 2010. ISBN: 978-1567921588.<br/>? Weil, Grete, Last Trolley from Beethovenstraat. David R. Godine, 1997. ISBN: 978-1567920314.<br/>? Thomas, D.M., The White Hotel. Penguin Books, 1993. ISBN: 978-0140231731.<br/>? Wiesel, Elie, Night. Hill and Wang, 2006. ISBN: 978-0374500016.<br/>? Wieviorka, Anette, The Era of the Witness. Cornell University Press, 2006. ISBN: 978-0801473166.<br/>? Wilkomirski, Binjamin, Fragments: Memories of a Childhood, 1939-1945. P/B, First Thus Edition. ISBN: 978-0330349925."}], "path": "/class-descriptions/4660/WCAS/GERMAN/404-0/30897", "instructor": ["Anna Maree Parkinson"], "class_attributes": "", "id": "30897", "subject": "GERMAN"}]