[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:30PM", "meet_l": "Meets in Non-General PurposeRm"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Winter 2016", "name": "27717", "title": "WCAS GEN_LA 280-6-22 Residence-Linked Seminar - VI (Literature and Fine Arts)", "class_attributes": "Permission of Instructor<br/><br/>", "section": "27717", "instructors": [{"instructor_phone": "", "instructor_name": "Linda H. Gates", "instructor_addr": ""}], "topic": "An Exploration Through Performance Of The Language", "course": "280-6", "descriptions": [{"name": "Overview of class", "value": "Alice's Adventures in Wonderland and Through the Looking Glass are two of the most celebrated children's books of all time. The critic Harold Bloom put them on his list of 100 Great Books of Western Literature. The familiar characters of: Alice, The Mad Hatter, the March Hare, the Cheshire cat, the Caterpillar, the White Rabbit, Tweedledum and Tweedledee are all part of our collective cultural awareness. Somewhat less familiar is the language of the book, especially in relation to the characters and the story. &quot;Begin at the beginning, and go on till you come to the end: then stop.&quot; Or &quot;Take care of the sense, and the sounds will take care of themselves.&quot; Or &quot;Why sometimes I've believed as many as six impossible things before breakfast.&quot; Or &quot;If you don't know where you are going, any road will get you there&quot; are all a part of our literary cultural awareness and regularly encountered in political discourse, journalism, critical writing, and literature, According to Harold Bloom, Satire, allusion, and symbolism weave deeper and mysterious meanings, lending a measure of immortality to Carroll's remarkable fantasy. This class will be an exploration of the language of both Alice's Adventures In Wonderland And Through The Looking Glass, looked at through its relation to the world of Victorian English culture and society. The purpose is to introduce students to literature through the art of the oral tradition, exploring how the rich layers of verbal expression support Lewis Carroll's writing and the role of the live, immediate performer in communicating this to an audience."}, {"name": "Learning Objectives", "value": "<ul><br/><li>The use of vocal expression in story telling</li><br/><li>To recognize and understand the rhetoric of vocal expression and how it creates meaning and pleasure for an audience</li><br/><li>How the application of rhetoric and scansion in both prose and the verse forms is applied in performance </li><br/><li>How to enhance performance of narrative through simple multi-media techniques</li><br/></ul>"}, {"name": "Teaching Method", "value": "Lecture, discussion, performance."}, {"name": "Evaluation Method", "value": "Writing 2 papers of 2?3 pages in length. The students would adapt a short hour-long performance piece from both books with a focus on Lewis Carroll's language, both prose and the verse, as well as explore the use of simple multi-media tools to enhance the performance experience. The final script will culminate in a performance in Jones Residential College Great Room. There will also be a possibility of a performance at the bookstore Bookends and Beginnings in their children's book performance area. Students will also write a final two-page paper, on how the language aspects of their performance reflect the Victoria world in which they were written. These papers would be printed as part of the program notes for the audience."}], "lmod": "1/9/16 6:47 PM (CT)", "subject": "GEN_LA"}]