[{"class_mtg_info": [{"meet_t": "MoWe 12:30PM - 1:50PM", "meet_l": "Locy Hall 301"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "26882", "title": "WCAS RELIGION 313-0-20 Tibetan Religion and Culture", "class_attributes": "", "section": "26882", "instructors": [{"instructor_phone": "8474671304", "instructor_name": "Sarah Hieatt Jacoby", "instructor_addr": "Department of Religious Studies, Crowe Hall 5-179, 1860 Campus Drive, Evanston, IL 60208"}], "topic": "", "course": "313-0", "descriptions": [{"name": "Overview of class", "value": "What is Tibet and what are the major features of Tibetan religions? What distinguishes the Tibetan cultural region from its neighbors? How have images of Tibet come to encompass everything from a peaceful Shangri-la on the roof of the world to a superstitious backwater in need of liberation? What does liberation mean in the case of Tibet?both as a religious and a political concept? Who is the Fourteenth Dalai Lama of Tibet and how has he come to be regarded as a god-king for many Tibetans and a splittist aiming to divide the motherland according to the People&#39;s Republic of China? This course will examine the religions of Tibet (primarily Buddhism but also Bön) with a focus on their significance within Tibetan culture, society, and politics in Tibetan history from the time of Tibet&#39;s Imperial Dynasty (7-9th centuries) to the present day. Topics the course will explore include Western imaginations of Tibet, Tibetan religious and political history, Sino-Tibetan conflicts, Tibetan religious and philosophical traditions, Tibetan autobiographical literature, Tibetan medical arts, death rituals, the status of women and nuns in Tibet, the Tibetan Diaspora, the post-Cultural Revolution revival of religion in Tibet, and contemporary restrictions imposed on Tibetan religious institutions and practices by the People&#39;s Republic of China. Course materials include English translations of major Tibetan historical and religious texts, secondary source analyses of these materials, and Tibet-related films and documentaries."}, {"name": "Learning Objectives", "value": "-Understand central features of the historical development and present status of Tibet as a geographic, cultural, religious, and political region<br/>-Gain familiarity with the key philosophical doctrines and ritual practices of Tibetan Buddhism and Bön<br/>-Consider the historical roots and current stakes of the Sino-Tibetan conflict from multiple perspectives<br/>-Cultivate analytical speaking and writing skills through oral presentations, contributing to class discussions, and writing assignments including a take-home midterm and final research paper"}, {"name": "Teaching Method", "value": "Class participationDiscussionFilms / videosLectureWriting assignments"}, {"name": "Evaluation Method", "value": "AttendanceClass participationPaper, finalPaper, mid-termReadings"}], "lmod": "1/9/16 6:53 PM (CT)", "subject": "RELIGION"}]