[{"class_mtg_info": [{"meet_t": "MoTuWeThFr 9:00AM - 12:00PM", "meet_l": "University Hall 412"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Summer 2016", "name": "40351", "title": "WCAS ARABIC 111-1-20 Arabic I", "class_attributes": "", "section": "40351", "instructors": [{"instructor_phone": "8474670927", "instructor_name": "Ragy H Ibrahim Mikhaeel", "instructor_addr": ""}], "topic": "", "course": "111-1", "descriptions": [{"name": "Overview of class", "value": "This first segment of the three-quarter first-year course facilitates students' learning of the alphabet and sound system, and helps them develop basic speaking, listening, reading, and writing skills. It also introduces students to the diglossic sociolinguistic environment of the Arab World, and provides exposure to basic, high frequency regional spoken variety elements. This course is designed for true beginners with no previous background in the language. Students with any background must take a placement test and consult with the Coordinator before enrolling."}, {"name": "Registration Requirements", "value": "None"}, {"name": "Teaching Method", "value": "Class is devoted to learning the script and sounds of Modern Standard Arabic and basic communication and reading skills. Students are required to use audio materials in the Multi-Media Language Center (MMLC). Audio tapes can be checked out for use at home. (The first book in the course textbook series also comes with audio CDs). Students should be prepared to devote additional time to daily homework."}, {"name": "Evaluation Method", "value": "Final grades for the course will be based on: homework, quizzes, mid-term exam, and final exam."}, {"name": "Class Materials (Required)", "value": "Alif Baa: Introduction to Arabic Letters and Sounds | Edition: 3 Author: Kristen Brustad, Mahmoud Al-Batal, Abbas Al-Tonsi ISBN: 9781589016323 Publisher: Georgetown University Press Publication Date: 07/01/2010 Al-Kitaab fii Ta callum al-cArabiyya: A Textbook for Beginning Arabic: Part One | Edition: 3 Author: Kristen Brustad, Mahmoud Al-Batal, Abbas Al-Tonsi ISBN: 9781589017368 Publisher: Georgetown University Press Publication Date: 07/15/2011"}], "lmod": "5/1/16 6:30 PM (CT)", "subject": "ARABIC"}]