[{"school": "WCAS", "overview_of_class": "What makes something funny? Where does comedy end and absurdity?or tragedy?begin? What can comedy teach us about society? What might it reveal about history? In this seminar, we will probe these questions as we examine theories and examples of comedy from across the ages. Focusing in particular on comedy in the English Renaissance and modern Anglo-American culture, we will consider how comedy has developed through time and how historical circumstances influence the ways humor is valued, used, and defined within a society. How, for example, does Shakespeare's Much Ado about Nothing compare with Seinfeld, the so-called &quot;show about nothing&quot;? What is similar or dissimilar about the ways the television show 30 Rock and the Renaissance play Knight of the Burning Pestle approach &quot;meta-comedy&quot;? Throughout the course, we will practice close-reading skills and pay special attention to how style, language, subject matter, and unspoken assumptions make jokes funny.", "name": "Seminar in Reading and Interpretation", "section": "20", "topic": "Comedy From Shakespeare to South Park", "course": "300-0", "meeting_time": ["TuTh 9:30AM - 10:50AM"], "path": "/class-descriptions/4650/WCAS/ENGLISH/300-0/23922", "instructor": ["Rebecca Lynn Fall"], "id": "23922", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "Edgar Allan Poe invented the short story, the detective story, the science fiction story, and modern poetic theory. His stories and essays anticipate the Freudian unconscious and various forms of psychoanalytic, poststructuralist, and modern critical theory. Poe wrote a spooky novel called The Narrative of Arthur Gordon Pym and several volumes of poetry and short stories. As editor or contributor to many popular nineteenth-century American magazines, he wrote sketches, reviews, essays, angelic dialogues, polemics, and hoaxes. This course will focus on Poe's writings as a means of learning how to read and analyze a variety of literary genres, including lyric and narrative poems, the novel, the short story, detective fiction, science fiction, the essay, the literary review, and critical theory. We shall study poetic language, image, meter, and form as well as various story-telling techniques such as narrative point of view, plot, structure, language, character, repetition and recurrence, and implied audience. We shall also study a variety of critical approaches to reading and interpreting Poe's writings, including formalist, psychoanalytic, historicist, Marxist, feminist, queer, critical race, poststructuralist, and postcolonial theory and criticism. We shall conclude by looking at the ways Poe's works have been translated and adapted in a selection of contemporary films and other pop cultural forms.", "name": "Seminar in Reading and Interpretation", "section": "21", "topic": "Poe", "course": "300-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4650/WCAS/ENGLISH/300-0/23923", "instructor": ["Betsy J Erkkila"], "id": "23923", "subject": "ENGLISH"}]