[{"class_mtg_info": [{"meet_t": "MoWe 9:00AM - 11:50AM", "meet_l": "640 Lincoln St Room 135"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "32232", "title": "WCAS AFST 390-0-22 Topics in African Studies", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "32232", "instructors": [{"instructor_phone": "", "instructor_name": "Philippa Ann Skotnes", "instructor_addr": ""}], "topic": "Framing the World", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "AFST 390-0-22 &quot;Framing the World and the Book&quot; (also ART390-0-20) Pippa Skotnes (Spring 2017) <br/><br/>This course will engage with the artist's book and the way in which composition reflects a human view of the world. Through making, discussions and lectures it will examine the ways in which the rectangle has been the most powerful and pervasive device for the visual representation of the world and our multiple relationships within it. Since the beginnings of architecture, and later entrenched by the development first of the codex, and finally the camera, the rectangle frames what we see from our windows, on digital screens, in books, and our cell phones. It shapes long traditions of painting, it creates composition. In this course we will be looking specifically at the way in which the medium of the artist's book can potentially disrupt conventions of both composition and reading and produce creative work that does not take for granted received forms of representation. The course will include a site visit (to the Field Museum) and the making of an artist's book."}, {"name": "Registration Requirements", "value": "ART 390-0-20"}, {"name": "Learning Objectives", "value": "This course will assist students in looking at the legacy of the rectangle as a tool to distance ourselves from, and to shape understanding of, the world around us. It will ask how the rectangle has created conceptions of composition, and will look at the book as both a part of this legacy, and as a means to disrupt it.<br/>In this course you will be asked to address your immediate environment and your daily movement through it, and to compose a creative response to it -outside of the frame. As part of this we will look at the nature of the book, at artists' books, at the ?exploded' book, and produce work that takes these into account while also accommodating other earlier, pre-architectural ways of seeing and representing. The course will include a mix of talks, discussions and project responses. You will all be asked to make an artist's book that both engages with these ideas and disrupts them, calling into question the nature of the book itself. As part of this we will discuss the ways in which a book can be conceptualised and realized. There will be a visit to the Field Museum, as a way of understanding a book as an act of curatorship. Participation in all aspects of the course will be important."}, {"name": "Evaluation Method", "value": "Students will be evaluated on the basis of performance in class, the creativity and inventiveness of their ideas, ability to think outside the frame, and the success of their artist's book in expressing the aims of the course. The bulk of the mark will be comprised of the fieldwork response, and the artist's book, but preparation will also be rewarded.<br/><br/><br/>The course will include two projects.<br/><br/>1. All students will make an artist's book that interrogates or disrupts both the nature of the book and the ways in which such a ?disrupted' book can address issues of composition and the relationships composition describes.<br/><br/>2. There will be a site visit to the Field Museum. All students will create a ?composition' within the museum. This could take the form of guided route, a site-specific sound track, a pamphlet or series of smaller works that encourage alternative engagements with the collections to those presented in the displays.<br/><br/>These may form separate projects or be a part of one larger project."}, {"name": "Class Materials (Required)", "value": "Materials required will depend on the way in which each student chooses to realise the project. A cutting matt, cutting blades and bone folder will be useful tools."}, {"name": "Class Notes", "value": "A field trip to the Field Museum will focus on the ways in which a route through a display or set of displays can be seen as a form of book, and in turn an act of curatorship."}], "lmod": "2/6/17 6:39 PM (CT)", "subject": "AFST"}]