[{"class_mtg_info": [{"meet_t": "MoWeFr 3:00PM - 3:50PM", "meet_l": "University Library 3722"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24108", "title": "WCAS FRENCH 303-0-20 Advanced Conversation", "class_attributes": "", "section": "24108", "instructors": [{"instructor_phone": "847/467-0833", "instructor_name": "Marie-Therese   Pent", "instructor_addr": "1860 S. Campus Drive, Crowe Hall #2-179"}], "topic": "", "course": "303-0", "descriptions": [{"name": "Overview of class", "value": "The goal of this course is the development of oral proficiency through speech functions, conversational routines and patterns, so as to build confidence in the practice of the French language. In order to achieve this goal, emphasis will be put on extensive examination of French press and French television news, French movies, the reading of a book related to the author studied this quarter, and spontaneous expression through dialogues and discussion, and even debates. Special emphasis will be placed on group work and culturally appropriate usage. The students will participate actively in the choice of the materials."}, {"name": "Registration Requirements", "value": "French 301, or consent of instructor"}, {"name": "Teaching Method", "value": "Audio-visual and spoken dialogic based on homework and lab preparations. Students will be expected to keep a &quot;journal&quot; with various exercises, articles, summaries, and their reactions to the class material."}, {"name": "Evaluation Method", "value": "Students will be evaluated on oral individual presentations and also on a group basis. There will be occasional quizzes to test the progress of the students. Preparation and participation will also be important parts of the final evaluation. Therefore regular attendance is essential. Two tests will test the oral comprehension of the students. Final exam based on group presentation and final individual interview."}, {"name": "Class Materials (Required)", "value": "1. Guide with some reading material. (available at Quartet Copies) <br/>2. Book to Read: TBA <br/>3. Students will be asked to provide copies to the class for the ateliers (1-2 times during the quarter) <br/>4. Good dictionaries are recommended: Harper-Collins-Robert French/English /English/French Dictionary, and French/French Dictionary (Micro-Robert)"}], "lmod": "12/25/16 6:59 PM (CT)", "subject": "FRENCH"}]