[{"class_mtg_info": [{"meet_t": "MoWe 12:30PM - 1:50PM", "meet_l": "Locy Hall 314"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Winter 2016", "name": "22764", "title": "WCAS ART_HIST 101-6-1 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "22764", "instructors": [{"instructor_phone": "", "instructor_name": "Stephen F Eisenman", "instructor_addr": ""}], "topic": "Art, Animals and Animal Rights", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "Recent neuro-physiological research on animals (the ones we eat, wear, experiment upon and hunt) has proven they not only feel pain, they experience suffering. Indeed, they possess more or less the same emotions we do including joy, grief, fear, desire, shame etc. The ethical implications of these discoveries are profound, and yet little has changed in human/animal relations. Will the future be different from the past and present?<br/><br/>Though current animal rights advocates tend to believe their generation was the first to recognize animal consciousness, in fact the intuition has existed for millennia. Works of art from the cave paintings of Lascaux to the photographs of Gary Winograd in the 1960s have revealed animal emotion and exposed the desire of some humans to re-order human/animal relations. The seminar will explore the history and theory of animal rights from antiquity to now, and examine key monuments of art that have exposed the inner, emotional and intellectual life of animals.<br/><br/>Readings will consist of two books and a number of articles."}, {"name": "Teaching Method", "value": "DiscussionReadingsThe course will be based around shared readings and discussion."}, {"name": "Evaluation Method", "value": "Class participationExam, mid-termPapersThere will be a midterm and a final seminar presentation/paper."}, {"name": "Class Materials (Required)", "value": "Two textbooks will be required."}], "lmod": "1/9/16 6:43 PM (CT)", "subject": "ART_HIST"}]