[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Harris Hall L07"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "33952", "title": "WCAS HUM 370-6-20 Special Topics in the Humanities", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "33952", "instructors": [{"instructor_phone": "", "instructor_name": "Daniel Scott Snelson", "instructor_addr": "Kresge 2350 (Kaplan Institute)"}], "topic": "Art, Writing, Technology", "course": "370-6", "descriptions": [{"name": "Overview of class", "value": "Art, Writing, Technology: New Approaches to the Digital Humanities<br/><br/>In 1882, Friedrich Nietzsche used his typewriter to declare: &quot;Our writing tools are also working on our thoughts.&quot; How might we reconsider the history of art and literature in a time when our thoughts are being worked over by iPhones, YouTube, and Google? Can we rewrite this archive using tactics found in contemporary art and poetry? This class follows emerging trends in art and writing to construct new approaches to historical objects that are equally likely to appear on Soundcloud, in a PDF, through online videos, or even on Facebook. Studying the digital humanities alongside modes of contemporary art and letters, we'll reimagine historical works through today's emerging forms and formats. Through readings and class visits from artists and poets, we will explore works that translate established forms into a variety of new media formats. How might Twitter facilitate works of art? What does YouTube demand of poetry? Using a combination of seminar conversations and collaborative workshops, we'll engage in a series of weekly experiments that attempt to reconfigure the history of art and literature through the filter of contemporary writing tools. No previous training in art, poetry, or new media is required."}, {"name": "Teaching Method", "value": "Seminar conversations, online threads, individual and collective creative workshops."}, {"name": "Evaluation Method", "value": "Collaboration, participation, short weekly experiments, and a final project in the form of a website."}, {"name": "Class Materials (Required)", "value": "All theoretical and critical readings will be made available online, with a focus on conversations within the digital humanities, new media art, and contemporary poetics. Selected texts will include writing by Wendy Chun, Anna Everett, Lisa Gitelman, Matthew Kirschenbaum, Alan Liu, Jerome McGann, Fred Moten, Rita Raley, Mark Sample, Lisa Samuels, and Hito Steyerl, among others. Creative works will also be available online, including works by Caroline Bergvall, Nick Briz, Alejandro Crawford, Gaby Cepeda, Craig Dworkin, Tan Lin, Holly Melgard, Tracie Morris, Yedda Morrison, Takeshi Murata, Allison Parrish, Rosmarie Waldrop, and Wilmer Wilson IV, among others."}], "lmod": "2/6/17 8:42 AM (CT)", "subject": "HUM"}]