[{"school": "WCAS", "overview_of_class": "For more information about this course, please contact the instructor directly via email.", "name": "Special Topics in Political Science", "section": "21", "topic": "Chinese Politics", "course": "490-0", "meeting_time": ["Mo 3:00PM - 5:50PM"], "path": "/class-descriptions/4650/WCAS/POLI_SCI/490-0/22955", "instructor": ["William James Hurst"], "id": "22955", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "Conceptualizing Culture, Prof. Loubna El Amine Winter 2017<br/>The central question that this course addresses is whether culture is a useful concept, particularly for the study of non-Western societies. The focus will be on the political theory literature, including debates around comparative political theory, multiculturalism, and global justice. But the readings will also draw from the broader political science literature, including the world values survey and ethnographic approaches to culture.", "name": "Special Topics in Political Science", "section": "22", "topic": "", "course": "490-0", "meeting_time": ["Tu 5:00PM - 7:50PM"], "path": "/class-descriptions/4650/WCAS/POLI_SCI/490-0/22956", "instructor": ["Loubna   El Amine"], "id": "22956", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "Global Capitalism and Law, Professors Karen J. Alter & Cristina Lafont, Winter 2017<br/>This seminar focuses on the parallel development of international law and capitalism since the industrial revolution, considering this development from both a normative and historical perspective. In particular, we will explore tensions between the principles of peace and protection of human rights that guide international law as a system of sovereign states, on the one hand, and the complex set of laws and policies that regulate global market economies and empower private actors, on the other. In our discussions, we will weave together normative debates on the justification of property rights, the proper role of the State vis-à-vis society, and the legitimacy of international law (from classic authors like Locke, Kant and Grotius to contemporaries like Milton Friedman, Rawls and Habermas) with historical and sociological analyses of the development of capitalism and international law (from classic authors like Braudel and Polanyi to more recent but still historically oriented scholars like Watson, Bull and Reus-Smit). A question we will be investigating is if and how debates about national and global capitalism have changed over time. Our historical and normative focus should help us address in the last part of the seminar some of the current challenges that the development of global capitalism poses to the system of states at the core of international law: from non-territorial intellectual property rights to land grabs, denationalized rights and obligations of corporations and other non-state actors, the role of the State vis-à-vis society in current systems of multilevel governance, etc.", "name": "Special Topics in Political Science", "section": "23", "topic": "Global Capitalism and Law", "course": "490-0", "meeting_time": ["Tu 2:00PM - 4:50PM"], "path": "/class-descriptions/4650/WCAS/POLI_SCI/490-0/22957", "instructor": ["Cristina   Lafont", "Karen   Alter-Hanson"], "id": "22957", "subject": "POLI_SCI"}]