[{"school": "WCAS", "overview_of_class": "This course focuses on macroeconomic aspects of development economics, and deals mainly with historical and long term patterns of economic development. This is such a fundamental issue in economics that Adam Smith even made it the title of his book, &quot;The Wealth of Nations.&quot; The main questions we ask are &quot;How can economies grow or fail to grow?&quot; &quot;What explains the difference in the income levels and growth performances across countries?&quot; No one can claim to have the answer to these difficult questions (and don't trust anyone who claims to know the answer). However, economic theories tell us what are important determinants of long run growth and development performances. More specifically, we will discuss the roles of investment (i.e., physical capital accumulation), of education (i.e., human capital accumulation), of technological change (i.e., knowledge capital accumulation through innovation and R&amp;D), of income distribution, of population growth and demographic change, and others.", "name": "Economic Growth &amp; Development", "section": "20", "topic": "", "course": "325-0", "meeting_time": ["MoWeFr 9:30AM - 10:50AM"], "path": "/class-descriptions/4620/WCAS/ECON/325-0/33300", "instructor": ["Kiminori   Matsuyama"], "id": "33300", "subject": "ECON"}, {"school": "WCAS", "overview_of_class": "How can economies grow rich? And how may economies fail to grow rich?<br/>These are fundamental questions in economics. Even Adam Smith alluded to them in the title of his<br/>book, &quot;The Wealth of Nations.&quot; These broad questions are the main focus of this course. No one can<br/>claim to have the answer to these difficult questions. However, economic theories can inform us on<br/>some important determinants of long-run growth patterns and development performances. In this<br/>course, we will cover some of the leading theories proposed to understand different aspects of long-run<br/>growth and development: Saving and capital accumulation, technological change, structural change,<br/>demographic transition, income distribution, imperfect credit markets, etc. (see the preliminary list of<br/>topics below)<br/>Detailed Contents of the Class (Preliminary)<br/>1. Facts and Measurement<br/>2. Traditional Theories of Economic Growth (Harrod-Domar, Solow)<br/>3. New Growth Theories (Human Capital, Endogenous Technological Progress)<br/>4. History, Expectations and Development (Complementarities, Increasing Returns and<br/>Poverty traps, some trade)<br/>5. Credit Markets (Alternative micro underpinnings and related theories)<br/>6. Inequality and Growth (Measurement, Kuznets Hypothesis, Interaction with Credit Mkts)<br/>7. Population Growth and Economic Development (Demographic Transition, Unified<br/>Growth Theory)<br/>8. International Linkages: Trade and Financial Markets (time permitting)<br/>9. Political Economy of Growth (time permitting)", "name": "Economic Growth &amp; Development", "section": "30", "topic": "", "course": "325-0", "meeting_time": ["MoWeFr 2:00PM - 3:20PM"], "path": "/class-descriptions/4620/WCAS/ECON/325-0/33301", "instructor": ["Marti   Mestieri Ferrer"], "id": "33301", "subject": "ECON"}]