[{"school": "WCAS", "overview_of_class": "This is an introductory course that covers the fundamentals of microeconomics. We will study the behaviour of individuals and firms in a world of limited resources, and the interactions between the two in many different markets. With an emphasis on economic principles, students will be introduced to core terminology and modes of analysis for studying the production and distribution of goods and services in the economy. An overarching goal is to gain insight into how, when, and why markets fail or succeed. Specific topics include supply and demand, market equilibrium, elasticity, costs of production, different degrees of competition (including perfect competition and monopoly), and government interventions (price controls, taxes).<br/><br/>You will get started thinking about the three fundamental questions in economics: (i) what goods and services should be produced?,?(ii) how do we produce those goods and services?, and (iii) who gets those goods and services?<br/><br/>This course is aimed at potential economics majors and students who are curious about having a better understanding of the popular press, or analyzing and comparing different government policies.", "name": "Introduction to Microeconomics", "section": "20", "location": "Leverone Auditorium Owen Coon", "topic": "", "course": "202-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4650/WCAS/ECON/202-0/20966", "instructor": ["Sara   Hernandez"], "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "id": "20966", "subject": "ECON"}, {"school": "WCAS", "overview_of_class": "This course emphasizes economic principles used to analyze individual and firm behavior. Students will be introduced to core terminology and modes of analysis for studying the production and distribution of goods and services in the economy. An overarching goal is to gain insight into how, when, and why markets fail or succeed. This includes applying simple models to predict outcomes given particular public policies, as well as understanding the criteria for evaluating such outcomes. Specific topics include gains from trade, supply and demand, elasticity, externalities, costs of production, perfect competition and monopoly.", "name": "Introduction to Microeconomics", "section": "40", "location": "Leverone Auditorium Owen Coon", "topic": "", "course": "202-0", "meeting_time": ["MoWeFr 12:00PM - 12:50PM"], "path": "/class-descriptions/4650/WCAS/ECON/202-0/20967", "instructor": ["Scott Richard Ogawa"], "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "id": "20967", "subject": "ECON"}]