[{"school": "SoC", "overview_of_class": "CSD 202<br/> <br/>Overview of class<br/>Course Description: This course is intended to introduce students to basic neurophysiological principles related to human communication.  Basic mechanisms underlying the function of the nervous system beginning with single cells and progressing up through simple reflexes to more complex functions related to speech-language-hearing will be addressed.  Sensory systems including the auditory, visual and somatosensory systems will be discussed in context to their relevance to communication and communication disorders.<br/> <br/>Registration Requirements: No prerequisites.<br/> <br/>Learning Objectives:<br/>Upon completion of the course students will be able to:<br/>Describe mechanisms of neuron action potential generation and propagation.<br/>Describe mechanisms of synaptic propagation.<br/>Describe mechanisms of muscle contraction.<br/>Describe the mechanisms underlying simple reflexes. Describe how the sensory systems function (i.e., vision, somatosensory and hearing).<br/>Identify associated disorders of vision, hearing, motor and cognition that may impact on human communication. Discuss language and associated disorders and their impact on communication functioning.<br/> <br/>Teaching Method:<br/> <br/>Evaluation Method:<br/> <br/>Class Materials (Required):<br/>Required Text: Bear, M.F., Connors, B.W. and Paradiso, M.S.(2015).  Neuroscience: Exploring the Brain, 4th Ed.: Baltimore: Lippincott, Williams & Wilkins Publishers.<br/> <br/>Class Materials (Suggested):<br/> <br/>Class Notes:<br/>Course Goals<br/>Describe mechanisms of neuron action potential generation and propagation Describe mechanisms of synaptic propagation Describe mechanisms of muscle contraction Describe the mechanisms underlying simple reflexes Describe how sensory systems encode stimuli and how the brain uses sensory information generally, and for communication. Describe cognitive brain function and language mechanisms and disorders.<br/>.", "name": "Neurobiology of Communication", "section": "20", "location": "Frances Searle Building 2407", "topic": "", "course": "202-0", "meeting_time": ["TuTh 3:00PM - 4:50PM"], "path": "/class-descriptions/4610/SoC/CSD/202-0/22963", "instructor": ["Jonathan H Siegel"], "class_attributes": "Natural Sciences Distro Area<br/><br/>", "id": "22963", "subject": "CSD"}]