[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "Allison Residential Comm 1021"}], "school": "WCAS", "overview_of_class": "A Greek temple; Mozart's Requiem; Hollywood stars; sunset in a National Park. Most of us would agree these things are beautiful. Are we right? A mathematical proof; a martyrdom; noise rock; a touchdown; a worm. Some but fewer people would find each of these beautiful. Are they right? What, if anything, do the things we call beautiful have in common? <br/><br/>The tradition of western philosophy began in ancient Greece and Rome, where important thinkers like Plato, Aristotle, or St. Augustine (whose phrase is the title of this seminar) thought carefully about beauty. They tended to think that beauty is a certain order or harmony and that beauty leads us to an understanding of goodness. They think if you deny that a beautiful temple is beautiful, you're wrong.<br/>In modern times, thinkers like Kant or Hume have reconsidered beauty. Some have suggested that beauty is more ?in the eye of the beholder'. Beauty might have more to do with the delight or calm we take from an object. Other philosophers and artists have denied that beauty is real at all, or declared that it is only for snobs or for rednecks, or that it is dangerous and deceitful. We shall read selections from these ancient and modern thinkers and consider carefully what things are beautiful according to them. We shall look for and discuss controversial examples of beauty or ugliness. We shall put the two together in rigorous, precise critical thought, and writing.", "qtr": "Winter 2017", "name": "First-Year Seminar", "title": "WCAS CLASSICS 101-6-1 First-Year Seminar", "lmod": "2/5/17 6:42 PM (CT)", "section": "1", "instructors": [{"instructor_phone": "847/467-1843", "instructor_name": "John P F Wynne", "instructor_addr": "Kresge 4365"}], "topic": "Beauty, So Old and So New", "course": "101-6", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "descriptions": [{"name": "Overview of class", "value": "A Greek temple; Mozart's Requiem; Hollywood stars; sunset in a National Park. Most of us would agree these things are beautiful. Are we right? A mathematical proof; a martyrdom; noise rock; a touchdown; a worm. Some but fewer people would find each of these beautiful. Are they right? What, if anything, do the things we call beautiful have in common? <br/><br/>The tradition of western philosophy began in ancient Greece and Rome, where important thinkers like Plato, Aristotle, or St. Augustine (whose phrase is the title of this seminar) thought carefully about beauty. They tended to think that beauty is a certain order or harmony and that beauty leads us to an understanding of goodness. They think if you deny that a beautiful temple is beautiful, you're wrong.<br/>In modern times, thinkers like Kant or Hume have reconsidered beauty. Some have suggested that beauty is more ?in the eye of the beholder'. Beauty might have more to do with the delight or calm we take from an object. Other philosophers and artists have denied that beauty is real at all, or declared that it is only for snobs or for rednecks, or that it is dangerous and deceitful. We shall read selections from these ancient and modern thinkers and consider carefully what things are beautiful according to them. We shall look for and discuss controversial examples of beauty or ugliness. We shall put the two together in rigorous, precise critical thought, and writing."}, {"name": "Teaching Method", "value": "Discussion"}, {"name": "Evaluation Method", "value": "The bulk of evaluation (about 75%) will be of the quality of thought and writing in written assignments. Remaining assessment will be of contribution to class discussion (15%) and of a presentation (10%). The presentation will concern some object (or piece of music, or equation, or sport, or anything at all) which you think is beautiful but other people either think is ugly or do not know.<br/><br/>During the quarter there will be a number of short response papers (about 2 pages each) to theories about beauty, or to possible examples of beauty, which we consider. <br/><br/>There will be two longer midterm papers (about 4 pages each) developing one of these responses.<br/><br/>These earlier pieces will build towards a final paper (about 6-10 pages). This final project will use some of the ideas about beauty we have read and discussed to defend the beauty or otherwise of some particular thing."}, {"name": "Class Materials (Required)", "value": "Selections on beauty from the philosophers mentioned in the description and others. I am not yet sure which selections I shall use, but students can get an idea of the sort of material from (for example) Albert Hofstader and Richard Kuhns (editors), Philosophies of Art and Beauty: Selected Readings in Aesthetics from Plato to Heidegger."}], "path": "/class-descriptions/4650/WCAS/CLASSICS/101-6/22483", "instructor": ["John P F Wynne"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "22483", "subject": "CLASSICS"}]