[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Kresge Centennial Hall 2-430"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "33882", "title": "WCAS ITALIAN 350-0-20 Advanced Topics in Italian Culture and Literature", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "33882", "topic": "New Media and Marxist Thought", "course": "350-0", "descriptions": [{"name": "Overview of class", "value": "New Media and Marxist Thought. The Italian Marxist tradition of Autonomia is probably the most influential branch of contemporary Marxism when it comes to new media theory - and more specifically when discussing processes of digitization, computerization, and networking. By engaging Marx's notion of the 'general intellect', Italian authors have linked such processes to the rise first of post-Fordism and later cognitive capitalism and financialization. Digital media and computer networks have been used as cases or examples of the transformations of capitalism in the age of immaterial labor and biopolitical production. Drawing the writings of Antonio Negri, Silvia Federici, Maurizio Lazzarato, and Christian Marazzi (among others), the course will ask what kind of perspective on contemporary digital media networks is enabled by Italian Autonomist Marxism."}, {"name": "Learning Objectives", "value": "The course aims to introduce students to Italian Autonomist Marxism and in particular to the ways in which such tradition has conceptualized the rise of computing, cybernetics, and telecommunications."}, {"name": "Teaching Method", "value": "Lectures, discussions, close reading of texts, screenings"}, {"name": "Evaluation Method", "value": "Attendance, assignments, participation (40%) + Term paper and its presentation to class (60%)."}, {"name": "Class Materials (Required)", "value": "Handouts will be provided for each class; students will have to take notes during lectures and discussion, and do reading and writing assignments from lesson to lesson."}, {"name": "Class Notes", "value": "Taught in English."}], "lmod": "2/9/17 6:44 PM (CT)", "subject": "ITALIAN"}]