[{"class_mtg_info": [{"meet_t": "We 2:00PM - 4:50PM", "meet_l": "Kresge Centennial Hall 2-415"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "17458", "title": "WCAS GNDR_ST 353-0-20 Gender and Citizenship", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "17458", "instructors": [{"instructor_phone": "847/491-3277", "instructor_name": "Monica L Russel y Rodriguez", "instructor_addr": "1918 Sheridan Road, Room 205"}], "topic": "Latina Feminisms", "course": "353-0", "descriptions": [{"name": "Overview of class", "value": "This course looks at the ranges of possibilities and practices within Chicana/ Latina feminisms. It looks at the conditions of oppression and the creative and expressive responses to those conditions, focusing especially on self-representation and auto-ethnography."}, {"name": "Learning Objectives", "value": "? describe the conditions and tensions of conciencia or the moment of being &quot;woke&quot; through a variety of social science theories <br/>? describe the range of hegemonic conditions that pressure Chicanas and Latinas to align with a majoritarian stance<br/>? describe and explain a range of conundrums or costs in rejecting subordinate positions<br/>? describe and theorize the range of creative responses to self-representation <br/>? describe and provide some theoretical insights into contemporary protests, social media campaigns, and unlikely locations of expressing Chicana/Latina feminisms."}, {"name": "Teaching Method", "value": "Class participationDiscussionField workFilms / videosGroup workGuest speakersObservationPresentationsReadingsSeminarWriting assignments"}, {"name": "Evaluation Method", "value": "Attendance: Required<br/>Class participation: Required<br/>Exam, mid-term: Two Mid-Quarter Exams<br/>ExamsField workGroup project: One Group Project<br/>Paper, finalPresentationsProject, finalReadingsWriting assignments"}, {"name": "Class Materials (Required)", "value": "Books will include Borderlands/ La Frontera (optional for those who have read this in its entirety in previous courses). Access to simple video filming technologies (including IPhone, IPad) will be helpful. A reader for purchase will be available."}], "lmod": "10/30/16 7:05 PM (CT)", "subject": "GNDR_ST"}]