[{"class_mtg_info": [{"meet_t": "MoTuWeThFr 9:00AM - 9:50AM", "meet_l": "University Library 5722"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "13707", "title": "WCAS ARABIC 111-1-20 Arabic I", "class_attributes": "", "section": "13707", "instructors": [{"instructor_phone": "", "instructor_name": "Amjad M Al-Dajani", "instructor_addr": ""}], "topic": "", "course": "111-1", "descriptions": [{"name": "Overview of class", "value": "This first segment of the three-quarter first-year course facilitates students' learning of the alphabet and sound system, and helps them develop basic speaking, listening, reading, and writing skills. It also introduces students to the diglossic sociolinguistic environment of the Arab World, and provides exposure to basic, high frequency regional spoken variety elements. This course is designed for true beginners with no previous background in the language. Students with any background must take a placement test and consult with the Coordinator before enrolling."}, {"name": "Registration Requirements", "value": "None"}, {"name": "Learning Objectives", "value": "By the completion of the first quarter in Arabic you will have mastered the Arabic alphabet and sound system, be able to distinguish and pronounce all Arabic sounds, and write accurately from dictation. You will also be able to initiate basic social interactions using MSA (Modern Standard Arabic), ask for basic information, and be aware of basic cultural aspects of social interaction in the Arab world."}, {"name": "Teaching Method", "value": "Class is devoted to learning the script and sounds of Modern Standard Arabic and basic communication and reading skills. Students are required to use audio materials in the Multi-Media Language Center (MMLC). Audio tapes can be checked out for use at home. (The first book in the course textbook series also comes with audio CDs). Students should be prepared to devote additional time to daily homework."}, {"name": "Evaluation Method", "value": "Final grades for the course will be based on: homework, quizzes, mid-term exam, and final exam."}, {"name": "Class Materials (Required)", "value": "1) Kristen Brustad, Mahmoud Al-Batal and Abbas al-Tonsi, &quot;Alif Baa&quot; with Multimedia: Introduction to Arabic Letters and Sounds. 3rd edition. [ISBN: 9781589016323 (1589016327)]<br/><br/>2) Kristen Brustad, Mahmoud Al-Batal and Abbas al-Tonsi, Al-Kitaab fii Ta?allum al-?Arabiyya with DVDs: Part One. 3rd edition. [ISBN: 9781589017368 (1589017366)]<br/><br/>3) Companion websites ?students will be able to purchase access after the course starts and they have their books. <br/><br/>Both are published by Georgetown University Press. Year of print/publication may vary, but please verify that you are purchasing the 3rd edition."}], "lmod": "10/30/16 6:58 PM (CT)", "subject": "ARABIC"}]