[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "University Hall 412"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Winter 2016", "name": "23149", "title": "WCAS ENGLISH 105-6-20 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "23149", "instructors": [{"instructor_phone": "847/467-4462", "instructor_name": "Elizabeth Anne Lenaghan", "instructor_addr": "555 Clark St., 241"}], "topic": "Lying, Cheating, &amp; Stealing", "course": "105-6", "descriptions": [{"name": "Overview of class", "value": "Media hoaxes, copies, and remixes have existed for centuries. But is anything different about these phenomena in our digital age? For instance, since it's so easy to copy and remix digital data, do we do so more often? Do people feel pressure to make things up because they must produce content more frequently, faster, and across more platforms than ever before? Do technology and its crowd-sourcing capabilities render lies and thefts easier to uncover? In this course, we will explore answers to these questions as we examine several historic and contemporary examples of hoaxes, copies, and remixes. We'll ask questions about both the positive and negative aspects of such examples with the ultimate aim of discovering what they can show us about broader concepts such as individuality, uniqueness, and authenticity. Students will also have the opportunity to engage in independent research on a hoax, theft, or remix of their choosing."}, {"name": "Teaching Method", "value": "Discussion and workshop. Students will also engage in peer editing and evaluations."}, {"name": "Evaluation Method", "value": "Evaluation and quarter grades will be based on three papers (70%), shorter writing and workshop assignments (10%), participation in class discussions, workshops, and exercises (10%), and an oral presentation (10%). There will be no exams. Papers will be written in stages and revised with feedback from the instructor and peers.<br/><br/>NUMBER OF WRITING ASSIGNMENTS AND THEIR LENGTHS<br/>The course will include three major papers.<br/>Paper 1: 3-4 pages<br/>Paper 2: 5-6 pages<br/>Paper 3: 7-8 pages"}, {"name": "Class Materials (Suggested)", "value": "Our readings will come from a course pack and several online/media sources. Additional readings and resources on writing will be distributed in class. A partial list of course-pack readings includes: John Jeremiah Sullivan, &quot;The Violence of the Lambs&quot;; Jonathan Lethem, &quot;The Ecstasy of Influence&quot;; Kenneth Goldsmith, &quot;It's Not Plagiarism&quot;; Lizzie Widdicombe, &quot;The Plagiarist's Tale&quot;; Malcolm Gladwell, &quot;Something Borrowed&quot;.<br/><br/>Additional multimedia sources will include: Film: Shattered Glass (dir. Billy Ray, 2003), Exit Through the Gift Shop (dir. Banksy, 2010); Podcast: Radiolab Season 4, Episode 3: War of the Worlds"}], "lmod": "1/9/16 6:46 PM (CT)", "subject": "ENGLISH"}]