[{"class_mtg_info": [{"meet_t": "Tu 3:30PM - 6:20PM", "meet_l": "Scott Hall 212"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "24425", "title": "WCAS POLI_SCI 395-0-22 Political Research Seminar", "class_attributes": "Attendance at 1st class mandatory<br/><br/>Auditing not permitted<br/><br/>Department Majors Only<br/><br/>Juniors/Seniors Only<br/><br/>", "section": "24425", "instructors": [{"instructor_phone": "", "instructor_name": "Thomas Kenneth Ogorzalek", "instructor_addr": ""}], "topic": "Race, Place, and Space in Democratic Politics", "course": "395-0", "descriptions": [{"name": "Overview of class", "value": "Poli_Sci 395-0-23 &quot;Race, Place, and Space: Diversity in Democratic Politics&quot; Thomas Ogorzalek, Spring 2015<br/><br/>Racial and ethnic politics in the U.S. (and elsewhere) have often been understood in terms of spatial dynamics and composition: Does local diversity heighten or soften racial tension? What kinds of diversity create the most challenges for governance? What kinds of spaces make for different intergroup dynamics? These kinds of questions have become even more important under conditions of demographic change and deepening political polarization. This seminar will encourage students to critically engage with and contribute to current debates and research on the relationship between political geography and intergroup relations, and contribute original"}, {"name": "Registration Requirements", "value": "Majors only (395), Junior or Senior"}, {"name": "Learning Objectives", "value": "By the end of the course, students should know the substance of key debates in the study of urban politics, be able to articulate a research question to engage in one of these debates, and design and execute a research paper in the field."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Discussions, Short Papers, Term Paper based on original research"}, {"name": "Class Materials (Required)", "value": "James C. Scott, Seeing Like a State, 1998, Yale, 800-078152, Paper<br/>J. Eric Oliver, The Paradoxes of Integration, 2010, Chicago, 226626636, Paper<br/>Bill Bishop, The Big Sort, 2008, Mariner, 547237725, Paper<br/>Massey and Denton, American Apartheid, 1993 (But most recent edition), Harvard, 67401821"}], "lmod": "1/9/16 6:52 PM (CT)", "subject": "POLI_SCI"}]