[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Annenberg Hall G29"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Spring 2017", "name": "30915", "title": "WCAS LING 101-6-21 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "30915", "instructors": [{"instructor_phone": "8474914968", "instructor_name": "Robert A Gundlach", "instructor_addr": "555 Clark St., 245"}], "topic": "Human Voice, Spoken &amp; Written", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "In this seminar, we will explore the power and complexity of the <br/>human voice as we encounter it in both speech and writing. We will begin by examining the physical and cognitive aspects of speaking and listening. We will then consider how the human voice conveys cultural meanings, how voices interact in conversation, and how &quot;voice&quot; is expressed in written form. Each student will select a topic of individual interest for a final research project. Topics might include (but are not limited to) the role of intonation in linguistic communication, voice and technology (e.g., telephones), voice in social media, voice and music, voice in professional roles, voice and gender, voice and age, voice disorders, the forensic use of &quot;voiceprints,&quot; voice in acting, voice in animal communication, human-machine vocal interaction, variations of voice across languages, accents and voice control in second language learning, the significance of voice in public speaking, and the representation of speech in literature. Throughout the quarter, students will also develop their ability and confidence as writers, and may use this seminar as an opportunity to experiment with their own written voices in a variety of forms."}, {"name": "Teaching Method", "value": "DiscussionRegular opportunities for students to write and share ideas developed in essays. Opportunities for students to conduct research on topics of individual interest."}, {"name": "Evaluation Method", "value": "PapersGrades will be based on three short essays (3-4 pages), one longer essay (6-8 pages), and participation in seminar discussions. Students will have the opportunity to revise their essays."}, {"name": "Class Materials (Required)", "value": "Crystal, David, How Language Works (paper: ISBN-13: 978-1583332917).<br/><br/>Turkle, Sherry, Reclaiming Conversation: The Power of Talk in a Digital Age (paper: ISBN-13: 978-0143109792)"}], "lmod": "2/16/17 6:48 PM (CT)", "subject": "LING"}]