[{"school": "WCAS", "overview_of_class": "Dexter, Raskolnikov, American Psycho. Killers, good and bad, have fascinated us for centuries. Psychologically, morally and philosophically we are drawn to the figure of the killer; we revel in the voyeuristic pleasure of entering the criminal mind while maintaining our own legal and moral codes. In this course we study works of fiction, film and TV that have the killer or murderer as their primary subject. We pose ourselves as investigators and analyze the minds and motives of characters as well as the cultures that generate them. We explore the appeal of the \"moral murderer\" and the \"crime drama\" genre that allow viewers to participate in a criminal act while allowing justice to prevail in the end. Our methods include close reading and traditional textual analysis, but we also borrow the tactic of psychological/behavioral profiling used in the criminal justice system and apply it to our fictional characters and texts.", "name": "Literature and its Others:", "section": "20", "location": "Locy Hall 318", "topic": "Criminal Minds", "course": "375-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4660/WCAS/COMP_LIT/375-0/33083", "instructor": ["Sarah   Valentine"], "class_attributes": "", "id": "33083", "subject": "COMP_LIT"}, {"school": "WCAS", "overview_of_class": "This course focuses on ways in which literary works were adapted into operatic and/or cinematic form by focusing on a small group of operas that were based on pre-existing literary or theatrical works, and which, in turn, inspired cinematic or televised works in the twentieth- and twenty-first centuries. In each case, we will study the literary or theatrical inspiration in its own right (those who can are encouraged to read these classic works in their original languages), become familiar with the opera, and proceed to some famous films and other video adaptations of each opera. We will end the course with a popular film that is directly based on neither a literary original nor an opera, but relies strongly on conventions from both and features a performance of one of our featured operas.<br/>The course is open to all interested students who read musical notation or read fluently in at least one of French, German, or Italian.", "name": "Literature and its Others:", "section": "21", "location": "RCMA Lower Level 111", "topic": "From Lit to Opera to Film", "course": "375-0", "meeting_time": ["MoWe 11:00AM - 12:20PM"], "path": "/class-descriptions/4660/WCAS/COMP_LIT/375-0/33084", "instructor": ["Linda P Austern"], "class_attributes": "", "id": "33084", "subject": "COMP_LIT"}]