[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "Annenberg Hall 101"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "12362", "title": "WCAS HISTORY 392-0-22 Topics In History", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "12362", "instructors": [{"instructor_phone": "847/491-7448", "instructor_name": "Carl Forbes   Petry", "instructor_addr": "Harris Hall Room 329"}], "topic": "Harem as an Institution", "course": "392-0", "descriptions": [{"name": "Overview of class", "value": "This will be a seminar/colloquium focusing on the issue of gender and women's status in the pre-modern Islamic Middle East. The term &quot;Harem&quot; derives from the Arabic &quot;Haruma&quot; and refers to a zone of private residence restricted to female access or immediate male kin. The evolution of this restricted section of the household into a complex institution regulating the lives of women who wielded power in royal courts will constitute the central topic of discussions, but background information on the status of women in Koran and Islamic Law, matters of sexuality and passion, women's contributions to the economy, and women in religious life will also be addressed. In general, issues pertaining to feminist activism in the nineteenth and twentieth centuries, periods of cultural and political influence from Western Europe, will NOT be considered. The seminar will weigh the question of gender as it would have emerged during the traditional era of Islamic History, when social standing was decided indigenously according to Muslim precepts."}, {"name": "Registration Requirements", "value": "GRADING BASIS: No P/N option (ANC only)"}, {"name": "Teaching Method", "value": "TEACHING METHOD: Discussion of topical questions and assigned readings. Occasional lectures on supplementary issues"}, {"name": "Evaluation Method", "value": "EVALUATION METHOD: For 392: assessment of performance will be divided between contributions to class discussion (50%), and preparation of an extended review comparing at least two publications significant to the topic. For 395: assessment of performance will divided between contributions to class discussion (50%), and composition of an analytical research essay on a topic developed from issues discussed (50%). No examinations."}, {"name": "Class Materials (Required)", "value": "***Tentative until order posted to Norris website<br/>A variety of primary sources (in translation) and secondary studies, including letters from wives of European ambassadors who visited the Ottoman Harem in Istanbul. N. Atiya: Khul Khaal: Five Egyptian Women tell their StoriesE. Fernea: Middle Eastern Muslim Women SpeakN. Dawood: Tales from the Arabian NightsD. Spellberg: Politics, Gender and the Islamic Past"}, {"name": "Class Notes", "value": "NOTES: Attendance at first class mandatory"}], "lmod": "10/30/16 7:06 PM (CT)", "subject": "HISTORY"}]