[{"school": "WCAS", "overview_of_class": "This course is designed to introduce the student to a cross-section of contemporary Latino plays, a general history of Latino theatre in the U.S. and current trends in Latino Theatre. The course will provide an overview of the state of professional Latino theatre and its impact on and place in the broader American professional theatre field. The class is partly the reading of dramatic literature, along with critical analysis and discussion, and some performance. There will generally be one play assigned per class, with each play assigned one student presenter. The student presenters are responsible for introducing the play in class, initiating discussions, capturing thematic issues, and identifying pivotal scenes, which will generally be read in class. The professor will support the student presenters as needed but it is the student presenters' responsibility to organize the discussions and readings as they see fit, according to how their particular play moves them and impacts their imaginations. The class will culminate in final scene and monologue performances, and a critical/creative paper that engages a shared theme across two plays from the reading list of the students' choice.", "name": "Topics in Latina and Latino Text and Representation", "section": "20", "topic": "", "course": "393-0", "meeting_time": ["MoWe 11:00AM - 12:50PM"], "path": "/class-descriptions/4650/WCAS/LATINO/393-0/24266", "instructor": ["Henry Dominic Godinez"], "id": "24266", "subject": "LATINO"}, {"school": "WCAS", "overview_of_class": "Subcultures are often understood as bringing like-minded people together who feel marginalized by societal standards, allowing them to develop a sense of identity, and often challenge these standards. In this course, we will explore how and why Latino/a youth participate in musical subcultures, such as, house, rave, punk, EMO, goth, and hip hop. First, we will define subculture, examine how the concept has changed over time among scholars, and apply the concept to the case of Latino/a youth subcultures. Second, we will explore how Latino/a youth create a sense of identity in subcultures and challenge societal norms around race, class, gender, and sexuality. We will pay special attention to the ways in which Latino/a youth have participated and made spaces for themselves in various subcultures that have been perceived as racially &quot;white,&quot; like goth or punk, or &quot;black,&quot; like house and hip hop. One public space we will pay attention to is the high school and how subculture groups behave and respond to school policies and norms. We will also examine the ways media portrays youth subcultures and how these representations are different to how youth portray themselves or self-representations with pictures, writings, dress, music, etc. Ultimately, this course will examine the ways in which Latino/a youth participate in subcultures to create spaces of belonging and express their unique ways of being and Latino/a cultural citizenship in the U.S.", "name": "Topics in Latina and Latino Text and Representation", "section": "21", "topic": "", "course": "393-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4650/WCAS/LATINO/393-0/24267", "instructor": [""], "id": "24267", "subject": "LATINO"}]