[{"school": "WCAS", "overview_of_class": "In urban India, malls and McDonalds stand side by side with centuries-old temples and illegal squatter settlements. In rural hinterlands, tribal communities use the internet to organize global protests against industrial schemes that will drown and destroy their villages, while farmers commit suicide after crops forced on them by Monsanto fail to yield a profit. How can we grasp the complex processes of globalization in India without resorting to tired tropes of tradition and modernity? With the aid of popular fiction and film as well as scholarly articles and ethnographies, students in this course will consider globalization in India as a historical, economic, and sociocultural process that is transforming the way Indians experience and think about themselves, their cities, their nation, and everyday life.", "name": "Advanced Topics in Asian Studies", "section": "21", "location": "Kresge Centennial Hall 2-440", "topic": "Globalizing India", "course": "390-3", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4660/WCAS/ASIAN_ST/390-3/36524", "instructor": ["Meredith L McGuire"], "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "id": "36524", "subject": "ASIAN_ST"}, {"school": "WCAS", "overview_of_class": "This class introduces you to a wide variety of ethnographies on Muslim communities in Asia, both in the range of regions and states - Iran, Pakistan, India, Malaysia, Indonesia, and China - as well as in terms of themes - how Muslims engage secularizing states, coexist with hegemonic non-Muslim majorities, survive as refugees on the battleground of rival nation states, and, with native languages other than Arabic, make the Qur'an collectively meaningful.<br/><br/>At the same time, you will sharpen your ability to read and evaluate difficult books. We will analyze the ethnographies as texts to understand how the authors combined different kinds of texts to achieve the effect of a unified ethnographic whole, which different fieldwork activities yielded specific forms of data or emprirical materials, which writing techniques authors used to give voice to different groups of informants, and how authors attempted to represent the hold of the past on the \"now\" of fieldwork.<br/><br/>This class is reading-intensive and will focus on discussion. You will take turns leading discussions. This class works only if you participate actively in discussion. Preparation for class discussion by keeping up with the readings is crucial and will figure into the grading.", "name": "Advanced Topics in Asian Studies", "section": "22", "location": "ANTHRO Sem Rm B07 - 1810 Hinmn", "topic": "", "course": "390-3", "meeting_time": ["TuTh 9:30AM - 10:50AM"], "path": "/class-descriptions/4660/WCAS/ASIAN_ST/390-3/36525", "instructor": ["Stefan   Henning"], "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "id": "36525", "subject": "ASIAN_ST"}]