[{"school": "WCAS", "overview_of_class": "As avid readers and creative writers, we are always working with or against a long tradition, one that dates back to days when most of our literature was transmitted orally. Almost 150 years ago, Northwestern University was known for its certificate program in elocution. The bardic boom, the pulpit pitch, the futurist with a megaphone?so many of the great works of literature were first delivered orally, then placed on the page and called literature. Speeches, psalms, manifestos, sermons, lectures, storytelling, poems and songs of revolution and reinvention?all of these will be investigated in reading and performance, and then students will find a way to get their own performative narratives of poetry, fiction, and nonfiction onto the page. How does the word in the air differ from the word on the page? <br/><br/>We will discuss the instructive aspect of art and literature, the difference between style and voice, how delivery by great orators can change the meaning of the material, and how the speech on the page has its own specific power that makes it, in its way, a second, separate work of literature. A solid knowledge of prosody and poetic form is necessary for class and workshop discussion.", "name": "Advanced Creative Writing", "section": "20", "topic": "Forms of Persuasion", "course": "307-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4620/WCAS/ENGLISH/307-0/34913", "instructor": ["Brian D Bouldrey"], "id": "34913", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "The playwright Anna Deveare Smith has written that to develop an ear, one must develop an ear. This class for fiction writers will be all about paying attention, with particular focus on the myriad ways writers listen - to themselves, to their characters, to the world - in order to create moving stories. We will closely read published stories in order to discuss and write about their impact, zeroing in on such key elements as characterization, tension, and compression. The class will also be reading Italo Calvino's Six Memos for the Next Millennium with an eye toward how the future of storytelling might be influenced by the past. Students will write 2 to 3 stories of their own, revising one of them. Student work will be workshopped and also reviewed during student-teacher conferences.", "name": "Advanced Creative Writing", "section": "21", "topic": "Fiction", "course": "307-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4620/WCAS/ENGLISH/307-0/34914", "instructor": ["Peter M Orner"], "id": "34914", "subject": "ENGLISH"}]