[{"school": "WCAS", "overview_of_class": "What do we learn when we hear stories from people who are marginalized by society - or when we write about our own experiences with marginalization? The goal of this seminar is to answer those questions while becoming more enlightened and skillful writers ourselves. Toward that end, we will read narratives of survival and protest by people who have been marginalized by race, gender, poverty, politics, religion, war, or prison. As we do this reading, we will also look at (a) philosophical issues, such as the relationship between stories and \"truth\" (what's the line between fiction and non-fiction?) and (b) literary issues, such as whether mainstream stories are any different from \"stories from the margins.\" Then, focusing particularly on narratives related to our country's astonishingly high rate of incarceration, we will examine the power of stories to reshape our understanding of contemporary issues, including marginalization and inclusion at Northwestern.<br/><br/>Papers will involve analysis of personal experience, such as how you have benefited from, or have been challenged by, marginalization, as well as analysis and arguments based on research, exploring whether or how stories from the margin challenge our views of ourselves and the world.", "name": "First-Year Seminar", "section": "20", "location": "Parkes Hall 213", "topic": "Rdng&Wrtng Stories from Margin", "course": "105-6", "meeting_time": ["MoWeFr 9:00AM - 9:50AM"], "path": "/class-descriptions/4640/WCAS/ENGLISH/105-6/14756", "instructor": ["Penny Gail Hirsch"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "14756", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "Media hoaxes, copies, and remixes have existed for centuries. But is anything different about these phenomena in our digital age? For instance, since it's so easy to copy and remix digital data, do we do so more often? Do people feel pressure to make things up because they must produce content more frequently, faster, and across more platforms than ever before? Do technology and its crowd-sourcing capabilities render lies and thefts easier to uncover? In this course, we will explore answers to these questions as we examine several historic and contemporary examples of hoaxes, copies, and remixes. We'll ask questions about both the positive and negative aspects of such examples with the ultimate aim of discovering what they can show us about broader concepts such as individuality, uniqueness, and authenticity. Students will also have the opportunity to engage in independent research on a hoax, theft, or remix of their choosing.", "name": "First-Year Seminar", "section": "21", "location": "University Hall 218", "topic": "Truth in Representation: Hoaxes, Copies, & Remixes", "course": "105-6", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4640/WCAS/ENGLISH/105-6/14757", "instructor": ["Elizabeth Anne Lenaghan"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "14757", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "In 2014, President Obama said, \"We are and always will be a nation of immigrants.\" What can we learn about the implications of that historical fact by reading stories written by and about immigrants to this country? The goal of this seminar is to answer that question as well as these others: How do immigrant experiences differ based on the era and country of origin, and in what ways are they similar? What happens to the relationships between parents and children through the process of acculturation into American society? How do social institutions and structures impact the lives of immigrants as they seek to pursue the American Dream? How do differences in national origin connect with other differences, particularly gender, race, ethnicity, and class?<br/><br/>We will read novels, memoirs, and poetry that range from the beginning to the end of the 20th century and that tell stories of immigrants from Barbados, China, Mexico, Russia, and elsewhere.", "name": "First-Year Seminar", "section": "22", "location": "University Hall 118", "topic": "Immigrant Stories", "course": "105-6", "meeting_time": ["MoWeFr 10:00AM - 10:50AM"], "path": "/class-descriptions/4640/WCAS/ENGLISH/105-6/14758", "instructor": ["Charles S Yarnoff"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "14758", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "In this seminar we shall read selected fiction, poems, and essays and respond to them in writing as a way of clarifying our ideas and communicating them effectively to others. Writing assignments will include response papers to the reading and three essays of varying length. Some of the authors we shall study are William Blake, Franz Kafka, Alice Munro, Marjane Satrapi, and Raymond Carver.", "name": "First-Year Seminar", "section": "23", "location": "555 Clark 230", "topic": "Writing about Lit & Experience", "course": "105-6", "meeting_time": ["MoWeFr 9:00AM - 9:50AM"], "path": "/class-descriptions/4640/WCAS/ENGLISH/105-6/14759", "instructor": ["Marcia B Gealy"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "14759", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "Every day on television and radio, on the streets and in classrooms, we hear people expressing opinions about a variety of topics. The people who are most persuasive, however, are those who are most informed. This course is designed to give students the tools to develop an informed opinion, to present that opinion to others orally and in writing, and to persuade others to consider (and even accept) their point of view.<br/><br/>In this seminar, you will have the opportunity to select a topic of your choice and research it in depth, using library resources, the Internet, interviews and surveys. You will also learn a number of techniques for presenting your ideas persuasively, both orally and in writing. By the end of the course, you will be in position to discuss your ideas in a thoughtful, authoritative way. In this sense, you will have earned the right to call yourself an expert on your topic.", "name": "First-Year Seminar", "section": "24", "location": "Harris Hall L05", "topic": "How to Become an Expert ...", "course": "105-6", "meeting_time": ["MoWeFr 11:00AM - 11:50AM"], "path": "/class-descriptions/4640/WCAS/ENGLISH/105-6/14760", "instructor": ["Barbara L Shwom"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "14760", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "This is a course for people who love food: eating it, cooking it, growing it, and going to restaurants. We will explore the connection between food and love, food and culture, food and religion, and food and family. We will also explore how the commercialization of food and agribusiness has changed what and how we eat. We'll watch some famous movies on food: The Big Night, Jiro loves Sushi, and the important documentary, Food, Inc. Students will be encouraged to follow a food interest of their own as a topic for the writing assignments. We will also look at the two latest trends in food: molecular chemistry and foraging.", "name": "First-Year Seminar", "section": "25", "location": "University Hall 112", "topic": "The Edible Word: Reading & Writing about Food", "course": "105-6", "meeting_time": ["TuTh 9:30AM - 10:50AM"], "path": "/class-descriptions/4640/WCAS/ENGLISH/105-6/14761", "instructor": ["Jeanne Elizabeth   Herrick"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "14761", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "What makes a writer credible? In other words, how do readers determine what writers deserve their trust? Every day we place our confidence in strangers who advise us on matters that range from the immediate (movies and restaurants) to the long-term (our money and our health). Yet high-profile scandals?such as fraudulent reporting at the New York Times?remind us that we must not place our faith too casually. In this course, we will examine the relationship between writers and their readers with an eye to understanding how the style, social context, and unspoken assumptions of a written work help inspire our confidence or elicit our disbelief in both the context of fiction and non-fiction. Students will be asked to consider the ethical responsibilities both of readers, alert to the possibility of misrepresentation or fraud, and of writers seeking to establish their own credibility and authority. <br/><br/>Course readings will include works of fiction, journalism, and writings from the natural and social sciences. We will also consider practical topics such as how University library resources and experts can help students locate and evaluate key sources and develop authoritative arguments.", "name": "First-Year Seminar", "section": "26", "location": "Harris Hall L05", "topic": "The Credible Writer", "course": "105-6", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4640/WCAS/ENGLISH/105-6/14762", "instructor": ["Kathleen   Carmichael"], "class_attributes": "WCAS First-Year Seminar<br/><br/>Attendance at 1st class mandatory<br/><br/>", "id": "14762", "subject": "ENGLISH"}]