[{"class_mtg_info": [{"meet_t": "We 6:15PM - 9:15PM", "meet_l": "Lunt Hall 107"}], "school": "SCS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "27589", "title": "SCS MATH 113-CN-65 Precalculus Mathematics", "class_attributes": "", "section": "27589", "instructors": [{"instructor_phone": "", "instructor_name": "Rodolfo   Maglio", "instructor_addr": ""}], "topic": "", "course": "113-CN", "descriptions": [{"name": "Overview of class", "value": "This course covers the properties and graphs of the basic functions, polynomial, rational, exponential, logarithmic, and trigonometric. Also studied are complex numbers, theory of equations, and selected topics in analytic geometry. Use of technology is integrated throughout.<br/><br/>Course objectives<br/>1. Understand the concept of function.<br/>2. Understand and use of functional notation.<br/>3. Understand relationship between a function and its inverse.<br/>4. Perform the basic operations with functions.<br/>5. Graph and understand the basic properties for the following functions:<br/>polynomial, rational, exponential, logarithmic, circular, and trigonometric<br/>6. Apply algebraic techniques with trigonometric expressions and identities.<br/>7. Solve right and oblique triangles.<br/>8. Perform the basic operations with complex numbers.<br/>9. Find real and complex zeros of polynomial functions.<br/><br/>Outline of Topics<br/>I. Functions and their graphs<br/>a. Relations<br/>b. Functions<br/>c. Properties and algebra of functions<br/>d. Composite and inverse functions<br/>II. Polynomial and Rational Functions<br/>a. Quadratic Functions<br/>b. Polynomial Functions of degree greater than two and their real zeros<br/>c. Complex numbers<br/>d. Rational Functions<br/>e. Applications<br/>III. Exponential and logarithmic Functions<br/>a. Exponential Functions and their graphs<br/>b. Logarithmic Functions and their graphs<br/>c. Properties of exponents and logarithms<br/>d. Exponential and Logarithmic equations<br/>e. Applications<br/>IV. Trigonometry<br/>a. Angles and measurements<br/>b. Trigonometric Functions<br/>c. Graphs of Trigonometric Functions<br/>d. Inverse Trigonometric Equations<br/>e. Right Triangle Trigonometry<br/>V. Analytic Trigonometry<br/>a. Fundamental Identities<br/>b. Trigonometric Equations<br/>c. Sum and Difference Formulas<br/>d. Multiple Cangle and Product Formula<br/>e. Law of Sines<br/>f. Law of Cosines<br/>VI. Topics in Analytic Geometry"}, {"name": "Teaching Method", "value": "Method of instruction is tailored to best meet the needs of the class as a whole. Each class begins with a problem solving session which focuses on problem areas indicated by students. The primary method of instruction employed is the traditional lecture. Technology is utilized."}, {"name": "Evaluation Method", "value": "There will be 4 tests of equal weight. The final course grade will be determined by the average of the tests."}, {"name": "Class Materials (Required)", "value": "Materials may include the following. Visit the campus bookstore or its website to confirm materials for the course. <br/><br/>Precalculus: a Concise Course, Second Edition by Larson , Cengage Publications. ISBN 9781439049082 <br/><br/>Graphing Calculator"}], "lmod": "12/25/16 6:51 PM (CT)", "subject": "MATH"}]