[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "RCMA 1-176"}], "school": "MUSIC", "overview_of_class": "The study of musical performance is a core topic in music cognition and an emerging topic in music theory. This class provides an introduction to the literature and methods of such research. <br/><br/>The class will involve a critical reading of core literatures  pertaining to musical performance, and also provides an introduction to three primary methods used in analysis of musical performance: analysis of audio recordings, analysis of digital data such as that collected through MIDI, and analysis of musicians' bodily movements. We will work from both existing recordings and record new data using  aMIDI grand pianoand other digital instruments, especially drum set. <br/>Course content is arranged by three topics:<br/>1.  Intention in performance: How do musicians make decisions about how to play pieces of music?  How can we understand these intentions and their outcomes?<br/>2.  Action in performance:  What do musicians do in performance, especially with regard to expressive performance?  How is this related to musical style and structure?<br/>3.  Response to performance:  How do listeners perceive and respond to musical performance?  What are the roles of sound, visuals, and emotion? <br/><br/>The emphasis of the class is on understanding musically expressive performance in a variety of styles and genres, including Western art music (\"classical\") and popular musics, especially jazz, R&B, funk, and other musics in African-American traditions. <br/>Reading music notation is assumed but no background in music theory. Rhythmic analysis will be covered in sufficient detail, and only certain works studied will require a knowledge of harmony.<br/><br/>Grades will be calculated on homework (60%), unit projects (30%), and class participation (10%).  There is no final exam or term project in this class.", "qtr": "Winter 2016", "name": "Selected Topics in Music Cognition", "title": "MUSIC MUS_THRY 436-0-20 Selected Topics in Music Cognition", "lmod": "1/9/16 6:32 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "847/491-5720", "instructor_name": "Richard D Ashley", "instructor_addr": "r-ashley@northwestern.edu"}], "topic": "Performance and Cognition", "course": "436-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "The study of musical performance is a core topic in music cognition and an emerging topic in music theory. This class provides an introduction to the literature and methods of such research. <br/><br/>The class will involve a critical reading of core literatures pertaining to musical performance, and also provides an introduction to three primary methods used in analysis of musical performance: analysis of audio recordings, analysis of digital data such as that collected through MIDI, and analysis of musicians' bodily movements. We will work from both existing recordings and record new data using aMIDI grand pianoand other digital instruments, especially drum set. <br/>Course content is arranged by three topics:<br/>1. Intention in performance: How do musicians make decisions about how to play pieces of music? How can we understand these intentions and their outcomes?<br/>2. Action in performance: What do musicians do in performance, especially with regard to expressive performance? How is this related to musical style and structure?<br/>3. Response to performance: How do listeners perceive and respond to musical performance? What are the roles of sound, visuals, and emotion? <br/><br/>The emphasis of the class is on understanding musically expressive performance in a variety of styles and genres, including Western art music (&quot;classical&quot;) and popular musics, especially jazz, R&amp;B, funk, and other musics in African-American traditions. <br/>Reading music notation is assumed but no background in music theory. Rhythmic analysis will be covered in sufficient detail, and only certain works studied will require a knowledge of harmony.<br/><br/>Grades will be calculated on homework (60%), unit projects (30%), and class participation (10%). There is no final exam or term project in this class."}], "path": "/class-descriptions/4610/MUSIC/MUS_THRY/436-0/22212", "instructor": ["Richard D Ashley"], "class_attributes": "", "id": "22212", "subject": "MUS_THRY"}]