[{"school": "WCAS", "overview_of_class": "Poli_Sci 101-6-21 \"Wealth and Power in America\" Benjamin Page, Winter 2017<br/>This seminar explores the nature of economic inequality in the United States and the role of government in dealing with it. Special attention is paid to the political power of wealthy Americans, as opposed to that of other citizens: how much power they have; how they exercise it; for what purposes; and what public policies result.", "name": "First-Year Seminar", "section": "21", "topic": "Wealth and Power in America", "course": "101-6", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4650/WCAS/POLI_SCI/101-6/22850", "instructor": ["Benjamin I Page"], "id": "22850", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "Prof. James Druckman Winter 2017 \"Sports, Politics, and Public Opinion\"<br/>Sports and politics have become increasingly intertwined over the last half-century. Local, state, and federal governments as well as other governing bodies (e.g., the NCAA) regulate who can participate (e.g., eligibility, equality) and what standards athletes must meet (e.g., drug testing, academic performance). These organizations also oversee economic (e.g., resource distribution) and symbolic (e.g., mascots) issues. Ideally, governing policies would be responsive to the wishes of their constituents (players, owners, voters), but are they? How would we know? How do we gauge their opinions? Alternatively, how do sports affect public opinion? Do citizens prefer politicians who engage in sports? Do media portrayals of sports affect what citizens think about race and/or gender? These are the kinds of questions we will consider in this class. This involves learning the science of public opinion polling and applying it to study opinions about public policies relevant to sports.", "name": "First-Year Seminar", "section": "22", "topic": "Sports, Politics, and Public Opinion", "course": "101-6", "meeting_time": ["Tu 3:30PM - 6:20PM"], "path": "/class-descriptions/4650/WCAS/POLI_SCI/101-6/22851", "instructor": ["James N Druckman"], "id": "22851", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "\"Racial Politics in the Obama Era\" Prof. Reuel Rogers Winter 2017 101-6-23<br/>The election of Barack Obama, the country's first Black president, marked a historic watershed in American race relations. His presidency prompted both heady expectations for greater racial tolerance and inclusion as well as grim worries about racial backlash and conflict. This course will examine shifts in American racial politics during the Obama presidency. We will consider Blacks' political fortunes, racial attitudes across groups, reactions to demographic and economic change, and racial dynamics in party politics and specific public policy areas over the course of the Obama era.", "name": "First-Year Seminar", "section": "23", "topic": "Racial Politics in the Obama Era", "course": "101-6", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4650/WCAS/POLI_SCI/101-6/22852", "instructor": ["Reuel R Rogers"], "id": "22852", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "\"Global Environmental Politics\" Prof. Kimberly R. Marion Suiseeya 101-6-25 Winter 2017<br/>Environmental problems like deforestation, biodiversity loss, climate change, and ocean and marine resource degradation have emerged as some of the most intractable problems that society faces. They transcend international borders, are scientifically complex, and generally involve large sets of diverse actors and power dynamics from global to local scales. In this seminar we will examine how policies, actions, and behaviors impact the environment and how these politics of the environment play out on a global scale.", "name": "First-Year Seminar", "section": "25", "topic": "Global Environmental Politics", "course": "101-6", "meeting_time": ["MoWe 11:00AM - 12:20PM"], "path": "/class-descriptions/4650/WCAS/POLI_SCI/101-6/22853", "instructor": ["Kimberly Ruggles Marion Suiseeya"], "id": "22853", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "\"Politics of Debt\" Prof. Stephen Nelson Winter 2017 101-6-26<br/>Debt and credit are central features of national and global capitalism. When debt and credit markets function well they can be engines of growth; when they malfunction, as in the 2008 financial implosion in the US and the ongoing Eurozone debt crisis, they generate severe crises. In this course we will explore the evolution of instruments, relations, and categories that underpin debt through a political lens. In this seminar we will read and discuss work that examines the politics of debt at three different levels: personal, national, and global.", "name": "First-Year Seminar", "section": "26", "topic": "Politics of Debt", "course": "101-6", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4650/WCAS/POLI_SCI/101-6/22854", "instructor": ["Stephen C Nelson"], "id": "22854", "subject": "POLI_SCI"}]