[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "University Library 4670"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Winter 2017", "name": "22854", "title": "WCAS POLI_SCI 101-6-26 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "22854", "instructors": [{"instructor_phone": "847 4912589", "instructor_name": "Stephen C Nelson", "instructor_addr": "601 University Place # 240"}], "topic": "Politics of Debt", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "&quot;Politics of Debt&quot; Prof. Stephen Nelson Winter 2017 101-6-26<br/>Debt and credit are central features of national and global capitalism. When debt and credit markets function well they can be engines of growth; when they malfunction, as in the 2008 financial implosion in the US and the ongoing Eurozone debt crisis, they generate severe crises. In this course we will explore the evolution of instruments, relations, and categories that underpin debt through a political lens. In this seminar we will read and discuss work that examines the politics of debt at three different levels: personal, national, and global."}, {"name": "Registration Requirements", "value": "First year students only"}, {"name": "Learning Objectives", "value": "By the end of this course students will: <br/>-Become familiar with some of the key economic ideas, institutions, structures, trends, and turning points in the construction and governance of debt markets<br/>-Work with different theoretical perspectives on the political problems of debt<br/>-Delve into some of the details of the 2008 mortgage crisis in the American financial system and the ongoing sovereign debt crisis in the Eurozone countries<br/>-Improve their abilities to use analytical frameworks and empirical evidence when talking and writing about important debates in this issue area<br/> -Sharpen their writing skills"}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "The weighting of the course requirements is as follows:<br/>o Research paper: 40%<br/>o Analytical essay: 25%<br/>o Course participation: 25%<br/>o Peer feedback exercise: 5% <br/>o &quot;Resident expert&quot; in one seminar meeting: 5%"}, {"name": "Class Materials (Required)", "value": "Louis Hyman. Debtor Nation: The History of America in Red Ink. Princeton University Press, 2012. Paperback. ISBN: 9780691156163"}], "lmod": "12/29/16 7:04 PM (CT)", "subject": "POLI_SCI"}]