[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "University Hall 121"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Environmental Policy and Culture Students Only During Pre-Registration", "qtr": "Spring 2017", "name": "37884", "title": "WCAS ENVR_POL 390-0-25 Special Topics in Environmental Policy and Culture", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "37884", "instructors": [{"instructor_phone": "", "instructor_name": "Maria   Akchurin", "instructor_addr": ""}], "topic": "Environment, Politics and Society", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "This undergraduate course examines connections between the natural environment, politics, and society across the global North and South. We will begin by discussing theories of environment-society relations in sociology and what we mean by &quot;environmental problems&quot; and &quot;environmental values.&quot; The remainder of the course will be organized into three substantive sections, on varieties of environmentalism; environment and development; and environment, inequality, and social justice. As we go through the readings, we will consider major themes such as the rise of organized collective action like environmental activism and individual responses like green consumerism and &quot;freeganism&quot;; the opportunities and limitations of institutional and policy responses to environmental degradation; the tensions between environmental protection and economic development; the relationship between environmental degradation and inequality within and among countries; and the roles of scientific knowledge and non-expert knowledge in making sense of environmental problems and solutions. Our substantive case studies will cover topics like water, energy, waste, and climate change."}, {"name": "Registration Requirements", "value": "During preregistration this course is only open to Sociology, SHC, and Global Health Majors &amp; Minors.<br/>This course is open to all undergraduates during regular registration."}, {"name": "Learning Objectives", "value": "The course is designed to provide students with broad knowledge about the social and political dimensions of environmental problems. The course materials are chosen to teach sociological perspectives regarding the relationship between society and the natural environment, as well as to expose students to concrete cases of environmental degradation and responses to it, in comparative perspective. By the end of the course, students will 1) become familiar with major sociological theories about the relationship between society and the natural environment, 2) discuss and analyze case studies drawn from distinct geographic contexts, 3) discuss and analyze different methodological approaches to conducting research on environmental topics in sociology, including ethnographic, historical, and quantitative approaches, 4) practice oral presentation skills, and 5) improve analytical and writing skills."}, {"name": "Evaluation Method", "value": "Discussion, midterm, final paper"}, {"name": "Class Materials (Required)", "value": "A course pack will be available at Quartet. Other course materials available on Canvas."}], "lmod": "2/13/17 6:44 PM (CT)", "subject": "ENVR_POL"}]