[{"school": "SoC", "overview_of_class": "The Advanced Public Speaking course allows students with a basic understanding of public speaking to extend their abilities through theory and practice while focusing on civic persuasion. Classes consist of theory lecture followed by speeches. Students develop research and organizational skills necessary for clear, concise, and engaging presentations. Students will also improve their individual public speaking delivery style by studying public speaking skills as both a speaker and an observer.", "name": "Topics in Communication Studies", "section": "20", "location": "Parkes Hall 214", "topic": "Advanced Public Speaking", "course": "395-0", "meeting_time": ["We 6:00PM - 9:00PM"], "path": "/class-descriptions/4660/SoC/COMM_ST/395-0/32957", "instructor": ["Ryan S Lauth"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "id": "32957", "subject": "COMM_ST"}, {"school": "SoC", "overview_of_class": "This course looks at ethnographies of artistic practice to better understand how culture is made, circulated, and received in social life.", "name": "Topics in Communication Studies", "section": "21", "location": "Parkes Hall 213", "topic": "Ethnographies of Culture", "course": "395-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4660/SoC/COMM_ST/395-0/32958", "instructor": ["Claudio Ezequiel Benzecry"], "class_attributes": "Jrs, Srs, Grad Students Only<br/><br/>", "id": "32958", "subject": "COMM_ST"}, {"school": "SoC", "overview_of_class": "This is a seminar course that will examine how algorithms are shaping society (and vice versa). We will cover issues related to income inequality, the 2016 U.S. presidential election, racial and ethnic bias, rural areas, and others topics. The primary weekly activities will be reading \"hot-off-the-presses\" literature, discussion, and presentation. The primary deliverable will be designing a research project for publication at a prominent scientific publication venue (i.e. this is a research/course \"twofer\"). This course will appeal equally to students from McCormick and from the School of Communication, and both types of students will be challenged in their domain of expertise.", "name": "Topics in Communication Studies", "section": "22", "location": "Frances Searle Building 2378", "topic": "Algorithms in Society", "course": "395-0", "meeting_time": ["WeFr 11:00AM - 12:20PM"], "path": "/class-descriptions/4660/SoC/COMM_ST/395-0/32959", "instructor": ["Brent Jaron Hecht"], "class_attributes": "Jrs, Srs, Grad Students Only<br/><br/>", "id": "32959", "subject": "COMM_ST"}, {"school": "SoC", "overview_of_class": "Fan interest in sports has never been more intense or widespread. The sports industry is now a $762 billion business with many organizations generating record revenues from ticket sales, broadcast rights agreements, and corporate sponsorships. At the same time, teams and leagues are facing an increasing amount of domestic and foreign competition, as well as new threats to traditional revenue streams, even as the costs of doing business continue to rise. Complicating matters further, the 24-hour sports news cycle is dominated by issues of ethics and corruption, forcing athletes, teams, and leagues to constantly defend and justify their actions in the face of ongoing crises. This includes innovations in social media and mobile technologies that are allowing teams and leagues to increase the frequency and intensity of interactions with different audiences. Unprecedented challenges are making it more difficult for organizations to meet their objectives. The course will examine how best practice strategies impact areas such as brand identity, digital communication, revenue generation, crisis management, managing the narrative, and place marketing. Students will be evaluated on a midterm and final paper related to developing sports strategies.", "name": "Topics in Communication Studies", "section": "23", "location": "University Library Video Theat", "topic": "Crisis and Sports Management", "course": "395-0", "meeting_time": ["Tu 2:00PM - 4:50PM"], "path": "/class-descriptions/4660/SoC/COMM_ST/395-0/32960", "instructor": ["Irving Jacob   Rein"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "id": "32960", "subject": "COMM_ST"}, {"school": "SoC", "overview_of_class": "This course will examine the impact, both positive and negative, that digital technology has on communication across development. This course will provide an overview of the complex ways in which children and adolescent engage in interpersonal communication with peers and family members as well as the interactions that children have with, through, and in the context of media technology.", "name": "Topics in Communication Studies", "section": "24", "location": "Parkes Hall 223", "topic": "Digital Communication", "course": "395-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4660/SoC/COMM_ST/395-0/32961", "instructor": ["Alexis Re Lauricella"], "class_attributes": "", "id": "32961", "subject": "COMM_ST"}]