[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "Harris Hall 107"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-registration is reserved for Sociology Majors and Minors.", "qtr": "Spring 2017", "name": "35556", "title": "WCAS SOCIOL 202-0-20 Social Problems", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "35556", "instructors": [{"instructor_phone": "847/467-0517", "instructor_name": "Karrie A Snyder", "instructor_addr": "1808 Chicago, Room 106"}], "topic": "", "course": "202-0", "descriptions": [{"name": "Overview of class", "value": "In this course, we will investigate how social conditions come to be defined as social problems. This course will be divided into two sections. The first section will be an overview of how sociologists have approached the study of social problems including theoretical perspectives (symbolic interactionist, conflict, structural-functionalist and constructionist perspectives). In this section, we will also conceptually examine the roles of policymakers, social advocates, and the media in the process of defining social problems. In the second section of the course, we will use the perspectives and conceptual tools from the first part to analyze contemporary social problems including bullying, violence among young people, and the effects of the media on children and teenagers. As a class, we will also examine the debates surrounding several social problems (such as teen pregnancy) to understand how interested parties can define a similar situation as problematic, but do so for very diverse reasons and in doing so suggest very different solutions."}, {"name": "Registration Requirements", "value": "During preregistration this course is only open to Sociology Majors &amp; Minors.<br/><br/>This course is open to all undergraduates during regular registration."}, {"name": "Learning Objectives", "value": "- An understanding of how social issues come to be defined as &quot;social problems.&quot;<br/><br/>- Understanding the roles of the media, parents, child advocates, and politicians in the defining of social problems.<br/><br/>- Students will trace the historical evolution of a social problem of their choice using the frameworks and theoretical perspectives we use in class."}, {"name": "Teaching Method", "value": "Lecture, Group Work, Discussion."}, {"name": "Evaluation Method", "value": "2 midterms (each 30%), Paper, final (25%), Class Participation (15%)"}, {"name": "Class Materials (Required)", "value": "This is a tentative booklist. Please verify all books before purchase: <br/> <br/><br/>Joel Best, Social Problems, 2nd Edition, Norton Press, 2012, 978-0393918632 <br/><br/>Course packet on Canvas"}], "lmod": "2/13/17 6:48 PM (CT)", "subject": "SOCIOL"}]