[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Frances Searle Building 2370"}], "school": "SoC", "overview_of_class": "Introduction to the measurement, analysis and synthesis of acoustic signals.", "qtr": "Fall 2017", "name": "Signals, Systems and Acoustics for the Communication Sciences", "title": "SoC CSD 401-0-20 Signals, Systems and Acoustics for the Communication Sciences", "lmod": "5/4/17 7:01 PM (CT)", "section": "20", "topic": "", "course": "401-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Introduction to the measurement, analysis and synthesis of acoustic signals."}, {"name": "Learning Objectives", "value": "This course responds to the typical needs and preparation of graduate and undergraduate students in the Department of Communication Sciences and Disorders, particularly those enrolled in the AuD program. Therefore, it assumes limited knowledge of mathematics and, specifically, does not require previous knowledge of either differential/integral calculus or calculus-based physics. It DOES require knowledge of basic mathematics, through algebra and trigonometry, and basic physics.<br/><br/>Students are expected to learn the material in the assigned readings, as reinforced and supplemented by classroom lectures and discussion (see Procedures below). Grading will be based on performance on two examinations, in which the questions will largely be derived from the TEXTBOOKS."}, {"name": "Class Materials (Required)", "value": "Required Texts:<br/>Stuart Rosen and Peter Howell (2007), Signals and Systems for Speech and Hearing, Emerald Group, UK.<br/>The previous edition of this book (1991) differs little from the current one. Either edition is fine.<br/><br/>Charles Speaks (1999), Introduction to Sound, Singular Press, San Diego.<br/><br/>Charles E. Speaks, Edward Carney, Monica Ray Zobits (1999), Course Notes and Workbook for Introduction to Sound, 3RD edition, Singular Press, San Diego."}, {"name": "Class Notes", "value": "Procedures: preparation for classes<br/>Other than field or laboratory research, academic learning is largely an individual activity. In \"courses\" (of study), most learning implies ACTIVE and dedicated reading of textbooks, which often includes solving practice problems or answering review questions. The textbooks I have chosen together cover the materials which, if thoroughly grasped, will fulfill most of the Goals of the course (see above). However, learning can be facilitated by guidance from more experienced people (\"teachers\", e.g., M.A.R), as well as peers. To make efficient use of classroom time, I would like to tailor lectures and discussions so that they focus on \"important\" and/or \"difficult\" subjects. For this purpose<br/>1) You should ALWAYS read the assigned textbook chapters in advance of the corresponding class. <br/>2) Optionally: after reading each chapter, send me via e-mail specific topics/subjects of readings that you found especially difficult to grasp or, simply, that you think I should spend substantial time clarifying in class. Try to submit your lists at least 24 hours before each class so that we may use them in the preparation of lectures and discussions.<br/><br/>Procedures: weekly quizzes<br/>Most Mondays, we will begin the week with a short quiz, lasting about 10 minutes and consisting of two questions dealing with subjects covered the previous week.<br/><br/>Procedures: mid-term and final exams<br/>The mid-term exam will cover solely the materials presented in the first half of the quarter. The final exam will be comprehensive.<br/><br/>Grades<br/>The overall course grade will be determined on the basis of two partial grades: 1) the final-exam grade and 2) a \"preliminary grade\" combining the mid-term exam score (80%) and the performance in quizzes (20%). If the final-exam grade is lower than the preliminary grade, the overall course grade will be computed as their average. If the final-exam grade is higher than the preliminary grade, the final-exam grade will be taken as the overall course grade."}], "instructor": ["Jonathan H Siegel"], "class_attributes": "", "id": "11044", "subject": "CSD"}]