[{"class_mtg_info": [{"meet_t": "MoTuWeTh 10:00AM - 10:50AM", "meet_l": "University Hall 412"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-Registration - Reserved for Classics majors or minors.", "qtr": "Spring 2017", "name": "32715", "title": "WCAS GREEK 101-3-20 Elementary Greek", "class_attributes": "", "section": "32715", "instructors": [{"instructor_phone": "847/467-6976", "instructor_name": "Ryan Christopher Platte", "instructor_addr": "Kresge Hall 4355"}], "topic": "", "course": "101-3", "descriptions": [{"name": "Overview of class", "value": "This course constitutes the third and final course in the year-long, introduction to the ancient Greek language, designed to provide students with the training required to read unaltered ancient texts by the end of the year. Once this course is completed students will be able to progress to courses on such topics as the New Testament, Plato, Homer, the Greek tragedians, and many more. This course, then, builds on the fundamentals of Greek grammar and vocabulary mastered in the previous terms and moves students into the study of more sophisticated constructions and ultimately to unaltered Greek."}, {"name": "Registration Requirements", "value": "Completion of Greek 101-2 or permission of the instructor"}, {"name": "Learning Objectives", "value": "- Complete study of the forms and structures of ancient Greek grammar<br/><br/>- Develop a working vocabulary of the ancient language"}, {"name": "Teaching Method", "value": "Class participationField trips: A trip to the Art Institute of Chicago<br/>LectureReadings"}, {"name": "Evaluation Method", "value": "AttendanceClass participationExam, finalExam, mid-termHomeworkQuizzesParticipation, weekly quizzes, midterm, and final"}, {"name": "Class Materials (Required)", "value": "From Alpha to Omega: a beginning course in Classical Greek (ISBN: 978-1585103911)<br/>46 Stories in Classical Greek (978-1585106318)"}], "lmod": "2/14/17 6:45 PM (CT)", "subject": "GREEK"}]