[{"class_mtg_info": [{"meet_t": "Mo 2:00PM - 4:50PM", "meet_l": "University Hall 018 English"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Spring 2017", "name": "33343", "title": "WCAS ENGLISH 471-0-20 Studies in American Literature", "class_attributes": "", "section": "33343", "instructors": [{"instructor_phone": "", "instructor_name": "Shaundra J Myers", "instructor_addr": ""}], "topic": "Black Women's Print Circuits", "course": "471-0", "descriptions": [{"name": "Overview of class", "value": "Whether described as a flourishing, an explosion, or a blossoming, the renaissance of African American women's writing that began in the 1970s is now commonly accepted as the starting point, if not the signature feature, of what we might consider the long era of contemporary African American literature. Engaging in bibliographic, archival, and critical work situated at the intersection of textual scholarship and African Americanist criticism, we will examine the gendered dimensions of late-twentieth-century African American print culture by studying the conditions of publication and distribution of black women's novels, short stories, poetry, drama, manifestos, periodical work, anthologies, and essays. We will complicate our understanding of what was produced during this literary awakening by investigating its processes of production. We will study the informal social networks as well as the formal venues, including Random House, Kitchen Table Press, the Feminist Press, and the digital Schomburg collection of 19th-century women writers, that facilitated black women's literary production, reproduction, and distribution. Over the course of our study, we will ask, Why did the publishing industry suddenly open up to black women's literature in unprecedented ways? How did the institutionalization of black literary studies and the attendant demand for accessible texts by black women writers shape the commodification, canonization, and aesthetics of the African American literary tradition? How do certain patterns or modes of textual circulation help constitute particular kinds of reading publics and counterpublics? Ultimately, as we explore black women's discursive manipulations of what Madhu Dubey terms their &quot;double ideological absence,&quot; we will also address other absences?embedded in the material history of their printed and reprinted texts."}, {"name": "Evaluation Method", "value": "Discussion, presentation and short paper on archival project, Canvas postings, conference presentation, and a final critical essay."}, {"name": "Class Materials (Required)", "value": "Primary texts may include works by Zora Neale Hurston, Nella Larsen, Gwendolyn Brooks, Toni Morrison, Toni Cade Bambara, Alice Walker, Gayl Jones, Andrea Lee, Ntozake Shange, and Audre Lorde. Critical and theoretical readings in black feminist theory, textual scholarship, and African Americanist criticism may include Barbara Smith, Deborah McDowell, Hazel Carby, Barbara Christian, Hortense Spillers, Mae Henderson, Madhu Dubey, Jerome McGann, Diana Taylor, Paul Bryant, Michael Warner, Joycelyn Moody, Howard Rambsy, George Hutchinson, and John Young, among others."}], "lmod": "2/21/17 6:46 PM (CT)", "subject": "ENGLISH"}]