[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "1801 Hinman Ave 2225"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "34925", "title": "WCAS ENGLISH 371-0-20 American Novel", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "34925", "instructors": [{"instructor_phone": "847/491-3530", "instructor_name": "Julia Ann   Stern", "instructor_addr": "University Hall Room 415"}], "topic": "Am Wm Auteurs: Novels &amp; Film 1900-1962", "course": "371-0", "descriptions": [{"name": "Overview of class", "value": "This course will explore narratives and characters created by American women writers and film actresses working between 1900 and 1962; described as &quot;regionalists&quot; or &quot;local color writers,&quot; or performers of &quot;melodrama&quot; or &quot;women's pictures,&quot; these figures produced literature and moving pictures celebrated by feminist scholars and critics today. The seminar will explore novels by Sarah Orne Jewett, Edith Wharton, Kate Chopin, Willa Cather, and Nella Larsen and several films starring two-time Oscar winner Bette Davis in order to develop a definition of &quot;women auteur.&quot;"}, {"name": "Teaching Method", "value": "Discussion"}, {"name": "Evaluation Method", "value": "Active participation in class discussion, 3 short essays (2-3 pp), and 1 final paper (5-6pp). Attendance is mandatory. Illnesses must be documented. Anyone who misses more than one class session must receive my permission to continue in the course."}, {"name": "Class Materials (Required)", "value": "Jewett, The Country of the Pointed Firs;<br/>Wharton, either House of Mirth or Custom of the Country;<br/>Chopin, The Awakening;<br/>Cather, either My Antonia or Sapphira and the Slave Girl;<br/>Larsen, Quicksand and Passing.<br/><br/>Films include: &quot;Jezebel,&quot; dir. William Wyler;<br/>&quot;The Letter,&quot; dir. William Wyler;<br/>&quot;Dark Victory,&quot; dir. Edmund Goulding;<br/>&quot;Now, Voyager,&quot; Irving Rapper;<br/>&quot;In This Our Life,&quot; John Huston;<br/>&quot;Whatever Happened to Baby Jane?&quot; dir. Robert Aldrich"}, {"name": "Class Notes", "value": "Post 1830/ICSP"}], "lmod": "4/3/16 7:59 PM (CT)", "subject": "ENGLISH"}]