[{"school": "WCAS", "overview_of_class": "*INFORMATION IS SUBJECT TO CHANGE*<br/><br/><br/>The instructor of \"Lessons in Non-Profit Management\" is: Liam Krehbiel<br/><br/><br/>This course is jointly sponsored by Business Institutions and a student organization called campusCatalyst. The course is taught by a leader in the Chicagoland non-profit community and combines both a consulting experience with area non-profits facing organizational strategy issues with classroom lectures and discussions on the nonprofit sector. The class is composed of 25 students who are split into teams of five, and matched with local non-profit organizations and Kellogg MBA mentors, to work on quarter-long consulting engagements. Students directly engage with their client organizations in the field and then collectively meet once per week to discuss issues and problems they are facing with one another and their instructor, as well as to attend a series of classroom lectures on the nonprofit sector. To inform and guide students' interactions with non-profits, the classroom sessions will provide an overview of the non-profit sector and the growing trends towards greater accountability, transparency and performance management. Students will explore the changing roles and responsibilities of non-profits, as shaped by both the public and private sector, and they will examine the implications of these trends. The course curriculum has two parts: 1) introducing students to the so-called Third Sector and the present political and economic systems that influence how it serves the public good and 2) examining business strategy and management and their applicability to non-profits. The over-arching goal of the course is to create a foundation of knowledge from which students can draw upon as they work together with community non-profits. This course is an opportunity to innovate, collaborate, learn and apply a new set of skills and knowledge while impacting the community.", "name": "Professional Linkage Seminar", "section": "20", "location": "Fisk Hall 114", "topic": "Lessons in Non-Profit Mgmt", "course": "394-0", "meeting_time": ["Th 3:00PM - 5:50PM"], "path": "/class-descriptions/4660/WCAS/BUS_INST/394-0/32607", "instructor": ["William Veeck Liam Krehbiel"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>Registration is By Application Only<br/><br/>", "id": "32607", "subject": "BUS_INST"}, {"school": "WCAS", "overview_of_class": "*INFORMATION IS SUBJECT TO CHANGE*<br/><br/><br/><br/>Instructor for \"Theories of Financial Investing\" is: William McLean<br/><br/><br/>This course studies the field of investment management for institutional portfolios. It is intended as a combination of modern financial theory and industry practice, giving insight into the investment process used in large foundations, endowments, and pension funds. It covers best practices in risk management, diversification theory, modern portfolio theory, and new issues in investment management. In particular, the field of alternative investments namely, hedge funds, private equity, venture capital, and real asset-based investments will be featured.<br/>", "name": "Professional Linkage Seminar", "section": "21", "location": "TBA", "topic": "Theories of Financial Investing", "course": "394-0", "meeting_time": ["Th 6:30PM - 9:30PM"], "path": "/class-descriptions/4660/WCAS/BUS_INST/394-0/32608", "instructor": ["William H McLean"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>Prerequisites apply, see description<br/><br/>", "id": "32608", "subject": "BUS_INST"}]