[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Frances Searle Building 1441"}], "school": "SoC", "enrl_requirement": "", "qtr": "Spring 2017", "name": "32755", "title": "SoC CSD 303-0-20 Brain and Cognition", "class_attributes": "Interdisciplinary Distro - See Rules<br/><br/>Natural Sciences Distro Area<br/><br/>Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "32755", "topic": "", "course": "303-0", "descriptions": [{"name": "Overview of class", "value": "This course will review cognitive foundations (e.g. perception, attention, memory, executive) for processing symbol systems (i.e. visual words, spoken words and numbers) with a focus on neural basis and development."}, {"name": "Registration Requirements", "value": "Prior exposure to neuroscience or cognitive science is helpful, but is not required."}, {"name": "Learning Objectives", "value": "Review relevant behavioral and neuroanatomical research<br/>Describe gross organization of the brain<br/>Describe methods of studying the brain basis of communication (e.g. electrophysiological, neuroimaging, lesion)<br/>Understand perceptual (e.g. visual, auditory) foundations of communication and its development<br/>Understand attention, memory and executive function foundations of communication and its development<br/>Describe models of information processing and symbolic representation (e.g. visual words, spoken words, numbers)<br/>Understand cortical organization and development of word processing (e.g. phonological, orthographic and semantic)<br/>Describe precursors and development of reading and spelling<br/>Discuss how breakdown in lexical systems, and in broader cognitive functions, may lead to deficits in reading and spelling<br/>Describe models of number processing, and the cortical organization and development of calculation"}, {"name": "Class Materials (Required)", "value": "Ward J (2010). The Students Guide to Cognitive Neuroscience. Psychology Press: New York.<br/><br/>Slides for classes and other material can be downloaded from BlackBoard (PDF format)."}], "lmod": "2/6/17 6:37 PM (CT)", "subject": "CSD"}]