[{"class_mtg_info": [{"meet_t": "MoWeFr 10:00AM - 10:50AM", "meet_l": "Harris Hall L05"}], "school": "WCAS", "overview_of_class": "In many respects, the culture of Renaissance England held startling views on gender, sex, and sexuality. Medical authorities in the period thought that female genitalia was essentially inverted male genitalia, and that it was prone to spontaneous reversals that could make women into men; Renaissance men (all Renaissance men) were thought to be particularly prone to homoerotic desire in their youth; and poetry was seen as both threatening as an incitement to illicit sexual desires and ennobling as a tool with which to transform sexual pleasure into spiritual exaltation. This course will consider Renaissance representations and conceptualizations of sex, gender, and sexuality, primarily in poetry and also in prose, visual art, and theatre. How did physicians, philosophers, and others think about and represent gender and sexuality? How did poets, playwrights, essayists, and visual artists adopt and adapt their culture's views in their artistic practices? What insight into our cultures' views of gender, sex, and sexuality does the culture of Renaissance England provide us?", "qtr": "Winter 2016", "name": "First-Year Seminar", "title": "WCAS ENGLISH 101-6-20 First-Year Seminar", "lmod": "1/9/16 6:46 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Christopher Daniel Shirley", "instructor_addr": ""}], "topic": "Sex and the Renaissance", "course": "101-6", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "descriptions": [{"name": "Overview of class", "value": "In many respects, the culture of Renaissance England held startling views on gender, sex, and sexuality. Medical authorities in the period thought that female genitalia was essentially inverted male genitalia, and that it was prone to spontaneous reversals that could make women into men; Renaissance men (all Renaissance men) were thought to be particularly prone to homoerotic desire in their youth; and poetry was seen as both threatening as an incitement to illicit sexual desires and ennobling as a tool with which to transform sexual pleasure into spiritual exaltation. This course will consider Renaissance representations and conceptualizations of sex, gender, and sexuality, primarily in poetry and also in prose, visual art, and theatre. How did physicians, philosophers, and others think about and represent gender and sexuality? How did poets, playwrights, essayists, and visual artists adopt and adapt their culture's views in their artistic practices? What insight into our cultures' views of gender, sex, and sexuality does the culture of Renaissance England provide us?"}, {"name": "Teaching Method", "value": "Discussion"}, {"name": "Evaluation Method", "value": "Participation (20%), Full Papers (60%), Small Group Presentation (10%), Response Papers (10%) Students will write three longer papers, two each of five pages and one of seven pages, as well as three short response papers of one to two pages."}, {"name": "Class Materials (Required)", "value": "We will read several poems from the most prominent poets of the Renaissance, including Thomas Wyatt, Philip Sidney, John Donne, William Shakespeare, and Andrew Marvell. We will also read short prose pieces by essayists such as Francis Bacon and Michel de Montaigne, works by Renaissance visual artists, and a play, The Roaring Girl, by Thomas Middleton and Thomas Dekker. Short readings by contemporary scholars will also be assigned to comment on our primary readings. The course will conclude with some contemporary material, such as episodes of the Showtime television series The Tudors and the film Shakespeare in Love, which will allow us to consider how sex in the Renaissance continues to fascinate and influence us in the twenty-first century. Norton Anthology of English Literature (Ninth Edition), Vol. B: The Renaissance and the Early Seventeenth Century (ISBN: 0393912507); Middleton and Dekker, The Roaring Girl (ISBN: 039393277X); course pack."}], "path": "/class-descriptions/4610/WCAS/ENGLISH/101-6/25417", "instructor": ["Christopher Daniel Shirley"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "25417", "subject": "ENGLISH"}, {"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "University Hall 318"}], "school": "WCAS", "overview_of_class": "People tend to think of fictional narratives as inventions. The etymology of the word itself, fiction, means \"made.\" But often, fiction writers draw on and transform true stories, settings and people from history in pursuit of their own artistic vision, a practice sometimes called literary historicism.<br/><br/>This first-year seminar is about these encounters between fiction and history. We will follow Sir Walter Scott back to the Scotland of the 1745 rebellion, and dwell in his careful evocation of a world that already seemed so distant in his own 1810s. We will silently mouth wooooah in unison to the mind-bending alter-native histories offered by Octavia Butler and Philip K. Dick, who will threaten to unmoor our inmost sense of our place in historical time. And we will reflect on Laurent Binet's postmodern meditations on the com-patibility between narrative and historical truth. All this, and more: a heart-rending short story set on a cosmological scale; a video game that attempts to recount the entirety of human history; and a Holly-wood blockbuster about time travel or the Oedipus Complex ? or maybe both.", "qtr": "Winter 2016", "name": "First-Year Seminar", "title": "WCAS ENGLISH 101-6-21 First-Year Seminar", "lmod": "1/9/16 6:46 PM (CT)", "section": "21", "instructors": [{"instructor_phone": "", "instructor_name": "Nicholas Pardee Valvo", "instructor_addr": ""}], "topic": "Back to the Future: Early/Modern Anachronic Prose", "course": "101-6", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "descriptions": [{"name": "Overview of class", "value": "People tend to think of fictional narratives as inventions. The etymology of the word itself, fiction, means &quot;made.&quot; But often, fiction writers draw on and transform true stories, settings and people from history in pursuit of their own artistic vision, a practice sometimes called literary historicism.<br/><br/>This first-year seminar is about these encounters between fiction and history. We will follow Sir Walter Scott back to the Scotland of the 1745 rebellion, and dwell in his careful evocation of a world that already seemed so distant in his own 1810s. We will silently mouth wooooah in unison to the mind-bending alter-native histories offered by Octavia Butler and Philip K. Dick, who will threaten to unmoor our inmost sense of our place in historical time. And we will reflect on Laurent Binet's postmodern meditations on the com-patibility between narrative and historical truth. All this, and more: a heart-rending short story set on a cosmological scale; a video game that attempts to recount the entirety of human history; and a Holly-wood blockbuster about time travel or the Oedipus Complex ? or maybe both."}, {"name": "Teaching Method", "value": "Discussion"}, {"name": "Evaluation Method", "value": "The first essay will be five pages (1500 words), due in the third week. <br/>The group assignment presentations will take place in the seventh week, with individual reflection papers of two to three pages (6-900 words) due in the eighth week. <br/>The final essay will be eight pages (2400 words), due in the exam period."}, {"name": "Class Materials (Required)", "value": "Sir Walter Scott, Waverly (1814; novel) <br/>Philip K. Dick, The Man in the High Castle (1962; novel)<br/>Octavia Butler, Kindred (1979; novel)<br/>Robert Zemeckis, &quot;Back to the Future&quot; (1985; film)<br/>Jenny Hollowell, &quot;The History of Everything Including You&quot; (2007; short story) <br/>&quot;Sid Meier's Civilization V&quot; (2010; video game)<br/>Laurent Binet, HHhH (2012; novel)"}], "path": "/class-descriptions/4610/WCAS/ENGLISH/101-6/25418", "instructor": ["Nicholas Pardee Valvo"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "25418", "subject": "ENGLISH"}, {"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "Locy Hall 314"}], "school": "WCAS", "overview_of_class": "If you're attracted by the title of this class, chances are that you're a fan of Jane Austen.  Love her or not, and this seminar also aims to speak to those who do not, you probably agree when she describes her novels as \"the little bit (two inches wide) of ivory on which I work with so fine a brush.\"  Austen offers a tiny painted cameo as a metaphor for her novels to belittle their topic:  family life, courtship, and marriage.  But Austen's metaphor takes her far outside the home, because a bit of ivory involves global traffic?elephants are not native to England.<br/><br/>This freshman seminar aims to challenge Austen's characterization of her work by pondering how her novels make us think?and what they invite us to think about.  In this class, we'll read four Austen novels, each paired with complementary shorter readings to help illuminate the historical, critical, and global questions they help us ask.  We will read Austen's Pride and Prejudice alongside feminist writing by Austen's shocking contemporary Mary Wollstonecraft to ponder this novel's sexual underbelly:  how does Austen relate economics and female sexuality in the early nineteenth century?  Is marriage?even happy marriage?really all about romance?  Next, we will read Austen's Emma alongside economic history by E. P. Thompson and Karl Marx to think about social status and class antagonism.  How much does social class define who you are, in the nineteenth century and today?  For our third novel, we'll read Austen's Mansfield Park alongside contemporary critical treatments of slavery and abolition.  We will also ponder the question:  how can we say that Mansfield Park is about slavery when its references to this topic are rare?  What critical techniques do we use to argue for the meaning of literary texts?  Finally, we'll read Austen's Northanger Abbey to reflect on the story she tells about popular novels like her own.  Alongside Northanger Abbey, we'll read excerpts from popular Gothic fiction of the time to reflect on Gothic horror and sensation, then and now.<br/><br/>There will be three mandatory film screenings for this class:  Pride and Prejudice, directed by Joe Wright; \"Clueless,\" directed by Amy Heckerling; and Mansfield Park, directed by Patricia Rozema.  All supplemental readings will be available in a course pack from Quartet Copies.  Austen's four novels will be bundled into a single package with one ISBN from Broadview Press, available at Norris Center Bookstore.", "qtr": "Winter 2016", "name": "First-Year Seminar", "title": "WCAS ENGLISH 101-6-22 First-Year Seminar", "lmod": "1/9/16 6:46 PM (CT)", "section": "22", "instructors": [{"instructor_phone": "", "instructor_name": "Helen F Thompson", "instructor_addr": ""}], "topic": "Thinking with Jane Austen", "course": "101-6", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "descriptions": [{"name": "Overview of class", "value": "If you're attracted by the title of this class, chances are that you're a fan of Jane Austen. Love her or not, and this seminar also aims to speak to those who do not, you probably agree when she describes her novels as &quot;the little bit (two inches wide) of ivory on which I work with so fine a brush.&quot; Austen offers a tiny painted cameo as a metaphor for her novels to belittle their topic: family life, courtship, and marriage. But Austen's metaphor takes her far outside the home, because a bit of ivory involves global traffic?elephants are not native to England.<br/><br/>This freshman seminar aims to challenge Austen's characterization of her work by pondering how her novels make us think?and what they invite us to think about. In this class, we'll read four Austen novels, each paired with complementary shorter readings to help illuminate the historical, critical, and global questions they help us ask. We will read Austen's Pride and Prejudice alongside feminist writing by Austen's shocking contemporary Mary Wollstonecraft to ponder this novel's sexual underbelly: how does Austen relate economics and female sexuality in the early nineteenth century? Is marriage?even happy marriage?really all about romance? Next, we will read Austen's Emma alongside economic history by E. P. Thompson and Karl Marx to think about social status and class antagonism. How much does social class define who you are, in the nineteenth century and today? For our third novel, we'll read Austen's Mansfield Park alongside contemporary critical treatments of slavery and abolition. We will also ponder the question: how can we say that Mansfield Park is about slavery when its references to this topic are rare? What critical techniques do we use to argue for the meaning of literary texts? Finally, we'll read Austen's Northanger Abbey to reflect on the story she tells about popular novels like her own. Alongside Northanger Abbey, we'll read excerpts from popular Gothic fiction of the time to reflect on Gothic horror and sensation, then and now.<br/><br/>There will be three mandatory film screenings for this class: Pride and Prejudice, directed by Joe Wright; &quot;Clueless,&quot; directed by Amy Heckerling; and Mansfield Park, directed by Patricia Rozema. All supplemental readings will be available in a course pack from Quartet Copies. Austen's four novels will be bundled into a single package with one ISBN from Broadview Press, available at Norris Center Bookstore."}, {"name": "Teaching Method", "value": "Discussion"}], "path": "/class-descriptions/4610/WCAS/ENGLISH/101-6/25419", "instructor": ["Helen F Thompson"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "25419", "subject": "ENGLISH"}, {"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "University Library 4770"}], "school": "WCAS", "overview_of_class": "One could search high and low through the annals of American literature without being able to find two BIGger BOOKS than the ones we will read in Winter 2016: Uncle Tom's Cabin and Moby-Dick.  For one thing, both books are long, and part of what we will talk about are the specific pleasures and challenges of reading BIG BOOKS.  How do we gauge, and thereby engage with, narratives of disproportionate scale and encyclopedic ambition? How do we lose, or find, our place in colossal fictional worlds?<br/><br/>But Stowe's Uncle Tom's Cabin and Melville's Moby-Dick are BIG BOOKS in another way, too.  Each of them has been a hugely influential and profoundly consequential novel.  Indeed, one cannot really understand American literary and cultural history if one is not familiar with these two BIG BOOKS.    Harriet Beecher Stowe's novel was a watershed text for both sides in the Civil War.  Upon meeting Stowe, Abraham Lincoln reportedly said to her, \"So you're the little woman who wrote the book that made this great war!\"  Stowe's novel sold 300,000 copies in the first year?an unprecedented number?and her story became the basis for countless stage adaptations, spin-offs, parodies, editorials, refutations, and re-writes. (Check out some of them here: <a>http://utc.iath.virginia.edu</a>)  The reputation of Melville's novel took longer to take shape?its early readers enjoyed the material about whaling, but didn't quite know what to make of the story of Ahab's obsession with the White Whale.  But over the course of the twentieth century these views reversed themselves, and Ahab's maniacal quest has come to be widely recognized as one of the masterpieces of world literature.  Our work in Winter 2016 will be, like Ahab, to take on these Leviathans, these BIG BOOKS, better to understand them and the worlds they shaped?including our own.", "qtr": "Winter 2016", "name": "First-Year Seminar", "title": "WCAS ENGLISH 101-6-23 First-Year Seminar", "lmod": "1/9/16 6:46 PM (CT)", "section": "23", "instructors": [{"instructor_phone": "", "instructor_name": "Jay A Grossman", "instructor_addr": ""}], "topic": "Big Books", "course": "101-6", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "descriptions": [{"name": "Overview of class", "value": "One could search high and low through the annals of American literature without being able to find two BIGger BOOKS than the ones we will read in Winter 2016: Uncle Tom's Cabin and Moby-Dick. For one thing, both books are long, and part of what we will talk about are the specific pleasures and challenges of reading BIG BOOKS. How do we gauge, and thereby engage with, narratives of disproportionate scale and encyclopedic ambition? How do we lose, or find, our place in colossal fictional worlds?<br/><br/>But Stowe's Uncle Tom's Cabin and Melville's Moby-Dick are BIG BOOKS in another way, too. Each of them has been a hugely influential and profoundly consequential novel. Indeed, one cannot really understand American literary and cultural history if one is not familiar with these two BIG BOOKS. Harriet Beecher Stowe's novel was a watershed text for both sides in the Civil War. Upon meeting Stowe, Abraham Lincoln reportedly said to her, &quot;So you're the little woman who wrote the book that made this great war!&quot; Stowe's novel sold 300,000 copies in the first year?an unprecedented number?and her story became the basis for countless stage adaptations, spin-offs, parodies, editorials, refutations, and re-writes. (Check out some of them here: <a>http://utc.iath.virginia.edu</a>) The reputation of Melville's novel took longer to take shape?its early readers enjoyed the material about whaling, but didn't quite know what to make of the story of Ahab's obsession with the White Whale. But over the course of the twentieth century these views reversed themselves, and Ahab's maniacal quest has come to be widely recognized as one of the masterpieces of world literature. Our work in Winter 2016 will be, like Ahab, to take on these Leviathans, these BIG BOOKS, better to understand them and the worlds they shaped?including our own."}, {"name": "Teaching Method", "value": "Discussion"}, {"name": "Evaluation Method", "value": "Your final grade will be based on both your written work and your informed seminar participation. Papers completed later in the quarter will count more than earlier ones, and substantive revisions will count more than first versions."}, {"name": "Class Materials (Required)", "value": "-Harriet Beecher Stowe, Uncle Tom's Cabin; or, Life Among the Lowly (first published 1851).<br/><br/>-Herman Melville, Moby-Dick; or, The Whale (first published 1851)."}], "path": "/class-descriptions/4610/WCAS/ENGLISH/101-6/25420", "instructor": ["Jay A Grossman"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "25420", "subject": "ENGLISH"}, {"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Parkes Hall 213"}], "school": "WCAS", "overview_of_class": "In this class, we will closely read three classic (and, incidentally, famously appealing) English novels of the nineteenth century, the golden age of popular fiction.  The reading list is designed as a case history of how a given complex of story materials (centered in this case on a certain image of an idealized heroine) may become conventional over time and also may be dramatically altered when seen through the prisms of different literary types.  The list is designed also to test the thesis that reading serious fiction with critical understanding-and with maximum pleasure-involves seeing it as a mode of philosophical argumentation.<br/><br/>Like all First-Year Seminars, this one will concentrate on the writing of argumentative prose of your own.  Three short analytical papers will be assigned in the course of the quarter, and several class sessions will be set aside for workshopping specimen papers written by members of the class.  In addition, attention will be given to developing effectiveness in oral as well as written communication.  To this end, each student will sign up to deliver two short oral presentations on designated topics related to our reading assignments.", "qtr": "Winter 2016", "name": "First-Year Seminar", "title": "WCAS ENGLISH 101-6-24 First-Year Seminar", "lmod": "1/9/16 6:46 PM (CT)", "section": "24", "instructors": [{"instructor_phone": "", "instructor_name": "Christopher   Herbert", "instructor_addr": ""}], "topic": "Reading Fiction", "course": "101-6", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "descriptions": [{"name": "Overview of class", "value": "In this class, we will closely read three classic (and, incidentally, famously appealing) English novels of the nineteenth century, the golden age of popular fiction. The reading list is designed as a case history of how a given complex of story materials (centered in this case on a certain image of an idealized heroine) may become conventional over time and also may be dramatically altered when seen through the prisms of different literary types. The list is designed also to test the thesis that reading serious fiction with critical understanding-and with maximum pleasure-involves seeing it as a mode of philosophical argumentation.<br/><br/>Like all First-Year Seminars, this one will concentrate on the writing of argumentative prose of your own. Three short analytical papers will be assigned in the course of the quarter, and several class sessions will be set aside for workshopping specimen papers written by members of the class. In addition, attention will be given to developing effectiveness in oral as well as written communication. To this end, each student will sign up to deliver two short oral presentations on designated topics related to our reading assignments."}, {"name": "Teaching Method", "value": "Discussion"}, {"name": "Evaluation Method", "value": "Course grades will incorporate all aspects of the course: papers, presentations, and, importantly, class participation. There are no exams."}, {"name": "Class Materials (Required)", "value": "Jane Austen, Sense and Sensibility (1811); Mary Elizabeth Braddon, Lady Audley's Secret (1861-62); Henry James, The Portrait of a Lady (1881)."}], "path": "/class-descriptions/4610/WCAS/ENGLISH/101-6/25421", "instructor": ["Christopher   Herbert"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "25421", "subject": "ENGLISH"}, {"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Harris Hall L04"}], "school": "WCAS", "overview_of_class": "Recently, an abundance of heroines has emerged in young adult literature and, in turn, cinema. In contradistinction to the earlier (and slightly concurrent) popularity of the more passive female protagonist of Twilight, the image of a strong female lead, shooting arrows, jumping off of trains, and generally kicking ass, has captured the attention of readers, movie-goers, and the mainstream media. This class asks why the strong heroine is popular in this cultural moment both by analyzing the primary texts that feature them and by reading them in conjunction with analysis of the phenomena from the perspective of cultural studies. Representations of these heroines in the media will also be treated as texts for unpacking the significance of the trend.  Does the introduction of these young women in young adult fiction change the way popular culture represents the role of women and girls in society more generally? As a foundation for our investigation, the course will begin by historicizing the notion of what it means to be a \"heroine\" in the popular imagination and specifically in the narratives offered by literature and film. Traditionally, is the heroine's journey distinct from the hero's? How might the heroine destabilize constructs of gender and sexuality? How does the role of the heroine relate to genre? (Are the genres of fantasy and dystopian fiction, for instance, especially conducive to the emergence of a Katniss-like heroine?) To answer these questions, our readings will engage with gender and feminist theory and masculinity studies. In doing so, we will dissect the traits characterizing recent popular heroines and examine how they might undermine hierarchies and norms of gender and sexuality. At the same time, our inquiry will trouble whether the current era of heroines is actually as subversive as it might seem by investigating what gender roles and stereotypes these characters and their stories might be reinforcing.", "qtr": "Winter 2016", "name": "First-Year Seminar", "title": "WCAS ENGLISH 101-6-25 First-Year Seminar", "lmod": "1/9/16 6:46 PM (CT)", "section": "25", "instructors": [{"instructor_phone": "", "instructor_name": "Whitney Blair Taylor", "instructor_addr": ""}], "topic": "Action Heroines", "course": "101-6", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "descriptions": [{"name": "Overview of class", "value": "Recently, an abundance of heroines has emerged in young adult literature and, in turn, cinema. In contradistinction to the earlier (and slightly concurrent) popularity of the more passive female protagonist of Twilight, the image of a strong female lead, shooting arrows, jumping off of trains, and generally kicking ass, has captured the attention of readers, movie-goers, and the mainstream media. This class asks why the strong heroine is popular in this cultural moment both by analyzing the primary texts that feature them and by reading them in conjunction with analysis of the phenomena from the perspective of cultural studies. Representations of these heroines in the media will also be treated as texts for unpacking the significance of the trend. Does the introduction of these young women in young adult fiction change the way popular culture represents the role of women and girls in society more generally? As a foundation for our investigation, the course will begin by historicizing the notion of what it means to be a &quot;heroine&quot; in the popular imagination and specifically in the narratives offered by literature and film. Traditionally, is the heroine's journey distinct from the hero's? How might the heroine destabilize constructs of gender and sexuality? How does the role of the heroine relate to genre? (Are the genres of fantasy and dystopian fiction, for instance, especially conducive to the emergence of a Katniss-like heroine?) To answer these questions, our readings will engage with gender and feminist theory and masculinity studies. In doing so, we will dissect the traits characterizing recent popular heroines and examine how they might undermine hierarchies and norms of gender and sexuality. At the same time, our inquiry will trouble whether the current era of heroines is actually as subversive as it might seem by investigating what gender roles and stereotypes these characters and their stories might be reinforcing."}, {"name": "Teaching Method", "value": "Discussion"}, {"name": "Evaluation Method", "value": "Participation, brief oral presentation, written assignments. There will be two short papers (3-5pp.) and one longer final paper (5-7pp.)"}, {"name": "Class Materials (Required)", "value": "In addition to readings from theory and cultural studies provided in a Course Reader, we will read fiction, old and new, that features the action heroine. These readings include Eaton Stannard Barrett's The Heroine, or: Adventures of a Fair Romance Reader (1813), Robin McKinley's The Blue Sword, Philip Pullman's The Golden Compass, Suzanne Collins' The Hunger Games, Kristin Cashore's Graceling, Elizabeth Wein's Code Name Verity, Amélie Nothomb's Sulphuric Acid, and The Harvard Lampoon's Nightlight."}], "path": "/class-descriptions/4610/WCAS/ENGLISH/101-6/25422", "instructor": ["Whitney Blair Taylor"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "25422", "subject": "ENGLISH"}, {"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "University Library 4722"}], "school": "WCAS", "overview_of_class": "Hailed by many as one of the greatest novels every written, George Eliot's Middlemarch is the gripping story of ambition, idealism, love, and scandal in a Victorian provincial town. Through rich depictions of characters' daily lives and relationships, Middlemarch provides a sweeping perspective on the cultural forces that influence the fortunes of individuals and societies: politics, religion, economics, gender roles, scientific innovation, and more. It is also a book that asks big questions: As members of a community, what do we owe other people? How do we measure social progress? How can we make ethical choices? We will experience Middlemarch as its first audience did: in serial form, immersing ourselves in its vibrant fictional world over the course of several weeks. Treating Middlemarch as both an object of study and a hub for investigating broader historical and philosophical concerns, we will also undertake shorter supplemental readings tied to the novel's themes and Victorian cultural context. Students will have the opportunity to savor this literary classic, which sheds a dazzling light on the past as well as the present.", "qtr": "Winter 2016", "name": "First-Year Seminar", "title": "WCAS ENGLISH 101-6-26 First-Year Seminar", "lmod": "1/9/16 6:46 PM (CT)", "section": "26", "instructors": [{"instructor_phone": "", "instructor_name": "Maha Zehra Jafri", "instructor_addr": ""}], "topic": "The Many Lives of Middlemarch", "course": "101-6", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "descriptions": [{"name": "Overview of class", "value": "Hailed by many as one of the greatest novels every written, George Eliot's Middlemarch is the gripping story of ambition, idealism, love, and scandal in a Victorian provincial town. Through rich depictions of characters' daily lives and relationships, Middlemarch provides a sweeping perspective on the cultural forces that influence the fortunes of individuals and societies: politics, religion, economics, gender roles, scientific innovation, and more. It is also a book that asks big questions: As members of a community, what do we owe other people? How do we measure social progress? How can we make ethical choices? We will experience Middlemarch as its first audience did: in serial form, immersing ourselves in its vibrant fictional world over the course of several weeks. Treating Middlemarch as both an object of study and a hub for investigating broader historical and philosophical concerns, we will also undertake shorter supplemental readings tied to the novel's themes and Victorian cultural context. Students will have the opportunity to savor this literary classic, which sheds a dazzling light on the past as well as the present."}, {"name": "Teaching Method", "value": "Discussion"}, {"name": "Evaluation Method", "value": "Papers, class participation, Canvas posts, and brief oral presentations. Three papers (2-3 pages, 4-5 pages, and 6-8 pages) and weekly Canvas posts. Students will engage in a process of drafting and revision for each paper."}, {"name": "Class Materials (Required)", "value": "George Eliot, Middlemarch; assorted supplementary readings."}], "path": "/class-descriptions/4610/WCAS/ENGLISH/101-6/25423", "instructor": ["Maha Zehra Jafri"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "25423", "subject": "ENGLISH"}]