[{"class_mtg_info": [{"meet_t": "We 1:00PM - 3:50PM", "meet_l": "RCMA Lower Level 113"}], "school": "MUSIC", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Spring 2016", "name": "36617", "title": "MUSIC MUS_THRY 450-0-20 Seminar in Music Theory &amp; Cognition", "class_attributes": "", "section": "36617", "instructors": [{"instructor_phone": "", "instructor_name": "Mark Jonathan Butler", "instructor_addr": "mark-butler@northwestern.edu"}], "topic": "Music Theory, Mediation, &amp; Materiality", "course": "450-0", "descriptions": [{"name": "Overview of class", "value": "Music theory has conventionally sought to formulate abstractions about music, through the devisement of theoretical systems, arguments about underlying &quot;structure,&quot; and other means. But music is more than an aural phenomenon. It comes into being through the actions of fleshly bodies, and is represented, communicated, and stored through ink on paper, grooves on wax, and digital circuits. What might a music theory that takes the material dimensions of musical creativity seriously look like? Drawing energy from the recent &quot;material turn&quot; in the humanities, this course considers this question from a variety of angles. Topics to be explored include instrumentality, interfaces, technologies (in a broad sense), recording(s), and other material components of music-making and scholarship. Mediation between creative processes and their results will be a central concern. In general, the orientation of the course will be exploratory. Readings will be drawn from a range of disciplines. The major project for the quarter will be a substantial theoretical and/or analytical paper."}, {"name": "Registration Requirements", "value": "The course will be oriented toward PhD students in music theory and cognition. However, other students may register with the instructor's permission. Please contact the instructor with any questions."}], "lmod": "4/3/16 6:37 PM (CT)", "subject": "MUS_THRY"}]