[{"school": "WCAS", "overview_of_class": "Lots of people have beliefs that other people think are just plain weird. Why do people have these beliefs? We'll examine some &quot;weird&quot; beliefs and try to understand what leads people to develop and maintain these beliefs. A complication arises since one person's &quot;weird&quot; belief may be another person's firmly held conviction. From this perspective, we'll also try to understand which beliefs are rational. Among the topics we will cover are: superstition, ESP and parapsychology, ghosts, witchcraft and magic, alien abduction, repressed memories of abuse, and creationism/intelligent design. Students will learn to use a wide variety of academic and popular press resources (including empirical research articles, ethnographic descriptions, philosophical arguments, popular press books, and documentary films) to explore the bases for these beliefs and practices.", "name": "Special Topics in Psychology", "section": "25", "topic": "Psychology and Weird Beliefs", "course": "314-0", "meeting_time": ["TuTh 2:30PM - 5:30PM"], "path": "/class-descriptions/4630/WCAS/PSYCH/314-0/40444", "instructor": ["Sara Cantonia Broaders"], "id": "40444", "subject": "PSYCH"}, {"school": "WCAS", "overview_of_class": "Evolutionary psychology is the study of how genetic and cultural evolution have influenced our psychology and behavior. General domains of interest include mating, aggression, cooperation, and morality. The course will include both didactic lectures and student discussions (and perhaps presentations).", "name": "Special Topics in Psychology", "section": "26", "topic": "Evolutionary Psychology", "course": "314-0", "meeting_time": ["TuTh 6:00PM - 8:30PM"], "path": "/class-descriptions/4630/WCAS/PSYCH/314-0/40445", "instructor": ["John Michael   Bailey"], "id": "40445", "subject": "PSYCH"}, {"school": "WCAS", "overview_of_class": "Psychology has traditionally focused on understanding mental illness, rather than factor that lead to optimal mental well-being. This seminar will instead focus upon the questions asked within the growing science of positive psychology. What is happiness? Can happiness be learned, or is our happiness &quot;setpoint&quot; mostly determined by genetics? Do we know ourselves well enough to know what makes us happy, and if not, why not? Does money make us happy? Relationships? Religion? How do people create a sense of meaning in their lives? What types of situations encourage cognitive mastery and creativity? How do we, as a society, encourage generosity and altruism? In this seminar, students will read a mix of recent scientific journal articles and books, will write opinion papers about the scientific findings, and will journal about their own experiences in trying to apply these findings to their own lives, using weekly well-being exercises. Students can expect to wrestle with some of the &quot;big questions&quot; about what makes a good life and a strong society in discussions with their classmates.", "name": "Special Topics in Psychology", "section": "35", "topic": "Positive Psychology- The Science of Well-Being", "course": "314-0", "meeting_time": ["TuTh 6:00PM - 9:00PM"], "path": "/class-descriptions/4630/WCAS/PSYCH/314-0/40446", "instructor": ["Wendi L Gardner"], "id": "40446", "subject": "PSYCH"}]