[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "University Hall 101"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "17618", "title": "WCAS POLI_SCI 390-0-23 Special Topics in Political Science", "class_attributes": "", "section": "17618", "instructors": [{"instructor_phone": "", "instructor_name": "Robert   Braun", "instructor_addr": ""}], "topic": "Understanding Genocide", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "Prof. Robert Braun, SOC 376-0-20/POLI SCI 390-0-23, Understanding Genocide, Fall 2016<br/>Why did some communities during the Armenian genocide protect victims of mass persecution while others did not? Why did some but not all Germans decide to actively participate in the killing of Jews during the Holocaust? Why did mass violence break out in Rwanda in the 1990s and not in equally instable Ivory Coast during the 2000s? / / In this course we will examine one of the most destructive, evil and perplexing phenomena haunting society: genocide - i.e. , the on a large scale organized exclusion and killing of populations defined by race, ethnicity, nationality or religion. In the first section of this course students will be introduced to ideational, rational and psychological explanations of genocide. Causes of genocide can be found at different levels of analysis. We will focus on theories at three different levels. First, we will look at how national and international processes such as modernization and political leadership cause genocide (macro level). Second, we will look at why individuals decide to participate in or condone mass killings (micro level). Third, we will look at what role subnational groups such as religious communities play (meso level). In the second part of this course, we will assess the validity of different explanations through the comparative study of three particular cases: the Holocaust, the Armenian Genocide and Rwanda. Students will explore a fourth case on their own. We will end the course with a discussion on foreign intervention. / / Students will improve their analytical skills by drawing connections between social science theory, historical monographs, graphic novels, memoirs of genocide survivors, journalistic accounts, policy documents, and public debates on foreign intervention. Upon completing the course, students will not only be acquainted with the main types of explanations offered for genocide, but they will also be able to evaluate the evidence supporting the various explanations. In turn, this should help students to develop and evaluate proposals to end and prevent mass killing."}, {"name": "Learning Objectives", "value": "Students will improve their analytical skills by drawing connections between social science theory, historical monographs, memoirs of genocide survivors, journalistic accounts, policy documents, and public debates on foreign intervention. Upon completing the course, students will not only be acquainted with the main types of explanations offered for genocide, but they will also be able to evaluate the evidence supporting the various explanations. In turn, this should help students to develop and evaluate proposals to end and prevent mass killing."}, {"name": "Teaching Method", "value": "lecture and discussion"}, {"name": "Evaluation Method", "value": "Short Paper (25 percent), Midterm (25 percent), Final (50 percent)"}, {"name": "Class Materials (Required)", "value": "Tentative book list. Please confirm all books before purchase.<br/>Jon Elster. More Nuts and bolts for the social sciences. Cambridge University Press, 2007 ISBN: 9780521777445.<br/>Manus Midlarsky. The killing trap: genocide in the twentieth century. Cambridge University Press, Cambridge, MA, 2005 ISBN: 9780521894692.<br/>Loung Ung. First they killed my father: A daughter of Cambodia remembers. Random House, New York, NY, 2001 9780060856267.<br/>Benjamin A. Valentino. Final solutions: Mass killing and genocide in the 20th century. Cornell University Press, 2013 9780801472732.<br/>James Waller. Becoming evil: How ordinary people commit genocide and mass killing. Oxford University Press, Oxford, 2007 9780195314564."}, {"name": "Class Materials (Suggested)", "value": "Adam Jones. Genocide: A comprehensive introduction. Routledge, 2006."}], "lmod": "10/30/16 7:08 PM (CT)", "subject": "POLI_SCI"}]