[{"class_mtg_info": [{"meet_t": "Mo 6:15PM - 9:15PM", "meet_l": "University Hall 101"}], "school": "SCS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "27772", "title": "SCS ECON 330-CN-62 Behavioral Economics", "class_attributes": "", "section": "27772", "instructors": [{"instructor_phone": "", "instructor_name": "John P McCarthy", "instructor_addr": ""}], "topic": "", "course": "330-CN", "descriptions": [{"name": "Overview of class", "value": "This course provides an introduction to concepts in the relatively new field of behavioral economics. The concepts are interdisciplinary in nature, drawing on other social sciences such as psychology or sociology, and physical sciences such as biology. In this sense, the field continues the &quot;behavioral revolution&quot; of the social sciences that began in the 1950s. This is a survey course designed to better understand the cognitive, emotional, and physical independent variables that weigh on the dependent variables of economic decision making. We consider both individual and collective actions and the general extension of standard economic models offered by behavioral economic models. <br/><br/>This course may be applied toward the Post-Baccalaureate Certificate in Finance."}, {"name": "Registration Requirements", "value": "ECON 281, 310-A,-B."}, {"name": "Learning Objectives", "value": "1. An ability to describe and compare major scholarly topics in behavioral economics.<br/><br/>2. The capability to research and share information in a useful way with colleagues.<br/><br/>3. The capacity to think critically and analytically about the assumptions of economic behavior, especially the assumptions of standard economic models compared to behavioral economic models."}, {"name": "Class Materials (Required)", "value": "Class materials may include the following:<br/><br/>Ariely, Dan. 2008. Predictably Irrational.<br/><br/>Thaler, Richard, and Cass Sunstein. 2008. Nudge.<br/><br/>Wilkinson, Nick. 2008. An Introduction to Behavioral Economics."}], "lmod": "1/9/16 6:41 PM (CT)", "subject": "ECON"}]