[{"class_mtg_info": [{"meet_t": "Mo 6:15PM - 9:15PM", "meet_l": "Harris Hall L28"}], "school": "SCS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "27783", "title": "SCS HISTORY 210-A-62 History of the United States", "class_attributes": "", "section": "27783", "instructors": [{"instructor_phone": "", "instructor_name": "Ian Thomas Saxine", "instructor_addr": ""}], "topic": "", "course": "210-A", "descriptions": [{"name": "Overview of class", "value": "This course will explore major events in American history from the first encounters between Natives, Europeans, and Africans though the Civil War, using evolving understandings of freedom as an interpretive framework. For many people, early America was a testing ground, marketplace, and battlefield for differing interpretations of liberty. In this course, we will trace the experiences of men and women, sailors and farmers, planters and slaves, Indians and colonists, and how this diverse group of people struggled to decide the meaning and extent of freedom. Was it universal? Bounded by ethnicity, religion, gender, or nation? Where did freedom come from? Did government threaten or protect freedom? We will read primary sources to seek out the voices of both famous and ordinary people as they grappled with these and other questions, and how both their answers and questions changed over time. Ideas about freedom shaped?and were shaped by?transatlantic migrations, religious revivals, wars of empire and independence, political upheavals, and global economic transformations. While exploring these ideas, this course will help students develop their historical thinking and writing abilities."}, {"name": "Registration Requirements", "value": "None."}, {"name": "Learning Objectives", "value": "By the time we finish the course, students should be able to: <br/><br/>-identify major events in American history through the Civil War and articulate their significance <br/>-understand how different ideas of freedom both changed over time and shaped early American history <br/>-appreciate the uses and pitfalls of various primary sources<br/>-analyze the arguments of scholarly secondary sources by weighing the evidence they present <br/>-articulate written and verbal historical arguments by drawing on their own primary source research and the work of other scholars."}, {"name": "Teaching Method", "value": "Lecture<br/>Discussion<br/>Class Participation<br/>Writing Assignments"}, {"name": "Evaluation Method", "value": "Class Participation<br/>Writing Assignments - three short papers, one larger (4-6 page) final paper."}, {"name": "Class Materials (Required)", "value": "Eric Foner Give Me Liberty! (Fourth edition, vol. 1) ISBN-10: 0393920305.<br/>Eric Foner Voices of Freedom Documentary Reader (Fourth edition, vol. 1) ISBN-10: 039392291X.<br/>Harriet Jacobs, Incidents in the Life of a Slave Girl (Dover Thrift Edition) ISBN-10: 0486419312."}], "lmod": "1/9/16 6:41 PM (CT)", "subject": "HISTORY"}]