[{"class_mtg_info": [{"meet_t": "MoWe 9:00AM - 10:20AM", "meet_l": "Technological Institute M349"}], "school": "MEAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "31653", "title": "MEAS MECH_ENG 495-0-29 Selected Topics in Mechanical Engg", "class_attributes": "", "section": "31653", "instructors": [{"instructor_phone": "8474670704", "instructor_name": "Cheng   Sun", "instructor_addr": "Technological Institute, Rm B392, 2145 Sheridan Road, EV CAMPUS"}], "topic": "Metamaterials", "course": "495-0", "descriptions": [{"name": "Overview of class", "value": "Metamaterials that mimic the order in matters have opened an exciting gateway to reach unprecedented physical properties and functionality unattainable from naturally existing materials. The &quot;atoms&quot; and &quot;molecules&quot; in metamaterials can be tailored in shape and size, the lattice constant and inter-atomic interaction can be precisely tuned, and &quot;defects&quot; can be designed and placed at desired locations. Recent studies have demonstrated engineering metamaterials with unprecedented characteristics such as left-handedness with simultaneous negative permittivity and permeability, negative lens that focus electromagnetic waves far below the diffraction limit, artificial magnetism from nonmagnetic materials, and invisibility cloaking of electromagnetic energy. <br/><br/>This introductory course is designed to cover the technology fundamentals of the optical and mechanical metamaterials, micro-/nano-fabrication methodologies, and prospective applications. Specific topics include sub-wavelength waveguiding and focusing, super-resolution imaging and nano-lithography beyond the diffraction limit of the light, negative refraction, and invisibility cloaking. Plasmonic metamaterials, bio- sensing, enhanced Raman scattering, extraordinary transmission, Graphene Plasmonics, light-trapping for solar cell will also be discussed."}, {"name": "Registration Requirements", "value": "Basic knowledge of electromagnetism and solid state materials."}, {"name": "Evaluation Method", "value": "Homework 30%<br/>Presentation 40%<br/>Report (5 pages) 30%"}, {"name": "Class Materials (Suggested)", "value": "1. &quot;Optics,&quot; Hecht (Addison Wesley, 1990) <br/>2. &quot;Classical Electrodynamics&quot; J. D. Jackson (John Wiley &amp; Sons, 1999) <br/>3. &quot;Photonic Crystals: Molding the Flow of Light ,&quot; J. D. Joannopoulos, R. D. Meade, J. N. Winn (Princeton University Press, 1995) <br/>4. &quot;Surface plasmons on smooth and rough surfaces and on gratings,&quot; H. Raether (Springer, 2013)<br/>5 &quot;Plasmonics: Fundamentals and Applications,&quot; S. Maier, (Springer, 2007)"}], "lmod": "2/20/17 6:36 PM (CT)", "subject": "MECH_ENG"}]