[{"class_mtg_info": [{"meet_t": "TuTh 5:00PM - 7:00PM", "meet_l": "Frances Searle Building 2378"}], "school": "SoC", "overview_of_class": "Course describes the neuroaudiological and neuropsychological bases of, assessment of, and intervention for central auditory processing disorders (CAPDs) among children and adults. Topics include overview of peripheral and central auditory nervous system neuroanatomy and physiology, auditory neurodevelopment, formal and informal assessment tools, special considerations for testing, diagnostic test scoring and interpretation, screening, management strategies, remediation programs and techniques, service delivery options, and conveying diagnostic/intervention information to clients, families and caregivers.", "qtr": "Fall 2016", "name": "Evaluation and Treatment of Central Auditory Processing Disorders", "title": "SoC CSD 424-0-20 Evaluation and Treatment of Central Auditory Processing Disorders", "lmod": "10/30/16 6:48 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Jeanane Marie Ferre", "instructor_addr": ""}, {"instructor_phone": "", "instructor_name": "Kristine Marie Grohne Riley", "instructor_addr": ""}], "topic": "", "course": "424-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Course describes the neuroaudiological and neuropsychological bases of, assessment of, and intervention for central auditory processing disorders (CAPDs) among children and adults. Topics include overview of peripheral and central auditory nervous system neuroanatomy and physiology, auditory neurodevelopment, formal and informal assessment tools, special considerations for testing, diagnostic test scoring and interpretation, screening, management strategies, remediation programs and techniques, service delivery options, and conveying diagnostic/intervention information to clients, families and caregivers."}, {"name": "Learning Objectives", "value": "At the end of this course, students will be able to: <br/>1) identify neuroanatomical landmarks of the central auditory nervous system IV B-4)<br/>2) describe key neurophysiological bases of central auditory processing (IV B-8)<br/>3) list and define known central auditory processes (IV B-8)<br/>4) describe components of typical behavioral diagnostic central auditory evaluation (IV D-6, D-7)<br/>5) implement a screening program for central auditory dysfunction (IV C-3, C-4)<br/>6) administer and score typical central auditory function tests (IV D-6, D-7)<br/>7) interpret test results using a deficit-specific model (IV D-12)<br/>8) describe general principles of intervention of central auditory disorders (IV B-2, B-3,E-2, E-5)<br/>9) make recommendations for effective deficit-specific CAPD management and treatment (IV B-2, D-16)<br/>10) report evaluation findings and recommendations to parents and other professionals (IV C-1, D-1, D-13, D-16, E-1, E-3, E-6)"}, {"name": "Class Materials (Required)", "value": "Auditory Processing Deficits. Rawool, VW. (2016). ISBN: 978-1-60406-838-2. Thieme Medical Publishers, Inc. Price: 99.99."}, {"name": "Class Notes", "value": "The schedule and topics in this course may be modified at the instructor's discretion.<br/>The students must abide by the NWU statement on Academic Honesty and Student Conduct as outlined by University and Departmental documents. Academic dishonesty includes, but is not limited to cheating on an exam (e.g., copying others' answers, using a crib sheet) or plagiarism of a paper or exercise (e.g., taking material from readings without citation, copying another student's work). Failure to maintain academic integrity on an assignment will result in a loss of credit for that assignment, at a minimum. <br/><br/>In compliance with equal access laws, the instructor is available to discuss appropriate academic accommodations that may be required by students with disabilities. Please make these requests during the first week of the quarter, except in unusual circumstances, so that arrangements can be made."}], "path": "/class-descriptions/4640/SoC/CSD/424-0/11023", "instructor": ["Jeanane Marie Ferre", "Kristine Marie Grohne Riley"], "class_attributes": "", "id": "11023", "subject": "CSD"}]