[{"school": "JOUR", "overview_of_class": "Marketing Measurement focuses on the art and science of strategic marketing measurement and practical application of marketing analytics to navigate the increasingly complicated path towards marketing accountability. Students use readings, cases and class exercises to develop skills in planning and conducting precise measurement of marketing communications effects. The exercises and interaction are structured to encourage more in-class learning by doing examples and projects with real data. The course provides actionable guidance for connecting marketing to business performance. The course will include a framework to help close the divide between finance, marketing, and the executive suite around the role of marketing investments in driving growth in value from three key dimensions - brands, customers, and marketing communications.", "name": "Practicum", "section": "20", "topic": "Marketing Measurement", "course": "498-0", "meeting_time": ["Th 9:00AM - 11:50AM"], "path": "/class-descriptions/4640/JOUR/IMC/498-0/17756", "instructor": ["Pradeep Kumar Madathil"], "id": "17756", "subject": "IMC"}, {"school": "JOUR", "overview_of_class": "The Digital Analytics course delivers an applied understanding of digital analytics tools, methods and organizational approaches that will let students connect the dots between digital analytics and digital communications strategy, design and delivery. The goal of the course is to give students the capability to lead the evolution of digital marketing practices in their organizations through an understanding of the collection and application of data to solve marketing problems. <br/><br/>Students will have exposure to an array of the most current digital analytics tools, and will conduct exercises and engage in discussions that illustrate how data and analytics should ideally shape marketing planning, content strategy, digital design and marketing performance evaluation.<br/><br/>The course will cover the collection of data from web, email, social, mobile and paid display media through tagging, testing and survey, and will explore the marketing and business application of this data for performance evaluation, communications planning, design and content development &amp; targeting. The application of marketing analytics in the overall emerging &quot;big data&quot; structures in organizations will be explored. The progression toward increasing capabilities for real-time 1:1 marketing through algorithmic targeting and content personalization will also be discussed in this context, as will the ever changing privacy landscape and questions around who &quot;owns&quot; consumers' digital data.", "name": "Practicum", "section": "21", "topic": "Digital Analytics", "course": "498-0", "meeting_time": ["Mo 9:00AM - 11:50AM"], "path": "/class-descriptions/4640/JOUR/IMC/498-0/13093", "instructor": ["Scot Rexford Wheeler"], "id": "13093", "subject": "IMC"}]