[{"class_mtg_info": [{"meet_t": "Mo 5:45PM - 8:45PM", "meet_l": "Wieboldt Hall 507"}], "school": "SCS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "37913", "title": "SCS ORG_BEH 368-CN-12 Project Management", "class_attributes": "", "section": "37913", "instructors": [{"instructor_phone": "", "instructor_name": "Daniel Walter Roth", "instructor_addr": ""}], "topic": "", "course": "368-CN", "descriptions": [{"name": "Overview of class", "value": "In this course, students will learn the basics and best practices of project management and some of the tools and techniques that help manage projects effectively and successfully. These include the essentials necessary for project success, the stages of project management, defining a vision for the project, setting measurable objectives, assessing resources and constraints, creating and managing a project plan, and dealing with change. This course is designed for those who have no knowledge of project management and for those who have been managing projects without any formal training. Its objective is to prepare project managers and team members to plan, implement, monitor and evaluate projects of all kinds successfully, thus reducing stress and ineffective communication while increasing efficiency and success. Using methods and models from this course, students should experience greater project definition and structure and be able to execute projects more effectively.<br/><br/><br/><br/>Information Systems majors may substitute this course for CIS 394 Software Project Management."}, {"name": "Registration Requirements", "value": "Note that this course meets from 5:45-8:45pm."}, {"name": "Learning Objectives", "value": "? Align to global Project Management standards<br/>? Introduce key concepts, tools and techniques of these standards<br/>? Provide a hands-on opportunity to apply these concepts, tools and techniques<br/>? Identify core competencies, responsibilities and critical skills of the PM<br/>? Identify the &quot;goodness&quot; factors in the practice of project management<br/>? Understand the threats and opportunities in a project <br/>? Exchange best practices and lessons learned<br/>? Produce a complete project proposal<br/>Learning Objectives:<br/>? Become aware of key organization considerations<br/>? Understand the project lifecycle<br/>? Identify defining constraints of a project<br/>? Write a project scope statement and work breakdown structure (WBS)<br/>? Establish project timelines, project resources, and costs<br/>? Develop a project management plan<br/>? Develop a risk management plan<br/>? Explain factors involved in leading a successful project team<br/>? Develop project progress and performance measures<br/>? Understand governance and oversight considerations<br/>? Design a project closure procedure"}, {"name": "Teaching Method", "value": "Class participation<br/>Demonstrations<br/>Discussion<br/>Films / videos<br/>Group work<br/>Lecture<br/>Presentations<br/>Problem sets<br/>Readings"}, {"name": "Evaluation Method", "value": "Readings: Students are expected to read and be prepared to discuss assigned readings, including the case studies, in class. Students need to be proactive about making valuable contributions/collaboration on the readings, and may be called on in class to answer questions pertaining to these readings.<br/><br/>Participation/Attendance (1000): There will be a total of ten (10) Participation/Attendance marks, each worth 100 points each, attendance half, participation half, pretty easy. <br/><br/>Group Efforts (1000): There will be a total of ten (10) Group assignments (I do the first one for free). These assignments are to be submitted to Bb prior to class each Session and presented.<br/><br/>Term Project (1000): The term long project submission will be discussed in Session 1."}, {"name": "Class Materials (Required)", "value": "Larson, E. W., &amp; Gray, C. F. (18 Oct 2013). Project management: The managerial process with MS Project (6th ed.). McGraw-Hill Higher Education. [ISBN-13: 978-1259186400] <br/>Student Site: http://highered.mheducation.com/sites/0078096596/student_view0/index.html"}, {"name": "Class Notes", "value": "Note: While this course may help you prepare for the Project Management Institute's certification exam, it is not intended or designed to be a preparatory course for the exam. You should consult the Project Management Institute's website (pmi.org) for specifics on this exam."}], "lmod": "4/3/16 7:34 PM (CT)", "subject": "ORG_BEH"}]