[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "Annenberg Hall 101"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "25404", "title": "WCAS PSYCH 205-0-22 Research Methods in Psychology", "class_attributes": "Attendance at 1st class mandatory<br/><br/>Prerequisites apply, see description<br/><br/>", "section": "25404", "instructors": [{"instructor_phone": "", "instructor_name": "Kevin J Hsu", "instructor_addr": ""}, {"instructor_phone": "", "instructor_name": "Katherine Steffen Filip Damme", "instructor_addr": ""}], "topic": "", "course": "205-0", "descriptions": [{"name": "Overview of class", "value": "Psychology is the science of behavior and mind. As with any science, psychology begins with scientific questions that are translated into hypotheses, which are then tested with various research methods to provide evidence for or against a theory. Whether you are conducting a survey to test how extraversion relates to political affiliation or a neuroimaging experiment to test what neural pathways are involved in memory recall, it is important that your study be scientifically sound in its design and methodology. Without rigorously scientific research methods, we cannot make strong conclusions about data or anything in psychology, and much of what we know about our behaviors, thoughts, attitudes, and development would fall apart. Thus, this course is extremely important, because it will help you to critically and scientifically think about, develop, and actually test ideas in psychology.<br/><br/>In this course, we will take a hands-on approach to evaluating, designing, conducting, and presenting psychological research. We will learn how to critically read and write about psychology, translate research questions into testable hypotheses, design empirical studies to test those hypotheses, conduct the appropriate statistical analyses on the data collected, and write research papers that detail the results in the style used by research psychologists. By the end, you will have experience with every part of the research process and completed your own psychological studies as part of a group. Because this course is not content specific, the knowledge and skills that you learn can be applied to courses and research in all areas of psychology, and even all areas of science."}, {"name": "Registration Requirements", "value": "Prerequisite: Psychology 201 or equivalent"}, {"name": "Evaluation Method", "value": "Grades will be based on three APA-style research reports, two short critiques, an exam, and participation (including group working sessions and other activities)."}, {"name": "Class Materials (Required)", "value": "Text: Cozby, P. C., &amp; Bates, S. C. (2012). Methods in behavioral research (11th ed.). New York: McGraw Hill. ISBN: 9780078035159. [Note that this is one edition prior to the most current edition, which hopefully will help with cost.]<br/>Additional Readings: Available on the course website (links in the syllabus)"}], "lmod": "12/25/16 7:05 PM (CT)", "subject": "PSYCH"}]