[{"school": "WCAS", "overview_of_class": "This course is about colonialism as an ongoing process rather than a particular period of history. From this perspective, while the formal political institutions of colonialism had largely given way by the mid-twentieth century, the after-lives of this protracted history continue to be felt in economic, cultural, aesthetic, ecological and discursive domains. Many of the things that we take for granted as being part and parcel of our day-to-day worlds are the result of these centuries of interaction, so much so that we see them now as \"local\" rather than hailing from distant shores. This class will try to disentangle some of these long histories, and show how the world was created through these encounters. Slavery, the environment, trade, cultural transmission, the body and violence are a part of all of these stories, though in different ways. The course hopes to impart to students the overwhelmingly important role of these political constellations in forging human history, both in the centuries that have past and in our modern world.", "name": "Topics in Anthropology", "section": "21", "location": "ANTHRO Sem Rm 104 - 1810 Hinmn", "topic": "Artifact and Text", "course": "490-0", "meeting_time": ["Tu 2:00PM - 4:50PM"], "path": "/class-descriptions/4660/WCAS/ANTHRO/490-0/32286", "instructor": ["Mark William Hauser"], "class_attributes": "", "id": "32286", "subject": "ANTHRO"}, {"school": "WCAS", "overview_of_class": "In a few short decades the field of household archaeology has emerged and exploded within contemporary archaeology. On an empirical level this may be because archaeological remains of houses are ubiquitous in the archaeological record: what site doesn't have houses? On a theoretical level this may be because studies of households lead us to focus on the archaeological record as a lived and peopled place. Thus despite its short history, household archaeology has taken a leading role in epistemological shifts which place people and their practices and differences at the center of archaeological interpretations of the past, rather than subsuming these into the \"noise\" of passive and depersonalized depictions of ancient social systems. Our studies of household archaeology will lead us to explore the importance of everyday life in the past. Households are an important, but not the only domain of people's everyday lives. Because all people in the past led daily lives, a study of everyday life in the past can lead to a more democratic understanding of societies inclusive of the full range of people that inhabited past societies. Studies of households and everyday life are not without their detractors and these detractors are often quite hostile. Because households and daily life are often considered \"micro\" domains were people interact with one another, they are not considered suitable areas of studies to answer \"macro\" questions of politics and society. In this class we will explore how \"micro\" and \"macro\" intersect in the analysis households and daily life making these vibrant domains to understand how micro (self, interaction, experience) and macro (institutions, power relations, society) merge as they shape and are shaped by people and societies. This class is designed to be a forum for collaborative discussion and debate on central issues in contemporary archaeology. We will critically assess approaches currently being used in studies of households and everyday life. Each class will entail a seminar discussion between all class participants.", "name": "Topics in Anthropology", "section": "22", "location": "ANTHRO Sem Rm 104 - 1810 Hinmn", "topic": "Household Archaeology", "course": "490-0", "meeting_time": ["We 2:00PM - 4:50PM"], "path": "/class-descriptions/4660/WCAS/ANTHRO/490-0/32287", "instructor": ["Cynthia   Rivera"], "class_attributes": "Graduate Students Only<br/><br/>", "id": "32287", "subject": "ANTHRO"}, {"school": "WCAS", "overview_of_class": "This course will examine the nexus between aesthetics and politics by examining how power and inequality are created and reproduced through aesthetic discourse and practice. Taking a capacious notion of the aesthetic as related to the senses, cultural forms, and processes of evaluation and judgment, we will explore how various aesthetic realms become sites of everyday domination, for the reworking of social relations, and changing modes of governance and governmentality. This course will be primarily anthropological in nature, with an emphasis on the lived experience of aesthetic categories and processes, on the aesthetic aspects of contemporary social movements, and on provincializing Eurocentric concepts of the aesthetic.", "name": "Topics in Anthropology", "section": "23", "location": "ANTHRO Sem Rm B07 - 1810 Hinmn", "topic": "Politics and Aesthetics", "course": "490-0", "meeting_time": ["Tu 6:00PM - 8:50PM"], "path": "/class-descriptions/4660/WCAS/ANTHRO/490-0/32288", "instructor": ["Jessica R Winegar"], "class_attributes": "", "id": "32288", "subject": "ANTHRO"}]