[{"school": "WCAS", "overview_of_class": "The MENA Colloquium is designed to encourage dialogue between students across disciplines who share interests in Middle East and North African Studies, to offer a space to develop extended papers and research reports, and to foster discussion between Northwestern MENA students and faculty. Students begin by enrolling in MENA 412-1 followed by MENA 412-2 as zero credit courses. Upon successful completion of MENA 412-1,2 students may enroll in MENA 412-3, completion of which earns one course credit. Students taking the 3 part MENA 412 sequence must present their work at a MENA colloquium at least one time per academic year, pre-circulate their paper to other members of the seminar, make one formal response, participate in online Blackboard discussion, and attend all MENA colloquia plus selected invited speakers. In order to obtain a Certificate in MENA Studies, students must enroll in three quarters of MENA 412 (one course credit) and three quarters of MENA 415 (which meets at the same time as MENA 412, and is otherwise identical, but does not require a public presentation or comment and bears no credit). Attendance at the colloquium is open to the public, though precirculated papers are only accessible to students enrolled in the MENA 412 sequence. Requirements (for MENA 412) : 15-20 page paper on an independent research project, submitted and circulated one week prior to colloquium session. 20-25 minute presentation based on the paper, ideally with visuals and/or handouts. One formal response to another student presentation. Active participation in the colloquium and online discussion. Note: MENA 412-1,2,3 is normally completed in a single academic year, but can also be spread over two academic years, with consent of MENA director. Please note: this is a three quarter long sequence bearing one course credit; it meets several times per quarter, to be determined at the first class session.", "name": "MENA Graduate Colloquium", "section": "20", "topic": "", "course": "412-3", "meeting_time": ["Mo 12:00PM - 2:00PM"], "path": "/class-descriptions/4650/WCAS/MENA/412-3/22720", "instructor": ["Brian T Edwards"], "id": "22720", "subject": "MENA"}]