[{"school": "SoC", "overview_of_class": "RTVF 398-0 Sec. 20 Issues in RTVF: Improvising the Text-based Collaborative Show<br/> <br/>Overview<br/>This course will introduce students to theatrical improv and sketch-creation techniques. Students will work collaboratively to improvise, develop, and fine-tune sketches inspired by a wide variety of source texts (i.e. news stories, tweets, Facebook posts, print ads, etc.). Emphasis will be placed on creating ensemble, storytelling, and making specific style and character choices.<br/> <br/>Evaluation Method<br/>Students will be evaluated on in-class participation/attendance, 1-2 short reflection papers, and contributions to their group's sketches and final performance.<br/> <br/>Class Materials<br/>A Journal or Notebook (devoted to this class only)<br/>Napier, Mick. \"Impovise: Scene from the Inside Out,\" Second Edition. Meriwether Publishing ISBN-978-1566081986", "name": "Symposium: Issues in RTVF", "section": "20", "topic": "Improvising Text-based Collaborative Show", "course": "398-0", "meeting_time": ["Tu 12:00PM - 2:50PM"], "path": "/class-descriptions/4650/SoC/RTVF/398-0/24500", "instructor": [""], "id": "24500", "subject": "RTVF"}, {"school": "SoC", "overview_of_class": "  RTVF 398-0 Sec. 21 Issues in RTVF: Nostalgia and Popular Culture, TTh 3:00-5:20, AMS Auditorium<br/>Mimi White<br/><br/>\"Nostalgia\" is a medical condition, an feeling, an attitude, a style. It may be deeply personal, but may equally be provoked publically, through objects, images, sounds, and stories. There are nostalgia films, and films that trigger nostalgia?and these are not necessarily the same thing. Nostalgia is about longing and the past?remembered and forgotten, actual and imagined?but it is not quite the same as history, memory, or trauma. This class explores some of the prominent ideas about nostalgia, especially ones developed in the context of film, television, and cultural studies. The class considers nostalgia in popular media, emphasizing the kinds of aesthetic/narrative practices that are most liable to be considered \"nostalgic.\" Media texts include: Midnight in Paris, American Graffiti, and Pleasantville, and television programs such as Mad Men and Pushing Daisies.<br/><br/>Class requirements: Attendance at screenings/lectures; participation in class discussion; weekly reading assignments and assigned reading responses; two short papers; take-home final. <br/><br/>Required reading packet will be approx. $30.00<br/>Depending on what students choose to write about, they may have to make additional investment to access specific films/TV", "name": "Symposium: Issues in RTVF", "section": "21", "topic": "Nostalgia & Pop Culture", "course": "398-0", "meeting_time": ["TuTh 3:00PM - 5:20PM"], "path": "/class-descriptions/4650/SoC/RTVF/398-0/24501", "instructor": ["Miriam B White"], "id": "24501", "subject": "RTVF"}, {"school": "SoC", "overview_of_class": "RTVF 398 - Showrunners and Writer-Producers<br/>Dr. Molly A. Schneider<br/><br/>Course Description:<br/>This course will examine the role of television showrunners and writer-producers in the United States, addressing both their emergence as industrial categories and their significance in media culture. From Rod Serling to Norman Lear to David Lynch to Tina Fey to Jenji Kohan to Shonda Rhimes, showrunners and writer-producers have become central figures in the evolution of television as a medium. Combining both managerial and creative roles, showrunners and writer-producers function as television auteurs in complex and rapidly evolving ways. How have they shaped artistic content and style? How have they operated in relation to the business of television? How has their work become a platform for discussing larger socio-cultural issues - such as gender, race and representation, and politics - both in and through television?<br/><br/>Learning Objectives:<br/><br/>Students will be able to chart the historical development of the television showrunner and writer-producer in the United States, identify their evolving industrial and artistic roles, and recognize their larger socio-cultural significance in the media landscape.<br/><br/>Evaluation Method:<br/>Class participation, blog posts, 2-3 short papers, and a final project.<br/><br/>Class Materials:<br/><br/>Bennett, Tara. Showrunners: The Art of Running a TV Show. London: Titan Books, 2014. ISBN 978-1783293575<br/><br/>Other readings to be posted on Canvas.<br/><br/>Class Notes:<br/>All screenings will be shown in class unless otherwise noted in the syllabus.", "name": "Symposium: Issues in RTVF", "section": "22", "topic": "TV Showrunners/Writer-producers", "course": "398-0", "meeting_time": ["TuTh 3:00PM - 4:50PM"], "path": "/class-descriptions/4650/SoC/RTVF/398-0/24502", "instructor": ["Molly Ann Schneider"], "id": "24502", "subject": "RTVF"}, {"school": "SoC", "overview_of_class": "Description This introductory course brings together a range of approaches and theories from the fields of media studies, communication, anthropology, and cultural studies, as well as objects in modern art, film, television, and digital media, to examine how food, and representations of food, play a critical yet diaphanous and evolving role in contemporary media culture. We begin from the premise that media and food are connected on two interrelated levels: food is both the subject of media and is a medium itself, through which ideas about gender, race, nation, domesticity, and the world beyond home are conveyed. Our guiding questions throughout the term will be: How does food serve as a point of entry for considering issues such as globalization, poverty, wealth, capitalism, leisure, work, identity, family, and belonging? How do food media, such as restaurant reviews, cookbooks, documentaries, and cooking shows, seek to intervene in public understandings of health, cuisine, and culture more broadly? And how are global food cultures represented, celebrated, or marginalized in American media? <br/><br/><br/><br/>Course Objectives: By the end of this course, students will:<br/><br/>Understand, evaluate, and be able to discuss a number of different lenses for the study of food media and culture, including semiotic, structural, performative, anthropological, and feminist approaches<br/>Apply these methods to their own written analyses of food media<br/>Sustain a lively critical community via class discussions<br/>Critically evaluate, via written assignments, the construction of food semiotics as they are mobilized to convey meanings and ideological messages<br/>Critically evaluate, via written assignments, the concepts and theories elaborated in the scholarly work we read<br/>Course Evaluations: attendance and participation, two papers, reading responses, final paper presentation<br/><br/>Books required: Polan, Dana B. Julia Child's the French Chef. Spin Offs. Durham, NC: Duke University Press, 2011. Frederick Errington, Deborah Gewertz, Tatsuro Fujikura. The Noodle Narratives: The Global Rise of an Industrial Food into the Twenty-First Century. Durham, NC: Duke University Press, 2013.", "name": "Symposium: Issues in RTVF", "section": "23", "topic": "Food, Media, and Culture", "course": "398-0", "meeting_time": ["MoWe 10:00AM - 11:20AM"], "path": "/class-descriptions/4650/SoC/RTVF/398-0/24503", "instructor": ["Maureen E. Ryan"], "id": "24503", "subject": "RTVF"}, {"school": "SoC", "overview_of_class": "", "name": "Symposium: Issues in RTVF", "section": "24", "topic": "", "course": "398-0", "meeting_time": ["MoWe 10:00AM - 11:50AM"], "path": "/class-descriptions/4650/SoC/RTVF/398-0/28234", "instructor": ["Charles Stephen Evans"], "id": "28234", "subject": "RTVF"}]