[{"school": "WCAS", "overview_of_class": "This course will focus on the intersections between democratic revolution and revolutionary poetics in Walt Whitman's writings. We will focus in particular on the Whitman's democratic experiments with the language, style, and forms of poetry, and his daring representation of such subjects as the dignity of labor and the working classes, the body, sex, race, technology, comradeship, war, America, the globe, and the cosmos. We will begin by exploring the sources of Whitman's 1855 Leaves of Grass in the social and political struggles of his time. We will consider the fascinating intersections between personal and political crisis, homoeroticism and poetic experimentation in the 1860 Leaves of Grass. We will also look at Whitman's attempts to find new forms to give voice to the simultaneous carnage and intimacy of the Civil War as the first modern war in Drum-Taps and Sequel (1865). And we will conclude by reflecting on Whitman's struggle in his later writings to reconcile the revolutionary dream of democracy with a post-Civil War world increasingly dominated by the unleashed forces of economic expansion, materialism, selfism, and greed. The course will end with readings of poets and writers from Ginsberg to Neruda in the United States and elsewhere who continue to \"talk back\" to Whitman.", "name": "Studies in American Literature", "section": "20", "location": "Harris Hall L28", "topic": "Whitman and the Democratic Imaginary", "course": "378-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4660/WCAS/ENGLISH/378-0/33295", "instructor": ["Betsy J Erkkila"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "33295", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "Urbanologist Yi Fu Tuan writes, \"What begins as undifferentiated space becomes place when we get to know it better and endow it with values.\" In The Untouchables, Sean Connery tells Kevin Costner, \"You want to get Capone? Here's how you get Capone. He pulls a knife, you pull a gun. He puts one of yours in the hospital, you put one of his in the morgue. That's the Chicago way.\" In this class, we will examine \"the Chicago way\" from many different angles in order to interrogate the values with which various artists have endowed Chicago. We will read in a broad range of media: journalism, poetry, song, fiction, film, and sequential art to see how a sense of Chicago as a place works over time. We will pay close attention to depictions of the construction of American identity, and to the role of the artist and intellectual in the city.", "name": "Studies in American Literature", "section": "21", "location": "Locy Hall 111", "topic": "The Chicago Way: \"Urban Spaces & American Values", "course": "378-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4660/WCAS/ENGLISH/378-0/33296", "instructor": ["William J Savage"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "33296", "subject": "ENGLISH"}]