[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "University Hall 418"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-Requisite:  Students must have taken &amp; passed English 206-0 to enroll.", "qtr": "Spring 2016", "name": "34913", "title": "WCAS ENGLISH 307-0-20 Advanced Creative Writing", "class_attributes": "Attendance at 1st class mandatory<br/><br/>Prerequisites apply, see description<br/><br/>", "section": "34913", "instructors": [{"instructor_phone": "", "instructor_name": "Brian D Bouldrey", "instructor_addr": ""}], "topic": "Forms of Persuasion", "course": "307-0", "descriptions": [{"name": "Overview of class", "value": "As avid readers and creative writers, we are always working with or against a long tradition, one that dates back to days when most of our literature was transmitted orally. Almost 150 years ago, Northwestern University was known for its certificate program in elocution. The bardic boom, the pulpit pitch, the futurist with a megaphone?so many of the great works of literature were first delivered orally, then placed on the page and called literature. Speeches, psalms, manifestos, sermons, lectures, storytelling, poems and songs of revolution and reinvention?all of these will be investigated in reading and performance, and then students will find a way to get their own performative narratives of poetry, fiction, and nonfiction onto the page. How does the word in the air differ from the word on the page? <br/><br/>We will discuss the instructive aspect of art and literature, the difference between style and voice, how delivery by great orators can change the meaning of the material, and how the speech on the page has its own specific power that makes it, in its way, a second, separate work of literature. A solid knowledge of prosody and poetic form is necessary for class and workshop discussion."}, {"name": "Teaching Method", "value": "Discussion"}, {"name": "Evaluation Method", "value": "Students will write 4-5 works on prompts from speeches, sermons, and lectures, and be challenged to transform oral work for the page."}, {"name": "Class Materials (Required)", "value": "Readings may include sermons by John Donne, Laurence Sterne, and Jonathan Swift; Psalms; Virgil's Georgics; 20th century manifestos by various modernist movements; speeches by Frederick Douglass, Susan B. Anthony, and Winston Churchill; and an examination of the history of the video and radio essay."}], "lmod": "4/3/16 7:58 PM (CT)", "subject": "ENGLISH"}]