[{"class_mtg_info": [{"meet_t": "We 9:00AM - 11:50AM", "meet_l": "Swift Hall 210"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: REASON: Pre-registration is not allowed for this class. Please try again during regular registration.<br/>Add Consent: Department Consent Required<br/>", "qtr": "Spring 2017", "name": "35688", "title": "WCAS PSYCH 497-0-20 Special Topics in Clinical Psychology", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "35688", "instructors": [{"instructor_phone": "312/503-7718", "instructor_name": "Daniel K Mroczek", "instructor_addr": "633 N. St. Clair, 19th Floor"}], "topic": "Multi-Level Modeling", "course": "497-0", "descriptions": [{"name": "Overview of class", "value": "This course will give students a basic grounding in the class of statistical techniques known as multilevel modeling (MLM). MLM goes by other names as well, such as hierarchical linear modeling (HLM), mixed models, random coefficient modeling, and random effects models. These techniques have been applied to many different research questions within the biomedical, behavioral, social sciences, and even engineering. We will focus on MLM as it is used in behavioral and social science research, with examples from education and adult development. Specifically, we will discuss in detail two types of multilevel models: clustered-observation or organizational models (e.g., children nested within classrooms) and growth-curve models (e.g., estimation of change with measurements nested within people over months or years). If we have time, we can consider a third: daily experience models (e.g., daily or hourly measurements nested within people over days or weeks). Students will also learn how to use SAS Proc Mixed for conducting MLM analyses. Students are assumed to have taken at least two graduate statistics courses and have a solid understanding of regression analysis."}, {"name": "Learning Objectives", "value": "How to apply Multilevel Modeling to research questions; <br/>Practical knowledge on running actual models and interpreting them correctly."}, {"name": "Teaching Method", "value": "Readings; Problem sets; Class participation; Demonstrations; Discussion"}, {"name": "Evaluation Method", "value": "Exam, final; Homework; Quizzes"}, {"name": "Class Materials (Required)", "value": "Singer, J.D. &amp; Willett, J.B. (2003). Applied longitudinal analysis: Modeling change and event occurrence. New York: Oxford University Press. ISBN-13: 9780195152968; <br/><br/>Raudenbush, S.W. &amp; Bryk, A.S. (2002). Hierarchical linear models: Applications and data analysis methods (2nd Ed). Thousand Oaks, CA: Sage. ISBN-13: 9780761919049"}], "lmod": "2/13/17 6:48 PM (CT)", "subject": "PSYCH"}]