[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "University Library 3322"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Spring 2017", "name": "34016", "title": "WCAS JWSH_ST 101-6-20 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "34016", "instructors": [{"instructor_phone": "847/467-4712", "instructor_name": "Marcus G Moseley", "instructor_addr": "1880 Campus Drive, Kresge 3339"}], "topic": "Job's Tears: Jewish Response to Suffering", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "This seminar revolves around a question that can be easily formulated but cannot be easily answered: why do the righteous suffer? This question has been at the center of Jewish thought and practice from its very earliest times to the most recent. Beginning with passages from the Book of Genesis, the seminar discusses the question of unjustifiable suffering by examining a range of biblical texts and figures, culminating in the exemplary figure of Job, whose story we will read in conjunction with classical rabbinic commentary and impressive illustrations of the romantic poet William Blake. The seminar then turns to texts written in response to the Khmielnitsky massacres in the seventeenth century and the surge of pogroms in early twentieth-century Russia, with special emphasis on H. N. Bialik's poetic response to the Kishinev Pogrom of 1903 and Marc Chagall's Jewish crucifixion series composed in the wake of the destruction of Jewish shtetls in the First World War. The final four weeks of the class are concerned with the Holocaust, as we read excerpts from diaries written in the Warsaw and Lodz ghettoes, analyze Elie Wiesel's Night, and conclude with Art Spiegelman's Maus."}, {"name": "Class Materials (Required)", "value": "David G. Roskies Against the Apocalypse: Responses to Jewish Suffering<br/><br/>The Literature of Destruction, ed. David G. Roskies<br/><br/>The Book of Job, tr. Stephen Mitchell<br/><br/>The King James Bible<br/><br/>Nathan Hanover, Abyss of Despair, tr. Abraham J. Mesch, new edition with an introduction by William B. Helmreich<br/><br/>Chaim Potok, My Name is Asher Lev<br/><br/>Richard L. Rubenstein, After Auschwitz: History Theology and Contemporary Judaism<br/><br/>Art Spiegelman MetaMaus (includes a disc of the actual Maus Volumes)"}], "lmod": "2/7/17 6:45 PM (CT)", "subject": "JWSH_ST"}]