[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Frances Searle Building 2407"}], "school": "SoC", "enrl_requirement": "", "qtr": "Spring 2017", "name": "32770", "title": "SoC CSD 495-0-20 Acquired Neurolinguistic and Neurocognitive Disorders", "class_attributes": "", "section": "32770", "instructors": [{"instructor_phone": "", "instructor_name": "Angela Christine Roberts", "instructor_addr": ""}], "topic": "", "course": "495-0", "descriptions": [{"name": "Overview of class", "value": "Course Overview<br/><br/>CSD 495 utilizes both lecture and active learning formats. Students are expected to prepare for (i.e., complete required readings and assignments) in order to participate actively in class discussions and activities. Every effort will be made by the course instructor and TA's to establish scholarly debates, especially on selected case studies. The format is intended to help students develop critical thinking and problem solving skills. For most lectures, visual and audio materials including PowerPoint slides, video and audio recordings will be used to enhance classroom learning. The reading load for the course is commensurate with graduate training. The required course readings and activities are designed to complement and to supplement information presented in the course lectures. <br/><br/>The course is designed to provide multiple formats for students to express their knowledge of the course content. Assignments, lectures, and course materials have been designed purposefully to link theoretical content from the course to clinical translation. The assignments for the course map directly onto the course learning objectives. While the intention of the course is to provide students with the theoretical foundation required for clinical practice in the areas of acquired neurocognitive and neurolinguistic impairments, students will demonstrate this knowledge in assignments and examinations based largely in clinically relevant tasks (e.g., case reports/summaries, mock clinical reports, designing therapy and assessment plans, designing and delivering individual and care partner education/training materials and plans, etc.). <br/>Purpose <br/>This course will:<br/>?Examine the neural bases and characteristics of acquired linguistic and cognitive disorders, including aphasia, dementia, traumatic brain injury and right hemisphere syndrome; <br/>?Explore how normal language and cognitive systems are fractionated by brain damage; <br/>?Focus on assessment, diagnosis, prognosis, treatment and recovery processes associated with these disorders; <br/>?Emphasize the integration of normative data, scientific knowledge, and clinical practice."}, {"name": "Learning Objectives", "value": "Course Learning Objectives (KASA-based objectives)<br/>Upon successful completion of this course the student will be able to: <br/>? Identify and describe the neural mechanisms of normal language and cognitive processing;<br/>? Describe potential etiologies of and factors associated with acquired linguistic and cognitive disorders;<br/>? Describe linguistic and cognitive characteristics, prognostic indicators, and recovery processes associated with acquired disorders, including aphasia, dementia, traumatic brain injury, and right hemisphere communication impairments;<br/>? Describe appropriate assessment principles and methods for adults with acquired language and cognitive disorders and select proper tests for evaluation and differential diagnosis;<br/>? Administer, score, and interpret assessment tools used for evaluating adults with acquired disorders, including aphasia, dementia, traumatic brain injury, and right hemisphere communication impairments; (DELETE)<br/>? Summarize and evaluate intervention strategies for adults with acquired disorders, including aphasia, dementia, traumatic brain injury, and right hemisphere communication impairments; <br/>? Choose and justify language intervention targets for adults with acquired disorders, including aphasia, dementia, traumatic brain injury, and right hemisphere communication impairments;<br/>? Demonstrate specific treatment strategies for adults with acquired disorders, including aphasia, dementia, traumatic brain injury, and right hemisphere communication impairments;<br/>? Consider the experience of having an acquired linguistic or cognitive disorder from the perspective of the speaker;<br/>? Describe the psychosocial impact of acquired linguistic and cognitive disorders and discuss components of education and counseling for patients, family, and other professionals."}, {"name": "Class Materials (Required)", "value": "Required Texts<br/><br/>Required Texts<br/>The required course texts are available at the Northwestern bookstore (print copies). <br/>1. Papathanasiou, I and Coppens, P., and Potages, C. (2017). Aphasia and Related Neurogenic Communication Disorders. Burlington, MA: Jones and Bartlett Learning. <br/>*Text available in print and e-print versions. Estimated cost $110.00<br/><br/>Course Website (CANVAS)<br/>1. Students will require access to CANVAS at Northwestern for this course. If you are not familiar with CANVAS and/or have difficulties accessing CANVAS for any reason, please discuss with the course instructor.<br/>2. Additional course readings: A number of published articles are required for the course, outside of the assigned text readings. When required, these will be supplied in .pdf format by the instructor on CANVAS. Students are required to observe all NU policies associated with use of copyrighted materials.<br/>3. Materials that support course lectures (e.g., PowerPoint slides) and discussions/assignments (e.g., links to websites) will be posted exclusively to CANVAS.<br/>4. Assignment instructions and submission: Assignment instructions will be posted to CANVAS. A number of assignments will require access to CANVAS for completion and/or submission.<br/>Clinic Recordings<br/>1. For some assignments students may be required to review video samples of clients collected in our program's clinic. <br/>2. These videos are available in a restricted format based on clinic policy. Students are required to follow all clinic policies regarding privacy and confidentiality when viewing and using these videos to complete assignments."}, {"name": "Class Materials (Suggested)", "value": "Course Reserve Materials<br/>Some assignments may require access to videos and/or print materials that cannot be made available via CANVAS. When required, these materials will be reserved for course use and may be loaned from the course instructor, loaned from the Northwestern University Library, and/or loaned from the Evanston Public Library. Availability of materials at each site may vary requiring students to have access to all three locations for materials."}, {"name": "Class Notes", "value": "Class Notes<br/>? Individual differences among students, life experiences, and perspectives are welcomed and encouraged. Students and instructors will communicate and act in a manner respectful of these differences during all class-related activities.<br/>? Any student requesting accommodations related to a disability or other condition is required to register with AccessibleNU (847-467-5530) and provide professors with an accommodation notification from AccessibleNU, preferably within the first two weeks of class. All information will remain confidential.<br/>? In the course, we will be reviewing clinical and research cases. It is imperative that students familiarize themselves with relevant privacy and confidentiality policies. These policies are available in the SLL handbook and in the NUCASLL clinic handbook. Links to these are provided on the CANVAS website. Maintaining the privacy of our clients and research subjects is paramount. Violating these policies will be viewed as an act of academic misconduct.<br/>? Students are expected to follow all NU procedures around use of copyrighted materials. This specifically includes no reposting of course slides, handouts, videos or other course content to websites other than the NU CANVAS website dedicated to the class, without express permission of the Instructor.<br/>? Students are expected to follow all NU procedures around scholarship and integrity.<br/>? Students enrolled in Communication Sciences and Disorders are required to follow all policies in the SLL student handbook relative to course attendance and standards for successful course completion. <br/>? Make-up assignments, late assignments, or grades of Incomplete are provided at the discretion of the Instructor and require approval in advance of the assignment due date/examination date. <br/>? Students are expected to conduct themselves at all times with the professionalism expected of graduate students in a professional program. Consistent with behaviors expected in a clinical setting, unless germane to the classroom lecture/assignment or authorized in writing by Accessible NU personnel, cell phones, pagers, personal music players and electronic devices other than personal computers/tablets should be turned ?off' or to ?silent' settings during class and left in either a backpack, purse, or other personal case. They should not be left out on the desk where they may serve as a distraction to others."}], "lmod": "2/9/17 6:37 PM (CT)", "subject": "CSD"}]