[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "Harris Hall L04"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores<br/>Add Consent: Department Consent Required<br/>Drop Consent: Department Consent Required<br/>", "qtr": "Fall 2016", "name": "14400", "title": "WCAS SOCIOL 101-6-22 First-Year Seminar", "class_attributes": "", "section": "14400", "instructors": [{"instructor_phone": "847/467-0517", "instructor_name": "Karrie A Snyder", "instructor_addr": "1808 Chicago, Room 106"}], "topic": "Teens, Tweens and Adolescents", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "This course examines the experiences of young people today and how the experience of being a young person varies greatly by socio-economic status, gender, and race/ethnicity. We will also spend time looking at how life stages associated with youth (such as tween, teenager, and emerging adulthood) have evolved and why the road to adulthood is often longer today. We will also think about how the media shapes societal views of young people and how young people use social media. Finally, we will consider how the lives of young people today (Millenials) compare to earlier generations (including Baby Boomers and Generation X) and we will look at intergenerational interactions at home, in school, and in the workplace."}, {"name": "Learning Objectives", "value": "1) To understand the historical and cultural development of youth life stages (such as teenager, 'tween etc.) 2) To critically think about how young people are portrayed in cultural stereotypes and debates, media/entertainment, and social science research agendas. <br/>3) To understand how the experience of being a young person differs greatly by gender, race/ethnicity, socioeconomic status, and generation.<br/>4) To investigate how young people make the transition to adulthood today and how this transition is shaped by social status, social norms and current economic conditions."}, {"name": "Teaching Method", "value": "Discussion"}, {"name": "Class Materials (Required)", "value": "Tentative Booklist. Please confirm all books before purchasing.<br/><br/>Pipher, Reviving Ophelia: Saving the Selves of Adolescent Girls, 1594481881<br/><br/>Simmons, Odd Girl Out, Revised and Updated: The Hidden Culture of Aggression in Girls, 0547520190 <br/><br/>Wiseman, Masterminds and Wingmen: Helping Our Boys Cope with Schoolyard Power, Locker-Room Tests, Girlfriends, and the New Rules of Boy World, 0307986683 <br/><br/>Other readings will be available through Course Reserves."}], "lmod": "10/30/16 7:10 PM (CT)", "subject": "SOCIOL"}]