[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Locy Hall 318"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "30986", "title": "WCAS COMP_LIT 211-0-21 Topics in Genre", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "30986", "instructors": [{"instructor_phone": "847/491-5288", "instructor_name": "Paola   Zamperini", "instructor_addr": "1800 Sherman, 5th Floor, Suite 5400, Office 5430"}], "topic": "Ming Novel", "course": "211-0", "descriptions": [{"name": "Overview of class", "value": "This course is devoted to the study of the novel in late imperial Chinese literature. This quarter we will read the English translation of Shuihu zhuan, aka The Water Margins, or The Outlaws of the Marsh. Due to its length, this novel will be the primary focus of the course, though we will include selections from other contemporary and related sources, when relevant to the overall understanding of the text under study. As we read through this text, in translation, uncovering its richness and complexity, we will in turn <br/>address issues such as the place of the novel in traditional Chinese literature; authorship and authority; narrative strategies and plot development; magic and religion; material culture; demons and exorcism; sexuality and adultery; femininity, masculinity and their discontents. In addition to Shuihu zhuan, representative theoretical work in the field of pre-modern Chinese literature will be incorporated as much as possible."}, {"name": "Learning Objectives", "value": "Acquisition of knowledge about the genre of the novel in late imperial China. This will mean exposure to primary sources (in English, and for those students able to, in Chinese) produced by late imperial Chinese authors, as well as to secondary sources related late imperial fiction and narrative.<br/><br/>-Development of methodological skills in studying, reading, and analyzing the primary and secondary sources related to the themes of the course.<br/><br/>-Growth as independent researchers in the field of Chinese literature and Asian humanities.<br/><br/>-Growth as independent academic thinkers and writers."}, {"name": "Teaching Method", "value": "Lecture and discussion"}, {"name": "Evaluation Method", "value": "Participation: 20% (This includes attendance, thorough preparation and reading of all assigned materials, and active participation in classroom discussion)<br/><br/>Assignments and responses: 25% (these include responses to readings and films, staged assignments in preparation of final projects, and so on)<br/><br/>Presentations: 20%<br/><br/>Final Project: 35% (the final project can be an analytical essay or a creative project)"}, {"name": "Class Materials (Required)", "value": "Readings available on Canvas."}], "lmod": "4/3/16 7:54 PM (CT)", "subject": "COMP_LIT"}]