[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Tech Institute Lecture Room 5"}], "school": "MEAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "20941", "title": "MEAS MECH_ENG 333-0-21 Introduction to Mechatronics", "class_attributes": "", "section": "20941", "instructors": [{"instructor_phone": "847/467-1223", "instructor_name": "Nicholas Davenport Marchuk", "instructor_addr": ""}], "topic": "", "course": "333-0", "descriptions": [{"name": "Overview of class", "value": "Introduction to microprocessor controlled electromechanical systems. Interfacing sensors and actuators to computers, electrical and mechanical prototyping, dissection of commercial product. Final team project. <br/><br/>This course is taken by engineering and computer science students interested in the design of microprocessor-controlled electromechanical systems. <br/><br/>Introduction to the design of microprocessor-controlled electromechanical systems. Interfacing sensors and actuators to a personal computer and a single-board computer. Electrical and mechanical design, prototyping, and construction. Dissection of a commercial mechatronic product. Students work in teams to produce final computer-controlled electromechanical projects of their own design."}, {"name": "Registration Requirements", "value": "Prerequisite: MECH_ENG 233, EECS 221 or consent of instructor."}, {"name": "Evaluation Method", "value": "Labs, Quizzes, Homework and Final Project."}, {"name": "Class Materials (Suggested)", "value": "READING: Introduction to Mechatronics and Measurement Systems, Second Edition, D. G. Alciatore and M. B. Histand, McGraw-Hill, 2003, ISBN 0-07-240241-5. <br/><br/>Other Sources: <br/><br/>The Art of Electronics, second edition, P. Horowitz and W. Hill, Cambridge University Press, 1989, ISBN 0-521-37095-7. <br/><br/>Mechatronics: Electronic Control Systems in Mechanical and Electrical Engineering, second edition, W. Bolton, Addison Wesley Longman, 1999, ISBN 0-582-35705-5. <br/><br/>Mobile Robots: Inspiration to Implementation, second edition, J. Jones, A. Flynn, and B. Seiger, AK Peters, 1999, ISBN 1-56881-097-0. <br/><br/>Mechanical Devices for the Electronics Experimenter, B. Rorabaugh, TAB Books (Division of Mc-Graw Hill), 1995, ISBN 0-07-053547-7."}], "lmod": "12/25/16 6:44 PM (CT)", "subject": "MECH_ENG"}]