[{"class_mtg_info": [{"meet_t": "MoWe 12:30PM - 1:50PM", "meet_l": "University Hall 121"}], "school": "WCAS", "overview_of_class": "This course will examine global capitalism from critical, historical, and sociological perspectives.  We will compare the development and contemporary forms of capitalism in different regions, tracing them through to neoliberal globalization. The course will pay particular attention to the role of colonialism and neo-colonialism in these developments, as well as the sexual division of labor and other resulting social inequalities. Through-out the course, we will also consider social movements and other forms of resistance and alternatives to capitalism.", "qtr": "Winter 2016", "name": "Global Capitalism", "title": "WCAS SOCIOL 324-0-20 Global Capitalism", "lmod": "1/9/16 6:54 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Elizabeth Anne Onasch", "instructor_addr": ""}], "topic": "", "course": "324-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "This course will examine global capitalism from critical, historical, and sociological perspectives. We will compare the development and contemporary forms of capitalism in different regions, tracing them through to neoliberal globalization. The course will pay particular attention to the role of colonialism and neo-colonialism in these developments, as well as the sexual division of labor and other resulting social inequalities. Through-out the course, we will also consider social movements and other forms of resistance and alternatives to capitalism."}, {"name": "Registration Requirements", "value": "During preregistration this course is only open to Sociology Majors &amp; Minors. <br/>This course is open to all students during regular registration starting November 16, 2015."}, {"name": "Class Materials (Required)", "value": "All materials for this course will be made available on Canvas - no purchase necessary."}], "path": "/class-descriptions/4610/WCAS/SOCIOL/324-0/23960", "instructor": ["Elizabeth Anne Onasch"], "class_attributes": "Historical Studies Distro Area<br/><br/>Interdisciplinary Distro - See Rules<br/><br/>Social &amp; Behavioral Sciences Distro Area<br/><br/>", "id": "23960", "subject": "SOCIOL"}]