[{"class_mtg_info": [{"meet_t": "MoWe 12:30PM - 1:50PM", "meet_l": "Locy Hall 109"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Environmental Policy and Culture Students Only During Pre-Registration", "qtr": "Spring 2017", "name": "37894", "title": "WCAS ENVR_POL 390-0-26 Special Topics in Environmental Policy and Culture", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "37894", "instructors": [{"instructor_phone": "", "instructor_name": "Eli S Suzukovich III", "instructor_addr": "1810 Hinman Avenue, Evanston, IL 60208-1310"}], "topic": "Introduction to Ethnobiology Theory and Practice", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "This class is an introduction to the growing field of Ethnobiology which is the scientific study of dynamic relationships among peoples, biota, and environments. As a multidisciplinary field, ethnobiology integrates anthropology, geography, systematics, population biology, ecology, mathematical biology, pharmacology, conservation, and sustainable development. This class will cover the origins and evolution of ethnobiology theory and practice ranging from folk science, polymaths, taxonomic and colonial practices, the rise of Indigenous science methods, and the contemporary focus on creating networks among researchers of various disciplines to face the challenges of rapid ecological change and shifting political economies."}, {"name": "Learning Objectives", "value": "Students will understand what ethnobiology is, its history, and the development of theoretical perspectives that have informed research methodologies. Students will understand the various ways in which different scientific and social science disciplines intersect and work together. Students will understand research ethics in ethnobiology."}, {"name": "Teaching Method", "value": "Lecture-discussion"}, {"name": "Evaluation Method", "value": "Midterm and Final Essays"}, {"name": "Class Materials (Required)", "value": "Class materials will include articles in PDF Format and the following books.<br/>? Indigenous Innovation: Universalities and Peculiarities. Editors: Huaman, Elizabeth Sumida, Sriraman, Bharath. Sense Publishers, 2015. ISBN: 978-94-6300-224-0 (paperback)<br/><br/>? Ethnobiology for the Future: Living Cultural and Ecological Diversity. Editor, Gary Paul Nabhan. The University of Arizona Press. 2016. 0816532745, 9780816532742<br/><br/>And library course reserves:<br/>? Ethnobiology. Anderson, et al. A. John Wiley and Sons, Inc. 2016 http://reader.eblib.com.turing.library.northwestern.edu/(S(nwuyimewjgqfgvw0kdtfnlp1))/Reader.aspx?p=697916&amp;o=2916&amp;u=GUMNUE6bcmE%3d&amp;t=1485994244&amp;h=B28C9DE5CEDB44F3A2543BE613654697910232A6&amp;s=53072668&amp;ut=9755&amp;pg=1&amp;r=img&amp;c=874&amp;pat=n&amp;cms=2&amp;sd=2#"}], "lmod": "2/14/17 6:44 PM (CT)", "subject": "ENVR_POL"}]