[{"class_mtg_info": [{"meet_t": "Th 6:15PM - 9:15PM", "meet_l": "Lunt Hall 107"}], "school": "SCS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "27592", "title": "SCS MATH 320-A-66 Introduction to Real Analysis", "class_attributes": "", "section": "27592", "instructors": [{"instructor_phone": "847 4675211", "instructor_name": "Santiago   Canez", "instructor_addr": "Lunt B27"}], "topic": "", "course": "320-A", "descriptions": [{"name": "Overview of class", "value": "Real analysis is essentially the study of real-valued functions, with concepts such as continuity, differentiability, and integrability being key. These are concepts which are commonly covered in a first calculus course, and indeed real analysis is about understanding why things in calculus work the way they do. This subject arose in the 1800s out of the need to put calculus on a firm, rigorous foundation to avoid the &quot;hand-wavy&quot; arguments which were often used in calculus at the time. This rigorous approach to calculus has by now led to a diverse range of applications-it is not an overstatement to say that anytime you are using functions to model some scenario in economics, engineering, or physics and the other sciences, you are making great use of real analysis. This course will give a basic introduction to real analysis, focusing on properties of continuous, differentiable, and integrable functions."}, {"name": "Registration Requirements", "value": "MATH 234, 240, 300, or equivalents, or instructor consent."}, {"name": "Learning Objectives", "value": "Basic properties of continuous, differentiable, and integrable functions, and the types of applications these concepts lead to."}, {"name": "Class Materials (Required)", "value": "Materials may include the following. Visit the campus bookstore or its website to confirm materials for the course. <br/><br/>Elementary Analysis: The Theory of Calculus by Ross, 2nd Edition<br/><br/>ISBN-10: 1461462703<br/>ISBN-13: 978-1461462705"}], "lmod": "12/29/16 6:50 PM (CT)", "subject": "MATH"}]