[{"school": "WCAS", "overview_of_class": "Postwar Italian Culture Through Art: from World War II to the &quot;miracolo economico&quot; and the 1960s: An art history interdisciplinary course in Italian studies that focuses on the Postwar period: from the first years of reconstruction at the end of World War II to the &quot;miracolo economico&quot;, the economic boom which would radically change the identity of the country in the 1960s, until the &quot;Sessantotto&quot; (1968), a year of generalized democratic protests that marked the beginning of the following so-called &quot;anni di piombo&quot; (&quot;years of lead&quot;), a dark decade that would be characterized by strong social and political tensions. Italy has always been a land of encounter for different artistic backgrounds, creative interdisciplinary development and intercultural exchange. This course invites students to examine how this aspect has had a significant moment in the field of visual art during the Postwar period in relationship to its political, social and cultural growth and changes. All of this will be examined and discussed with students also with a special attention paid to artists' writings from the time (read in English translation, but also in some of their Italian &quot;keywords&quot;), that mirror - in their content and language - a more general shift in Italian culture. Choosing seminal ideas, events, pieces and protagonists from the period (such as Lucio Fontana, Alberto Burri, Piero Manzoni, Mario Schifano, Michelangelo Pistoletto?), the course will outline key elements of Postwar art in Italy in connection to the more general social and cultural developments in the country, aimed at reconstructing its own new plural identity, and at experimenting new balances between the people and the rising culture of consumerism and mass media.The interdisciplinary approach uses artworks, artists' writings, documents of any kind (paper to video) as indexes of socio-cultural issues in connection to design, architecture, photography, music, fashion, cinema and theater.<br/><br/>Instructor Biography: Francesca Pola is an historian and critic of contemporary art who contributes to various specialist publications and curates exhibitions. Since 1999 she has been teaching and conducting research at the Institute for the History of Art of the Università Cattolica (where she graduated, specialized and received her PhD with full marks and honours and is currently Adjunct Professor) in Milan and Brescia; since 2003 she has been Art History instructor at the Milan center of IES. Her studies have focused, in particular, on twentieth century sculpture, American art from the 1920s to the period after the Second World War, Italian and International Postwar Art of the 1950s and1960s, topics of cultural identity connected to artistic practices from the 1950s to today, and abstract art from the 1980s to the present. Her books and essays have been published by major Italian and foreign institutions such as the Fondazione Piero Manzoni (Milan), the Forum Austriaco di Cultura (Milan), the Institut Mathildenhöhe (Darmstadt), the Italian Cultural Institute (Los Angeles), the Kaiserliche Hofburg (Innsbruck), the Peggy Guggenheim Collection (Venice), the Moderna Museet (Stockholm), the Städel Museum (Frankfurt) and the Gagosian Gallery (London), among others. From 2009 to 2011 she was the Curator of MACRO Museo d'Arte Contemporanea Roma, where she developed special curatorial projects based on multimedia experience of art and digital art history challenges. She is currently Curator of Multimedia Projects for Gallerie d'Italia, ongoing at their museum venues in Milan and Vicenza.", "name": "Advanced Topics in Italian Culture and Literature", "section": "20", "topic": "", "course": "350-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4610/WCAS/ITALIAN/350-0/23309", "instructor": [""], "id": "23309", "subject": "ITALIAN"}]