[{"school": "WCAS", "overview_of_class": "How have people tried to explain what their lives mean? How have historical actors come to understand more abstract features of their society - such as religion, nationalism, race, gender, and sexuality - in relation to themselves? How do new historical contexts create new understanding of the self? <br/><br/>To address these questions, we will consider autobiographical primary sources ranging from medieval love letters to memoirs of the Holocaust; experiences of trench warfare, artistic creation, and spiritual awakening; lives changed by scientific discovery, fighting duels, and running away from home.", "name": "First-Year Seminar-European History", "section": "20", "location": "Kresge Centennial Hall 2-435", "topic": "Autobiography and the Self in European History", "course": "101-6", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4660/WCAS/HISTORY/101-6/34211", "instructor": [""], "class_attributes": "WCAS First-Year Seminar<br/><br/>Attendance at 1st class mandatory<br/><br/>Freshmen/Sophomores Only<br/><br/>", "id": "34211", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "In this course, we will study the way that Europeans responded to the growing political, economic, social, and cultural power of the United States since the end of the U.S. Civil War. Themes of the course include, but are not limited to: the attraction of America as an untrammeled frontier and place for reinvention, the allure of American bodies and their creative and destructive potential during the First and Second World Wars, the rise of American consumer and commercial culture in the post-war reconstruction, the challenge and opportunity brought by African-Americans immigrants in Europe escaping Jim Crow, and the transatlantic communication between American and European protest groups in the 1960s and 1970s.", "name": "First-Year Seminar-European History", "section": "22", "location": "Harris Hall L06", "topic": "The American Invasion; Americas & Americanization", "course": "101-6", "meeting_time": ["MoWe 9:30AM - 10:50AM"], "path": "/class-descriptions/4660/WCAS/HISTORY/101-6/34212", "instructor": ["Keith Allen Rathbone"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "34212", "subject": "HISTORY"}]