[{"class_mtg_info": [{"meet_t": "Tu 2:00PM - 4:50PM", "meet_l": "Crowe Hall 5-178"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Fall 2016", "name": "14171", "title": "WCAS RELIGION 471-0-21 Studies in History of Religions", "class_attributes": "", "section": "14171", "instructors": [{"instructor_phone": "491-2614", "instructor_name": "Richard   Kieckhefer", "instructor_addr": "1860 Campus Drive, Crowe Hall # 4-141"}], "topic": "Late Medieval Religion", "course": "471-0", "descriptions": [{"name": "Overview of class", "value": "All the controversies that came clearly into view in the sixteenth century were already anticipated in the last medieval centuries. And the conflicts among historical subjects can be seen mirrored in debates among modern scholars. Religion in the late medieval West has for some time been vigorously discussed and debated, across disciplinary and sometimes also denominational lines. The most widely respected scholars, such as Eamon Duffy and Caroline Walker Bynum, are not only emulated but also challenged. Theoretical issues sometimes lie at the heart of controversy. Views about the relationship between medieval and Reformation religion continue to generate conflict. More unexpected issues also arise: how precisely to conceive and define heresy; how far literacy and reading habits supported traditional commitment, or when and whether they fostered dissent; how to map the boundaries, if any, separating devotional practice from superstition and magic. Venerable clichés about late medieval religion-its emphasis on the humanity of Christ, or its neurotically penitential character-are now much disputed. We will plunge into all these conversations and controversies in an effort to see just why late medieval religion is so controversial. This seminar should be of interest to historians, religionists, art historians, and students of medieval and early modern literature."}, {"name": "Class Materials (Required)", "value": "1. Eamon Duffy on the state of orthodox religion: The Stripping of the Altars and related works<br/>2. Eamon Duffy anticipated and reconsidered: G.W. Bernard, The Late Medieval English Church, and related works<br/>3. Caroline Walker Bynum on function and meaning of bodily piety: Holy Feast and Holy Fast and related works<br/>4. Caroline Walker Bynum-from body to matter: Christian Materiality and related works<br/>5. Nicholas Watson on promotion and inhibition of vernacular theology<br/>6. Bernd Hamm: Frömmigkeitstheologie and centering focus<br/>7. Prayer, reading, and inward religion<br/>8. Jean Gerson and the new public intellectual"}], "lmod": "10/30/16 7:09 PM (CT)", "subject": "RELIGION"}]