[{"class_mtg_info": [{"meet_t": "Tu 9:00AM - 11:50AM", "meet_l": "Scott Hall 107 Burdick Room"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "23040", "title": "WCAS POLI_SCI 469-0-20 Special Topics in Knowledge &amp; Politics", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "23040", "instructors": [{"instructor_phone": "", "instructor_name": "Jacqueline   Stevens", "instructor_addr": "Scott Hall, Rm 304"}], "topic": "", "course": "469-0", "descriptions": [{"name": "Overview of class", "value": "&quot;Politics After Biopolitics: Foucault and His Critics.&quot; Professor Stevens, Winter 2017<br/>This course will analyze concepts that are in the orbit of biopolitics broadly conceived, that is, conflicts over how to reproduce and maintain a particular body politic, in order to engage with the specific concept as appears sporadically in the work of Michel Foucault and is used and criticized by other thinkers. The objective is to understand the advantages and disadvantages of Foucault's critiques of sovereignty for analyzing current political conflicts situated in practices of the nation, race, class, and the family, as well as the subject positions associated with these, i.e., citizens, immigrants, Whites, Asians, rich, poor, the 1%, dependents, women, men, LGBTF, queer, and many more. The course will attend to the intellectual and political history informing Foucault's decision to develop critiques of the discourse of sovereignty, including juridical discourses. During class meetings we will discuss the uses and disadvantages of Foucault's historical periodizations of changing power/knowledge relations associated with biopolitics and evaluate the metanarrative that informs his new heuristics. The class will read extensively from works by Foucault as well as texts by Giorgio Agamben, Wendy Brown, Judith Butler, Michael Hardt and Antonio Negri, Jacques Rancière, Ann Stoler, and others."}], "lmod": "12/25/16 7:05 PM (CT)", "subject": "POLI_SCI"}]