[{"class_mtg_info": [{"meet_t": "MoWe 12:30PM - 1:50PM", "meet_l": "Kresge Centennial Hall 2-319"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-requisite: Students must have passed Hindi 121-3 with at least a C- or be placed in according to placement test results.<br/><br/>Pre-requisite: Students must have passed Hindi 121-3 with at least a C- or be placed in according to placement test results.", "qtr": "Fall 2016", "name": "10716", "title": "WCAS HIND_URD 211-3-20 Hindi-Urdu III: Topics in Intermediate Hindi-Urdu", "class_attributes": "", "section": "10716", "instructors": [{"instructor_phone": "8474677581", "instructor_name": "Rami   Nair", "instructor_addr": "1880 Campus Drive, Kresge Hall, Office 4-429"}, {"instructor_phone": "847/467-0936", "instructor_name": "David Sol Boyk", "instructor_addr": "1880 Campus Drive, Kresge Hall, Office 4-425"}], "topic": "Society on Screen", "course": "211-3", "descriptions": [{"name": "Overview of class", "value": "Too often students complain that they do not get enough practice speaking the language that they are learning. This course will focus mainly on sustaining conversations in Hindi on various topics ranging from gossip to politics. There will be some reading, but very little writing done. Each topic will be introduced either through a short written passage, or through a video or audio clip. After introducing the basic vocabulary, phrases and expressions necessary for talking about that topic, the students will be given a situation in which they find themselves, and create an impromptu conversation that fits the situation (and the topic).<br/><br/>Topics covered in class:<br/><br/>a. Extended small talk (talking to strangers as well as acquaintances about daily life, problems, weather, etc). <br/>b. Health and Medicine (asking about health, the ability to tell one's health problems/symptoms to a doctor, discussing a disease and how it is contracted and the possible forms of treatment, and the side-effects that these may cause)<br/>c. Politics (vocabulary related to politics; elections; passing laws; issues like social security; healthcare system; taxation; etc).<br/>d. Social issues in South Asia such as female infanticide; plight of the elderly; untouchability, etc.<br/><br/>Bibliography:<br/><br/>Handouts made by the instructor, video and audio clips from Bollywood movies or TV shows such as &quot;Satyamev Jayate&quot; (http://www.satyamevjayate.in/), as well as Meena UNICEF (Hindi and Urdu)"}, {"name": "Evaluation Method", "value": "will be based on class participation, weekly vocabulary tests, 2 Midterms, and a final video project that will portray an interview or a conversation, and a monologue."}], "lmod": "10/30/16 7:05 PM (CT)", "subject": "HIND_URD"}]