[{"school": "WCAS", "overview_of_class": "The growth and popularity of fields such as Afro-pessimism and settler colonial studies as of late has provided a serious challenge to the logics and protocols of liberal reform, multiculturalism, and social justice. Each, for example, forces us to respond to critical questions regarding slavery and its \"afterlife,\" to examine the conquest of indigenous peoples on this continent as more verb than noun, and to acknowledge limits of western modernity and its promises of universality. This course is designed around the question of, how do Latinxs or Latinx Studies fit into these critical and pessimistic paradigms? As this recent wave of critical pessimism is well centered within the interdisciplines of Black Studies and Native American Studies, this course will ask and attempt to facilitate responses to the question of what constitutes a critical Latinx Studies?", "name": "Topics in Latina and Latino Social and Political Issues", "section": "20", "location": "Kresge Centennial Hall 2-410", "topic": "Native American Studies", "course": "392-0", "meeting_time": ["Th 5:00PM - 7:50PM"], "path": "/class-descriptions/4660/WCAS/LATINO/392-0/34026", "instructor": ["John David Marquez"], "class_attributes": "Interdisciplinary Distro - See Rules<br/><br/>Social &amp; Behavioral Sciences Distro Area<br/><br/>Ethics &amp; Values Distro Area<br/><br/>", "id": "34026", "subject": "LATINO"}, {"school": "WCAS", "overview_of_class": "What do we mean by urban education? Is it a code word for discussing race? Is it the study of urban schooling? This course is designed to enhance students' knowledge of urban education and schooling, especially related to dynamics of race, class, and culture. It provides an analysis of policies and practices and how they have/are implemented to meet the \"need\" of the individuals and groups who interact with these institutions. We will explore the following: historical and political economic factors influencing urban education; the distribution of opportunity and wealth in cities and schools; multicultural education, the development of positive school cultures, and the use of community services and resources. The goal is to encourage and foster students' critical thinking and reflective practice to address the pressing challenges which students face in American urban public schools.", "name": "Topics in Latina and Latino Social and Political Issues", "section": "21", "location": "Harris Hall L06", "topic": "Latinos and Higher Education", "course": "392-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4660/WCAS/LATINO/392-0/34027", "instructor": ["Alejandro Eduardo Carrion"], "class_attributes": "Interdisciplinary Distro - See Rules<br/><br/>Social &amp; Behavioral Sciences Distro Area<br/><br/>Ethics &amp; Values Distro Area<br/><br/>", "id": "34027", "subject": "LATINO"}, {"school": "WCAS", "overview_of_class": "According to the latest statistics, the United States is home to over 55.5 million \"Latinos\" and \"Hispanics.\" In 2000, this population became the largest \"minority group\" in the country. Demographers forecast that within the century, this population will reach close to 100 million. Considerable popular and academic debate has ensued about the meaning and significance of these demographic trends. For some, Latino population growth represents a major domestic threat, and for others it is a beneficial and welcomed development. Implicated in these debates, but rarely discussed, is the sociohistorical and political process by which diverse and heterogeneous Latin American-descent communities came be imagined and understood as comprising a panethnic whole. In this course, we will examine this process with an analytic focus on the intersection of politics, race, and knowledge production.", "name": "Topics in Latina and Latino Social and Political Issues", "section": "22", "location": "Locy Hall 111", "topic": "Meaning, Measurement, & Making of Latin@ Panethnic", "course": "392-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4660/WCAS/LATINO/392-0/34028", "instructor": ["Michael D Rodriguez"], "class_attributes": "Interdisciplinary Distro - See Rules<br/><br/>Social &amp; Behavioral Sciences Distro Area<br/><br/>Ethics &amp; Values Distro Area<br/><br/>", "id": "34028", "subject": "LATINO"}, {"school": "WCAS", "overview_of_class": "", "name": "Topics in Latina and Latino Social and Political Issues", "section": "23", "location": "Kresge Centennial Hall 2-410", "topic": "", "course": "392-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4660/WCAS/LATINO/392-0/34029", "instructor": ["Myrna   Garcia"], "class_attributes": "Interdisciplinary Distro - See Rules<br/><br/>Social &amp; Behavioral Sciences Distro Area<br/><br/>Ethics &amp; Values Distro Area<br/><br/>", "id": "34029", "subject": "LATINO"}]