[{"class_mtg_info": [{"meet_t": "We 1:30PM - 4:00PM", "meet_l": "ANTHRO Sem Rm B07 - 1810 Hinmn"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Graduate Students.<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Spring 2016", "name": "32035", "title": "WCAS ANTHRO 485-0-1 Seminar in Mind, Body, &amp; Health", "class_attributes": "", "section": "32035", "instructors": [{"instructor_phone": "847/491-7207", "instructor_name": "Rebecca A Seligman", "instructor_addr": "1810 Hinman Ave., Room #204, EV Campus"}], "topic": "", "course": "485-0", "descriptions": [{"name": "Overview of class", "value": "This course will provide a graduate level introduction to the anthropology of mind, body, and health, addressing broadly the question of how Anthropologists understand and investigate the social and cultural contexts of health and illness. We will examine the diverse ways in which humans use cultural resources to cope with pain, illness, suffering and healing in specific cultural contexts. In addition, we will analyze medical practices as cultural systems, examining how disease, health, body, and mind are socially influenced and socially constructed, how these constructions articulate with human biology, and vice versa. In particular, the course will focus on the concept of embodiment, its various uses and meanings in the context of illness and healing. The course will combine an examination of current theoretical paradigms with ethnographic case material from a number of societies, including Brazil, Japan, the US, and Canada. The goal of this comparative endeavor will be to analyze similarities and differences across understandings of mind and body and systems of healing, and to examine American perspectives, behaviors, and practices critically in order to illuminate the ways in which they are socially embedded and culturally specific. <br/><br/>Open to all graduate students. No P/N."}, {"name": "Registration Requirements", "value": "Grad Students Only. Non-Anthropology Graduate Students need permission."}], "lmod": "4/3/16 7:43 PM (CT)", "subject": "ANTHRO"}]