[{"school": "WCAS", "overview_of_class": "This course addresses the question how one can tell a story. Basically, we look at the idea that \"no matter how good a story is, there's more at stake in the telling.\" It is a premise of the course that how one writes is more interesting than what one writes, but of course, \"how\" is informed and determined by \"what,\" as well as \"why.\" So subject matter informs and determines style, form, and structure, and vice versa. We will approach these questions by reading a variety of novels and some short stories by authors from a number of different national contexts. Authors will likely include W.G Sebald (The Emigrants), Claudio Magris (Microcosms), Antonio Muñoz Molina (Sepharad), Tayeb Saleh (Season of Migration to the North), Marguerite Yourcenar (Memoirs of Hadrian), Doris Lessing, Sadegh Hedayat (The Blind Owl), Gabriel García Márquez (Love in the Time of Cholera).<br/><br/>Instructor: Rabih Alameddine", "name": "Major Periods in World Literature", "section": "1", "location": "University Hall 102", "topic": "World Literature in a Comparative Frame: Na", "course": "302-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4620/WCAS/COMP_LIT/302-0/31012", "instructor": [""], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "31012", "subject": "COMP_LIT"}, {"school": "WCAS", "overview_of_class": "The Yiddish language is the most widespread of Jewish diaspora languages in<br/>world history. Prior to World War II, the language was spoken and read by around<br/>twelve million Jews, that is 40% of the global Jewish population. From the late<br/>nineteenth century on, there began to develop a distinctively modern, secular<br/>Yiddish literature. By an extraordinarily accelerated process of development<br/>Yiddish literature essentially achieved in less than a century what had been in<br/>European literature in the course of half a millennium. Following the Holocaust,<br/>secular Yiddish literature and culture survived as a spectral, haunted remnant.<br/>While this magnificent literature is well represented in English translation, it remains<br/>for the most part a dark continent for the increasing number of students pursuing<br/>graduate studies in fields outside Jewish Studies for whom Jewish history and<br/>culture is of significant or central concern. This course is aimed toward such<br/>graduates. The course provides an overview of emergence of a modern Jewish<br/>language and literature from consideration of the three classic writers-Mendele<br/>the Bookseller; Y.L. Peretz; Sholem Aleichem - to high Yiddish modernist poetry in<br/>early 20th Century America; the post-Holocaust poetry of Avrom Sutzkever and<br/>the Isaac Bashevis-Singer phenomenon. Questions to be addressed include: What<br/>is a belated literature? What is a minor literature? What is a national literature?<br/>What is a dead literature? Can a Diaspora literature, stateless, landless, constitute<br/>a trans-territorial, stateless state (a \"make-believe territory\" - Kemoy teritorie in the<br/>formulation of one leading Yiddish thinker)? Where, why and how does Yiddish<br/>survive in literature written in non-Jewish languages, by Jews and non-Jews? Do<br/>we find a parallel to this odd universal life in death/death in life elsewhere? It is<br/>hoped that students will bring theoretical perspectives derived from their own<br/>fields to bear upon the texts studied.", "name": "Major Periods in World Literature", "section": "21", "location": "Fisk Hall 114", "topic": "The Rise and Fall of Modern Yiddish Culture", "course": "302-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4620/WCAS/COMP_LIT/302-0/38261", "instructor": ["Marcus G Moseley"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "38261", "subject": "COMP_LIT"}]