[{"class_mtg_info": [{"meet_t": "Tu 6:15PM - 9:15PM", "meet_l": "Wieboldt Hall 512"}], "school": "SCS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "27566", "title": "SCS ECON 354-CN-14 Issues in Urban and Regional Economics", "class_attributes": "", "section": "27566", "instructors": [{"instructor_phone": "", "instructor_name": "Brett Morgner Baden", "instructor_addr": ""}], "topic": "", "course": "354-CN", "descriptions": [{"name": "Overview of class", "value": "This course addresses factors affecting the spatial distribution of economic activity. We will start with a theoretical model grounded in common sense and core economic principles, then move to applications of the theoretical model and empirical analysis of urban problems. First, the course builds the urban monocentric model through parallel approaches: common sense, simple mathematical approach as well as through utility maximization. This model is then used as the core heuristic process for understanding urban and regional urban economic development including issues such as poverty, housing markets, zoning, employment, education, environmental problems, and racial discrimination. Different policy perspectives on these topics are evaluated through readings and applied problems worked out in class. The course ends by connecting the core urban economic framework developed to explain city development to a framework of cities within a wider economy."}, {"name": "Registration Requirements", "value": "ECON 281, 310-A, -B."}, {"name": "Learning Objectives", "value": "This class will emphasize understanding developing economic intuition to help build and simple economic models and use data to investigate policy issues."}, {"name": "Teaching Method", "value": "The beginning of the course will be lecture based, pulling from readings, and encouraging class participation as the core economic models are built. Problem sets will be provided, with some work completed during class. There will be one examination near the middle of the term. The rest of the course will be spent helping the students write their data-based policy papers and discussing economics and current urban and regional policy issues in class."}, {"name": "Evaluation Method", "value": "There will be one examination and a data-based policy paper. Students will be encouraged to participate in class discussions and have one-on-one sessions to develop their papers with the instructor."}, {"name": "Class Materials (Required)", "value": "Texts and materials will include economic journal articles, policy white papers, course lecture slides, and instructive problem sets."}], "lmod": "12/29/16 6:49 PM (CT)", "subject": "ECON"}]