[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "Locy Hall 111"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Gender Studies students.", "qtr": "Spring 2017", "name": "33917", "title": "WCAS GNDR_ST 382-0-20 Race, Gender, and Sexuality", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "33917", "instructors": [{"instructor_phone": "467/491-3150", "instructor_name": "Tessie P Liu", "instructor_addr": "Harris Hall Room 327"}], "topic": "Politics of Beauty", "course": "382-0", "descriptions": [{"name": "Overview of class", "value": "Is beauty a site of political struggle? Certainly the last presidential election presented many opportunities to debate the question. Applying the critical frameworks developed by writers and theorists as different as Naomi Wolf, Kathy Davis, bell hooks, Michele Wallace, and Judith Butler, this course asks why has there been such heated disputes among feminists over whether beauty culture is oppressive or liberatory? Is beauty the source of delusion and false values or the source of self-expression and empowerment? Could it be a site of critical destabilizing practices? To better understand the deeper stakes in this debate, the class sets these questions historically, tracing them from 17th and 18th century moral philosophy and aesthetics to 19th century physiognomics, anthropology, medicine, phrenology, and comparative anatomy. A crucial component of this project is to uncover how elites as spectators, philosophers, connoisseurs, and scientists have constituted racial and sexual hierarchies through their aesthetic judgments of others. <br/> Through case studies on beauty pageants, cosmetic surgeries, bar and club cultures, as well as sports and modern/postmodern concert dance, we will study the counter-discourses and self-fashioning strategies of groups and individuals. Focusing on the performative and bodies in motion, we will ask whether corporeal meaning can be remade from within and by &quot;marked&quot; bodies. Instead of developing simple resistance models of opposition, we will focus on how communities establish their aesthetics to communicate their goals, hopes, and pain."}, {"name": "Teaching Method", "value": "Between 100 to 150 pp of reading a week. Three to four films viewed outside of class meetings. One short essay (3 to 5 pp) with an assigned topic. Two additional short essays (3 to 5 pp.) due after leading the discussion. One final paper (5 to 7 pp) due during exam week. Final essays may be either a short research paper or a book and/or articles review based on student interest and developed in consultation with instructor."}, {"name": "Evaluation Method", "value": "Between 100 to 150 pp of reading a week. Three to four films viewed outside of class meetings. One short essay (3 to 5 pp) with an assigned topic. Two additional short essays (3 to 5 pp.) due after leading the discussion. One final paper (5 to 7 pp) due during exam week. Final essays may be either a short research paper or a book and/or articles review based on student interest and developed in consultation with instructor."}], "lmod": "2/9/17 6:43 PM (CT)", "subject": "GNDR_ST"}]