[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "University Hall 121"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "33392", "title": "WCAS HISTORY 366-0-20 Race and Nation in the Independence Era", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "33392", "instructors": [{"instructor_phone": "847/491-7444", "instructor_name": "Paul F Ramirez", "instructor_addr": "Harris Hall Room 233"}], "topic": "", "course": "366-0", "descriptions": [{"name": "Overview of class", "value": "Spring 2016 topic: &quot;The Indian Problem&quot; Independence from Spain intensified longstanding debates about race, citizenship, and nation that remain ongoing in Latin America up to the present. Would people of American descent enjoy full citizenship in the new nation-states? What role would American civilizations, cultures, symbols, and languages play in forging national identities? This thematic survey of Latin America in the national era examines the political, cultural, ideological, and economic foundations of discrimination and inequality in the region. History 365 or an equivalent introduction to Latin America is encouraged, but not required."}, {"name": "Teaching Method", "value": "Lecture and discussion sections"}, {"name": "Evaluation Method", "value": "Position papers 20% <br/>Class participation 30% <br/>Mid-term exam 25% <br/>Historical essay 25%"}, {"name": "Class Materials (Required)", "value": "READING LIST: <br/>Brooke Larson, Trials of Nation Making: Liberalism, Race, and Ethnicity in the Andes, 1810-1910 (ISBN 0521567300) <br/><br/>Erin E. O'Connor and Leo Garofalo, Documenting Latin America: Gender, Race, and Nation, vol. 2 (ISBN 0132085089) <br/><br/>David Weber, Bárbaros: Spaniards and Their Savages in the Age of Enlightenment (ISBN 0300119917)"}, {"name": "Class Notes", "value": "Attendance at first class is mandatory<br/><br/>HISTORY AREA OF CONCENTRATION: Americas"}], "lmod": "4/3/16 8:03 PM (CT)", "subject": "HISTORY"}]