[{"class_mtg_info": [{"meet_t": "Tu 3:00PM - 5:50PM", "meet_l": "Kresge Centennial Hall 2-325"}], "school": "SoC", "enrl_requirement": "Enrollment Requirements: Reserved for Comm Studies juniors.  Majors who study abroad a full year may enroll senior year.  Comm_ST 394-0 may not be repeated.", "qtr": "Spring 2017", "name": "33043", "title": "SoC COMM_ST 394-0-22 Communication Studies Research Seminar", "class_attributes": "Department Majors Only<br/><br/>Juniors/Seniors Only<br/><br/>", "section": "33043", "topic": "Social Structure and Identity in Sci Fi Film &amp; TV", "course": "394-0", "descriptions": [{"name": "Overview of class", "value": "The Science Fiction genre?notoriously hard to classify though &quot;we know it when we see it&quot;- offers its audiences ways to see beyond their real societies. The conceit of being on a different planet or talking with intelligent aliens puts enough space between reality and story that social issues can be addressed in ways it is more difficult for realist narrative. This course studies &quot;Social Science Fiction&quot;, the sub-genre of Speculative Fiction (SF) which concentrates more on alternative social roles and structures than on space battles or futuristic technology. <br/>A number of approaches to SF film/TV history and criticism with an emphasis on social science fiction will be introduced. Students will be required to discover and use further research in order complete a 15-20 page term paper on social roles and structures in their object of study. This paper will make an argument about that object of study concentrating in one of three general areas: (1) History?the particulars to be negotiated with the instructor (2) Criticism- of a contemporary SF object or element [a film, tv show, series, genre, recurring character, etc] or (3) Reception- of a SF film or program or series by fans (e.g. fan-sites).<br/>Beyond furthering students' understanding of the topic, this seminar is intended to develop both academic and professional research and writing skills. Thus a good deal of the in-class work will concern formulating a clear, well focused claim (i.e. thesis), discerning and using credible, relevant and sufficient sources (both with and without Google), creating a coherent argument that follows from the claim and is supported by the research, and improving the quality of the writing itself (its flow, clarity, coherence, use of language, succinctness, etc.)<br/>Early drafts of the research question, bibliography, and the paper itself will be due during the term. These as well as the in-class participation and a one on one meeting with the instructor will constitute half the course grade. The final paper grade constitutes the second half."}, {"name": "Class Materials (Required)", "value": "No textbook"}], "lmod": "2/14/17 6:38 PM (CT)", "subject": "COMM_ST"}]