[{"class_mtg_info": [{"meet_t": "Mo 6:00PM - 8:50PM", "meet_l": "Meets in Non-General PurposeRm"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Winter 2017", "name": "27806", "title": "WCAS GEN_LA 280-6-23 Residence-Linked Seminar - VI (Literature and Fine Arts)", "class_attributes": "Permission of Instructor<br/><br/>", "section": "27806", "instructors": [{"instructor_phone": "847/491-8290", "instructor_name": "Ingrid   Zeller", "instructor_addr": "Kresge Hall, Rm 3319, 1880 Campus Drive"}], "topic": "Film Across Borders: The Berlin Connection", "course": "280-6", "descriptions": [{"name": "Overview of class", "value": "In this class, we will view and discuss contemporary German films<br/>since the fall of the Berlin Wall in 1989. Using the fascinating global<br/>city Berlin as a focal point and as a mirror for German history in the<br/>20th and 21st century, we will analyze films dealing with German<br/>Reunification (Goodbye Lenin, Lives of Others, Barbara) and Post-<br/>Reunification (Victoria, Kaddish for a Friend), while also discussing<br/>approaches to film analysis.<br/>As the Area VI requirement states, &quot;the course will help<br/>[students] understand how the attitudes, ideas, and values of<br/>individuals, groups, societies, or cultures are represented in their<br/>literature, arts, and other creative activities.&quot; In particular, we will<br/>trace how perspectives regarding East and West and regarding<br/>walls and borders are represented in German films and how these<br/>perspectives have changed in the last 25 years, both on a national<br/>as well as transnational level.<br/>In order to explore German-American connections on site,<br/>we will include an excursion to the Berlin Wall memorial in Lincoln<br/>Square at the Western El Stop along with a visit to additional sites in<br/>Lincoln Square's Germantown and including an ethnic culinary<br/>experience in a German restaurant. During the second part of the<br/>course, we plan another excursion to explore German-influenced<br/>architecture in Chicago with references to the films that we see<br/>and, depending on availability, we may plan a trip to the European<br/>film festival to watch a current German film."}, {"name": "Learning Objectives", "value": "After taking this course, students should be able to show they can:<br/><ul><br/><li> Be familiar with and able to use key concepts, language, and approaches related to film analysis.<br/></li><br/><li> Acquire knowledge and understanding regarding the history of German film, including movements, trends, directors, and actors and actresses.</li><br/><li> Be familiar with German history related to the Berlin Wall, reunification, and the current refugee crisis.</li><br/><li> Be able to discuss, critically evaluate, and interpret films involving German history and culture. </li><br/><li> Identify and learn to research German-American connections in Chicago.</li><br/><li> Critically evaluate the presence of national and transnational concerns in German cinema at a formal as well as thematic level.</li><br/><ul>"}, {"name": "Teaching Method", "value": "Lecture, discussion, readings, presentations"}, {"name": "Evaluation Method", "value": "Participation, short homework assignments, quizzes, essays, research project and presentation."}], "lmod": "12/29/16 6:58 PM (CT)", "subject": "GEN_LA"}]