[{"class_mtg_info": [{"meet_t": "Th 5:00PM - 7:20PM", "meet_l": "University Hall 318"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "23296", "title": "WCAS FRENCH 495-0-20 Practicum in Scholarly Writing, Publication, &amp; Research", "class_attributes": "Given in English<br/><br/>", "section": "23296", "instructors": [{"instructor_phone": "847/491-8255", "instructor_name": "Doris L Garraway", "instructor_addr": "1860 S. Campus Drive, Crowe Hall #2-179"}], "topic": "", "course": "495-0", "descriptions": [{"name": "Overview of class", "value": "In this course, students revise and expand a paper written in a previous course with an aim towards producing a work approaching publishable quality, of approximately 20-25 pages in length. While deepening students' knowledge of their chosen subject area, the course also provides students with a forum in which to work through some of the methodological challenges of academic research and writing. In the revised paper, students will develop an original argument relative to a significant problem or research question; demonstrate knowledge of relevant primary and secondary sources; engage critically with a well-defined theoretical methodology or scholarly corpus; and draw out clearly the significance of their findings. The class will meet regularly as a group for the purpose of discussion and feedback on individual work, and students will give short presentations on various aspects of their projects including the research methodology, the state of knowledge on their topics, and the contribution to the field. In addition, students will meet individually with the professor to discuss their progress. Work written in the quarter will be shared and discussed in the final meeting of the quarter. Taught in English. Although required for French Ph.D. students in the 2nd or 3rd year, this course is appropriate for graduate students across the humanities. The professor will contact enrolled students at least one week prior to the first meeting so as to solicit the paper they wish to develop in the seminar. Any student who enrolls after that date should contact the professor as soon as possible before the beginning of the quarter."}], "lmod": "1/9/16 6:47 PM (CT)", "subject": "FRENCH"}]