[{"class_mtg_info": [{"meet_t": "MoWe 5:00PM - 6:20PM", "meet_l": "University Hall 102"}], "school": "WCAS", "overview_of_class": "This course examines immigration to the United States and Europe through a sociological lens, with attention to the social, political, and historical contexts of immigration and the relationships between migrants and existing institutions and identities. The course will first outline the factors shaping migration patterns and compare immigration policies across time and space.  Next, we will explore debates around assimilation and other models of immigrant incorporation, and consider how gender, race, and ethnicity affect the reception and integration of migrants.  Finally, we will examine the consequences of immigration and transnationalism on nation-states and diasporic communities.", "qtr": "Winter 2016", "name": "Sociology of Immigration", "title": "WCAS SOCIOL 322-0-20 Sociology of Immigration", "lmod": "1/9/16 6:53 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Elizabeth Anne Onasch", "instructor_addr": ""}], "topic": "", "course": "322-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "This course examines immigration to the United States and Europe through a sociological lens, with attention to the social, political, and historical contexts of immigration and the relationships between migrants and existing institutions and identities. The course will first outline the factors shaping migration patterns and compare immigration policies across time and space. Next, we will explore debates around assimilation and other models of immigrant incorporation, and consider how gender, race, and ethnicity affect the reception and integration of migrants. Finally, we will examine the consequences of immigration and transnationalism on nation-states and diasporic communities."}, {"name": "Registration Requirements", "value": "During preregistration this course is only open to Sociology Majors &amp; Minors. <br/>This course is open to all students during regular registration starting November 16, 2015."}, {"name": "Class Materials (Required)", "value": "All materials for this course will be made available on Canvas. No purchase necessary."}], "path": "/class-descriptions/4610/WCAS/SOCIOL/322-0/23961", "instructor": ["Elizabeth Anne Onasch"], "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "id": "23961", "subject": "SOCIOL"}]