[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 11:50AM", "meet_l": "Locy Hall 318"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "31087", "title": "WCAS ITALIAN 275-0-20 Dante's Divine Comedy", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "31087", "instructors": [{"instructor_phone": "847/491-8259", "instructor_name": "Alessia   Ricciardi", "instructor_addr": "1860 S. Campus Drive, Crowe Hall #2-133"}], "associated_classes": [{"component": "DIS", "room": "Locy Hall 318", "meeting_time": "Fr 11:00AM - 11:50AM"}, {"component": "DIS", "room": "Locy Hall 303", "meeting_time": "Fr 2:00PM - 2:50PM"}], "topic": "", "course": "275-0", "descriptions": [{"name": "Overview of class", "value": "This course focuses primarily on exploring the first third of Dante's epic masterpiece while taking into account the structure of the entire work, including Parts 2 (Purgatory) and 3 (Paradise). Our reading of Inferno will examine the poem with an eye to determining its place within the cultural context of the late Middle Ages, especially in relation to the historical, artistic, philosophical, and socio-political dimensions of the text. A guiding concern of the discussion is to assess the ways in which Dante changed our understanding of the relationship between the human and the divine, sin and punishment, high and low style. How does Dante's writing encompass such a wide variety of experiences and disciplines while inventing an entirely new poetic language? Political turmoil, philosophical and theological paradigms, social and religious conflict all converge in the making of Inferno and will thus form crucial elements of our investigation. Reading is difficult, but not extensive. Taught in English."}, {"name": "Evaluation Method", "value": "1. Attendance, Preparation, Participation: Class attendance is crucial and preparation is needed to actively participate (20%) <br/>2. One-page responses: Two responses of one printed page in length each to a specific passage from a given canto, to be e-mailed to the instructor; one due before and one after the midterm (20%) <br/>3. Midterm exam (20%)<br/>4. Final exam (40%)"}, {"name": "Class Materials (Required)", "value": "1. Dante Alighieri, Inferno, Durling and Martinez edition (Oxford UP)<br/>2. Secondary material, almost all of which will be available online"}], "lmod": "4/3/16 8:10 PM (CT)", "subject": "ITALIAN"}]