[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "Harris Hall L28"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Winter 2017", "name": "21947", "title": "WCAS HISTORY 101-6-20 First-Year Seminar-European History", "class_attributes": "WCAS First-Year Seminar<br/><br/>Attendance at 1st class mandatory<br/><br/>Freshmen/Sophomores Only<br/><br/>", "section": "21947", "instructors": [{"instructor_phone": "847/491-7172", "instructor_name": "John Starkes   Bushnell", "instructor_addr": "Harris Hall - Room 204"}], "topic": "Stalinism", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "The seminar will grapple with the way in which Soviet citizens tried to make sense of what went on around them during the 1930s, a decade in which several million peasants died after their farms were collectivized, millions of innocent people were sentenced to forced labor in the Gulag prison camps, and another million or so were executed for political crimes they had not committed. We will read documents, diaries, and memoirs written during the 1930s but not published until much later."}, {"name": "Teaching Method", "value": "DiscussionReadingsWriting assignments"}, {"name": "Evaluation Method", "value": "Discussion section: 20%<br/>Writing assignments: 80%<br/>"}, {"name": "Class Materials (Required)", "value": "***Tentative until posted to Norris website***<br/>J. Arch Getty, Oleg V. Naumov, The Road to Terror. Stalin and the Self-Destruction of the Bolsheviks, 1932-1939. 9780300094035 (paperback)<br/>Veronique Garros, et al., Intimacy and Terror: Soviet Diaries of the 1930s. 9781565842006 (paperback)<br/>Miron Dolot, Execution by Hunger. The Hidden Holocaust. 9780393304167 (paperback)<br/>Sheila Fitzpatrick and Yuri Slezkine, eds., In the Shadow of Revolution: Life Stories of Russian Women from 1917 to the Second World War (2000). 9780691019495 (paperback)<br/>Nina Lugovskaya, Diary of a Soviet Schoolgirl: 1932-1937 THIS WILL BE AVAILABLE ONLY ON THE COURSE CANVAS SITE. IT IS NOT AVAILABLE FOR PURCHASE. You may be able to find a used copy through Amazon.com, abe.com, or other on-line book sellers (easier to read holding in your hands than reading on a computer screen).<br/>There will also be a few documents distributed in class."}, {"name": "Class Notes", "value": "AREA OF CONCENTRATION: Europe"}], "lmod": "12/24/16 6:59 PM (CT)", "subject": "HISTORY"}]