[{"class_mtg_info": [{"meet_t": "Tu 2:00PM - 4:50PM", "meet_l": "University Library Video Theat"}], "school": "SoC", "enrl_requirement": "Enrollment Requirements: Reserved for Communication Studies majors who are Sophomores, Juniors, or Seniors.", "qtr": "Spring 2017", "name": "32960", "title": "SoC COMM_ST 395-0-23 Topics in Communication Studies", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "32960", "instructors": [{"instructor_phone": "", "instructor_name": "Irving Jacob   Rein", "instructor_addr": ""}], "topic": "Crisis and Sports Management", "course": "395-0", "descriptions": [{"name": "Overview of class", "value": "Fan interest in sports has never been more intense or widespread. The sports industry is now a $762 billion business with many organizations generating record revenues from ticket sales, broadcast rights agreements, and corporate sponsorships. At the same time, teams and leagues are facing an increasing amount of domestic and foreign competition, as well as new threats to traditional revenue streams, even as the costs of doing business continue to rise. Complicating matters further, the 24-hour sports news cycle is dominated by issues of ethics and corruption, forcing athletes, teams, and leagues to constantly defend and justify their actions in the face of ongoing crises. This includes innovations in social media and mobile technologies that are allowing teams and leagues to increase the frequency and intensity of interactions with different audiences. Unprecedented challenges are making it more difficult for organizations to meet their objectives. The course will examine how best practice strategies impact areas such as brand identity, digital communication, revenue generation, crisis management, managing the narrative, and place marketing. Students will be evaluated on a midterm and final paper related to developing sports strategies."}, {"name": "Class Materials (Required)", "value": "Scorecasting: The Hidden Influences Behind How Sports Are Played and Games Are Won by Tobias Moskowitz and L. Jon Wertheim Publisher: Three Rivers Press; (2012). ISBN: 978-0-307-59179-1 <br/><br/>The Sports Strategist: Developing Leaders For A High Performance Industry by Irving Rein, Ben Shields, and Adam Grossman. Publisher: Oxford Press; (2015). ISBN-10: 978-0-19-934383-6;"}], "lmod": "2/9/17 6:37 PM (CT)", "subject": "COMM_ST"}]