[{"class_mtg_info": [{"meet_t": "TuSu 10:00AM - 11:50AM (AST)", "meet_l": "Carnegie Mellon Room 3035"}], "school": "DOHA", "enrl_requirement": "Enrollment Requirements: Registration is reserved for sophomore, juniors, and seniors only.", "qtr": "Spring 2016", "name": "30530", "title": "DOHA MIT 321-0-70 Radio/Tv/Film Authorship", "class_attributes": "", "section": "30530", "instructors": [{"instructor_phone": "", "instructor_name": "Kirsten Marie Pike", "instructor_addr": ""}], "topic": "Disney", "course": "321-0", "descriptions": [{"name": "Overview of class", "value": "<p>The name &quot;Disney&quot; has achieved nearly mythic status in international media and popular culture. For many, the name evokes treasured childhood memories of watching The Lion King or of discovering Mickey Mouse for the first time. Among film scholars, Disney cartoons represent some of the finest examples of carefully crafted, character-centered animation. For business professionals, the Walt Disney Company has come to symbolize a modern, competitive corporation that seeks to leverage its stories and characters across a range of media platforms in a global marketplace. While many people love Disney films and TV shows, Disney artifacts have also sparked controversy in different countries at different times in history. In order to provide at least a passing familiarity with popular Disney narratives, ideologies, and institutional practices and their significance within modern culture, this course offers a critical investigation of Disney TV shows, live-action and animated films, books, theme parks, advertisements, online media, and corporate materials from the 1930s to the present. One of the primary goals of the course is to explore Disney artifacts as industrial and aesthetic texts, paying particular attention to how ideas about identity, nation, consumerism, politics, authorship, and brand have been circulated to diverse audiences. Ultimately, we will examine how the form and function of Disney media has changed (or resisted change) over time, while also considering how historical factors have shaped the construction and reception of Disney media over the past 85 years.</p>"}, {"name": "Registration Requirements", "value": "<ul><br/><li>Prerequisites: None</li><br/><li>Sophomores and above</li><br/><li>Open for cross-registration</li><br/><li>Satisfies Contemporary Media Sequence</li><br/></ul>"}], "lmod": "4/3/16 7:15 PM (CT)", "subject": "MIT"}]