[{"class_mtg_info": [{"meet_t": "Tu 10:00AM - 1:00PM", "meet_l": "Technological Institute L150"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "37787", "title": "WCAS INTL_ST 390-0-26 Special Topics in International Studies", "class_attributes": "", "section": "37787", "instructors": [{"instructor_phone": "", "instructor_name": "Ayca   Alemdaroglu", "instructor_addr": ""}], "topic": "", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "This course explores historical formation of cities and citizenry in the Middle East since the 19th century. It studies urban development, economy, social classes and politics in Egypt and Turkey with a focus on two world-historical cities, Cairo and Istanbul. Drawing mostly on readings in history, anthropology and sociology, it examines how urban space in Egypt and Turkey was reconfigured through histories of colonialism, nationalism, developmentalism and globalization with a particular attention to the following topics: urban immigration, informality, gendered places, consumption, urban regeneration, local politics and branding the city. Throughout the course, these topics are studied in relation to two main questions: How do spatial changes engender new social practices and redefine cultural difference and vice versa?; How do power struggles at the intersection of local and global interests shape urban change? The course is designed for history, sociology, anthropology, political science and urban studies majors."}, {"name": "Learning Objectives", "value": "At the end of this course, the students will be able to: <br/>? Develop an interdisciplinary understanding of urban change in two major cities of the Middle East <br/>? Know the main historical periods and social factors in the shaping of urban space, urban society and culture in Turkey and Egypt <br/>? Acquire a critical understanding of broad generalizations <br/>? Obtain the knowledge of common sociological concepts that they could apply to understand other societies <br/>? Evaluate the merits of common media representations of the Middle East and its people"}, {"name": "Evaluation Method", "value": "Participation/discussion/presentation <br/>30% Response papers (4 papers of 2 pages) <br/>20% Final Project (~ 2000 words due 1) <br/>50% Interview Project or Review Project"}, {"name": "Class Materials (Required)", "value": "Readings will be available on reserve at the Green Library, on Coursework and online"}], "lmod": "4/3/16 8:09 PM (CT)", "subject": "INTL_ST"}]