[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "University Hall 102"}], "school": "WCAS", "overview_of_class": "\"Environmental Politics and Policy\" Designing and implementing effective environmental policies demands detailed attention to the complex nature of environmental challenges as well as a commitment to reflexivity and adaptation. This course considers the political, economic, ethical, legal, and institutional issues involved in environmental decision-making. We begin with an introduction to the foundations of environmental politics and policy We then examine the political and institutional landscapes that shape the emergence and uptake of environmental agendas. Next, drawing from US cases, we will consider the formation and implementation of different environmental policies across a range of topics, which may include natural resources, coastal and marine resources, endangered species, air and water pollution, energy, climate change, public lands, endangered species, hazardous waste, toxics, and fisheries, among others. We conclude with a look towards the future of environmental policy. This is an introductory level course designed to give students an understanding of important conceptual issues in environmental policy-making, as well as an overview of core policies related to the US.", "qtr": "Fall 2017", "name": "Special Topics in Environmental Policy and Culture", "title": "WCAS ENVR_POL 390-0-21 Special Topics in Environmental Policy and Culture", "lmod": "9/12/17 7:10 PM (CT)", "section": "21", "associated_classes": [{"component": "DIS", "room": "Frances Searle Building 2407", "meeting_time": "We 1:00PM - 1:50PM"}, {"component": "DIS", "room": "University Hall 102", "meeting_time": "We 1:00PM - 1:50PM"}, {"component": "DIS", "room": "Frances Searle Building 1441", "meeting_time": "We 4:00PM - 4:50PM"}, {"component": "DIS", "room": "Kresge Centennial Hall 2-415", "meeting_time": "We 4:00PM - 4:50PM"}], "topic": "Environmental Politics and Policy", "course": "390-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "\"Environmental Politics and Policy\" Designing and implementing effective environmental policies demands detailed attention to the complex nature of environmental challenges as well as a commitment to reflexivity and adaptation. This course considers the political, economic, ethical, legal, and institutional issues involved in environmental decision-making. We begin with an introduction to the foundations of environmental politics and policy We then examine the political and institutional landscapes that shape the emergence and uptake of environmental agendas. Next, drawing from US cases, we will consider the formation and implementation of different environmental policies across a range of topics, which may include natural resources, coastal and marine resources, endangered species, air and water pollution, energy, climate change, public lands, endangered species, hazardous waste, toxics, and fisheries, among others. We conclude with a look towards the future of environmental policy. This is an introductory level course designed to give students an understanding of important conceptual issues in environmental policy-making, as well as an overview of core policies related to the US."}, {"name": "Learning Objectives", "value": "The overarching objective of this interactive lecture-based course is to cultivate critical thinking and reading skills. By the end of this course students will be able to: (1) Prepare appropriately to participate effectively in class discussion, including challenging and offering substantive replies to others' arguments, comments, and questions, while remaining sensitive to the original speaker/writer and the classroom audience. (2) Students should become familiar with several different approaches to solving public policy problems, including their strengths and weaknesses. (3) Students should gain a basic understanding of core U.S. environmental policies (4) Students should gain a basic understanding of different views on several crucial debates in environmental policy today, including: o Are there \"limits to growth\"? o What are the causes and solutions of the \"Tragedy of the Commons\"? o What is the proper role of markets vs. regulation in solving environmental problems? o What is the proper role of the public and scientists in environmental policy making? o How should environmental policymakers deal with scientific uncertainty or complexity in addressing important environmental challenges? (5) Students will practice writing and analytical skills to effectively communicate their ideas, opinions, and arguments on different environmental policy topics."}, {"name": "Teaching Method", "value": "Lecture and Discussion Sections"}, {"name": "Evaluation Method", "value": "Assignments include shorter reading and in-class assignments, a written policy analysis in three parts, a midterm exam, a group policy project, and a final exam."}, {"name": "Class Materials (Required)", "value": "(1) Walter A. Rosenbaum. (2017). Environmental Politics and Policy, 10th edition. CQ Press: Washington, DC. ISBM-13: 879-1-5063-4537-6. (2) Judith Layzer. (2016). The Environmental Case: Translating Values Into Policy, 4th edition. CQ Press: Washington, DC. ISBN-13: 978-1-4522-3989-7."}], "instructor": ["Kimberly Ruggles Marion Suiseeya"], "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "id": "16634", "subject": "ENVR_POL"}, {"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "Locy Hall 314"}], "school": "WCAS", "overview_of_class": "This class involves the intersection of religion, law, cultural preservation, land management, and ethnoecology. We will focus on Native American sacred sites and cultural landscapes and their relationship to land, ceremony, history, and tribal/ethnic identity. Central to the class will be a focus on the sacred aspects of tribal identity and the role that landscape plays in the creation and maintenance of these identities. The class will cover laws pertaining to religious freedoms and how they are applied to Native and non-Native contexts throughout U.S. history, along with the histories and philosophies that have, and still influences these polices. <br/><br/>The class will cover both Federal and Tribal management of sacred sites, ceremonial sites, and religious/spiritual traditions. Important to this discuss, will be the role of oral history in the preservation of culture and relationships to landscapes and how it has/is being utilized the U.S. legal system pertaining to Native American Tribes. The role of treaties and the conflicts that arise between Tribal/U.S. government to government relations and responsibilities will also be covered.", "qtr": "Fall 2017", "name": "Special Topics in Environmental Policy and Culture", "title": "WCAS ENVR_POL 390-0-22 Special Topics in Environmental Policy and Culture", "lmod": "9/12/17 7:10 PM (CT)", "section": "22", "topic": "Land, Identity and the Sacred", "course": "390-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "This class involves the intersection of religion, law, cultural preservation, land management, and ethnoecology. We will focus on Native American sacred sites and cultural landscapes and their relationship to land, ceremony, history, and tribal/ethnic identity. Central to the class will be a focus on the sacred aspects of tribal identity and the role that landscape plays in the creation and maintenance of these identities. The class will cover laws pertaining to religious freedoms and how they are applied to Native and non-Native contexts throughout U.S. history, along with the histories and philosophies that have, and still influences these polices. <br/><br/>The class will cover both Federal and Tribal management of sacred sites, ceremonial sites, and religious/spiritual traditions. Important to this discuss, will be the role of oral history in the preservation of culture and relationships to landscapes and how it has/is being utilized the U.S. legal system pertaining to Native American Tribes. The role of treaties and the conflicts that arise between Tribal/U.S. government to government relations and responsibilities will also be covered."}, {"name": "Registration Requirements", "value": "Native American and Indigenous Studies, Cultural Resource Management, Anthropology, Religious Studies, Law and Policy, Ethnohistory, Oral history, Tribal Cultural Resource Management,"}, {"name": "Learning Objectives", "value": "Students will have an understanding of tribal cultural resource management, Native American perspectives of land, religion in law and policy, sacred site management and preservation."}, {"name": "Teaching Method", "value": "DiscussionLecture"}, {"name": "Evaluation Method", "value": "Midterm and Final paper, point system and Letter Grade"}, {"name": "Class Materials (Required)", "value": "There will be five books required for this class. <br/>? Worship and Wilderness: Culture, Religion, and Law in Public Lands Management. Lloyd Burton<br/>? Tribal Cultural Resource Management: The Full Circle to Stewardship. Darby Stapp and Michael Burney<br/>? Grave Injustice: The American Indian Repatriation Movement and NAGPR. Kathleen Fine-Dare.<br/>? Places That Count: Traditional Cultural Properties in Cultural Resource Management. Thomas F. King.<br/>? Oral Tradition as History. Jan Vansina<br/>Along with the required books, the instructor will assign supplementary articles in PDF format."}], "instructor": ["Eli S Suzukovich III"], "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "id": "17460", "subject": "ENVR_POL"}]