[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "Harris Hall L06"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-registration is reserved for students majoring or minoring in Asian Languages &amp; Cultures, Asian Studies, or International Studies.", "qtr": "Spring 2017", "name": "32524", "title": "WCAS ASIAN_LC 390-0-20 Advanced Topics in Asian Languages and Cultures", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "32524", "instructors": [{"instructor_phone": "847/467-5829", "instructor_name": "Daniel Joseph Majchrowicz", "instructor_addr": "1880 Campus Drive, Kresge Hall, Office 4-423"}], "topic": "This is not that dawn??: The Partition of India an", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "In August 1947, as the sun set on Britain's Indian empire, the subcontinent was partitioned into two newly-created, independent nations: India and Pakistan. The division into two territories -one Hindu-majority, the other Muslim-majority - was accompanied by perhaps the largest migration in human history. Millions moved from one territory to the other, often against their will, as hundreds of thousands were killed in the ensuing chaos. The unprecedented violence of Partition - physical, emotional, social - profoundly shaped the national identities of India and Pakistan, permanently restructured the texture of everyday life and altered the global political order. From border disputes in Kashmir to ongoing cross-border migration to unresolved conflicts over identity and belonging, the conflicts engendered by Partition continue to shape the region today.<br/><br/>Unsurprisingly, then, Partition and its legacy have been the subject of extensive engagement in literature, film, popular culture and even TV advertisements. This class will examine how Partition has been engaged in literature and popular culture, moving from contemporary depictions from the late 1940s to its continued invocation in India, Pakistan and Bangladesh today. We will read these texts alongside the extensive body of scholarship on Partition from History, Anthropology and Gender Studies with particular attention to the historiography of Partition and South Asian nationalisms. Throughout, we will engage with the idea of Partition as an &quot;event&quot; and ask how Partition continues to inflect life in South Asia and beyond today. "}, {"name": "Learning Objectives", "value": "- Critically engage with scholarship on Partition and nationalism in South Asia <br/>- Gain a familiarity of artistic and literary approaches to Partition from across national, linguistic and religious traditions<br/>- Integrate and analyze approaches to a single ?event' from a range of disciplinary perspectives"}, {"name": "Teaching Method", "value": "Lecture and Discussion"}, {"name": "Evaluation Method", "value": "Paper submissions, short response"}, {"name": "Class Materials (Required)", "value": "Material will be available on Canvas."}], "lmod": "2/12/17 6:50 PM (CT)", "subject": "ASIAN_LC"}]