[{"school": "WCAS", "overview_of_class": "Inequalities, their varied forms, reproduction, transformations and, potentially, eradication - have been core concerns of sociology since its inception as a discipline. However, attention to the particular dimension of class has grown dramatically in recent years, both in sociology and in other social science disciplines. In this seminar, we take an interdisciplinary approach and integrate this newer focus on class with ongoing research on other dimensions of inequality. We also focus on the role of politics - broadly construed to include systems of beliefs and ideology, culture, electoral systems, social movements, states - in creating, sustaining or eroding inequalities of various kinds.", "name": "Topics in Sociological Analysis", "section": "20", "topic": "Professional Writing Seminar", "course": "476-0", "meeting_time": ["Th 2:00PM - 4:50PM"], "path": "/class-descriptions/4650/WCAS/SOCIOL/476-0/24699", "instructor": ["Charles M Camic"], "id": "24699", "subject": "SOCIOL"}, {"school": "WCAS", "overview_of_class": "In this seminar we will consider how one formulates a research questions and puts evidence together in order to investigate specific instances of the culture-society interaction and, from doing so, to assess cultural theory. The course is for students who (1) have a background in cultural sociology (usually by having taken SOC 420), and (2) have a research project involving culture, one that is either already underway or in the planning stages. All participants must be actively engaged in a piece of cultural research (dissertation proposal, second-year paper, etc.), at least for the duration of the course itself. The goal is to create a productive interplay between research activities and methodological awareness.", "name": "Topics in Sociological Analysis", "section": "23", "topic": "Cultural Methods", "course": "476-0", "meeting_time": ["Th 9:00AM - 12:00PM"], "path": "/class-descriptions/4650/WCAS/SOCIOL/476-0/24701", "instructor": ["Wendy   Griswold"], "id": "24701", "subject": "SOCIOL"}]