[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Technological Institute AUD"}], "school": "WCAS", "overview_of_class": "Earth science encompasses the geology, chemistry, biology, and physics of our planet, while appreciating its beauty. <br/><br/>Environmental degradation, natural resources, energy, climate change, and geologic hazards are among the most pressing issues facing society in the 21st century. This course introduces students to Earth science through topical lectures and discussion of current events and research in Earth science. <br/><br/>Topics include formation, evolution, structure, and composition of the Earth, plate tectonics and the rock cycle, the water cycle, climate change, paleoclimate, peak oil and fracking, renewable energy, nuclear fuel cycle and policy, geology of the National Parks, and job prospects in Earth science.", "qtr": "Fall 2016", "name": "Earth Science for the 21st Century", "title": "WCAS EARTH 101-0-01 Earth Science for the 21st Century", "lmod": "10/30/16 7:02 PM (CT)", "section": "01", "instructors": [{"instructor_phone": "847.467.1825", "instructor_name": "Steven Dollard Jacobsen", "instructor_addr": "Tech F297"}], "topic": "", "course": "101-0", "enrl_requirement": "Enrollment Requirements: Registration restricted to Undergraduate students only", "descriptions": [{"name": "Overview of class", "value": "Earth science encompasses the geology, chemistry, biology, and physics of our planet, while appreciating its beauty. <br/><br/>Environmental degradation, natural resources, energy, climate change, and geologic hazards are among the most pressing issues facing society in the 21st century. This course introduces students to Earth science through topical lectures and discussion of current events and research in Earth science. <br/><br/>Topics include formation, evolution, structure, and composition of the Earth, plate tectonics and the rock cycle, the water cycle, climate change, paleoclimate, peak oil and fracking, renewable energy, nuclear fuel cycle and policy, geology of the National Parks, and job prospects in Earth science."}, {"name": "Registration Requirements", "value": "Class Note: Remaining seats in the course are restricted to First-year and Sophomore Students."}, {"name": "Learning Objectives", "value": "<br/>Students attending this class will:<br/><br/>1. Obtain fundamental knowledge on subjects including:<br/>Formation and evolution of the Earth, composition of the Earth, geological hazards, plate tectonics, the rock cycle, the water cycle, oil formation and reserves, fracking, renewable energy, rare Earth elements, nuclear technology and policy, geology of the National Parks, and learn about job and career opportunities in Earth science. <br/>2. Critically evaluate interpretations of scientific data, especially regarding climate change. <br/>3. Engage in discussion and debate on topical issues such as peak oil and fracking. <br/>4. Engage in Q&amp;A with Dr. Mark Peters, Associate Director of the Energy and Global Security Directorate at Argonne National Laboratory. Dr. Peters is one of the world's leading experts on nuclear technology and policy, and often testifies before Congress."}, {"name": "Teaching Method", "value": "Weekly quizzes based on lecture worth 60% of final grade, homework exercises worth 20%, and final exam worth 20%. No midterm."}, {"name": "Evaluation Method", "value": "<br/>Weekly quizzes based on lecture worth 60% of final grade, homework exercises worth 20%, and final exam worth 20%. No midterm."}, {"name": "Class Notes", "value": "Letter grade only. No textbook is required for this course.<br/>Remaining seats in the course are restricted to First-year and Sophomore Students. All others interested in the course must complete the department waitlist in order to be considered for the course: http://bit.ly/1NAGeat"}], "path": "/class-descriptions/4640/WCAS/EARTH/101-0/11197", "instructor": ["Steven Dollard Jacobsen"], "class_attributes": "Natural Sciences Distro Area<br/><br/>See Class Details for Important Registration Info<br/><br/>", "id": "11197", "subject": "EARTH"}]