[{"school": "JOUR", "overview_of_class": "Digital Analytics course delivers an applied understanding of digital analytics tools, methods and organizational approaches that will let students connect the dots between digital analytics and digital communications strategy, design and delivery. The goal of the course is to give students the capability to lead the evolution of digital marketing practices in their organizations through an understanding of the collection and application of data to solve marketing problems. Students will have exposure to an array of the most current digital analytics tools, and will conduct exercises and engage in discussions that illustrate how data and analytics should ideally shape marketing planning, content strategy, digital design and marketing performance evaluation. The course will cover the collection of data from web, email, social, mobile and paid display media through tagging, testing and survey, and will explore the marketing and business application of this data for performance evaluation, communications planning, design and content development &amp; targeting. The application of marketing analytics in the overall emerging &quot;big data&quot; structures in organizations will be explored. The progression toward increasing capabilities for real-time 1:1 marketing through algorithmic targeting and content personalization will also be discussed in this context, as will the ever changing privacy landscape and questions around who &quot;owns&quot; consumers' digital data.", "name": "Practicum", "section": "21", "topic": "Digital Analytics", "course": "498-0", "meeting_time": ["Mo 9:00AM - 11:50AM"], "path": "/class-descriptions/4620/JOUR/IMC/498-0/31199", "instructor": ["Scot Rexford Wheeler"], "id": "31199", "subject": "IMC"}, {"school": "JOUR", "overview_of_class": "Sports Marketing provides an understanding of the key concepts and methods in marketing communications in both traditional and digital media within the world of sports. The course provides students with the development and execution of communications strategies for any sports organization with added opportunities to learn the marketing environments that pertain to sports including organizations, leagues and brands. Primary emphasis is placed on consumer engagement, branding, market segmentation and positioning, message strategy, promotion, financial analysis and the execution of marketing strategies in the context of sport. Students will develop an understanding of how marketing works in sports through readings, lectures, case analysis and discussions with guest experts.", "name": "Practicum", "section": "22", "topic": "Sports Marketing", "course": "498-0", "meeting_time": ["We 6:00PM - 8:50PM"], "path": "/class-descriptions/4620/JOUR/IMC/498-0/31200", "instructor": ["Candy   Lee"], "id": "31200", "subject": "IMC"}, {"school": "JOUR", "overview_of_class": "", "name": "Practicum", "section": "23", "topic": "Content Analytics", "course": "498-0", "meeting_time": ["Mo 6:00PM - 8:50PM"], "path": "/class-descriptions/4620/JOUR/IMC/498-0/31201", "instructor": ["Richard   Gordon"], "id": "31201", "subject": "IMC"}, {"school": "JOUR", "overview_of_class": "This course offers an introduction to visual communication principles, aesthetics, research and applications in the field. The course will examine methods for effective communication using images and design as a language. It prepares students for further study in photojournalism, video storytelling, publication design and interactive storytelling. The class will follow the narrative arc of visual storytelling from the ancient 32,000 year old Chauvet Cave paintings in southern France all the way to the sophisticated eye track activity recognition systems that influence modern design. Students will learn and apply Gestalt theory to design problems and expand their visual lexicon. Photo history will be brought into context with the larger visual narrative and explore how light, shape, form and composition help communicate complex thought and emotion. Guest lecturers will frequent the class giving insight into how visual language is used to communicate and report beyond words.", "name": "Practicum", "section": "24", "topic": "Visual Literacy", "course": "498-0", "meeting_time": ["We 1:30PM - 4:20PM"], "path": "/class-descriptions/4620/JOUR/IMC/498-0/31202", "instructor": ["Susan Yvonne   Curtis"], "id": "31202", "subject": "IMC"}, {"school": "JOUR", "overview_of_class": "", "name": "Practicum", "section": "25", "topic": "Narrative Structure in Storytelling", "course": "498-0", "meeting_time": ["Mo 9:00AM - 11:50AM"], "path": "/class-descriptions/4620/JOUR/IMC/498-0/31203", "instructor": ["Patti Lynne Wolter"], "id": "31203", "subject": "IMC"}, {"school": "JOUR", "overview_of_class": "", "name": "Practicum", "section": "26", "topic": "Narrative Structure in Storytelling", "course": "498-0", "meeting_time": ["Mo 9:00AM - 11:50AM"], "path": "/class-descriptions/4620/JOUR/IMC/498-0/31204", "instructor": ["Patti Lynne Wolter"], "id": "31204", "subject": "IMC"}, {"school": "JOUR", "overview_of_class": "The IMC Capstone course provides students the opportunity to bring all their course learning together to develop an integrated marketing communications program for a real-world client. Student teams will receive a brand challenge briefing directly from the client, and then work with faculty guidance through key stages to develop a marketing communications program to address brand needs. Along the way students will clarify the marketing objective, use qualitative and quantitative means to understand consumers, uncover brand building insights, identify an integrating idea, hold a strategic work session with the client, solidify brand positioning and develop a winning message strategy that includes creative content, consumer engagement platforms and measurement. Teams will compete to &quot;win the business&quot; and finish the quarter with a formal presentation of their recommended IMC plan directly to the client. Three faculty members with complementary experience in brand strategy, digital communications and creative development will share lecture and student engagement opportunities.", "name": "Practicum", "section": "27", "topic": "IMC Capstone Project", "course": "498-0", "meeting_time": ["Tu 6:00PM - 8:50PM"], "path": "/class-descriptions/4620/JOUR/IMC/498-0/31205", "instructor": ["James Edward Lecinski", "Marshall R Kohr", "Daniel Wayne Fietsam"], "id": "31205", "subject": "IMC"}, {"school": "JOUR", "overview_of_class": "What is the difference between the master and the novice? The master has failed more times than the novice has even tried. Creating Outstanding Digital Experiences is a pragmatic introduction to creating code for digital content. Today's digital culture is being created directly by its consumers. Empowered by easy, elegant, and effective open web technologies, it has never been more possible to personally transform ideas into objects and strategies into software. The course is designed for complete beginners, with little or no programming experience. A hands-on learning lab approach demystifies the jargon and simplifies the complexity of HTML5, CSS3, and a sprinkling of Javascript. Students will discover for themselves that &quot;making is thinking&quot; as they explore the art and science of crafting delightful and useful digital content.", "name": "Practicum", "section": "28", "topic": "Creating Outstanding Digital Experiences", "course": "498-0", "meeting_time": ["Th 9:00AM - 11:50AM"], "path": "/class-descriptions/4620/JOUR/IMC/498-0/31206", "instructor": ["Andrew S Hullinger"], "id": "31206", "subject": "IMC"}, {"school": "JOUR", "overview_of_class": "Data Privacy and Security: Critical Issues in Digital Marketing Communications: In the era of highly publicized privacy violations and data breaches, led by Google, Facebook, Target and Sony, a growing number of companies have faced costly regulatory enforcement actions and class action law suits for their misuse of and the misappropriation of their customer data. These events have resulted in an erosion of customer confidence levels and have had a devastating effect on their business performance.<br/><br/> This class will focus on the areas of data privacy and data security, potentially the biggest &quot;data&quot; issues that marketing communications professionals will face over the course of their careers. As such, the class will address the rapid move of companies toward digital marketing efforts, and the coming world of connected devices in the Internet of Things. It will highlight areas of risk that all marketing professionals should understand, emphasize ways to reduce and avoid these risks, and outline the consequences and costs that accompany serious privacy violations and data breaches.", "name": "Practicum", "section": "29", "topic": "Data Privay &amp; Security: Issues in Digtl Mktg", "course": "498-0", "meeting_time": ["Tu 12:00PM - 2:50PM"], "path": "/class-descriptions/4620/JOUR/IMC/498-0/37707", "instructor": ["Thomas H Hayden"], "id": "37707", "subject": "IMC"}]