[{"class_mtg_info": [{"meet_t": "MoWe 12:30PM - 1:50PM", "meet_l": "Wirtz Center Ballroom"}], "school": "SoC", "enrl_requirement": "", "qtr": "Winter 2017", "name": "21920", "title": "SoC DANCE 250-0-20 Modern II", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "21920", "instructors": [{"instructor_phone": "", "instructor_name": "Erin Dawn Barnett", "instructor_addr": ""}], "topic": "", "course": "250-0", "descriptions": [{"name": "Overview of class", "value": "This course will explore Modern Dance under the umbrella of Martha Graham, Katherine Dunham and Garth Fagan technique, some of the historical context from which it developed, and is currently performed. This Modern technique class will offer all the elements of a level II technique class through a historical lens and focus on the impact of these influential Modern Dance pioneers. Through the use of the floor, standing, across the floor sequences, students will explore more advanced dance etiquette, and terminology necessary to develop technique. The focus of this course is on developing flexibility, strength and stamina. Throughout this course we will explore the use of the back in order to gain a larger sense of the use of the torso/spine in modern dance. Students will also gain an understanding of the important contributions these choreographers, among others, have had on the development of modern dance. Complementary material such as videos and readings will be used in order to enhance the students experience in class."}, {"name": "Registration Requirements", "value": "Must have been placed in level II or with instructor permission."}, {"name": "Learning Objectives", "value": "Students will be able to:<br/> demonstrate a Graham contraction during floor/standing exercises and across the floor sequences <br/> demonstrate a Fagan spiral sequence during the floor exercises <br/> demonstrate a Dunham flat back and undulation sequence during the standing exercises and across the floor sequences <br/> demonstrate a Cunningham warm up standing sequence<br/>identify and demonstrate how Fagan technique has incorporated the Graham contraction, the Dunham undulation and the off center movement of Cunningham into his movement vocabulary <br/> perform movement sequences created by the instructor that include Graham, Dunham, Cunningham and Fagan vocabulary <br/> demonstrate a higher level of confidence, efficiency, clarity and speed with their dancing"}, {"name": "Class Materials (Required)", "value": "No dance shoes are required for this course. Simple leotards, footless tights/unitards are required. Well-fitted socks, sweatpants, T-shirts and sweatshirts are acceptable only during the floor warm-up combinations. Hair must be secured behind face at all times."}], "lmod": "12/24/16 6:46 PM (CT)", "subject": "DANCE"}]