[{"school": "WCAS", "overview_of_class": "Few literatures can have been more isolated and isolating than Modern Hebrew Literature in its formative years in Europe in the late nineteenth and early twentieth centuries. Young Jewish men are afforded a glimpse of the intellectual vistas lying beyond the stifling confines of the traditional Jewish shtetl. Reviled in these traditional communities as \"heretics\" they sought refuge from ostracism, persecution, in the tenements and boarding-houses of the metropolises of Europe. Umbilically attached to an unspoken language these outsiders wrote in full awareness that their potential audience consisted largely of each other. This \"imagined community\" was an exclusively male domain; the handful of female Hebrew writers in the Europe constituted an absolute anomaly. <br/><br/>It was in the erotic realm that this isolation reached its fullest literary summation, especially in the figure of the \"Talush\" (\"the uprooted man\") which placed center stage effeminate, masochistic Jewish men often subordinated by ruthless gentile women. This literature breathed of sexual anxiety.<br/><br/>The course aims to explore the poetic, the ideological and the gender implications of the interwoven themes of eros and isolation in Hebrew Literature from the turn of the 19th century to the present day. In doing so, we shall study the migration of these themes along with Hebrew Literature itself from Europe to Palestine and ultimately the State of Israel. Has the rebuilding of the national \"Home\" brought the uprooted man his long lost masculinity? And how did the female writer incorporate/become incorporated by the \"Talush\" narrative? How do we account for the longevity of this sad and pathetic figure? This course provides an excellent introduction to Modern Hebrew Literature per se: we shall read classic texts by M.Y. Berdichevsky, Y.H. Brenner, S.Y. Agnon, alongside excerpts from contemporary bestselling Israeli novels by Amos Oz, Ya'akov Shabtai and others.", "name": "Modern Hebrew Literature in Translation", "section": "1", "location": "Kresge Centennial Hall 2-415", "topic": "Tales of Love and Darkness", "course": "278-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4650/WCAS/JWSH_ST/278-0/20551", "instructor": ["Marcus G Moseley"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "20551", "subject": "JWSH_ST"}, {"school": "WCAS", "overview_of_class": "In this course we will take a close look at Israeli works of fiction and poetry, in English translation. We will ask: What is the role of literature in political conflict, and in a state of war? Students will not only learn about the historical context of Israeli literature post-1948, but will be introduced to the meta-literary questions of political discourse and minor literature. We will problematize notions of national narrative and national literature, discussing and analyzing the main issues with which this literature engages, such as the national subject, gender, self and other, identity and counter identity. We will read texts from a variety of times and contexts written by, inter alia: S. Yizhar, Amos Oz and Dalia Ravikovitch. In addition, the course will introduce the case of Palestinian authors writing in Hebrew, through texts by Anton Shammas, Salman Masalha and Sayed Kashua.", "name": "Modern Hebrew Literature in Translation", "section": "2", "location": "Swift Hall 107", "topic": "The Pen and the Sword: Israeli Literature of War", "course": "278-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4650/WCAS/JWSH_ST/278-0/20552", "instructor": ["Yael   Dekel"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "20552", "subject": "JWSH_ST"}]