[{"class_mtg_info": [{"meet_t": "Th 2:00PM - 4:50PM", "meet_l": "Harris Hall L40"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Graduate Students.", "qtr": "Winter 2017", "name": "22060", "title": "WCAS HISTORY 410-2-20 General Field Seminar in American History", "class_attributes": "Prerequisites apply, see description<br/><br/>Graduate Students Only<br/><br/>", "section": "22060", "instructors": [{"instructor_phone": "847/491-7262", "instructor_name": "Henry Claxton   Binford", "instructor_addr": "Harris Hall - Room 240"}], "topic": "", "course": "410-2", "descriptions": [{"name": "Overview of class", "value": "This course is the second element in the three-quarter sequence required of first-year U. S. history doctoral students, and intended to prepare them for later work as teachers and scholars. The winter quarter is designed to introduce students to recent scholarship on major issues in the history of the nineteenth century United States, and to acquaint them with the evolution of scholarly thinking concerning those issues. Students will be expected to become solidly acquainted with important topics (such as the American experience of industrialization, the evolution of slavery and responses to it, the Civil War/Reconstruction crisis, and the relationships between late nineteenth-century economic change and issues of race, class, and gender), and to engage critically with historiographic approaches to those topics. Although the focus will always be on the United States, we will in every case consider how expanding scholarly attention to the international context has enriched and complicated the study of this nation's history.<br/><br/>This is a seminar, involving class discussion driven by student initiatives. Each week the class will consider a core reading or readings, and one or two supplementary readings. Everyone will read the core assignment, and students will take turns presenting a critical summary of one set of supplementary readings and leading the discussion of those works. Every student will thus have three or four turns as leader. These presentations will account for 25% of the grade. In any given week, those students who are NOT leading the discussion should submit an ungraded, one-page response paper dealing with the central required reading for that session. By the end of the fifth week (Friday, February 6), every student will submit a 2-3 page critical review of the reading(s) for ONE of sessions in which s/he has served as leader. By the end of last week of classes (March 12), every student will submit a 5-page paper on a topic related to readings to that point (25% of grade). At the end of the course (march 18) every student will submit a 10-12 page paper defining and analyzing a central problem in nineteenth century U.S. history (50% of grade). Students will choose topics for these papers in close consultation with the instructor, and will be expected to demonstrate a thorough familiarity with the scholarship and the issues related to the chosen topic, including readings beyond those assigned in the course. I will provide additional bibliography."}, {"name": "Teaching Method", "value": "Field workSeminar"}, {"name": "Evaluation Method", "value": "Paper, finalReadings"}, {"name": "Class Materials (Required)", "value": "***Tentative until posted to Norris website***<br/>TBA"}], "lmod": "12/24/16 7:01 PM (CT)", "subject": "HISTORY"}]