[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Locy Hall 301"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Registration is reserved for Philosophy PhD Graduate Students", "qtr": "Spring 2016", "name": "31494", "title": "WCAS PHIL 310-0-21 Studies in Ancient Philosophy", "class_attributes": "Graduate Students Only<br/><br/>", "section": "31494", "instructors": [{"instructor_phone": "8474677536", "instructor_name": "David Buckley Ebrey", "instructor_addr": "Crowe 1-103"}], "topic": "On the Soul: Aristotle's Philosophy of Mind and Bi", "course": "310-0", "descriptions": [{"name": "Overview of class", "value": "Title: On the Soul: Aristotle's Philosophy of Mind and Biology<br/><br/>In this class we will be thinking about Aristotle's views about the nature of the soul. What are the central features of the soul and how does it relate to the body? Aristotle argues that the soul explains why plants and animals live in the way that they do. What are the distinctive features of living organisms? Aristotle argues that perception and locomotion are distinctive to animals, and thinking is distinctive to humans. We will closely examine his accounts of perception, locomotion, and thought. We will consider broadly what he thinks is the relationship between the soul and the body. Near the end of the course, we will also consider some of his detailed works like &quot;On Sleep and Dreams&quot; where he discusses phenomena that he says arise jointly from the soul and the body."}, {"name": "Learning Objectives", "value": "Basic knowledge of Aristotle's views about the soul, psychology, and life Develop close reading skills Develop thesis-driven paper writing."}, {"name": "Teaching Method", "value": "Group workSeminar"}, {"name": "Evaluation Method", "value": "Weekly assignments and two papers"}, {"name": "Class Materials (Required)", "value": "Aristotle: De Anima (trans. Shields) 978-0199243457"}], "lmod": "4/3/16 8:13 PM (CT)", "subject": "PHIL"}]