[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Technological Institute M345"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "33838", "title": "WCAS ENVR_SCI 201-0-20 Earth: A Habitable Planet", "class_attributes": "Natural Sciences Distro Area<br/><br/>", "section": "33838", "instructors": [{"instructor_phone": "847.491.7460", "instructor_name": "Patricia A Beddows", "instructor_addr": "Tech F295"}], "topic": "", "course": "201-0", "descriptions": [{"name": "Overview of class", "value": "This course provides an overview of the physical processes governing environmental systems, from the Earth's lithosphere to hydrosphere to atmosphere. We will cover internal and external sources of energy to the Earth system; the processes from tectonic to atmospheric that are driven by that energy; and some human impacts on the resulting environmental systems. Students will gain physical science perspectives on current debates about environmental issues, such as those over water resources, energy, and climate change."}, {"name": "Learning Objectives", "value": "Upon completion of this course students will be able to: <br/><br/>- Describe the bio-geo-physico-chemical processes that maintain the Earth in a homeostatic and dynamic state.<br/>- Recognize the complexity of the Earth system and the interdependence of environmental processes. <br/> - Apply a scientific approach to the investigation of events in daily life.<br/>- Analyze a specific environmental situation within a large context. <br/>- Assess how current and future human activities may affect the Earth System."}, {"name": "Teaching Method", "value": "Class will be lecture-based, but class periods will also include discussions and exercises that require thoughtful student participation. Students are expected to complete all assigned reading before class in order to contribute to discussions and required in-class exercises. Lectures will highlight and expand upon the most important topics in the assigned readings, but will not cover every topic covered in readings; likewise, some topics covered in lecture will not be covered in readings. Exams will cover all of the material from both lectures and readings. Therefore, success in this class requires both careful reading of assigned materials AND alert attendance in class."}, {"name": "Class Materials (Required)", "value": "Textbook: Brian J. Skinner and Barbara W. Murck, 2011. The Blue Planet: An Introduction to Earth System Science. 3rd Edition. Publisher: John Wiley &amp; Sons. Available at the University bookstore, online used and new, and as a digital e-book. IMPORTANT: Read the 3rd Edition of this textbook, published in 2011 in hardcover (or as a digital e-book)."}], "lmod": "2/21/17 6:46 PM (CT)", "subject": "ENVR_SCI"}]