[{"class_mtg_info": [{"meet_t": "MoWeFr 11:00AM - 11:50AM", "meet_l": "Harris Hall L05"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores<br/>Add Consent: Department Consent Required<br/>", "qtr": "Spring 2016", "name": "31145", "title": "WCAS GERMAN 104-6-20 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "31145", "instructors": [{"instructor_phone": "847/491-7249", "instructor_name": "Benjamin Lewis   Robinson", "instructor_addr": "1800 Sherman, Suite 106"}], "topic": "Like a dog: Kafka?s Resonance", "course": "104-6", "descriptions": [{"name": "Overview of class", "value": "&quot;Like a dog&quot; - Kafka`s Resonance in Literature, Film, and Philosophy<br/><br/>Kafka`s great novel The Trial ends with the famous line that coincides with the protagonist's execution: &quot;Like a dog. It was as if the shame would outlive him.&quot; This course will reflect on the extraordinary force of Kafka`s figure of the dog with attention to a diverse selection of works of literature, film, and philosophy. We will explore how and why the figure of the dog emerges, as it does explicitly in Kafka, to solicit an examination of the limits of what we consider to be our humanity. For dogs seem to present the most enduring figures at once of intimate domestic attachment, and of social degradation and exclusion. From domestic dogs to wild wolves, and from Kafka`s Prague and mid-century London to contemporary Mexico City and South Africa, we will consider the figure of the dog insofar as it articulates discriminations within human societies, including race, class, and gender, as well as demarcating the distinction between the inside and the outside of the human community in general. Reflecting on the global reverberations of Kafka`s phrase, we will look at the ambivalent status of dogs and the humaneness of human relations to them, but also of the doggishness of human beings in their often inhuman or inhumane and in any case shameful relations to one another as well as to animals."}, {"name": "Registration Requirements", "value": "This is a discussion-based course intended to introduce students to the study of literature and film with a philosophical or theoretical bent. Emphasis will be placed on developing techniques for &quot;close reading&quot; literature and film - and on the value of extending such methods to philosophical texts. We will also practice strategies for approaching theoretical questions and engaging philosophical ideas with attention to the particular complexities that literature and film present. The class will provide students with the opportunity to develop their facility for written expression with an emphasis on making critical arguments in a manner that conveys the relevance as well as the content of their claims. <br/><br/>While the course will introduce students to significant works of literature and film (Schiller, Woolf, Bachmann, Coetzee, Iñárritu, von Trier) it is also an introduction to strands of modern political philosophy (Hobbes, Nietzsche) and contemporary debates relating to bio-politics, ecology, political-zoology and animal studies (Agamben, Foucault, Levinas, Derrida, Haraway). Finally, beyond the classroom, the course is meant to encourage students to critically engage many of the issues concentrated in the figure of the dog that, with different degrees of intensity, demand our attention today."}, {"name": "Teaching Method", "value": "DiscussionSeminar"}, {"name": "Evaluation Method", "value": "20% Participation<br/>20% Weekly Assignments<br/>35% Short Papers<br/>25% Final Paper"}, {"name": "Class Materials (Required)", "value": "Kafka, Franz. The Trial. Oxford; New York: Oxford University Press, 2009. 978-0-19-923829-3<br/><br/>Kafka, Franz. Kafka's Selected Stories. New York: W. W. Norton &amp; Company, 2006. 978-0-393-92479-4<br/><br/>Coetzee, J. M. Disgrace. New York: Penguin Books, 2008. 978-0-14-311528-1"}, {"name": "Class Materials (Suggested)", "value": "Nietzsche, Friedrich. &quot;On the Genealogy of Morality&quot; and Other Writings: Revised Student Edition. Cambridge: Cambridge University Press, 2006. 978-0521691635"}], "lmod": "4/3/16 8:01 PM (CT)", "subject": "GERMAN"}]