[{"class_mtg_info": [{"meet_t": "TBA", "meet_l": "TBA"}], "school": "SoC", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Winter 2017", "name": "21666", "title": "SoC PERF_ST 424-0-20 Practicum: Adaptation/Staging of Texts", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "21666", "instructors": [{"instructor_phone": "847/491-3171", "instructor_name": "Paul C Edwards", "instructor_addr": "Annie May Swift Hall, Room G03"}], "topic": "", "course": "424-0", "descriptions": [{"name": "Overview of class", "value": "The Practicum seminar in adaptation for first-year students in the Theatre MFA Directing Program meets once a week for three hours. The seminar addresses four topic areas.<br/>(1) Principles of storytelling for stage adaptations of non-dramatic texts.<br/>(2) Narrators onstage: models for the dynamic interaction of storytelling and dramatic representation.<br/>(3) Pretext analysis: the place of appropriation, allegory, and mash-up in stage adaptation.<br/>(4) Imagining the performance space for plays with narrators."}, {"name": "Registration Requirements", "value": "Three. Receive permission number directly from Paul Edwards at edwdoyle@northwestern.edu or edwdoyle1@gmail.com"}, {"name": "Evaluation Method", "value": "(1) Four presentations in seminar meetings across the quarter (one every two-three weeks) responding to specific assignments.<br/>(2) One end-of-quarter process paper describing the seminar member's quarter-long progress on an original stage adaptation of a non-dramatic text.<br/>(3) Note: the Practicum seminar no longer requires a staging project with members of a separate undergraduate adaptation class. All presentations will happen in once-a-week, three-hour seminar meetings."}, {"name": "Class Materials (Required)", "value": "(1) Non-dramatic texts (short stories, selections from novels, compilations of narrative non-fiction) suggested by the seminar members for quarter-long adaptation projects. Source texts will be posted by the instructor to the NU Canvas course site.<br/>(2) Required and recommended readings (essays and book chapters) posted by the instructor to the NU Canvas course site."}], "lmod": "12/25/16 6:47 PM (CT)", "subject": "PERF_ST"}]