[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Harris Hall L06"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "34732", "title": "WCAS RELIGION 339-0-20 Topics in Judaism", "class_attributes": "", "section": "34732", "instructors": [{"instructor_phone": "847 4912618", "instructor_name": "Barry Scott Wimpfheimer", "instructor_addr": "Crowe Hall, 1860 Campus Drive, 5-174"}], "topic": "The Talmud: A Methodological Introduction", "course": "339-0", "descriptions": [{"name": "Overview of class", "value": "The Talmud is one of the most important works of Jewish literature. For the last millennium, Talmud study has been a central part of Jewish religious and cultural practice. Despite the splintering of Judaism into different denominations, Jews the world over are unified by their commitment to studying Talmud. The Talmud is an unusual work of literature, and it has been credited as an influence on codes of law, sermons, modern works of Jewish literature, and even Seinfeld. This course will explain the Talmud's import and durability within Jewish culture while introducing students to the rigors of legal analysis that lie at the heart of most talmudic passages. The course is ideal for those interested in religion, law, logic games and questions of textual interpretation. The course will study the Talmud entirely in English translation; there is neither a language prerequisite nor an expectation of prior experience reading the Talmud.<br/><br/>THIS COURSE WILL COINCIDE WITH A LAUNCHING OF A MOOC (MASSIVE OPEN ONLINE COURSE) ON TALMUD AT NORTHWESTERN. THERE WILL BE SOME FLIPPED CLASSROOM CLASSES THAT UTILIZE THE MOOC MATERIALS AND STUDENTS FROM THE COURSE WILL HAVE THE OPTION TO SERVE AS MOOC DISCUSSION LEADERS."}, {"name": "Learning Objectives", "value": "? Critical Thinking Skills<br/>? Legal Analytic Skills<br/>? Appreciation of Central Text of Judaism<br/>? Confidence to study Talmud in translation<br/>? Basic Ancient Historiography related to texts<br/>? Jewish History"}, {"name": "Teaching Method", "value": "Class participationFilms / videos: MANY MOOC VIDEOS WILL BE USED IN THIS COURSE<br/>Online work: THERE WILL BE ONLINE DISCUSSION BOARDS<br/>Seminar: TWO 80 MINUTE SEMINAR DISCUSSIONS<br/>Writing assignments: STUDENTS WILL WRITE TWO PAPERS: MID-TERM AND FINAL<br/>"}, {"name": "Evaluation Method", "value": "Class participation: 20%<br/>Online work: 20%<br/>Paper, final: 30%<br/>Paper, mid-term: 30%<br/>"}], "lmod": "4/3/16 8:20 PM (CT)", "subject": "RELIGION"}]