[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "Kresge Centennial Hall 2-325"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "34426", "title": "WCAS TURKISH 111-3-20 Turkish I", "class_attributes": "", "section": "34426", "instructors": [{"instructor_phone": "", "instructor_name": "Oya   Topcuoglu", "instructor_addr": ""}], "topic": "", "course": "111-3", "descriptions": [{"name": "Overview of class", "value": "Turkish 111-3 is the final part of the three-quarter introductory course in modern Turkish. It is open to both undergraduate and graduate students. Successful completion of Turkish 111-2 or equivalent is required. This course aims to introduce students to the essential points of modern Turkish grammar and vocabulary to develop basic reading, writing, speaking and listening skills. The course also provides insights into modern Turkish culture through the language. With this in mind, the textbook is supplemented by additional printed and audio-visual materials provided by the instructor."}, {"name": "Registration Requirements", "value": "Turkish 111-2."}, {"name": "Teaching Method", "value": "The course is based on lectures on grammar. These lectures are supplemented by listening and reading exercises. Students are also asked to participate in group projects and assignments both during and outside the class. These include collaborative exercises, such as in-class conversation, building vocabulary lists and flash cards, and final projects and presentations in the classroom."}, {"name": "Evaluation Method", "value": "Homework consisting of (but not limited to) assignments from the exercises in the textbook/handouts. One midterm and one final exam, as well as grammar and vocabulary quizzes to determine the general level of progress in the classroom. <br/>Full attendance and active class participation are strongly encouraged for the successful completion of the course. In addition to regular participation in class activities, it is important to complete all your homework on time."}, {"name": "Class Materials (Required)", "value": "Lectures on grammar, listening exercises, and homework assignments are based on Kurtulu? Öztopçu's Elementary Turkish: A Complete Course for Beginners. Revised Third Edition. The two-volume textbook can be purchased online at http://www.elementaryturkish.com/buy/."}], "lmod": "2/8/17 6:47 PM (CT)", "subject": "TURKISH"}]