[{"class_mtg_info": [{"meet_t": "MoWe 9:30AM - 10:50AM", "meet_l": "Parkes Hall 223"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-registration - Reserved for English students.", "qtr": "Spring 2017", "name": "33443", "title": "WCAS ENGLISH 374-0-20 Topics in Native American and Indigenous Literatures", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "33443", "instructors": [{"instructor_phone": "", "instructor_name": "Kelly E Wisecup", "instructor_addr": ""}], "topic": "Unredeemed Captives", "course": "374-0", "descriptions": [{"name": "Overview of class", "value": "One of the most popular literary genres in early America, captivity narratives circulated tales of helpless women torn from their families by allegedly cruel captors. Captives' &quot;redemption&quot; and return to their families signified the stability of Anglo-American cultural practices and settlements. This course will investigate captivity narratives that significantly complicate this structure by telling stories of captives who chose to remain with their Native captors, thus transforming stories of captivity into narratives of family. We will read the narratives of &quot;unredeemed captives&quot; in order to analyze literary articulations of settler colonialism and to examine the ways that Native American writers took up the form of the captivity narrative to critique colonial and U.S. wars, expansion, and Indian policies. We will track these narratives through multiple editions, in order to illuminate the various purposes to which their editors attempted to put them. A key component of the course will thus be the study of the print culture of captivity narratives and the role it played in shaping their popularity and meanings, as well as the role that unredeemed captivity narratives played in shaping and contesting cultural, racial, and gendered identities in early America."}, {"name": "Teaching Method", "value": "Discussion."}, {"name": "Evaluation Method", "value": "Canvas posts, attendance and discussion, essays."}, {"name": "Class Materials (Required)", "value": "Mary Rowlandson, The Captivity and Restoration of Mrs. Mary Rowlandson; A Narrative of the Life of Mary Jemison; John Tanner, The Falcon; and John Williams, The Redeemed Captive, Returning to Zion; Elias Johnson, &quot;A Captives Life Among Indians&quot;; Zitkala-Sa, American Indian Stories; and Sherman Alexie, Indian Killer."}], "lmod": "2/8/17 6:42 PM (CT)", "subject": "ENGLISH"}]