[{"class_mtg_info": [{"meet_t": "Mo 3:00PM - 4:50PM", "meet_l": "Kresge Centennial Hall 2-415"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "12934", "title": "WCAS HUM 325-6-20 Humanities in the Digital Age", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "12934", "instructors": [{"instructor_phone": "847/491-8029", "instructor_name": "Francesca   Tataranni", "instructor_addr": "Crowe Hall 3-171"}], "associated_classes": [{"component": "LAB", "room": "Kresge Cent. Hall 2-530 MMLC", "meeting_time": "We 3:00PM - 4:20PM"}], "topic": "Ancient Rome in Chicago", "course": "325-6", "descriptions": [{"name": "Overview of class", "value": "Although the ancient Romans never made it to the new world, their legacy in Chicago is reflected in architecture, the visual arts, and sites devoted to recreation, education, politics, and business. This class will journey to Chicago's financial district, political and commercial core, cultural institutions, hotels, theaters, parks, schools, cemeteries, and ethnic neighborhoods. By walking the city, you will learn to &quot;read&quot; the streets, buildings, and monuments that showcase Chicago's engagement with the classical past. You will also learn how to use digital tools and practices ? such as video editing, data analysis, and digital mapping ? to produce an innovative and collaborative virtual walking tour mapping Chicago's ongoing dialogue with Roman antiquity."}, {"name": "Teaching Method", "value": "The aim of this advanced research seminar is to train students to take ownership of their learning through knowledge creation. Students' work will be divided among class discussions and workshops, in- and out-of class labs, and individual and collaborative research. Students will meet with the instructor for two hours and a half every week in a traditional classroom setting where they will discuss assigned readings, do task-based exercises, report on the progress of their research, showcase their projects and receive feedback from the instructor and their classmates. Weekly labs will complement the regular sessions and will provide students with a dedicated time and space to familiarize themselves with digital technologies. Labs will be run by members of the Center for Scholarly Communication &amp; Digital Curation and the Multimedia Learning Center at Northwestern University in collaboration with the instructor."}, {"name": "Evaluation Method", "value": "Daily assignments; individual and group projects; participation in class discussion and labs"}, {"name": "Class Materials (Required)", "value": "All the readings for this class will be posted on Canvas"}, {"name": "Class Notes", "value": "Attendance at first class is mandatory. No P/N option."}], "lmod": "10/30/16 7:06 PM (CT)", "subject": "HUM"}]