[{"class_mtg_info": [{"meet_t": "TBA", "meet_l": "TBA"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Spring 2017", "name": "30949", "title": "WCAS LING 482-0-20 Individual Speech and Language Tutoring for Nonnative Speakers of English", "class_attributes": "", "section": "30949", "instructors": [{"instructor_phone": "", "instructor_name": "Kathleen A.D. Geraghty", "instructor_addr": ""}], "topic": "", "course": "482-0", "descriptions": [{"name": "Overview of class", "value": "In this course, a trained tutor provides individualized language study for the purpose of increasing nonnative speakers' proficiency in English, in both academic and everyday contexts. At the beginning of the term, students will complete a needs assessment to determine which aspects of spoken English are most critical for current communication skills. These may include: accent and intelligibility, grammatical errors, sociolinguistic skills, intercultural competence, classroom communication skills, formal and informal writing tasks, and more. Together, the tutor and student will create a set of learning goals for the term. The tutor will then provide appropriate practice in each session to help the student acquire the linguistic and academic skills needed to improve communicative competence. Tutors may assign additional work to be completed outside of the session. Students will be expected to reflect on their own progress both periodically and at the end of the term. Active participation and evidence of progress towards learning goals must be demonstrated in order to achieve a satisfactory grade in the course."}, {"name": "Registration Requirements", "value": "Instructor consent required."}, {"name": "Learning Objectives", "value": "By the end of this course, students should be able to:<br/>1. Use data from self-assessments, standardized assessments, and instructor feedback to identify your pre-term level of communicative competence in English, including: linguistic competence, sociolinguistic competence, discourse competence, functional competence, and strategic competence.<br/>2. Identify your own critical academic and personal language learning needs.<br/>3. Articulate your learning goals for the quarter (in partnership with your tutor). Your goals should address your unique learning needs in effective communication<br/>4. Demonstrate progress towards achieving your stated learning goals."}, {"name": "Teaching Method", "value": "Individual face-to-face instruction, in-session practice activities, suggested homework practice activities."}, {"name": "Evaluation Method", "value": "At the beginning of the quarter, students will complete an intake assessment with their tutor, and then create individual learning goals for the quarter. Students will be evaluated at the end of the quarter with a self-assessment, recorded speech samples, and documentation of progress towards individual goals by the tutor."}, {"name": "Class Materials (Required)", "value": "None"}, {"name": "Class Notes", "value": "Students must complete an online form from English Language Programs in order to be eligible for the class and obtain a permission number. Contact elp@northwestern.edu for specific registration instructions."}], "lmod": "2/20/17 6:48 PM (CT)", "subject": "LING"}]