[{"class_mtg_info": [{"meet_t": "MoWe 9:30AM - 10:50AM", "meet_l": "Kresge Centennial Hall 2-415"}], "school": "SoC", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24965", "title": "SoC THEATRE 365-1-20 American Theatre and Drama", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "24965", "instructors": [{"instructor_phone": "847/467-0513", "instructor_name": "Elizabeth Won-Kyung Son", "instructor_addr": "70 Arts Circle Drive, 5-174"}], "topic": "Asian/Black Connections in U.S. Theatre &amp; Performa", "course": "365-1", "descriptions": [{"name": "Overview of class", "value": "&quot;Asian/Black Connections in U.S. Theatre and Performance&quot; examines performances by and about Asian Americans and African Americans in order to understand an interconnected history of race and racism in the United States from the nineteenth to the twenty-first century. We will explore the production and contestation of racialized meanings-how bodies are marked and redefined as &quot;Asian,&quot; &quot;Oriental&quot;, &quot;Black&quot;, &quot;Other&quot;, &quot;Asian American&quot;, and &quot;African American&quot;-through performances. In other words, we study the construction of race through performances on stage and in everyday life. The course covers a range of performances or embodied practices, including theatre, museum and fair displays, exhibitions, minstrelsy, musicals, cabaret performances, protests, martial arts, and hip hop. We will also look at the mutual influence of and relationships between Asian American and African American performers.<br/><br/>Our investigations will be guided by these inquiries: How do theatre and performances in general illuminate how bodies acquire cultural meaning? How are bodies radicalized through performance? What does it mean for a body to be marked &quot;Asian&quot; or &quot;Black&quot; How do negotiations of radicalization impact subjects' experiences of identity, place, community, and belonging. How can performances offer the possibilities for resistance and critique. What kind of political and cultural connections are shared by Asian Americans and African Americans?<br/>The course begins in the nineteenth century with a comparative study of embodied negotiations of race and racism in public exhibits of Asian and black bodies, and in blackface and yellow face minstrel performances. The course then examines the influence of ideas about Asia and Asians on African American performances and African American influences on Asia American performances. We then turn to cross-racial alliances and influences in activisim and hip hop in the United States and in Asia. The course concludes by exploring contemporary theatrical representations of Asian/Black relationships. In addition to dramatic texts, we will read key works in Asian American and African American history and cultural studies, along with readings in critical race theory and performance theory."}], "lmod": "12/25/16 6:48 PM (CT)", "subject": "THEATRE"}]