[{"school": "MEAS", "overview_of_class": "In this services design studio students will explore a human centered approach to the design of services. Students will explore and apply design thinking to a client sponsored project and synthesize both user and client needs to the design of tangible consumer touchpoints. This may include experiences plans, digital interface designs, communication models, organizational designs, systems and/or brand tonality deliverables. The course will build on skills learned in 305 with the potential to take the deliverables further. Coursework will be workshop based with a majority of team assignments supported by specific individual responsibilities.", "name": "Special Topics", "section": "1", "location": "Ford Eng Design Cntr G-205", "topic": "", "course": "395-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4660/MEAS/DSGN/395-0/31905", "instructor": ["Jason David George", "James Edward Wicks"], "class_attributes": "", "id": "31905", "subject": "DSGN"}, {"school": "MEAS", "overview_of_class": "What if you approached your life as a big design project? What if there were a class to help you explore the bigger issues of finding your way to a career you'll love, and space to work on crafting a total life that feels \"like you\"? Modeled on Stanford's class by the same name, this brand-new offering will be co-taught by Segal's Co-Director Prof. Bruce Ankenman and designer-in-residence Pam Daniels. The course will include seminar-style discussions, role-playing, short writing assignments, hands-on making, guest speakers, and individual mentoring and coaching. Small group discussions will be held during the class's lab time.", "name": "Special Topics", "section": "2", "location": "Meets in Non-General PurposeRm", "topic": "Designing your Life", "course": "395-0", "meeting_time": ["MoWe 12:30PM - 1:50PM"], "path": "/class-descriptions/4660/MEAS/DSGN/395-0/31906", "instructor": ["Bruce E Ankenman", "Pamela A. Forgianni Daniels"], "class_attributes": "", "id": "31906", "subject": "DSGN"}]