[{"class_mtg_info": [{"meet_t": "We 2:00PM - 4:50PM", "meet_l": "ANTHRO Sem Rm 104 - 1810 Hinmn"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Anthropology Graduate Students", "qtr": "Winter 2017", "name": "23126", "title": "WCAS ANTHRO 401-2-20 Logic of Inquiry in Anthropology (Archy)", "class_attributes": "Department Majors Only<br/><br/>Graduate Students Only<br/><br/>", "section": "23126", "instructors": [{"instructor_phone": "847/467-3021", "instructor_name": "Matthew H Johnson", "instructor_addr": "1812 Hinman Ave., Room #201"}], "topic": "", "course": "401-2", "descriptions": [{"name": "Overview of class", "value": "In this course, students will learn about the logic of inquiry in archaeology - key theories, concepts and approaches; characteristic habits of thought; techniques and intuitions. In particular, we will discuss how archaeology articulates with the other sub-fields of anthropology. We will approach the subject through the basic dimensions of archaeological enquiry (and, arguably, most enquiry in the human sciences): space, time, materiality, and the relationship between present and past. Student will write a final paper applying what they have learnt to a specific topic in their research."}, {"name": "Learning Objectives", "value": "? To reflect on the nature of archaeology as a sub-field of a fourfield anthropology<br/>? To understand some of the basic principles of archaeological enquiry<br/>? To apply these principles to a body of empirical material spanning at least two of the subfields"}, {"name": "Evaluation Method", "value": "35%: Seven response papers, each no more than 400 words, due 24 hours before the relevant class. (No response paper is required for the first, Introduction class.)<br/><br/>The response papers should:<br/><br/>? Include some comment on all the pieces of reading<br/>? Evaluate the reading (compare and contrast approaches, make critical comments)<br/>? Relate the reading to the development of your own research outlook and priorities<br/><br/>65%: A final paper, maximum length 5200 words excluding bibliography and illustrations, due in at 12.00pm on the last day of the quarter. Please submit both pdf to me by email and hard copy in class. <br/><br/>You should discuss your final paper with me beforehand, present its main ideas in class, and respond to feedback from both myself and other students at draft stage. Your final paper should:<br/><br/>? Take a problem or topic from your own research outlook and priorities<br/>? Discuss and evaluate that problem or topic from an archaeological perspective<br/>? Use archaeological evidence to explore your problem or topic<br/>? Draw wider conclusions about an anthropological archaeology from your discussion"}], "lmod": "12/25/16 6:54 PM (CT)", "subject": "ANTHRO"}]