[{"class_mtg_info": [{"meet_t": "We 6:15PM - 9:15PM", "meet_l": "Wieboldt Hall 402"}], "school": "SCS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "18422", "title": "SCS CHINESE 111-A-15 Chinese I", "class_attributes": "", "section": "18422", "instructors": [{"instructor_phone": "8474918130", "instructor_name": "Chyi   Chung", "instructor_addr": "CROWE 1860 Campus Dr 1-159 EV2161"}], "topic": "", "course": "111-A", "descriptions": [{"name": "Overview of class", "value": "This first course in a three-course sequence (completed by Chinese 111-B in Winter quarter and 111-C in Spring quarter) introduces the material of the first year Beginning Chinese curriculum, presenting the Pinyin system, Chinese characters and compound words, and grammar of standard modern Mandarin Chinese. This course provides a practical, learner-centered curriculum and aims to help true beginners develop their communicative competence in four basic skills of listening, speaking, reading and writing, while gaining competence in Chinese culture, making connections to their daily life, and building links among communities. This first course in the three-course sequence introduces the standard (Mandarin) Chinese phonetics system (Pinyin), Chinese writing system (simplified Chinese characters), basic grammar and simple sentence structures. Speaking, listening, character, grammar, and communicative exercises are included throughout the course."}, {"name": "Registration Requirements", "value": "None."}, {"name": "Learning Objectives", "value": "The course focuses on the practical needs and interests of students. The content of the course begins with individual, family, and school activities, and then gradually expends to include wider social occasions and societal contact. In this course, students will study Units 1- 4 from the Modern Chinese - Textbook 1A."}, {"name": "Class Materials (Required)", "value": "Texts may include the following. Visit the campus bookstore or its website to confirm materials for the course.<br/><br/>Modern Chinese 1A 1st ed, Better Chinese LLC. ISBN: 978-1-60603-481-1."}, {"name": "Class Notes", "value": "For each lesson, students will study the new vocabulary items, grammar notes and sentence patterns, and will learn to use them in different life-like situations. Students will be actively engaged in the learning process through various kinds of in-class exercises, which include vocabulary dictations, pattern drills, listening comprehension exercises, reading practice, situational dialogue, role-play, and language games, etc."}], "lmod": "10/30/16 6:54 PM (CT)", "subject": "CHINESE"}]