[{"school": "SoC", "overview_of_class": "Course Overview<br/><br/>CSD 495 utilizes both lecture and active learning formats. Students are expected to prepare for (i.e., complete required readings and assignments) in order to participate actively in class discussions and activities. Every effort will be made by the course instructor and TA's to establish scholarly debates, especially on selected case studies. The format is intended to help students develop critical thinking and problem solving skills. For most lectures, visual and audio materials including PowerPoint slides, video and audio recordings will be used to enhance classroom learning. The reading load for the course is commensurate with graduate training. The required course readings and activities are designed to complement and to supplement information presented in the course lectures. <br/><br/>The course is designed to provide multiple formats for students to express their knowledge of the course content. Assignments, lectures, and course materials have been designed purposefully to link theoretical content from the course to clinical translation. The assignments for the course map directly onto the course learning objectives. While the intention of the course is to provide students with the theoretical foundation required for clinical practice in the areas of acquired neurocognitive and neurolinguistic impairments, students will demonstrate this knowledge in assignments and examinations based largely in clinically relevant tasks (e.g., case reports/summaries, mock clinical reports, designing therapy and assessment plans, designing and delivering individual and care partner education/training materials and plans, etc.). <br/>Purpose <br/>This course will:<br/>?Examine the neural bases and characteristics of acquired linguistic and cognitive disorders, including aphasia, dementia, traumatic brain injury and right hemisphere syndrome; <br/>?Explore how normal language and cognitive systems are fractionated by brain damage; <br/>?Focus on assessment, diagnosis, prognosis, treatment and recovery processes associated with these disorders; <br/>?Emphasize the integration of normative data, scientific knowledge, and clinical practice.", "name": "Acquired Neurolinguistic and Neurocognitive Disorders", "section": "1", "topic": "", "course": "495-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4650/SoC/CSD/495-0/25928", "instructor": ["Angela Christine Roberts"], "id": "25928", "subject": "CSD"}]