[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "Swift Hall 107"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "37695", "title": "WCAS ANTHRO 390-0-27 Topics In Anthropology", "class_attributes": "", "section": "37695", "instructors": [{"instructor_phone": "", "instructor_name": "Eli S Suzukovich III", "instructor_addr": ""}], "topic": "Topics in Ethno-Biology", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "Topics in Ethno-Biology.<br/><br/>This class will introduce and cover topics in Ethno-biology which is the scientific study of dynamic relationships among peoples, biota, and environments. As a multidisciplinary field, ethnobiology integrates archaeology, geography, systematics, population biology, ecology, mathematical biology, cultural anthropology, ethnography, pharmacology, nutrition, conservation, and sustainable development. This class will cover theory and practice, ethnobotany; ethnozoology; and culturally and community based practices and solutions to ecosystem, agriculture, and land management. We will look at case studies from across the globe ranging from mulberry groves and Sufi musicians in Central Asia; the relationships of beavers, wolves, bison, and people in Yellowstone and Chernobyl; traditional plant harvesting on Mt. Rainer in Washington State; and emerging urban and community forestry practices within Chicago American Indian community. <br/><br/>AREA OF CONCENTRATION: <br/>Anthropology, Sociology, Environmental Science, Botany, Zoology, Agricultural Sciences, Land Management, Native American and Indigenous Studies, Forestry, Ecology,"}, {"name": "Registration Requirements", "value": "No Pre-requisites."}, {"name": "Learning Objectives", "value": "Students will have an understanding of the field of Ethno-biology, culturally based resource and land management strategies."}, {"name": "Teaching Method", "value": "Lecture and Class Discussion."}, {"name": "Evaluation Method", "value": "EVALUATION METHOD:<br/>Midterm and Final paper, point system and Letter Grade<br/><br/>GRADING BASIS: <br/>Grades are based Attendance, Class Participation, and Midterm/Final Paper"}, {"name": "Class Materials (Required)", "value": "Articles will be the primary course materials. They will be in PDF format."}], "lmod": "4/3/16 7:43 PM (CT)", "subject": "ANTHRO"}]