[{"class_mtg_info": [{"meet_t": "Tu 3:00PM - 5:50PM", "meet_l": "Locy Hall 110"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: REASON: Pre-registration is not allowed for this class. Please try again during regular registration.", "qtr": "Spring 2017", "name": "34447", "title": "WCAS MENA 390-6-22 Advanced Topics in Middle East &amp; North African Studies", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "34447", "instructors": [{"instructor_phone": "", "instructor_name": "Hannah J Feldman", "instructor_addr": ""}], "topic": "What is a Place? Art and the Spatial Imagination i", "course": "390-6", "descriptions": [{"name": "Overview of class", "value": "Drawing on selected contemporary art and visual cultural practices in the contemporary Middle East, this seminar considers the ways in which visual, literary, architectural, and media cultures articulate a sense of place and belonging, especially in the near decade bracketed by 9/11 and the so called Arab Spring. We consider carefully the ways in which these practices speak to local histories and populations as well as to an international audience, and how they draw upon models of utopia, pan-regional politics, subterfuge, and resistance. We will try to determine how these efforts construct specific understandings of a &quot;Middle Eastern&quot; place, whether it be national, cultural, historical, or geographical. In each instance, however, we are less concerned with establishing a singular view regarding the &quot;reality&quot; of a place than with the ways in which its &quot;realities&quot; are constructed and represented culturally, historically, aesthetically, and temporally. Our analyses will be formed in dialogue with interdisciplinary theoretical and analytical texts ranging from art history to political science and anthropology, and we will, on occasion read artists' writings just as we will view their visual work. Topics range from transnational and regional identification, decolonization and anti-imperialism, neoliberalism and globalization, the artistic appropriation of archival traditions, images of state and so-called terrorist violence, public and private arts institutions, dis-placements and territorial control, the use of historical images in modeling visions of the present, and the remembrance of war. Our survey is not comprehensive in either geographical or art historical terms. Instead, we consider several case studies (mostly in the Levant) in order to analyze different ways by which places are imagined, dreamed, and sometimes destroyed across shifting regimes of power and authority.<br/><br/>Seminar is conversation based. Juniors and seniors are encouraged to enroll, but sophomores might want to contact the professor. Students are expected to have open minds and, ideally, some exposure to contemporary art, but this is not required."}, {"name": "Evaluation Method", "value": "Assessments will be made on the basis of class and virtual participation, short essays, and a longer final assessment."}, {"name": "Class Materials (Required)", "value": "Readings and most moving image material will be made available online and, if desired by a majority of the students, through a reader for purchase."}], "lmod": "2/12/17 6:58 PM (CT)", "subject": "MENA"}]