[{"school": "WCAS", "overview_of_class": "The 1960s and 70s represents an era of enormous upheaval and activism in the United States. In this seminar, we will focus on the emergence of Gay Liberation, Women's Liberation and ethnic nationalist movements during this era. In each case, we will read movement newspapers, manifestos, position papers and other ephemera from the period housed in NU Special Collections alongside documentary films and more recent historical accounts. Our readings and discussions will focus on the challenge these movements posed to dominant ideas about gender, sexuality and race during this period. In addition, we will consider their legacies in the present moment and ask how these earlier formulations and demands are used, contested and/or revised in contemporary activism, from the undocumented youth movement to the End Campus Rape and #BlackLivesMatter campaigns.", "name": "First-Year Seminar", "section": "20", "topic": "Counter-Cultures Then &amp; Now: Gay Liberation, Radic", "course": "101-6", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4610/WCAS/GNDR_ST/101-6/23324", "instructor": ["Amy Ruth Partridge"], "id": "23324", "subject": "GNDR_ST"}, {"school": "WCAS", "overview_of_class": "Are public spaces inclusive? To explore this question, this course will combine theoretical and fictional readings and films, as well as examinations of particular physical spaces and NU archives. We will query the ways in which different members of the Northwestern university student body experience access to public spaces. By focusing on a particular student building on campus and examining the specificities of access (either the Northwestern Library or the Norris Student Center, tba), the course will cover such deeply-entrenched topics as gender, sexuality, sexual identification, race, class, religion, ethnicity, and ability. The goal of this course is to query how public spaces are politically experienced in non-uniform ways as well as recognize the constructed nature of the concept of &quot;public space.&quot; Our localized focus of a campus building will suggest broader ideas, rendering visible the vicissitudes of what constitutes publics and space that might be extended to multiple environments and settings.", "name": "First-Year Seminar", "section": "21", "topic": "Race and Gender and Sexuality Studies: The Politic", "course": "101-6", "meeting_time": ["MoWe 9:30AM - 10:50AM"], "path": "/class-descriptions/4610/WCAS/GNDR_ST/101-6/23325", "instructor": ["Jillana B Enteen"], "id": "23325", "subject": "GNDR_ST"}]