[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "Kresge Centennial Hall 2-410"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24267", "title": "WCAS LATINO 393-0-21 Topics in Latina and Latino Text and Representation", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "24267", "topic": "", "course": "393-0", "descriptions": [{"name": "Overview of class", "value": "Subcultures are often understood as bringing like-minded people together who feel marginalized by societal standards, allowing them to develop a sense of identity, and often challenge these standards. In this course, we will explore how and why Latino/a youth participate in musical subcultures, such as, house, rave, punk, EMO, goth, and hip hop. First, we will define subculture, examine how the concept has changed over time among scholars, and apply the concept to the case of Latino/a youth subcultures. Second, we will explore how Latino/a youth create a sense of identity in subcultures and challenge societal norms around race, class, gender, and sexuality. We will pay special attention to the ways in which Latino/a youth have participated and made spaces for themselves in various subcultures that have been perceived as racially &quot;white,&quot; like goth or punk, or &quot;black,&quot; like house and hip hop. One public space we will pay attention to is the high school and how subculture groups behave and respond to school policies and norms. We will also examine the ways media portrays youth subcultures and how these representations are different to how youth portray themselves or self-representations with pictures, writings, dress, music, etc. Ultimately, this course will examine the ways in which Latino/a youth participate in subcultures to create spaces of belonging and express their unique ways of being and Latino/a cultural citizenship in the U.S."}, {"name": "Learning Objectives", "value": "Helping students think critically about standing ideologies and discourses regarding how youth of color are often reduced to failures, delinquents, apolitical citizens, consumers, etc. How do music subcultures show &quot;self-determination&quot; among youth of color in such ways that express active thinking, political engagement and even affiliation with social and or grassroots movements of change and post-national movements? In what ways do US racial projects or standing ideologies and discourses (of race, success, failure, violence, gangs, etc.) limit or discredit youth subcultures? Students will share through discussion and small writing exercises their personal experiences with other classmates on weekly topics. Ultimately, this will help students claim and share their own knowledge and social positioning in useful ways to think critically about the dynamics of race, gender, sexuality, and alternative forms of participation and citizenship in the US through musical subcultures. Such classroom discourse will encourage students to openly dialogue in ways that invite mixed perspectives and value a &quot;unity in difference&quot; dialogue of critical multiculturalism. For the final project, students will have the option to one of the following in light of the themes and key concepts we cover in class: conduct an interview project that generates perspectives around one or more subcultures; critically analyze either youth self-representations and how subcultures plays a role in their meanings; critically analyze dominant film and media texts and focus on how these texts collide with youth thought or counterideologies in subcultures; propose a local youth project (after school, during school, self-run, etc.) that addresses a need and involves using musical subculture, or a policy paper that consults either educators, non-profit organizations, or policy think tanks on how and why to incorporate subculture into pedagogy, youth programming, and direct services to attract today's youth in meaningful ways. These are possible final projects that may change but will be similar to the confirmed ones for the course."}, {"name": "Teaching Method", "value": "Class participationDiscussionFilms / videosLecturePresentationsReadingsWriting assignments"}, {"name": "Evaluation Method", "value": "AttendanceClass participationExam, mid-termHomeworkPapersProject, finalQuizzesReadingsWriting assignments"}, {"name": "Class Materials (Required)", "value": "Multi-use texts defining subculture, essays on different music subcultures, and post-subculture (Some of these texts will change. Page numbers will be assigned later.) <br/><br/>Austin, Joe and Michale Nevin Willard, eds. Generations of Youth: Youth Cultures and History in Twentieth-Century America. New York: New York University Press, 1998. Print. <br/><br/>Danesi, Marcel. Geeks, Goths, and Gangstas: Youth Culture and the Evolution of Modern Society. Toronto: Canadian Scholars Press, 2010. Print.<br/><br/>During, Simon, ed. The Cultural Studies Reader. New York: Routledge, 1993. Print. <br/><br/>Gelder, Ken. Subcultures: Cultural Histories and Social Practice. New York: Routledge, 2007. Print. <br/><br/>Greenberg, Arielle. Youth Subcultures: Exploring Underground America. New York: Pearson Longman, 2007. Print.<br/><br/>Guins, Raiford and Omayra Zaragoza Cruz, eds. Popular Culture: A Reader. Washington, D.C.: Sage, 2009. Print.<br/><br/>Haenfler, Ross. Goths, Gamers, &amp; Grrrls: Deviance and Youth Subcultures. New York: Oxford University Press, 2010. Print. <br/><br/>Maira, Sunaina and Elisabeth Soep, eds. Youthscapes: The Popular, the National, the Global. Philadelphia. University of Pennsylvania Press, 2005. Print. <br/><br/>Muggleton, David and Rupert Weinzierl, eds. The Post-Subcultures Reader. New York: Berg, 2003. Print. <br/><br/>Hip Hop and Rap<br/><br/>Aidi, Hisham. Rebel Music: Race, Empire and the New Muslim Youth Culture. New York: Pantheon Books, 2014. Print. <br/><br/>Rivera, Raquel. &quot;Hip Hop and New York Puerto Ricans.&quot; Latino/a Popular Culture. Eds. Michelle Habell-Pallan and Mary Romero. New York: New York University Press, 2002. 127-146. Print. <br/><br/>Kelly, Reagan. &quot;Hip Hop Chicano: A Separate But Parallel Story.&quot; That's the Joint!: A Hip Hop Studies Reader. Eds. Murray Foreman and Mark Anthony Neal. New York: Routledge, 2012. Print. <br/><br/>House and Techno <br/><br/>Bailey, Marlon M. Butch Queens Up in Pumps: Gender, Performance and Ballroom Culture in Detroit. Ann Arbor: The University of Michigan Press, 2016. Print. <br/><br/>Rivera Colon, Edgar. &quot;Between Runway and the Empty Tomb: Bodily Transformations and Christian Praxis in New York City's House Ball Community.&quot; Christianity and Culture in the City: A Postcolonial Approach. Ed. Samuel Cruz. New York: Lexington Books, 2013. Print. <br/><br/>Wilson, Brian. Flight, Fight, Chill: Subcultures, Youth, and Rave into the Twenty-First Century. Montreal: McGill-Queen's University Press, 2006. Print. <br/><br/>Films <br/><br/>Clark, Larry, dir. Kids. Guys Upstairs, 1995.<br/><br/>Livingston, Jennie, dir. Paris is Burning. Art Matters, Inc., 1990. <br/><br/>Goth, EMO and Punk<br/><br/> Habell-Pallan, Michelle. &quot;?Soy Punkera Y Que?': Sexuality, Translocality, and Punk in Los Angeles and Beyond.&quot; Loca Motion: The Travels of Chicana and Latina Popular Culture. New York: New York University Press, 2005. 147-180. Print. <br/><br/>Lopez, Marissa. &quot;Soy Emo, Y Que? Sad Kids, Punkera Dykes and the Latin@ Public Sphere.&quot; Journal of American Studies, 46.4 (2012): 895-918. Print. <br/><br/>Munoz, Jose E. &quot;The White to Be Angry: Vaginal Creme Davis' Terrorist Drag.&quot; Disidentifications: Queers of Color and the Performance of Politics. Minneapolis: University of Minnesota, 1999. 93-118. Print.<br/><br/>Films <br/><br/>Sorrondeguy, Martin, dir. Mas Alla de los Gritos. 1999. <br/><br/>Spooner, James, dir. Afro-Punk. Afro-Punk, 2003."}], "lmod": "12/29/16 7:01 PM (CT)", "subject": "LATINO"}]