[{"class_mtg_info": [{"meet_t": "MoWe 9:30AM - 10:50AM", "meet_l": "Fisk Hall 217"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "21013", "title": "WCAS ECON 311-0-20 Macroeconomics", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "21013", "instructors": [{"instructor_phone": "", "instructor_name": "Robert J Gordon", "instructor_addr": ""}], "associated_classes": [{"component": "DIS", "room": "Locy Hall 214", "meeting_time": "Fr 3:00PM - 3:50PM"}, {"component": "DIS", "room": "Locy Hall 214", "meeting_time": "Fr 4:00PM - 4:50PM"}, {"component": "DIS", "room": "University Hall 121", "meeting_time": "Fr 3:00PM - 3:50PM"}, {"component": "DIS", "room": "University Hall 121", "meeting_time": "Fr 4:00PM - 4:50PM"}, {"component": "DIS", "room": "University Hall 101", "meeting_time": "Fr 3:00PM - 3:50PM"}, {"component": "DIS", "room": "University Hall 101", "meeting_time": "Fr 4:00PM - 4:50PM"}], "topic": "", "course": "311-0", "descriptions": [{"name": "Overview of class", "value": "This course develops several simple models for thinking about the determinants of variables like aggregate employment, unemployment, investment, consumption, interest rates, inflation, exchange rates and the balance of trade. The framework is used to address issues such as: what is the role of saving in determining the long run wealth of the country; what is the role of money in accounting for inflation; what are the factors accounting for the recurrent fluctuations in employment and output called the business cycle; what factors account for fluctuations in the US dollar; what risks, if any, do the high US government deficits and large U.S. international deficits pose for the health of the US economy? Particular attention in Winter 2017 will be given to the causes of and solutions to the U. S. financial market meltdown of 2008-09, the causes of the slow recovery since 2009, the outlook for future growth, and the ongoing problem of high unemployment and slow growth which plagues Europe."}, {"name": "Registration Requirements", "value": "Economics 201. If an AP credit or other reason has opted you out of the Econ 201 requirement for the econ major, then it is not a prerequisite for this course."}, {"name": "Teaching Method", "value": "Lectures and TA sessions."}, {"name": "Evaluation Method", "value": "10% electronic homework, 20% five closed-book quizzes, 35% two midterms, 35% final exam."}, {"name": "Class Materials (Required)", "value": "Textbook: Robert J. Gordon, Macroeconomics, 12th edition. Information regarding textbooks and study materials will be discussed during the first class session. Students are provided with the opportunity to buy the textbook at a greatly reduced price through the publisher and should not buy the book prior to the first class when all the options for purchase will be provided. Students are advised not to buy used copies on the web or elsewhere, as that will not give them access to the electronic homework, which they will then have to purchase separately."}], "lmod": "12/29/16 6:57 PM (CT)", "subject": "ECON"}]