[{"class_mtg_info": [{"meet_t": "Mo 6:15PM - 8:15PM", "meet_l": "University Hall 218"}], "school": "SCS", "overview_of_class": "French 101-A is the first quarter of a three-quarter sequence of Elementary French. The aim of the course is to build skills in speaking, understanding, writing and reading French through class activities, practice, and study. A variety of class activities are designed to help students acquire knowledge of the basic French vocabulary and structures along with the ability to use what they have learned in situations of communication. It uses a multimedia approach that incorporates texts, songs, videos, and the internet and helps students acquire linguistic as well as cultural competence. Classes include a variety of activities designed to help students acquire knowledge of basic French vocabulary and structures along with the ability to use what they have learned in situations of communication. By the end of the three-quarter sequence, students will be able to create with the language to talk about familiar topics related to daily life and to express personal meaning. <br/><br/>Schedule note: this is a hybrid course, which meets once every week for two hours (6:15-8:15 pm) on campus, and requires a weekly one-hour online session that students can complete on their own time. An online workbook manual will be used for homework. <br/><br/>Carries humanities credit (two-course limit for language courses).", "qtr": "Fall 2016", "name": "Elementary French", "title": "SCS FRENCH 101-A-62 Elementary French", "lmod": "10/30/16 6:55 PM (CT)", "section": "62", "instructors": [{"instructor_phone": "847/497-3930", "instructor_name": "Dominique Mary Licops", "instructor_addr": "1860 S. Campus Drive, Crowe Hall #2-175"}], "topic": "", "course": "101-A", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "French 101-A is the first quarter of a three-quarter sequence of Elementary French. The aim of the course is to build skills in speaking, understanding, writing and reading French through class activities, practice, and study. A variety of class activities are designed to help students acquire knowledge of the basic French vocabulary and structures along with the ability to use what they have learned in situations of communication. It uses a multimedia approach that incorporates texts, songs, videos, and the internet and helps students acquire linguistic as well as cultural competence. Classes include a variety of activities designed to help students acquire knowledge of basic French vocabulary and structures along with the ability to use what they have learned in situations of communication. By the end of the three-quarter sequence, students will be able to create with the language to talk about familiar topics related to daily life and to express personal meaning. <br/><br/>Schedule note: this is a hybrid course, which meets once every week for two hours (6:15-8:15 pm) on campus, and requires a weekly one-hour online session that students can complete on their own time. An online workbook manual will be used for homework. <br/><br/>Carries humanities credit (two-course limit for language courses)."}, {"name": "Registration Requirements", "value": "French 101-A is the first quarter of a three-quarter course for students with less than two years of high school French or with no previous study of French."}, {"name": "Learning Objectives", "value": "Students will work throughout the course on the following skills and are expected to have mastered them to pass the course:<br/>Knowledge of grammar - Be able to manipulate simple structures. Know the basic verbal system of French (tenses, moods, aspects) and be able to produce forms.<br/>Speaking proficiency - Be able to go beyond the one word response. Be able to produce simple, sentence-length utterances, with reasonably accurate pronunciation, on topics related to their personal and academic lives (family, classes, daily activities, leisure activities, etc.)<br/>Reading proficiency - Be able to read and establish meaning of simple cultural readings, simplified literary readings, advertisements, etc.; continue developing the basic strategies that will enable them to successfully comprehend brief readings; be able to guess from context, recognize cognates, and scan to get the gist even when they do not know all the words.<br/>Writing proficiency - Be able to write simple paragraphs and narratives on concrete topics related to their own personal experiences.<br/>Listening proficiency - Be able to understand sentence-length utterances produced at a more-or-less natural pace; those incorporating simple grammatical structures and vocabulary; be able to get the gist of utterances without understanding all of the words.<br/>Cultural knowledge - Know the difference between (some) French speaking cultures. Know some facts about a particular French speaking culture (e.g. Quebec, Senegal, Martinique). Know the geographical location of French speaking countries. Have some knowledge about social life and interaction between genders in French speaking cultures. Be aware that cultural differences often create misunderstandings. Be aware of the existence of stereotypes and common misperceptions."}, {"name": "Teaching Method", "value": "The aim of all three quarters, French 101-a, 101-b and 101-c is to build skills in speaking, understanding, reading, and writing French as well as basic cross-cultural competence through study, practice, and class activities. Classes will include a variety of in class and online activities designed to help students acquire knowledge of basic French vocabulary and structures along with the ability to use what they have learned in situations of communication. Classes will be conducted exclusively in French except when explanation of administrative information may necessitate the use of English. The online class component will be divided into 2 half-hour online activities that student complete before and after the Wed. meeting, as preparation and follow-up to the weekly class. Students are also expected to study and practice regularly throughout the week (homework is assigned online following a MWF schedule), to prepare for the next week's lesson, to participate actively in class activities, to speak only French in class, and to work independently with the online En Avant! Workbook program. Instructors will not teach grammar explicitly, instead we will practice grammar in communicative class activities. Please note: any elaborate grammatical explanations in English will be saved for instructors' office hours."}, {"name": "Evaluation Method", "value": "Final grades per quarter are based on the following items:<br/><br/>Preparation, attendance and in class and online participation 20%<br/>Homework (online work) 15%<br/>Two Compositions 10%<br/>Student Presentation 5%<br/>5 Unit Quizzes 20%<br/>Midterm Exam 10% <br/>Final Written Exam 10%<br/>Final Oral Exam 10%"}, {"name": "Class Materials (Required)", "value": "Texts may include the following. Visit the campus bookstore or its website to confirm materials for the course: <br/><br/>Anderson, Golato and Blatty, En Avant!, first edition.<br/>Anderson, Golato and Blatty, En Avant! WorkBook and Laboratory Manual (WBLM), first ed. <br/><br/>These texts are available in a bundle, which includes access to online material<br/><br/>Course packet (distributed in first class).<br/><br/>NOTE: All quarters of Elementary French - 101-A, 101-B, and 101-C will use the above texts."}], "path": "/class-descriptions/4640/SCS/FRENCH/101-A/18439", "instructor": ["Dominique Mary Licops"], "class_attributes": "", "id": "18439", "subject": "FRENCH"}]