[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "Locy Hall 301"}], "school": "WCAS", "overview_of_class": "This course will involve the close reading of Faulkner's  four  great tragic novels of race and identity The Sound and The Fury (1929), As I Lay Dying (1930), Light In August (1932),  and  Absalom, Absalom! (1936). Until very recently, these works have been considered central to the canon of modernist fiction and read as meditations on the tortured consciousness of the artist (TSATF, AILD, A,A! ) or the dilemma of the outsider adrift in an alienating world (LIA).  Saturating Faulkner's novels are images of the anguished history of race relations in the American South from the 19th century to the Great Migration and Great Depression.  Yet the tragic legacy of slavery, Faulkner's abiding subject, has been understood by critics as a figure for more abstract and universal moral predicaments.  Our investigation seeks to localize Faulkner's representation of history, particularly his vision of slavery and the effects of the color line as a specifically American crisis, embodied in the remarkable chorus of narrative voices and visions that constitute his fictive world.", "qtr": "Winter 2016", "name": "American Novel", "title": "WCAS ENGLISH 371-0-20 American Novel", "lmod": "1/9/16 6:47 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "847/491-3530", "instructor_name": "Julia Ann   Stern", "instructor_addr": "University Hall Room 415"}], "topic": "Faulkner, Race & Politics", "course": "371-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "This course will involve the close reading of Faulkner's four great tragic novels of race and identity The Sound and The Fury (1929), As I Lay Dying (1930), Light In August (1932), and Absalom, Absalom! (1936). Until very recently, these works have been considered central to the canon of modernist fiction and read as meditations on the tortured consciousness of the artist (TSATF, AILD, A,A! ) or the dilemma of the outsider adrift in an alienating world (LIA). Saturating Faulkner's novels are images of the anguished history of race relations in the American South from the 19th century to the Great Migration and Great Depression. Yet the tragic legacy of slavery, Faulkner's abiding subject, has been understood by critics as a figure for more abstract and universal moral predicaments. Our investigation seeks to localize Faulkner's representation of history, particularly his vision of slavery and the effects of the color line as a specifically American crisis, embodied in the remarkable chorus of narrative voices and visions that constitute his fictive world."}, {"name": "Teaching Method", "value": "Lecture and discussion."}, {"name": "Evaluation Method", "value": "During the quarter, you will write two take-home close reading examinations of two pages each, as well as a final paper of 8-10 pages on a topic of your choice that you have discussed with me. All written exercises are due over email in the form of Microsoft Word Attachments. One quarter of your grade will be based on your participation in class discussion. Anyone who misses a class will require the professor's permission to continue in the course. No late papers will be accepted. Conflicts with deadlines must be discussed with the professor and any extensions must be approved in advance."}], "path": "/class-descriptions/4610/WCAS/ENGLISH/371-0/25464", "instructor": ["Julia Ann   Stern"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "25464", "subject": "ENGLISH"}]