[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "Kresge 4531 MENA Seminar Rm"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "13134", "title": "WCAS INTL_ST 390-0-21 Special Topics in International Studies", "class_attributes": "", "section": "13134", "instructors": [{"instructor_phone": "", "instructor_name": "Saeid   Golkar", "instructor_addr": ""}], "topic": "Society and Politics in Iran", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "The aim of this course is to provide students interested in Iranian studies and Middle East politics with the analytic skills necessary to succeed in these fields. This course will do so by examining the relationship between state and society in post-revolutionary Iran, concentrating on the social bases of Iranian politics. It will begin by briefly examining the history of state and society during the Pahlavi era. From the third session, we will focus on Iranian state-society relations after the 1979 Islamic Revolution and the transition to hard-line theocratic governance. From there, we will explore the nature of the Iranian state, concentrating on two of its main characteristics: personalization and militarization. We will additionally consider how the main social groups in Iran's society (the armed forces, the clergy, students, and women), as well as key social spaces such as the bazaar operate in relation to one another and the state. Social media and its simultaneous role in both suppressing and liberating Iranian society will also be a key focal point. Finally, the course will focus on the future of state-society relations in Iran with a special emphasis on the possible transition from authoritarianism to democracy"}, {"name": "Teaching Method", "value": "Lectureclass discussion"}, {"name": "Evaluation Method", "value": "Class participation: 20%<br/>Exam, final: 30%<br/>Exam, mid-term: 25%<br/>Paper, final: 25%<br/>"}, {"name": "Class Materials (Required)", "value": "Readings will be available as digital texts on the Canvas."}], "lmod": "10/30/16 7:07 PM (CT)", "subject": "INTL_ST"}]