[{"class_mtg_info": [{"meet_t": "Mo 10:00AM - 12:50PM", "meet_l": "Annie May Swift Hall 219"}], "school": "SoC", "enrl_requirement": "", "qtr": "Winter 2016", "name": "22289", "title": "SoC RTVF 321-0-20 Radio/Tv/Film Authorship", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "22289", "instructors": [{"instructor_phone": "", "instructor_name": "Miriam Joanna Petty", "instructor_addr": ""}], "topic": "Tyler Perry", "course": "321-0", "descriptions": [{"name": "Overview of class", "value": "In this class, students will explore the film, theatre and televisual work of media mogul Tyler Perry. The course provides a variety of cultural contexts to help students read and analyze Perry's work. We will focus especially upon such elements as: the so-called &quot;Chitlin' Circuit&quot; tradition of African American theatre from which Perry initially emerges; the resurgence of the African American church as an organizing force for many Black communities, especially amidst a largely televisual and social media-oriented American culture; the importance of region, especially &quot;the South,&quot; and particularly the city of Atlanta, to Perry's filmic and dramatic corpus; and conflicts of gender and class between African American women and men that are at the heart of so many of Perry's narratives. Students in the course will also construct nuanced understandings of Perry's signature character, Mabel &quot;Madea&quot; Simmons, a provocative, paradoxical figure who arguably anchors much of Perry's success."}, {"name": "Class Materials (Required)", "value": "Readings may include such works as:<br/><br/>Farah Jasmine Griffin, Who Set You Flowin': The African American Migration Narrative<br/>Tyler Perry, Don't Make a Black Woman Take Off Her Earrings: Madea's Uninhibited Commentaries on Love and Life<br/>LeRhonda Manigault-Bryant and Tamura Lomax, Womanist and Black Feminist Responses to Tyler Perry's Productions<br/>C. Riley Snorton, Nobody is Supposed to Know: Black Sexuality on the Down Low"}], "lmod": "1/9/16 6:39 PM (CT)", "subject": "RTVF"}]