[{"class_mtg_info": [{"meet_t": "Tu 6:15PM - 9:15PM", "meet_l": "Wieboldt Hall 505"}], "school": "SCS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "18470", "title": "SCS SPANISH 101-A-14 Elementary Spanish", "class_attributes": "", "section": "18470", "instructors": [{"instructor_phone": "847/491-8280", "instructor_name": "Elena   Lanza", "instructor_addr": "1-200 Kresge"}], "topic": "", "course": "101-A", "descriptions": [{"name": "Overview of class", "value": "This course is part one of a three-quarter sequence based on the competency (or &quot;can do&quot;) and the communicative approaches. The course is designed for adults who wish to learn Spanish in a dynamic way and it is designed to help students achieve pragmatic, linguistic and cultural competencies adequate for a beginning level. This is a student-centered course in which the student will learn how to interact in the target language in basic real-life situations, both orally and in writing, as well as to develop the necessary skills to become an independent learner outside of the classroom. The intercultural nature of all the activities and tasks to be completed by the student will also help the student to become more aware of the rich and varied cultures within the Spanish-speaking world. The topics and textbook are aligned with the interests of adult learners. Carries humanities credit (two-course limit for language courses)."}, {"name": "Registration Requirements", "value": "Only students who have never taken Spanish before should enroll in this course. Students with previous Spanish experience (high school or college, studied abroad, etc), should enroll in SPANISH 102. Students with questions prior to registering should contact the instructor."}, {"name": "Learning Objectives", "value": "-Gaining a basic understanding of cultural issues that define Spanish-speaking countries.<br/>-Developing basic oral and written skills to give and request personal information (name, age, address, profession/occupation, phone numbers, marital status, family...), describe something's or someone's physical appearance and personality (descriptive adjectives, as well as clothing) <br/>-Talking about actions in the present and daily routines<br/>-Expressing likes/dislikes/general preferences<br/>-Giving (and asking for) directions (and talk about transportation, location, frequency<br/>-Expressing obligation<br/>-Reading about current events and cultural topics in Spanish-speaking countries.<br/>-Writing basic sentences, paragraphs and compositions in Spanish on all the various topics mentioned above."}, {"name": "Teaching Method", "value": "This is a highly interactive class in which you will be working in pairs and in groups most of the time. The class time will be used mostly to interact with the instructor as well as the classmates. Students will be watching, outside of class time, an online video program (weekly) and two movies (throughout the quarter) and will also be expected to spend 2-3 hours (weekly) on homework assignments."}, {"name": "Class Materials (Required)", "value": "Text may include:<br/><br/>-Texbook: Alonso, Montserrat and Rocío Prieto. Embarque 1, Madrid: Edelsa, 2011<br/>-Manual (Libro de ejercicios): Alonso, Montserrat and Rocío Prieto. Embarque 1, Madrid: Edelsa, 2011<br/>(Available in Norris Bookstore- Evanston Campus)"}], "lmod": "10/30/16 6:57 PM (CT)", "subject": "SPANISH"}]