[{"class_mtg_info": [{"meet_t": "Mo 6:15PM - 9:15PM", "meet_l": "University Hall 418"}], "school": "SCS", "overview_of_class": "Whether we look at a world-class genius or just a slightly-more-accomplished high school classmate, we can't help wondering what makes some of us so much more successful than others. Were they born special, did they work harder, or were they just luckier? In this course students will explore the state of our knowledge about success, steering clear of self-help gurus and celebrity biographies in favor of insights from research in the cognitive and social sciences. The course's larger purpose is to give students practice in reading, analyzing, and writing about serious ideas with clarity and precision.", "qtr": "Fall 2016", "name": "Writing Seminar II", "title": "SCS ENGLISH 111-CN-62 Writing Seminar II", "lmod": "10/30/16 6:54 PM (CT)", "section": "62", "instructors": [{"instructor_phone": "", "instructor_name": "John Chisholm Bishop", "instructor_addr": ""}], "topic": "Success", "course": "111-CN", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Whether we look at a world-class genius or just a slightly-more-accomplished high school classmate, we can't help wondering what makes some of us so much more successful than others. Were they born special, did they work harder, or were they just luckier? In this course students will explore the state of our knowledge about success, steering clear of self-help gurus and celebrity biographies in favor of insights from research in the cognitive and social sciences. The course's larger purpose is to give students practice in reading, analyzing, and writing about serious ideas with clarity and precision."}, {"name": "Registration Requirements", "value": "ENGLISH 110 or equivalent."}, {"name": "Learning Objectives", "value": "Students will gain practice in the foundational skills of college-level academic writing: critical reading, summary, synthesis, analysis, and citation of sources. Before taking this class, students should have attained a basic mastery of English grammar and usage, should be able to write plain sentences using standard English, and should be comfortable using the paragraph as a basic unit of composition. Students needing more basic instruction should enroll in English 110."}, {"name": "Teaching Method", "value": "Some material will be presented in lecture form; some will be developed in class discussion of readings and peer response to sample writing, both in class and through online work."}, {"name": "Evaluation Method", "value": "Multiple short writing exercises based on source readings; two middle-length essays based on independent research; attendance and participation in class discussion and peer response exercises."}, {"name": "Class Materials (Required)", "value": "Required texts will be distributed in class, posted on Canvas or freely accessible online. Students are encouraged to obtain a basic handbook of English usage; I recommend The Little Seagull Handbook (2011), ISBN 978-0393911510."}], "path": "/class-descriptions/4640/SCS/ENGLISH/111-CN/18432", "instructor": ["John Chisholm Bishop"], "class_attributes": "", "id": "18432", "subject": "ENGLISH"}]