[{"school": "SoC", "overview_of_class": "Through workshop and performance, this Special Topic class will explore the genius of Henrik Ibsen by adapting, deconstructing and reimagining a work from the Father of Realistic Drama.  This class will build on the Checkov/ Modern Drama section in the 3rd quarter of junior year, and take a closer look at Ibsen's innovative and deeply compelling plays.  Our work throughout the quarter will focus on Ibsen's The Master Builder, the basis for a new work currently in development: The Master Comic.  This class will use the meteoric rise and tragic fall of Bill Cosby as a basis for The Master Comic to examine race, respectability politics and contemporary definitions of success. This class is open to actors, writers, writers who act and actors who write.  The Master Builder Project: The Master Comic is the winner of a 2015 Ibsen Scholarship, awarded at The International Ibsen Conference in Skein, Norway.  The annual conference addresses existential and society-related subject matters concerning Henrik Ibsen and his plays.", "name": "Acting III: Problems in Style", "section": "21", "topic": "After Ibsen", "course": "349-2", "meeting_time": ["TuTh 11:00AM - 12:50PM"], "path": "/class-descriptions/4610/SoC/THEATRE/349-2/24097", "instructor": ["Aaron Todd Douglas"], "id": "24097", "subject": "THEATRE"}, {"school": "SoC", "overview_of_class": "This course is designed to prepare the student actor for participation in Northwestern University's acting showcase in New York City during spring break.  The course will primarily consist of research, development, rehearsal and direction of scene work to be used in the showcase.  Students will learn how to create a professional resume, and will be required to acquire professional caliber head shots.  The class will be complimented by guest lectures and direction, from casting professionals and directors from Chicago. The class will culminate in a dress rehearsal before an audience prior to leaving to perform the showcase in New York City.", "name": "Acting III: Problems in Style", "section": "22", "topic": "New York Showcase", "course": "349-2", "meeting_time": ["We 1:00PM - 3:00PM", "Mo 1:00PM - 3:00PM"], "path": "/class-descriptions/4610/SoC/THEATRE/349-2/24098", "instructor": ["Henry Dominic Godinez"], "id": "24098", "subject": "THEATRE"}, {"school": "SoC", "overview_of_class": "", "name": "Acting III: Problems in Style", "section": "23", "topic": "On-Camera Copy: Commercial, Industrial, Theatrical", "course": "349-2", "meeting_time": ["TuTh 1:00PM - 2:50PM"], "path": "/class-descriptions/4610/SoC/THEATRE/349-2/24099", "instructor": ["Sandra U Marquez"], "id": "24099", "subject": "THEATRE"}, {"school": "SoC", "overview_of_class": "This class serves to prepare the student actor for the business of being an actor.  We cover steps to building a small business, fundamentals of auditioning, guest speakers, meetings with managers, agents and casting directors.  Research is done on cities with thriving artistic communities.  It is a comprehensive look at the transition from being a student to becoming a professional.", "name": "Acting III: Problems in Style", "section": "24", "topic": "The Business of Acting - Preparing for Life as a W", "course": "349-2", "meeting_time": ["TuTh 9:00AM - 10:50AM"], "path": "/class-descriptions/4610/SoC/THEATRE/349-2/24100", "instructor": ["Gail S Shapiro"], "id": "24100", "subject": "THEATRE"}, {"school": "SoC", "overview_of_class": "", "name": "Acting III: Problems in Style", "section": "25", "topic": "Meisner Technique", "course": "349-2", "meeting_time": ["TuTh 11:00AM - 12:50PM"], "path": "/class-descriptions/4610/SoC/THEATRE/349-2/24101", "instructor": ["Dawn A Mora"], "id": "24101", "subject": "THEATRE"}]