[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "Locy Hall 314"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Winter 2016", "name": "23150", "title": "WCAS ENGLISH 105-6-21 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "23150", "instructors": [{"instructor_phone": "847/467-5592", "instructor_name": "Kathleen   Carmichael", "instructor_addr": "555 Clark St., #239"}], "topic": "Literatures of Addiction", "course": "105-6", "descriptions": [{"name": "Overview of class", "value": "Ever since Pentheus' fatal decision to spy on the revels of Dionysus, audiences have had a guilty fascination with the spectacle of addiction?a fascination which crosses not only centuries but disciplines, captivating scientists, policymakers, philosophers, artists, and laypeople alike. This class will trace the evolution of literary representations of addiction across several centuries, from classical depictions of god-induced madness, through the Gothic narratives of Poe and Stevenson, temperance classics such as Ten Nights in a Barroom (whose impact has often been compared to that of Uncle Tom's Cabin), to the twentieth- and twenty-first century comedies and confessionals that make the bestseller lists today. Through these readings and related critical texts, we will examine the ways that such literature provides a staging ground for public controversy and emerging theories about the artistic, cultural, ethical, and scientific significance and ramifications of addiction. <br/><br/>Course discussions will also consider how recent literature?both popular and scientific?expands the definition of addiction to include an ever-increasing array of behaviors (such as eating disorders, gambling, and compulsive shopping), in ways that may point to both patterns in contemporary culture and new directions for scientific research into the perennial problem of &quot;disrupted free will.&quot;<br/><br/>Course readings/viewing will include works of fiction and non-fiction as well as popular films. We will also consider practical topics such as how University library resources and experts can help students locate and evaluate key sources and develop authoritative arguments."}, {"name": "Teaching Method", "value": "Discussion and workshop"}, {"name": "Evaluation Method", "value": "This course requires three papers and periodic writing assignments in the class portfolio (approximately 25 pages total). All papers will be written in stages and revised. Quarter grades will cover writing (approximately 70%) and class participation (30%, including attendance and in-class presentations)."}, {"name": "Class Materials (Suggested)", "value": "Readings will include excerpts from some works and some works in their entirety:<br/>The Bacchae, Euripides;<br/>The Black Cat, Edgar Allen Poe;<br/>Dr. Jekell and Mr. Hyde, Robert Louis Stevenson;<br/>Confessions of an English Opium Eater, Thomas de Quincey;<br/>Ten Nights in a Bar Room, T.S. Arthur;<br/>Junky, William S. Burroughs;<br/>Drinking: A Love Story and Appetites, Caroline Knapp;<br/>Confessions of a Shopaholic, Sophia Kinsella;<br/>Online coursepack with critical readings (including excerpts from &quot;The Big Book&quot; of Alcoholics Anonymous).<br/><br/>Video:<br/>The Lost Weekend;<br/>The Philadelphia Story;<br/>The Neurobiology of Disrupted Free Will, Nora Volkow, Director of the National Institute on Drug Abuse."}], "lmod": "1/9/16 6:46 PM (CT)", "subject": "ENGLISH"}]