[{"class_mtg_info": [{"meet_t": "Tu 3:30PM - 6:20PM", "meet_l": "University Hall 101"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "25708", "title": "WCAS HISTORY 393-0-24 Approaches to History", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "25708", "instructors": [{"instructor_phone": "847/467-6538", "instructor_name": "Ji-Yeon   Yuh", "instructor_addr": "Harris Hall - Room 306"}], "topic": "Memories of War", "course": "393-0", "descriptions": [{"name": "Overview of class", "value": "Vietnamese refugees and Korean immigrants came to the United States with experiences of war that are passed to younger generations as both silence and memory. How can we understand and represent the experiences of both the older and younger generations? How do their experiences transform the history of Asian Americans as well as the broader history of the United States? What does war mean in the American experience? This research seminar focuses on Vietnamese American and Korean American communities in the Chicago area in an attempt to answer these and other questions through focused oral history research and public presentations."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Class participationResearch project"}, {"name": "Class Materials (Required)", "value": "***Tentative until posted to Norris website***<br/>Bruce Cumings. The Korean War: A History. 9780812978964.<br/>Mark Atwood Lawrence. The Vietnam War: A Concise International History. 9780199753932.<br/>Grace Cho. Haunting the Korean Diaspora: Shame, Secrecy, and the Forgotten War. 9780816652754.<br/>Memory of Forgotten War - streaming video<br/>Cathy J. Schlund-Vials. War, Genocide, and Justice: Cambodian American Memory. 9780816670970.<br/>Nathalie Huynh Chau Nguyen. Memory is Another Country: Women of Vietnamese Diaspora. 9780313360275."}, {"name": "Class Notes", "value": "AREA OF CONCENTRATION: Americas"}], "lmod": "12/24/16 7:00 PM (CT)", "subject": "HISTORY"}]