[{"class_mtg_info": [{"meet_t": "Tu 3:00PM - 5:50PM", "meet_l": "Annenberg Hall G29"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Winter 2017", "name": "26492", "title": "WCAS GEN_LA 280-6-20 Residence-Linked Seminar - VI (Literature and Fine Arts)", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>Permission of Instructor<br/><br/>", "section": "26492", "instructors": [{"instructor_phone": "", "instructor_name": "Rifka   Cook", "instructor_addr": ""}], "topic": "The Silver Mirror", "course": "280-6", "descriptions": [{"name": "Overview of class", "value": "The fundamental purpose of this course is the expanding of our students' horizons -<br/>especially through movies. The students will be introduced to the Latin-American culture<br/>through this engaging media; and help the students in the class to learn about events in<br/>specific cultures which have contributed to the panorama of the Latin-American's world<br/>community - for instance, the Mexican revolution, life in Cuba during the dictatorship of<br/>Castro, Chile in the 1970's, and so on. In addition to these memorable and salient references<br/>to contemporary history, the films will also teach students about the daily life of their<br/>protagonists with respect to food and meals, family and community traditions, the raising and<br/>education of children, etc. Such information provides a means for the student to grow in<br/>mindfulness of the quotidian lives of other peoples, as well as offering enjoyment to the<br/>whole class through sharing the viewing of much that is beautiful, uplifting, and thought provoking.<br/>Participating in the course will enhance critical thinking because students will<br/>learn how to evaluate and compare real events as recorded and portrayed in different movies."}, {"name": "Learning Objectives", "value": "After taking this course, students should be able to show they can:<br/><ul><br/><li> Examine, critically, the meanings of customs/habits among different Hispanic cultures.</li><br/><li> Explore the ways in which geographical, cultural, political, and economic forces interact<br/>to influence the culture of the region.</li><br/><li> Engage in debates with their classmates concerning the meaning and importance of some<br/>habits, traditions, or customs as a powerful symbol of social and cultural meanings.</li><br/><li> Contribute meaningfully to class discussion by identifying their own questions about the<br/>movies, by articulating their insights about the movies and readings, and by respectfully<br/>responding to others comments. </li><br/><ul>"}, {"name": "Teaching Method", "value": "The course will include introductory lectures; class discussions related to the movie<br/>scheduled for that class day, readings, and student presentations."}, {"name": "Evaluation Method", "value": "The participation grade is based on the student's watching the movie [before each class] and<br/>writing a synopsis/critique of the movie addressing the questions posted for that class day. In<br/>class, the students will sit in groups of three and read materials related to the movie they<br/>watched. This part of the evaluation will count toward 60% of the final grade. The Final<br/>Project will be divided in two parts: an oral presentation, and a written essay. I will provide a<br/>guide for the students to follow. This final Project will be worth 40% of the final grade.<br/>Further details will be distributed in class and posted on CMS."}], "lmod": "12/25/16 6:59 PM (CT)", "subject": "GEN_LA"}]