[{"class_mtg_info": [{"meet_t": "MoTuWeTh 10:00AM - 10:50AM", "meet_l": "Parkes Hall 213"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "32693", "title": "WCAS LATIN 101-3-21 Elementary Latin", "class_attributes": "Specific requirements in the language<br/><br/>", "section": "32693", "instructors": [{"instructor_phone": "847/491-8043", "instructor_name": "Graziela Marieta Byros", "instructor_addr": "Kresge Hall 4357"}], "topic": "", "course": "101-3", "descriptions": [{"name": "Overview of class", "value": "Elementary Latin provides a thorough introduction to the language, literature and culture of the Roman world. It helps lay the foundation for further study of western culture as well as Medieval Latin, Renaissance Latin, and other Romance languages. Latin 101-3 is the third quarter of the year-long Elementary Latin course designed to introduce students to the basic principles of classical Latin grammar and syntax. In addition to the mastering of these basic tools, the course will focus on vocabulary acquisition and the development of sight translation skills and reading competency necessary to continue successfully in the second year. During the first three weeks of the quarter, class meetings will be devoted to completing chapters 34-40 of Wheelock's Latin. For the rest of the term, primary Latin readings from Cicero's First Catilinarian Oration will be assigned on a daily basis. Students will be expected to develop their translation skills in prepared passages and in sight-reading exercises."}, {"name": "Registration Requirements", "value": "PREREQUISITES: Successful completion of Latin 101-2 OR placing in Latin 101-3 through the online Latin Placement Test. For further information, contact the Director of Latin Instruction Francesca Tataranni (f-tataranni@northwestern.edu)."}, {"name": "Learning Objectives", "value": "-students will have gained firm command of the basic Latin core vocabulary, as well as the basic principles of Latin grammar and syntax;<br/><br/>-students will have gained competency in prepared translation of Latin passages, as well as in sight-translation, in preparation for second year Latin."}, {"name": "Teaching Method", "value": "Class participationLecture"}, {"name": "Evaluation Method", "value": "AttendanceClass participationExam, finalExam, mid-termHomeworkQuizzesDaily assignments, attendance and participation in class, weekly quizzes, mandatory midterm and final exams."}, {"name": "Class Materials (Required)", "value": "1)LaFleur, Richard A., ed., Wheelock's Latin, 7th edition (Harper Collins, 2011) ISBN: 0061997226<br/>2)Groton, Anne H. &amp; James M. May, Latin Stories (Bolchazy-Carducci, 1995) ISBN: 0865162891<br/>3)K. Frerichs, Cicero's First Catilinarian Oration (Bolchazy-Carducci, 1997) ISBN: 0865163413<br/>4)Brad Tillery, Richard A. LaFleur, Cumulative Chapter Vocabulary Lists for Wheelock's Latin, Bolchazy- Carducci 2011 (7th ed.) ISBN: 086516620X"}, {"name": "Class Notes", "value": "PREREQUISITES: Successful completion of Latin 101-2 OR placing in Latin 101-3 through the online Latin Placement Test. For further information, contact the Director of Latin Instruction Francesca Tataranni (f-tataranni@northwestern.edu)."}], "lmod": "2/19/17 6:50 PM (CT)", "subject": "LATIN"}]