[{"class_mtg_info": [{"meet_t": "MoTuWeThFr 11:00AM - 11:50AM", "meet_l": "University Library 3622"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Prerequisite: Students must have passed Japanese 111-2 with at least a C- or  be placed in according to placement test results.<br/><br/>Prerequisite: Students must have passed Japanese 111-2 with at least a C- or  be placed in according to placement test results.", "qtr": "Spring 2017", "name": "32503", "title": "WCAS JAPANESE 111-3-22 Japanese I", "class_attributes": "Prerequisites apply, see description<br/><br/>Specific requirements in the language<br/><br/>", "section": "32503", "instructors": [{"instructor_phone": "8474912764", "instructor_name": "Yumi   Shiojima", "instructor_addr": "1880 Campus Drive, Kresge Hall, Office 4-349"}], "topic": "", "course": "111-3", "descriptions": [{"name": "Overview of class", "value": "Japanese I (JAPANESE 111-1, 2 and 3) is a yearlong course that covers the first half of college level elementary Japanese.  In Japanese I, students will develop the four skills of speaking, listening, reading, and writing and learn many aspects of Japanese culture and society through various in-class activities, written assignments, and video viewing.  Students will also learn to identify and self-correct errors in their language use to become independent learners. The instructor will assist in this learning process with oral and written feedback. Careful and thorough review and preparation for each class session are required."}, {"name": "Registration Requirements", "value": "Except for JAPANESE 111-1, students must pass the preceding course with C- or above, or must be placed into the course by the departmental placement test."}, {"name": "Learning Objectives", "value": "The goal of Japanese I is to bring students' overall Japanese proficiency to the Intermediate Low level defined by the American Council on Teaching of Foreign Languages (ACTFL) proficiency guidelines.  Upon the satisfactory completion of the course, the students will be able to greet, introduce themselves, describe their families and friends, discuss their daily routines and experiences, and write letters to teachers and friends. "}, {"name": "Teaching Method", "value": "This course is conducted mostly in Japanese, and class hours are spent mainly on oral development.  Written assignments are given for reading and writing development."}, {"name": "Class Materials (Required)", "value": "Hasegawa, Y. (2005). Elementary Japanese (Volume One) with CD-ROM. Tuttle Publishing.  ISBN: 978-0-8048-3504-6; AJALT (2012). JAPANESE FOR BUSY PEOPLE: Kana Workbook (for the Revised 3rd Edition). ISBN: 978-1-56836-401-8; Course Packet"}, {"name": "Class Materials (Suggested)", "value": "Endo-Hudson, M (1994). English Grammar for Students of Japanese. Ann Arbor: The Olivia and Hill Press. ISBN: 0-934034-16-8; Makino, S. &amp; Tsutsui M. (1989). Dictionary of Basic Japanese Grammar. Tokyo: The Japan Times. ISBN 4-7890-0454-6; Kodansha (2002). Kodansha's Essential Kanji Dictionary. Tokyo: Kodansha. ISBN: 978-4-7700-2891-4 / 4-7700-2891-1.   "}], "lmod": "2/13/17 6:46 PM (CT)", "subject": "JAPANESE"}]