[{"class_mtg_info": [{"meet_t": "MoWeFr 2:00PM - 2:50PM", "meet_l": "Technological Institute M152"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-requisite: Students must have completed NEUROSCIENCE 202 and 306 or BIOL_SCI 302 or BIOL_SCI 311 or gain consent of the instructor to enroll in this course.<br/><br/>Pre-requisite: Students must have completed NEUROSCIENCE 202 and 306 or BIOL_SCI 302 or BIOL_SCI 311 or gain consent of the instructor to enroll in this course.", "qtr": "Spring 2016", "name": "31459", "title": "WCAS NEUROSCI 377-0-1 Neurobiology of Sensation and Perception", "class_attributes": "Natural Sciences Distro Area<br/><br/>", "section": "31459", "instructors": [{"instructor_phone": "", "instructor_name": "Tiffany Marie Schmidt", "instructor_addr": ""}], "topic": "", "course": "377-0", "descriptions": [{"name": "Overview of class", "value": "Every day we experience our environment by sensing a combination of light (vision), pressure wave (hearing), chemical (taste, smell), and tactile (touch and pain) signals. Our nervous system is able to integrate and react to an ever-changing environment because of the existence of very specialized sensory cells throughout the body that detect external stimuli. Signals are then relayed to the brain where they allow us to perceive, interpret, and respond to sights, sounds, tastes, smells, touch, and pain. This course will provide an in-depth look at five major sensory systems: visual, auditory, gustatory, olfactory, and somatosensory, including their peripheral receptors and the central pathways leading to perception of the cues mentioned above."}, {"name": "Registration Requirements", "value": "Prerequisites: NEUROSCI 202 and 306; or BIOL SCI 302 or 311; or permission of the instructor."}, {"name": "Learning Objectives", "value": "1. To acquire in-depth knowledge of key concepts and neural pathways involved in the sensations of touch, pain, taste, hearing, vision, and olfaction (smell).<br/>2. To develop the ability to critically evaluate scientific evidence presented in published scientific literature the field of sensory neurobiology.<br/>3. To be able to interpret and explain scientific evidence for mechanisms of sensation.<br/>4. To understand the methods commonly used to study sensory systems.<br/>5. To develop the ability to make effective arguments and communicate effectively orally and in writing."}, {"name": "Teaching Method", "value": "Lecture"}, {"name": "Evaluation Method", "value": "Midterm Exam: 20% (15% for graduate students)<br/>Term Paper: 20% (25% for graduate students)<br/>Final Presentation: 10% (15% for graduate students)<br/>Participation: 10%<br/>Article Synopses: 10%<br/>Final Exam: 30% (25% for graduate students)"}, {"name": "Class Materials (Required)", "value": "Neuroscience, 5th Edition, Eds. Purves, Augustine, Fitzpatrick, Hall, LaMantia, White, ISBN: 0878936955; Additional selected readings will be provided."}, {"name": "Class Notes", "value": "Pre-requisite: Students must have completed NEUROSCI 202 and 306; or BIOL SCI 302 or 311; or gain permission of the instructor to register for this course."}], "lmod": "4/3/16 8:13 PM (CT)", "subject": "NEUROSCI"}]