[{"class_mtg_info": [{"meet_t": "MoWe 9:00AM - 10:20AM", "meet_l": "Harris Hall L28"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "34798", "title": "WCAS SLAVIC 396-0-20 Topics in Literature and Arts", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "34798", "instructors": [{"instructor_phone": "847/868-4964", "instructor_name": "Hui   Zhang", "instructor_addr": "1880 Campus Dr. (Kresge) Office 3359"}], "topic": "", "course": "396-0", "descriptions": [{"name": "Overview of class", "value": "This course investigates the description, evaluation and representation of Asia in Russian writings of the 19th and the 20th century, with a specific focus on East Asia. We will engage with the notion of &quot;Russian orientalism&quot; in consideration of both the narrower and broader sense of the word: We will look at the development of Russian oriental studies and its relationship with the nation- and empire-building in Russian history. More importantly, we will read orientalism as a system of knowledge, opinions, judgments and hypotheses about Asia that was formed and transformed in the artistic, philosophical and journalistic writings by Russian authors. Questions to be discussed include: To what extent is Edward Said's idea of orientalism applicable to the history of Russian writings about Asia? Is it possible to talk about a &quot;Russian occidentalism&quot; that corresponds and counterbalances the orientalism? Does Russian orientalism draw a line between the orients within and without Russia? Authors to be read include: Vasilii Vasil'ev, Konstantin Leontiev, Vladimir Solovyov, Andrey Bely, Nikolai Gumilev, Velimir Khlebnikov, Boris Pilnyak, Sergei Tretyakov, etc."}, {"name": "Learning Objectives", "value": "We will aim at developing a critical methodology of reading and understanding Russian writings about Asia, in particular about China and Japan. Students are encouraged to extend their interest to other areas of Russian orientalism and Russia-Asia relationship."}, {"name": "Teaching Method", "value": "Lecture and discussion."}, {"name": "Evaluation Method", "value": "Presentation and Final Paper."}, {"name": "Class Materials (Required)", "value": "All readings will be available in libraries and/or on Canvas."}], "lmod": "2/19/17 6:52 PM (CT)", "subject": "SLAVIC"}]