[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "555 Clark B03"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "23341", "title": "WCAS GNDR_ST 332-0-1 Gender, Sexuality, and Health", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "23341", "instructors": [{"instructor_phone": "", "instructor_name": "Aaron Travis Norton", "instructor_addr": ""}], "topic": "Sexuality, Bio-medicine, &amp; HIV", "course": "332-0", "descriptions": [{"name": "Overview of class", "value": "SINCE THE APPEARANCE OF A &quot;MYSTERIOUS NEW ILLNESS&quot; AMONG GAY MEN IN THE U.S., HIV/AIDS HAS BEEN CLOSELY ASSOCIATED WITH SEXUALITY. THIS IS TRUE NOT ONLY BECAUSE A LARGE PERCENTAGE OF HIV-TRANSMISSION OCCURS VIA SEXUAL CONTACT, BUT ALSO BECAUSE OF CLOSE ASSOCIATIONS BETWEEN SEXUALITY AND MORALITY AND WHAT &quot;KINDS&quot; OF PEOPLE AND PRACTICES ARE SAID TO BE MORE LIKELY TO SPREAD HIV THAN OTHERS. IN THIS COURSE, WE DRAW UPON SCHOLARSHIP IN THE SOCIAL SCIENCES AND HUMANITIES TO EXAMINE THE INTERPLAY BETWEEN HIV/AIDS AND SEXUALITY, WITH AN EMPHASIS ON THE ROLE OF SCIENCE AND TECHNOLOGY. HOW DID ASSOCIATIONS BETWEEN SEXUALITY, DISEASE AND MORALITY SHAPE WHAT WAS KNOWN ABOUT THE SPREAD OF HIV EARLY IN THE EPIDEMIC? HOW HAVE ONGOING EFFORTS TO KNOW, TREAT AND PREVENT HIV SHAPED SEXUAL PRACTICES AND INTIMACIES, AND VICE VERSA? TOGETHER, WILL CONSIDER THE COMPLEX INTERPLAY OF HIV, SEXUALITY AND SCIENCE ACROSS A DIVERSE ARRAY OF TOPICS, INCLUDING: THE POLITICS OF HIV-RISK CATEGORIZATION; HIV-STIGMA AND DISCRIMINATION; SOCIAL MOVEMENTS AND ACCESS TO TREATMENT; SEXUAL PRACTICES AND INTIMACIES; AND NEW FRONTIERS IN HIV-PREVENTION, AMONG OTHERS."}, {"name": "Teaching Method", "value": "Lecture"}, {"name": "Evaluation Method", "value": "STUDENTS WILL SUBMIT:<br/>WEEKLY RESPONSES TO READINGS (8 TOTAL)<br/>QUESTIONS BASED ON READINGS (FOR CLASS DISCUSSION)<br/>SHORT MIDTERM PAPER<br/>FINAL TAKE-HOME ESSAY EXAM"}, {"name": "Class Materials (Required)", "value": "Brier, Jennifer. 2009. &quot;Early AIDS Activism&quot; Pp. 11-44 in Infectious Ideas: U.S. Political Responses to the AIDS Epidemic<br/><br/>Carrillo, H. (2002). Trust, love, passion: The relational context of HIV risk. In: The Night Is Young: Sexuality in Mexico in the Time of AIDS (pp. 255-287).<br/><br/>Cohen, Cathy J. 1996. &quot;Contested Membership: Black Gay Identities and The Politics of AIDS.&quot; Pp. 41-61 in Queer Studies: An Interdisciplinary Reader<br/><br/>Dean, T. (2009). Introduction: Confessions of a Barebacker. In: Unlimited Intimacy: Reflections on the Subculture of Barebacking (pp. 1-47).<br/><br/>Dean, Tim. 2015. &quot;Mediated intimacies: Raw sex, Truvada, and the biopolitics of chemoprophylaxis.&quot;<br/>Sexualities 18(1-2): 224-46.<br/><br/>Epstein, S. (1988). Moral contagion and the medicalizing of gay identity: AIDS in historical perspective. Research in Law, Deviance and Social Control, 9: 3-36.<br/><br/>Epstein, S. (1996). Impure Science (Chapters 1 and 5-7).<br/><br/>Fassin, Didier. 2008. &quot;The embodied past. From paranoid style to politics of memory in South Africa.&quot; Social Anthropology 16(3): 312-28.<br/><br/>Fassin, Didier. 2003. &quot;The Embodiment of Inequality.&quot; EMBO reports 4(6S): S4-S9. <br/><br/>Flowers, Paul. 2001. &quot;Gay men and HIV/AIDS risk management.&quot; Health: 5(1): 50-75.<br/><br/>Hammonds, Evelynn. 1997. &quot;Seeing AIDS: Race, Gender and Representation&quot; Pp. 113-126 in The Gender Politics of HIV/AIDS in Women: Perspectives on the Pandemic in the U.S. <br/><br/>Herek, G.M. (1990). Illness, stigma, and AIDS. (pp. 107-150).<br/><br/>Hoppe, Trevor. 2013. &quot;From Sickness to Badness: The Criminalization of HIV in Michigan.&quot; Social Science &amp; Medicine 101: 139-47.<br/><br/>Kippax, S., &amp; Race, K. (2003) Sustaining safe practice: Twenty years on. Social Science &amp; Medicine, 57(1), 1-12.<br/><br/>Lewis, Desiree. 2011. &quot;Representing African Sexualities&quot; Pp. 199-216 in African Sexualities: A Reader<br/><br/>Lupton, D., McCarthy, S., &amp; Chapman, S. (1995) Doing the right thing: The symbolic meanings and experiences of having an HIV antibody test. Social Science &amp; Medicine, 41(2), 173-180.<br/><br/>Mykhalovskiy, Eric. 2011. &quot;The Problem of&quot; Significant Risk&quot;: Exploring the Public Health Impact of Criminalizing HIV Non-Disclosure.&quot; Social Science &amp; Medicine 73(5): 668-75.<br/><br/>Nguyen, V.K. (2005). Uses and Pleasures: Sexual Modernity, HIV/AIDS, and Confessional Technologies in a West African Metropolis. (pp. 245-267)<br/><br/>Nguyen, V.K., Bajos, N., Dubois-Arber, F., O'Malley, J., &amp; Pirkle, C.M. (2011) Remedicalizing an epidemic: From HIV treatment as prevention to HIV treatment is prevention. AIDS, 25(3), 291-293.<br/><br/>Norton, Aaron T. 2013. &quot;Surveying Risk Subjects: Public Health Surveys as Instruments of Biomedicalization.&quot; BioSocieties 8(3): 265-88.<br/><br/>Patton, Cindy. 1990. &quot;Inventing ?African' AIDS.&quot; new formations (10): 25-39.<br/><br/>Phillips, Layli. 2005. &quot;Deconstructing &quot;Down Low&quot; Discourse: The Politics of Sexuality, Gender, Race, AIDS, and Anxiety.&quot; Journal of African American Studies 9(2): 3-15.<br/><br/>Preda, Alex. 2004. AIDS, Rhetoric, and Medical Knowledge [selections from Introduction and Chapter 2)<br/><br/>Seidman, Steven. 1997. &quot;Transfiguring Sexual Identity: AIDS and The Cultural Politics of Sexuality and Homosexuality, 1981-1986.&quot; Pp. 165-84 in Difference troubles: Queering social theory and sexual politics.<br/><br/>Race, K. 2001. The undetectable crisis: Changing technologies of risk. Sexualities 4(2): 167-89.<br/><br/>Treichler, P.A. (1988). AIDS, homophobia, and biomedical discourse: An epidemic of signification. (pp. 357-373)<br/><br/>Watney (1990/1999). &quot;Safer sex as Community Practice&quot; Pp. 405-416 in Culture, Society and Sexuality: A Reader"}], "lmod": "1/9/16 6:48 PM (CT)", "subject": "GNDR_ST"}]