[{"class_mtg_info": [{"meet_t": "MoWeFr 12:00PM - 12:50PM", "meet_l": "Technological Institute L168"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "37189", "title": "WCAS PHYSICS 239-0-1 Foundations of Modern Physics", "class_attributes": "Natural Sciences Distro Area<br/><br/>", "section": "37189", "instructors": [{"instructor_phone": "847/467-2583", "instructor_name": "Jens   Koch", "instructor_addr": "Technological Institute Building (2145 Sheridan Road), Room F-332, Evanston, IL"}], "topic": "", "course": "239-0", "descriptions": [{"name": "Overview of class", "value": "This course provides an introduction to the foundational principles that are required for a modern interpretation of physical systems. The key concepts of quantum physics are motivated from seminal experiments, both of the early 20th century and in the modern era. Major topics include the wave nature of light and matter, the probabilistic interpretation of wavefunctions, one-dimensional potentials, and tunneling. Applications of quantum theory to modern topics such as statistics and atomic structure are introduced. The course will strengthen problem solving skills and tools, including complex numbers, series, and differential equations, to build intuition in modern physics, which differs significantly from the familiar expectations of classical physics."}, {"name": "Registration Requirements", "value": "Prerequisites are PHYSICS 135-1,2,3 or equivalent; MATH 250 or PHYS 211-2 or equivalent (concurrent enrollment permitted)"}, {"name": "Learning Objectives", "value": "Acquire knowledge of seminal experiments indicating that classical reasoning is insufficient to describe the natural world, understand and apply the probabilistic interpretation of both quantum measurement and quantum theory, explain fundamental principles of quantum physics and implications for particles, photons, atoms , and solid-state materials, use critical calculational methods to understand quantum wavefunctions in one or more dimensions, give concise physical interpretations, and arguments for the validity of mathematical solutions."}, {"name": "Teaching Method", "value": "Lectures"}, {"name": "Evaluation Method", "value": "Grades are obtained as weighted averages of scores from online quizzes, problem sets, midterm exam, and final exam."}, {"name": "Class Materials (Required)", "value": "none (lecture notes will be provided)"}, {"name": "Class Materials (Suggested)", "value": "Quantum Physics: A Fundamental Approach to Modern Physics (John Townsend, University Science Books)"}], "lmod": "2/6/17 6:53 PM (CT)", "subject": "PHYSICS"}]