[{"class_mtg_info": [{"meet_t": "Th 2:00PM - 4:50PM", "meet_l": "Scott Hall 107 Burdick Room"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "23045", "title": "WCAS POLI_SCI 447-0-20 Critical Studies in World Politics", "class_attributes": "", "section": "23045", "instructors": [{"instructor_phone": "847 491 2632", "instructor_name": "Michael M Loriaux", "instructor_addr": "601 University Place, Scott Hall #325"}], "topic": "", "course": "447-0", "descriptions": [{"name": "Overview of class", "value": "Realism: Crisis in Europe and Rebellion in Thought on War and Violence.<br/><br/>The word &quot;critical&quot; in critical theory is the adjective of the noun &quot;crisis.&quot; Critical theory draws its energy from the sentiment that we are living in an era of crisis, diversely described as a crisis of &quot;nihilism,&quot; a &quot;crisis of modernity,&quot; or a crisis of &quot;Enlightenment values.&quot; In a word, confidence in progress through science and reason has, over the past decades, fallen victim to such political phenomena as fascist and communist totalitarianism, genocide, a thirty-year &quot;world war,&quot; &quot;mutual assured destruction,&quot; several major financial crises, and our inability or unwillingness to address climate change. <br/><br/>Critical theory builds on the suspicion that our confidence in progress, through reason, toward perpetual peace and prosperity is threatened, not by external forces, like ISIS or xenophobic political parties, but by internal, endogenous defects in thought, argument, and valuation. Critical theory seeks to expose those defects, bring them to public scrutiny, and introduce awareness of them into public debate.<br/><br/>This year we apply this perspective to Political Realism. The suspicion here is that Political Realism is an expression of nihilism. We explore that suspicion by reading two early sources of Realist thought, Carr's Twenty Year Crisis and Morgenthau's Scientific Man versus Power Politics. We then place that literature in debate with &quot;continental&quot; reactions to the same crisis, the crisis of the new &quot;thirty years war&quot; that brought Europe to its knees in the last century: Heidegger, Levinas, Patocka, and Camus. We end with speculations regarding the impact of the Cold War and its promotion of the more &quot;managerial&quot; thought that is Realism, and the continental tradition that focuses on &quot;meaning.&quot;<br/><br/>No prior exposure to Critical Theory is necessary."}, {"name": "Evaluation Method", "value": "Writing Assignment. Students write a 15-20 page term paper, due March16."}, {"name": "Class Materials (Required)", "value": "Calendar: <br/>Week 1. E. H. Carr, The Twenty Years Crisis.<br/><br/>Week 2. Hans Morgenthau, Scientific Man versus Power Politics. Christoph Frei, Hans J. Morgenthau: An Intellectual Biography.<br/><br/>Week 3. Mark Wrathall, How to read Heidegger, Martin Heidegger, &quot;The Ontic Priority of the Question of Being&quot; [53-7]; &quot;The Phenomenological Method of the Investigation,&quot; [71-3]. <br/><br/>Week 4. Jan Patocka, Heretical Essays in the Philosophy of History<br/><br/>Week 5. Marc Crépon, The Thought of Death and the Memory of War, ch. 3; Emmanuel Levinas, &quot;Is Ontology Fundamental?;&quot; &quot;Transcendence and Intelligibility;&quot; &quot;Peace and Proximity;&quot; &quot;Useless Suffering;&quot; Marc Crépon, Murderous Consent, ch. 3. <br/><br/>Week 6. Albert Camus, The Rebel; The Plague.<br/><br/>Week 7. Theodor Adorno et al., Aesthetics and Politics.<br/><br/>Week 8. Jacques Derrida, Rogues.<br/><br/>Week 9: Ido Oren, Our Enemies and US.<br/><br/>Week 10: Marc Crépon, Murderous Consent."}], "lmod": "12/29/16 7:04 PM (CT)", "subject": "POLI_SCI"}]