[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "Harris Hall L05"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Winter 2017", "name": "23889", "title": "WCAS ENGLISH 101-6-22 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "23889", "instructors": [{"instructor_phone": "", "instructor_name": "Whitney Blair Taylor", "instructor_addr": ""}], "topic": "Action Heroines", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "Recently, an abundance of heroines has emerged in young adult literature and, in turn, cinema. In contradistinction to the earlier (and slightly concurrent) popularity of the more passive female protagonist of Twilight, the image of a strong female lead, shooting arrows, jumping off of trains, and generally kicking ass, has captured the attention of readers, movie-goers, and the mainstream media. This class asks why the strong heroine is popular in this cultural moment both by analyzing the primary texts that feature them and by reading them in conjunction with analysis of the phenomena from the perspective of cultural studies. Representations of these heroines in the media will also be treated as texts for unpacking the significance of the trend. Does the introduction of these young women in young adult fiction change the way popular culture represents the role of women and girls in society more generally? As a foundation for our investigation, the course will begin by historicizing the notion of what it means to be a &quot;heroine&quot; in the popular imagination and specifically in the narratives offered by literature and film. Traditionally, is the heroine's journey distinct from the hero's? How might the heroine destabilize constructs of gender and sexuality? How does the role of the heroine relate to genre? (Are the genres of fantasy and dystopian fiction, for instance, especially conducive to the emergence of a Katniss-like heroine?) To answer these questions, our readings will engage with gender and feminist theory and masculinity studies. In doing so, we will dissect the traits characterizing recent popular heroines and examine how they might undermine hierarchies and norms of gender and sexuality. At the same time, our inquiry will trouble whether the current era of heroines is actually as subversive as it might seem by investigating what gender roles and stereotypes these characters and their stories might be reinforcing."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Participation, brief oral presentation, written assignments. There will be one short (3-5 pp.) and one longer final research paper (5-7pp.)."}, {"name": "Class Materials (Required)", "value": "Suzanne Collins, The Hunger Games; Robin LaFevers, Grave Mercy; Kristin Cashore, Graceling; Elizabeth Wein, Code Name Verity; and Tim Hanley, Wonder Woman Unbound: The Secret History of the World's Most Famous Heroine."}], "lmod": "12/25/16 6:58 PM (CT)", "subject": "ENGLISH"}]