[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Annenberg Hall G30"}], "school": "WCAS", "overview_of_class": "The goals of this course are to introduce students to the fundamental principles of theoretical syntax, to place them in a position to pursue more advanced study in syntax, and to provide a foundation for their own research. Students will learn the analytical methods used in syntactic research: how to analyze syntactic data, how to formulate plausible hypotheses to explain the data, and how to compare and evaluate hypotheses. Thus, the main focus of the course is on learning how to do syntax, and secondarily on learning a particular theory of syntax. No textbook will be used, and there will be minimal reading assignments; instead, the course will proceed on the basis of class discussion and weekly written assignments. Although the primary source of linguistic data will be English, examples will also be drawn from other languages both in class and on the assignments.", "qtr": "Fall 2017", "name": "Fundamentals of Syntax", "title": "WCAS LING 360-0-20 Fundamentals of Syntax", "lmod": "5/2/17 8:02 PM (CT)", "section": "20", "topic": "", "course": "360-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "The goals of this course are to introduce students to the fundamental principles of theoretical syntax, to place them in a position to pursue more advanced study in syntax, and to provide a foundation for their own research. Students will learn the analytical methods used in syntactic research: how to analyze syntactic data, how to formulate plausible hypotheses to explain the data, and how to compare and evaluate hypotheses. Thus, the main focus of the course is on learning how to do syntax, and secondarily on learning a particular theory of syntax. No textbook will be used, and there will be minimal reading assignments; instead, the course will proceed on the basis of class discussion and weekly written assignments. Although the primary source of linguistic data will be English, examples will also be drawn from other languages both in class and on the assignments."}, {"name": "Registration Requirements", "value": "None"}, {"name": "Learning Objectives", "value": "The past 40 years have seen significant advances in the understanding of the so-called \"locality constraints\" in syntax. A great number of studies have been devoted to understand the nature of syntactic operations and they have been crucially looking at the interaction of these operations with the locality constraints. However, in this direction of research, the nature of islands has been relatively disregarded for a long time. Although Ross's studies have revealed which domains are islands and which are not, the question why islands are islands and non-islands are not islands has remained unanswered except for a few studies (Chomsky 1986, Lasnik & Saito 1992, Rizzi 1991 and others). Even these attempts are facing serious challenges once we start looking at wide varieties of cross-linguistic data. The aim of this course is to learn the basics of transformational generative grammar by looking at locality constraints. In particular we are concerned with questions of what the nature of island constraints is, and what our current understanding of them is."}, {"name": "Teaching Method", "value": "Lecture"}, {"name": "Evaluation Method", "value": "ExamsHomework"}, {"name": "Class Materials (Required)", "value": "No textbook. The reading materials will be provided electronically."}, {"name": "Class Notes", "value": "None"}], "instructor": ["Masaya   Yoshida"], "class_attributes": "Formal Studies Distro Area<br/><br/>", "id": "10027", "subject": "LING"}]