[{"class_mtg_info": [{"meet_t": "Tu 3:00PM - 5:50PM", "meet_l": "Locy Hall 213"}], "school": "WCAS", "overview_of_class": "What is \"affect theory\"? What is \"the history of emotions\"? This course charts seminal critical theoretical approaches to literary and cultural analysis through the lens of emotion and affect theory. Beginning with post-Freudian psychoanalysis, the class considers how (or even if) subjectivity and attachment are staged in theory, literature, and film. Is affect merely an expression of contained, individual inner states? How do emotions form and mediate the subject`s relationship to the world? In response to questions such as these, the class will consider connections between emotion and politics and the ways in which this relationship is staged in different media from emotions-on-the-couch to post cinematic affect.", "qtr": "Fall 2017", "name": "Studies in Communication and Culture", "title": "WCAS GERMAN 441-0-20 Studies in Communication and Culture", "lmod": "5/1/17 8:10 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "847/467-5173", "instructor_name": "Anna Maree Parkinson", "instructor_addr": "1880 Campus Drive, Kresge Hall, Rm 3321, Evanston"}], "topic": "Affective Passages", "course": "441-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "What is \"affect theory\"? What is \"the history of emotions\"? This course charts seminal critical theoretical approaches to literary and cultural analysis through the lens of emotion and affect theory. Beginning with post-Freudian psychoanalysis, the class considers how (or even if) subjectivity and attachment are staged in theory, literature, and film. Is affect merely an expression of contained, individual inner states? How do emotions form and mediate the subject`s relationship to the world? In response to questions such as these, the class will consider connections between emotion and politics and the ways in which this relationship is staged in different media from emotions-on-the-couch to post cinematic affect."}, {"name": "Registration Requirements", "value": "? Students will evaluate and critique prominent and influential critical theories of affect and emotion.<br/>? Students will be able to articulate how theoretical configurations are performed in different medial forms.<br/>? Students will be able to interpret the critical relationship between emotions, affect theory, and politics.<br/>? Students will be able to formulate an abstract, collate an annotated bibliography, present their research to and discuss their ideas with peers, and write an independent research paper on a subject of their choice."}, {"name": "Teaching Method", "value": "Class participationDiscussionFilms / videosPresentationsReadingsResearch projectSeminar: One class session: 3 hours<br/>Writing assignments"}, {"name": "Evaluation Method", "value": "AttendanceClass participationPapersPresentationsReadingsWriting assignments"}, {"name": "Class Materials (Required)", "value": "? Elisabeth R. Anker, Orgies of Feeling: Melodrama and the Politics of Freedom. Durham: Duke University Press, 2014.<br/>? Lauren Berlant, The Female Complaint: The Unfinished Business of Sentimentality in American Culture. Durham: Duke University Press, 2008.<br/>? Judith Butler, Precarious Life: The Powers of Mourning and Violence. London: Verso, 2006. ISBN 978-1844675449<br/>? Henry James, The Turn of the Screw and The Aspern Papers. New York: Penguin, 2003. ISBN 978-0141439907<br/>? Eve Kosofsky Sedgwick, Touching Feeling: Affect, Pedagogy, Performativity. Durham: Duke University Press, 2003. ISBN: 978-0822330158.<br/>? Friedrich Nietzsche, The Basic Writings of Nietzsche. New York: Modern Library Classics, 2010. ISBN 978-0679783398.<br/>? Steven Shaviro, Post Cinematic Affect. Winchester, UK: Zero Books, 2010. ISBN: 978-1846944314<br/>? Niza Yanay, The Ideology of Hatred. New York: Fordam University Press, 2013. ISBN: 978-0823250059"}], "path": "/class-descriptions/4680/WCAS/GERMAN/441-0/16687", "instructor": ["Anna Maree Parkinson"], "class_attributes": "", "id": "16687", "subject": "GERMAN"}]