[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Locy Hall 303"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "12243", "title": "WCAS GNDR_ST 396-0-20 Research Methods for Gender &amp; Sexuality Studies", "class_attributes": "Undergraduate Students Only<br/><br/>", "section": "12243", "instructors": [{"instructor_phone": "", "instructor_name": "Aaron Travis Norton", "instructor_addr": ""}], "topic": "", "course": "396-0", "descriptions": [{"name": "Overview of class", "value": "This course serves as an introduction to research methods in the interdisciplinary study of gender and sexuality. We will explore a range of methods used in the qualitative social sciences and the humanities, including one-one-one interviewing, participant observation, focus groups, surveys, textual and content analysis, and archival analysis. We will discuss the relationship between research methods and other crucial aspects of research design, including formulating research questions, creating implementation plans, selecting sampling strategies, selecting analytical strategies, and writing up results. The course will include guest lectures by Gender &amp; Sexuality Studies (GSS) faculty. We will examine the methodological sections of some of their work, as well as other key sources on GSS-related methods. Students are expected to do all assigned readings, attend class regularly, participate in class discussion, write short critical reviews and research proposal drafts, provide peer review comments, complete all readings and written assignments, receive peer review comments and incorporate them into their research proposals, and produce a complete research proposal for a planned GSS project."}, {"name": "Teaching Method", "value": "Seminar-style discussion of class readings, presentations by instructor and guest speakers, student presentations, written assignments, and peer review"}, {"name": "Evaluation Method", "value": "Class participation, student presentations, short critical reviews, research proposal drafts, and a complete research proposal that serves as a final project for the course"}], "lmod": "10/30/16 7:05 PM (CT)", "subject": "GNDR_ST"}]