[{"class_mtg_info": [{"meet_t": "Tu 3:30PM - 6:20PM", "meet_l": "University Hall 318"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-registration - Reserved for History &amp; International Studies students.<br/><br/>Freshmen may not register for this course.", "qtr": "Spring 2017", "name": "34272", "title": "WCAS HISTORY 395-0-22 Research Seminar", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "34272", "instructors": [{"instructor_phone": "847/491-3418", "instructor_name": "Melissa A Macauley", "instructor_addr": "Harris Hall - Room 344"}], "topic": "Imperialism in Asia", "course": "395-0", "descriptions": [{"name": "Overview of class", "value": "This seminar is designed to provide students of history, Asian studies, and international affairs with the opportunity to engage in sustained historical research and writing over the course of an entire quarter. The first two-thirds of the course will be devoted to reading a variety of source materials relating to the subject of imperialism in East, South, and Southeast Asia. The last third of the course will be devoted to the research and writing of a term paper on any topic of your choice relating to the history of colonialism and imperialism in these regions. Students may wish to examine certain genres of primary source material: missionary writings, diplomatic correspondence, or travel literature, for example. Or students might wish to evaluate the secondary source literature on those topics concerning which there has been extended scholarly debate (for example, the Vietnam Wars; the Japanese occupation of Southeast Asia; the American enterprise in the Philippines; some aspect of British imperialism in India, Singapore, or Hong Kong; the Boxer Uprising and War; some aspect of the Cold War in Asia; gender and empire in a particular place; and so on). The purpose of this paper is not to write a major undergraduate study, but to write the kind of polished term paper that is not usually possible during the frenzied schedule of the quarter system. We will define imperialism broadly and you will have great leeway deciding your term paper topic."}, {"name": "Teaching Method", "value": "Seminar &amp; Individual Sessions with the Professor"}, {"name": "Evaluation Method", "value": "Participation, One Short Paper based upon a book that is central to your research (2 pgs.), &amp; Final Paper (15-20 pgs.)"}, {"name": "Class Materials (Required)", "value": "Frank Dikotter et al. Narcotic Culture. 9780226149059. Carl Trocki. Opium, Empire and the Global Political Economy: A Study of the Asian Opium Trade 1750-<br/>1950 (Asia's Transformations). 9780415215008.<br/>James Hevia. English Lessons: The Pedagogy of Imperialism in Nineteenth-Century China. 9780822331889. E. M. Forster. A Passage to India. 9780156711425. Niall Ferguson. Empire: The Rise and Demise of the British World Order and the Lessons for Global Power. 9780465023295. Louise Young. Japan's Total Empire: Manchuria and the Culture of Wartime Imperialism. 9780520219342. We will also make extended use of important databases in the Library, including &quot;China: Trade, Politics, and Culture, 1793-1980: Sources from the School of Oriental and African Studies and the British Library, London.&quot;"}], "lmod": "2/14/17 6:45 PM (CT)", "subject": "HISTORY"}]