[{"class_mtg_info": [{"meet_t": "Mo 3:00PM - 4:50PM", "meet_l": "Kresge Centennial Hall 2-415"}], "school": "WCAS", "overview_of_class": "Although the ancient Romans never made it to the new world, their legacy in Chicago is reflected in architecture, the visual arts, and sites devoted to recreation, education, politics, and business. This class will journey to Chicago's financial district, political and commercial core, cultural institutions, hotels, theaters, parks, schools, cemeteries, and ethnic neighborhoods. By walking the city, you will learn to \"read\" the streets, buildings, and monuments that showcase Chicago's engagement with the classical past. You will also learn how to use digital tools and practices ? such as video editing, data analysis, and digital mapping ? to produce an innovative and collaborative virtual walking tour mapping Chicago's ongoing dialogue with Roman antiquity.", "qtr": "Fall 2016", "name": "Humanities in the Digital Age", "title": "WCAS HUM 325-6-20 Humanities in the Digital Age", "lmod": "10/30/16 7:06 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "847/491-8029", "instructor_name": "Francesca   Tataranni", "instructor_addr": "Crowe Hall 3-171"}], "associated_classes": [{"component": "LAB", "room": "Kresge Cent. Hall 2-530 MMLC", "meeting_time": "We 3:00PM - 4:20PM"}], "topic": "Ancient Rome in Chicago", "course": "325-6", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Although the ancient Romans never made it to the new world, their legacy in Chicago is reflected in architecture, the visual arts, and sites devoted to recreation, education, politics, and business. This class will journey to Chicago's financial district, political and commercial core, cultural institutions, hotels, theaters, parks, schools, cemeteries, and ethnic neighborhoods. By walking the city, you will learn to &quot;read&quot; the streets, buildings, and monuments that showcase Chicago's engagement with the classical past. You will also learn how to use digital tools and practices ? such as video editing, data analysis, and digital mapping ? to produce an innovative and collaborative virtual walking tour mapping Chicago's ongoing dialogue with Roman antiquity."}, {"name": "Teaching Method", "value": "The aim of this advanced research seminar is to train students to take ownership of their learning through knowledge creation. Students' work will be divided among class discussions and workshops, in- and out-of class labs, and individual and collaborative research. Students will meet with the instructor for two hours and a half every week in a traditional classroom setting where they will discuss assigned readings, do task-based exercises, report on the progress of their research, showcase their projects and receive feedback from the instructor and their classmates. Weekly labs will complement the regular sessions and will provide students with a dedicated time and space to familiarize themselves with digital technologies. Labs will be run by members of the Center for Scholarly Communication &amp; Digital Curation and the Multimedia Learning Center at Northwestern University in collaboration with the instructor."}, {"name": "Evaluation Method", "value": "Daily assignments; individual and group projects; participation in class discussion and labs"}, {"name": "Class Materials (Required)", "value": "All the readings for this class will be posted on Canvas"}, {"name": "Class Notes", "value": "Attendance at first class is mandatory. No P/N option."}], "path": "/class-descriptions/4640/WCAS/HUM/325-6/12934", "instructor": ["Francesca   Tataranni"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "12934", "subject": "HUM"}, {"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Parkes Hall 224"}], "school": "WCAS", "overview_of_class": "What is the history of cultural and arts criticism in the United States? Where is it headed today? This methods course combines historical examination with fieldwork in the setting of a contemporary art museum. Students read extensively in the history of cultural criticism while experimenting with new, digital modes of writing. The course convenes in seminar format once a week on the Evanston campus (Thursdays) and once a week at the Museum of Contemporary Art, conveniently located across the street from the Chicago campus's stop for the free Intercampus bus (Tuesdays, when the museum is open late and free to the public; other trips to the MCA will be required to complete assignments as well). Over the course of the quarter, we will meet with MCA staff and Northwestern faculty whose work examines cultural criticism. Expect extensive discussion of readings, films, artworks, digital projects, performances, and more.", "qtr": "Fall 2016", "name": "Humanities in the Digital Age", "title": "WCAS HUM 325-6-21 Humanities in the Digital Age", "lmod": "10/30/16 7:06 PM (CT)", "section": "21", "instructors": [{"instructor_phone": "847/467-3879", "instructor_name": "Michael J Kramer", "instructor_addr": "Harris Hall 212"}], "topic": "Cultural Criticism and the Contemp Museum", "course": "325-6", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "What is the history of cultural and arts criticism in the United States? Where is it headed today? This methods course combines historical examination with fieldwork in the setting of a contemporary art museum. Students read extensively in the history of cultural criticism while experimenting with new, digital modes of writing. The course convenes in seminar format once a week on the Evanston campus (Thursdays) and once a week at the Museum of Contemporary Art, conveniently located across the street from the Chicago campus's stop for the free Intercampus bus (Tuesdays, when the museum is open late and free to the public; other trips to the MCA will be required to complete assignments as well). Over the course of the quarter, we will meet with MCA staff and Northwestern faculty whose work examines cultural criticism. Expect extensive discussion of readings, films, artworks, digital projects, performances, and more."}, {"name": "Evaluation Method", "value": "Assessment in the course revolves around multimedia modes of digital cultural criticism written about the MCA Chicago's exhibitions, performance series, and educational events (no extensive computer experience required, just a willingness to spend time at the MCA and to experiment with digital approaches to cultural criticism). Selections of student work will potentially appear on the MCA's official blog, MCA DNA. The course concludes with one final, scholarly, multimedia essay on a topic related to the contemporary museum, cultural and arts criticism, and a student's particular interests."}, {"name": "Class Materials (Suggested)", "value": "? Matti Bunzl, In Search of a Lost Avant-Garde: An Anthropologist Investigates the<br/>Contemporary Art Museum (Chicago: University of Chicago Press, 2014), ISBN-<br/>13: 9780226418124.<br/>? A. O. Scott, Better Living Through Criticism: How to Think About Art, Pleasure,<br/>Beauty and Truth (New York: Penguin, 2016), ISBN-13: 978-1910702550<br/>? Susan Sontag, On Photography (NY: Farrar, Straus, and Giroux, 1977), ISBN-13:<br/>978-0312420093.<br/>? Claire Bishop, Radical Museology: Or What's Contemporary in Museums of<br/>Contemporary Art? (London: Koenig Books, 2013), ISBN-13: 978-3863353643.<br/>? Lane Relyea, Your Everyday Art World (Cambridge, MA: MIT Press, 2013),<br/>ISBN-13: 978-0262019231.<br/>? David Murray, ed., American Cultural Criticism (Exeter, UK: University of<br/>Exeter Press, 1995), ISBN-13: 978-0859894043.<br/>? Ben Davis, 9.5 Theses on Art and Class (Chicago: Haymarket Books, 2013),<br/>ISBN-13: 978-1608462681<br/>? The New Yorker magazine.<br/>? Additional articles, films, and websites on course website and/or on reserve at NU<br/>Library, see our Canvas course page."}], "path": "/class-descriptions/4640/WCAS/HUM/325-6/12935", "instructor": ["Michael J Kramer"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "12935", "subject": "HUM"}]