[{"class_mtg_info": [{"meet_t": "We 9:00AM - 12:30PM", "meet_l": "Botanic Garden - Glencoe, IL"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Prerequisite: Students must have completed BIOL_SCI 215 or ENVR_SCI 202 to register for this course.", "qtr": "Spring 2016", "name": "32150", "title": "WCAS BIOL_SCI 336-0-20 Spring Flora", "class_attributes": "Prerequisites apply, see description<br/><br/>", "section": "32150", "instructors": [{"instructor_phone": "847/467-1266", "instructor_name": "Nyree J C Zerega", "instructor_addr": "Hogan Hall, 6-140a, 2205 Tech Drive"}], "topic": "", "course": "336-0", "descriptions": [{"name": "Overview of class", "value": "Spring Flora merges aspects of plant evolution and identification (with an emphasis on learning about the local flora) with plant ecology (with an emphasis on ecological interactions and adaptations). This course takes a field-based approach to learning the process of identifying major components of the local flora. Understanding vegetative and reproductive structures of plants, and use of this knowledge to identify plants with taxonomic keys will be emphasized. Ecological interactions, adaptations, and related conservation issues will also be discussed. This course will take place on the grounds of the Chicago Botanic Garden but some days we will go off site. Be prepared to spend at least part of every class period in the field, rain or shine; warm or cold. Dress for the weather!"}, {"name": "Registration Requirements", "value": "Prerequisite Students must have taken ONE of the following courses: <br/>Bio 164, 215, 330, 339, 342, 347, 349, 350 or ENV SCI 202"}, {"name": "Teaching Method", "value": "Lecture and field study based at Chicago Botanic Garden, transportation will be arranged if needed."}, {"name": "Evaluation Method", "value": "Written exams/practicals, field and laboratory quizzes, independent projects."}, {"name": "Class Materials (Required)", "value": "Class Materials: Required<br/><br/>Mohlenbrock, R.H. 2013. Vascular Flora of Illinois: A Field Guide. Fourth Edition. Southern Illinois University Press. ISBN-13: 9780809332083<br/><br/>Black, Merel R., Judziewicz, Emmet J. 2009. Wildflowers of Wisconsin and the Great Lakes Region: A Comprehensive Field Guide 2nd Edition. University of Wisconsin Press. ISBN-10: 0299230546<br/><br/>Barnes, B.V. and Wagner, W.H. 2004. Michigan Trees: A Guide to the Trees of Michigan and the Great Lakes Region. University of Michigan Press/Regional. ISBN-10: 0472089218<br/><br/>10x to 20x Magnification Loupe, like ones shown here:<br/><br/>http://www.amazon.com/Jewelers-Loupe-EYE-MAGNIFYING-GLASS/dp/B008LTIAXQ/ref=sr_1_7?ie=UTF8&amp;qid=1422636963&amp;sr=8-7&amp;keywords=loupe+10x<br/>http://www.amazon.com/Folding-Magnifier-Magnifying-Glass-Jewelry/dp/B008BXQYAS/ref=sr_1_8?ie=UTF8&amp;qid=1422636963&amp;sr=8-8&amp;keywords=loupe+10x<br/>http://www.amazon.com/SE-Loupe-Set-Dual-10x/dp/B001C9LG60/ref=sr_1_5?ie=UTF8&amp;qid=1422636963&amp;sr=8-5&amp;keywords=loupe+10x<br/>http://www.amazon.com/SE-Triplet-Professional-Loupes-Black/dp/B000P9MI7O/ref=sr_1_2?ie=UTF8&amp;qid=1422636942&amp;sr=8-2&amp;keywords=loupe+10x<br/>http://www.amazon.com/SE-Loupe-Triplet-Illuminated-21mm/dp/B002E0MU7U/ref=sr_1_4?ie=UTF8&amp;qid=1422636963&amp;sr=8-4&amp;keywords=loupe+10x"}, {"name": "Class Materials (Suggested)", "value": "Optional Text<br/><br/>Plant Identification Terminology: An Illustrated Glossary, 2001, James G. Harris and Melinda Woolf Harris, Spring Lake Publishing ISBN: 0-9640221-6-8<br/><br/>Prairie Plants of the University of Wisconsin-Madison Arboretum. Cochrane, Theodore S. 2006 <br/>University of Wisconsin Press ISBN: 9780978959005"}, {"name": "Class Notes", "value": "Every class, including the first class, meets at 9am at the Plant Science Lab at the Chicago Botanic Garden. Transportation to the Garden will be arranged either via carpool or shuttle (which will leave the Northwestern Evanston Campus at 8:20am). The instructor will e-mail all students before the first day of class with detailed information about transportation."}], "lmod": "4/3/16 7:46 PM (CT)", "subject": "BIOL_SCI"}]