[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Kresge Centennial Hall 2-331"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Prerequisite: Students must have passed Japanese 211-3 with at least a C- or  be placed in according to placement test results.<br/><br/>Prerequisite: Students must have passed Japanese 211-3 with at least a C- or  be placed in according to placement test results.", "qtr": "Fall 2016", "name": "10658", "title": "WCAS JAPANESE 313-1-20 Japanese IV: Japanese Newspaper Reading and News Listening", "class_attributes": "", "section": "10658", "instructors": [{"instructor_phone": "8474671986", "instructor_name": "Noriko Taira   Yasohama", "instructor_addr": "1880 Campus Drive, Kresge Hall, Office 4-552"}, {"instructor_phone": "8474912762", "instructor_name": "Junko   Sato", "instructor_addr": "1880 Campus Drive, Kresge Hall, Office 4-347"}], "topic": "", "course": "313-1", "descriptions": [{"name": "Overview of class", "value": "JAPANESE 313-1 is a low-advanced fourth-year Japanese language course. All of the fourth-year Japanese courses have the common goals to bring students' overall proficiency to Advanced-Low by the proficiency guidelines of American Council on Teaching of Foreign Languages (ACTFL). JAPANESE 313-1 focuses on development of skills to read newspaper articles, to listen to news and to participate in intellectual discussions and debate on social and cultural phenomena of contemporary Japan. This class introduces the structures, styles and expressions commonly used in Japanese newspaper articles and news. The class provides a number of opportunities for reading newspaper articles in different topics, listening to semi-authentic news, and increasing the knowledge of kanji characters and compounds and, idiomatic expressions frequently used in news articles. The students will develop oral skills through in-class discussions and some individualized assignments. This course does NOT provide training for writing skills development (All students taking this course should come with at least the intermediate-level writing skills, equivalent to the end of JAPANESE 211-3, and should be able to write an opinion paper in the plain style). The students who need writing skills development should take JAPANESE 314-1."}, {"name": "Registration Requirements", "value": "Students must have completed JAPANESE 211-3 with C- or above, or must be placed into the class by the departmental placement test."}, {"name": "Teaching Method", "value": "Classes are conducted only in Japanese. Most class time will be used for discussions and debate."}, {"name": "Evaluation Method", "value": "Kanji/vocabulary quizzes, assignments; oral and written examinations; active and productive class participation and class performance."}, {"name": "Class Materials (Required)", "value": "- Shimbun no Dokkai (3A Corporation, 2008) ISBN 978-4-88319-475-9.<br/>- New Intermediate Kanji Book, vol.1, 3rd edition (Bonjinsha) ISBN 978-4-89358-810-4."}, {"name": "Class Materials (Suggested)", "value": "-Tanki Shuuchuu Shokyuu Nihongo Bunpoo Soumatome Point 20 (3A Corporation, 2004) ISBN 978-4-88319-328-8.<br/>-Chuukyuu Nihongo Bunpoo Yooten Seiri Point 20 (3A Corporation, 2007) ISBN 978-4-88319-457-5.<br/>- News no Nihongo Chookai 50 (3A Corporation, 2010) ISBN 978-4-88319-539-8. <br/>- Jookyuu kara Chookyuu e Nihongo Chookyuu-Washa e no Kakehashi (3A Corporation, 2007) ISBN 978-488319-449-0."}], "lmod": "10/30/16 7:07 PM (CT)", "subject": "JAPANESE"}]