[{"school": "WCAS", "overview_of_class": "Prof. Laurel Harbridge, Party Polarization in American Politics, Fall 2016<br/>Is the American public polarized? What about political elites? What do we mean by party polarization and what does this phenomenon mean for issues of representation, government productivity, and civic engagement? This research seminar explores these and other questions related to polarization in American politics, including timely new topics related to the Tea Party and House Freedom Caucus, gridlock in politics, and the current election. Using the knowledge and skills that they gain in the course, students will each put together a research paper of their own that answers a question of their own choosing.", "name": "Political Research Seminar", "section": "20", "topic": "Party Polarization", "course": "395-0", "meeting_time": ["We 2:00PM - 4:50PM"], "path": "/class-descriptions/4640/WCAS/POLI_SCI/395-0/12755", "instructor": ["Laurel Harbridge Yong"], "id": "12755", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "Prof. Reuel Rogers, Fall 2016, &quot;Racial Politics in American Cities&quot;<br/>This course explores how race and place influence political dynamics in American cities and suburbs. We consider specific cases in cities such as Ferguson, Missouri, New York City, Chicago, and Atlanta to explore mobilization, political and civic engagement, contests for political representation, coalition building, democratic responsiveness, and patterns of socioeconomic mobility and inequality. Our overarching aim will be to understand how these two dominant features of American urban life-race and place-interplay and shape the quest for political power, policy influence, and socioeconomic advancement in American cities.", "name": "Political Research Seminar", "section": "23", "topic": "Racial Pol in American Cities", "course": "395-0", "meeting_time": ["We 9:00AM - 11:50AM"], "path": "/class-descriptions/4640/WCAS/POLI_SCI/395-0/12757", "instructor": ["Reuel R Rogers"], "id": "12757", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "Fall 2016, Poli Sci 395 &quot;Oligarchs and Elites&quot;, Prof. Jeffrey Winters<br/>Despite strong ideological currents calling for justice, fairness, and equality for all, we witness persistent patterns of stratification, domination, and exclusion. Tremendous concentrations of power in the hands of small segments of society continue even after major democratic gains have been won. This seminar will focus on oligarchs, who are empowered by tremendous wealth, as well as elites who are empowered in non-material ways. How are these actors defined and what are the different forms of oligarchic and elite power across countries and historical periods? The United States will be among the cases examined in comparative perspective.", "name": "Political Research Seminar", "section": "24", "topic": "Oligarchs and Elites", "course": "395-0", "meeting_time": ["Tu 4:00PM - 6:50PM"], "path": "/class-descriptions/4640/WCAS/POLI_SCI/395-0/12758", "instructor": ["Jeffrey A Winters"], "id": "12758", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "&quot;Military Interventions&quot;, Prof. Marina Henke Fall 2016<br/>Military interventions are the most costly foreign policy tool extent. The purpose of this research seminar is to examine systematically and comparatively why military interventions are launched and what results they produce on the ground. The seminar, in particular, tries to find answers to the following questions: (1) What were the broad policy arguments in favor of or opposed to a particular intervention? (2) Who were the principal players arguing for intervention? (3) What role did international institutions play in the set-up of the intervention? (4) What specific kinds of military force proved particularly useful in the actual intervention? (6) In each case, do we judge the intervention a success or failure, and how do we explain the success or failure?", "name": "Political Research Seminar", "section": "26", "topic": "Military Intervention", "course": "395-0", "meeting_time": ["Th 2:00PM - 4:50PM"], "path": "/class-descriptions/4640/WCAS/POLI_SCI/395-0/12760", "instructor": ["Marina Elisabeth Philippina Henke"], "id": "12760", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "Political Science 395, Fall 2016, Professor Andrew Roberts, &quot;Fixing the US Constitution&quot;<br/>This class will consider to what extent the US Constitution is flawed and needs repair. It will consider key provisions in the Constitution and their effects on politics. It will then begin to look at constitutional designs from around the world to find potential solutions to these problems. The class will be conducted in seminar format with frequent in-class debates. The culmination of the class is a major seminar paper of 15-20 pages which will propose a change to the US Constitution and evaluate its potential effects.", "name": "Political Research Seminar", "section": "27", "topic": "Fixing the U.S. Constitution", "course": "395-0", "meeting_time": ["Th 9:30AM - 12:20PM"], "path": "/class-descriptions/4640/WCAS/POLI_SCI/395-0/17594", "instructor": ["Andrew L Roberts"], "id": "17594", "subject": "POLI_SCI"}]