[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Annenberg Hall G30"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-requisite: Students must have taken or be currently enrolled in LING 270, or have graduate standing to enroll in this course.", "qtr": "Fall 2016", "name": "17593", "title": "WCAS LING 300-0-21 Topics in Linguistics", "class_attributes": "", "section": "17593", "instructors": [{"instructor_phone": "", "instructor_name": "Alexis Cornelia Wellwood", "instructor_addr": ""}], "topic": "Experimental Semantics", "course": "300-0", "descriptions": [{"name": "Overview of class", "value": "We study two broad categories of experimental research relevant to meaning in natural language: (i) research testing truth-conditional theories (&quot;experimental semantics&quot;), and (ii) research exploring the relationship between meaning and non-linguistic cognition (&quot;psychosemantics&quot;). These two categories of research have different scope, limits, and methods. This course develops an understanding of the state of contemporary experimental research on meaning through readings, lecture, and discussion. Specific topics to be covered might include the mass/count distinction, plurality, event semantics, quantifiers, numerals, vagueness, gradability, and presupposition."}, {"name": "Registration Requirements", "value": "Linguistics 270 or permission from the instructor."}, {"name": "Learning Objectives", "value": "Students will learn to understand two different types of experimental research into linguistic meaning, to identify the sorts of questions each type finds theoretically interesting, and to practice constructing experiments that can address those questions."}, {"name": "Teaching Method", "value": "Discussion format with occasional lectures."}, {"name": "Evaluation Method", "value": "Homeworks and a collaborative research paper."}, {"name": "Class Materials (Suggested)", "value": "No textbook. Research papers and course notes will be provided."}], "lmod": "10/30/16 7:07 PM (CT)", "subject": "LING"}]