[{"school": "WCAS", "overview_of_class": "What is Asian American advertising, how can we understand cultural production<br/><br/>and consumption practices among Asian Americans? This course will examine<br/><br/>ethnographic approaches to advertising, fashion, food, and expressive culture<br/><br/>among Asian communities in the United States. The first portion of the class will<br/><br/>examine the creative and production processes involved in creating ads for<br/><br/>specific Asian ethnic groups, as well as other cultural production in Asian<br/><br/>American industries, including fashion. The second will look in depth at various<br/><br/>studies of consumption that document the ways in which Asian Americans<br/><br/>engage with popular culture and commodities, including food and art. The course<br/><br/>will also draw relevant connections between advertising and consumption in the<br/><br/>US with China, India, Japan, and other Asian nation-states. The course will be<br/><br/>grounded in anthropological perspectives of advertising and cultural production<br/><br/>as well as theories of consumption, and consider the effects of these on<br/><br/>meanings of ethnicity, race, gender, class, nation, and diaspora.", "name": "Topics In Anthropology", "section": "22", "location": "Kresge Centennial Hall 2-415", "topic": "Asian Persuasion: Advt & Cons", "course": "390-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4640/WCAS/ANTHRO/390-0/10093", "instructor": ["Shalini   Shankar"], "class_attributes": "", "id": "10093", "subject": "ANTHRO"}, {"school": "WCAS", "overview_of_class": "Knowledge of human osteology forms the basis of physical and forensic anthropology, bioarchaeology, paleoanthropology and clinical anatomy. This course will provide an intensive introduction to the human skeleton; particularly the identification of complete and fragmentary skeletal remains. Through this course you will be exposed to techniques for identification and classification of human skeletal anatomy through hands-on, dry laboratory sessions. Additional time outside of class is available and may be required to review practical materials.", "name": "Topics In Anthropology", "section": "24", "location": "ANTHRO Lab A58 - 1810 Hinmn", "topic": "Human Osteology", "course": "390-0", "meeting_time": ["Fr 9:00AM - 11:30AM"], "path": "/class-descriptions/4640/WCAS/ANTHRO/390-0/10095", "instructor": ["Erin Beth Waxenbaum Dennison"], "class_attributes": "", "id": "10095", "subject": "ANTHRO"}, {"school": "WCAS", "overview_of_class": "Native Americans experience significant disparities in health and in access to health care. This course introduces students to Native American health by exploring the social, cultural, political, and environmental determinants influencing Native health both historically and today. This course is designed as a reading intensive, discussion-based seminar, drawing upon research and contributions from a variety of disciplines including American Indian studies, anthropology, history, psychology, public health, and medicine.", "name": "Topics In Anthropology", "section": "25", "location": "University Hall 121", "topic": "Native American Health", "course": "390-0", "meeting_time": ["Tu 3:00PM - 5:50PM"], "path": "/class-descriptions/4640/WCAS/ANTHRO/390-0/17405", "instructor": ["Margaret Ellen Pollak"], "class_attributes": "", "id": "17405", "subject": "ANTHRO"}, {"school": "WCAS", "overview_of_class": "This course will explore cultural resource protection and its relationship to environmental policy through various lenses. Cultural resources include architecture, archeological sites, language, cultural landscapes, ethno-ecosystems, cultural traditions and practices, sacred sites, oral history and community voice. The class will cover; 1) the history of cultural resource management theory in the United States and how that has, and still, affects policy making and enforcement; 2) the relationships between Federal, State, and American Indian Tribal governments regarding the enactment of cultural resource policies; 4) various laws and acts including the National Historic Preservation Act, Native American Graves Protection and Repatriation Act, Antiquities Act, and Archaeological Resource Protection Act; and 5) ethical issues that arise from multiple perspectives of culturally significant landscapes, places, beliefs and practices. Selected case studies will be utilized as both a focus for, and to facilitate, class discussions. Readings will include books and selected articles relevant to the course.", "name": "Topics In Anthropology", "section": "26", "location": "University Hall 118", "topic": "Cultural Res Mgmt and Evn Pol", "course": "390-0", "meeting_time": ["MoWe 11:00AM - 12:20PM"], "path": "/class-descriptions/4640/WCAS/ANTHRO/390-0/17528", "instructor": ["Eli S Suzukovich III"], "class_attributes": "", "id": "17528", "subject": "ANTHRO"}]