[{"school": "WCAS", "overview_of_class": "The seminar discusses the historical background to the rise of political Islam within the Palestinian society, reviewing three periods: Mandatory Palestine (1920s - 1940s), the West Bank and Gaza under Jordan and Egypt's rule (1948-1967), and Israel since 1967. The central part of the seminar focuses in more detail on Hamas, \"Islamic Jihad,\" and the Islamic Movement in Israel. It analyses the causes for the rise of revivalist Islam in the territories and in Israel since the 1970s. It deals with the ideology and political platform of Hamas as outlined in its \"Charter\" (the Islamicization of the Israel-Arab conflict, the Islamicization of the Palestinian nation identity). We will examine the doctrinal and practical principle of Jihad and the idea of martyrdom in Islam (Istishad). A special emphasis will be laid on suicide bombing from a doctrinal and practical point of view. The seminar examines the political participation of Hamas (Municipal, Legislative Council elections - 2006) and its relationship with the PLO. Finally the seminar reviews the rise of the Islamic Movement in Israel, its particular characteristics, the political divide of the movement (1996) and its role as a social, economic and cultural agent of change in the life of the Arab minority in Israel.", "name": "Topics In History", "section": "20", "topic": "Hamas & \"Islamic Jihad\"", "course": "392-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4650/WCAS/HISTORY/392-0/22008", "instructor": ["Elie   Rekhess"], "id": "22008", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "This will be a seminar-colloquium focusing on the background of the July, 1952 Revolution and controversies surrounding the course of its development. We shall examine the major issues of the British occupation, the Palace faction and the centrist Wafd Party-in the context of their spiraling confrontation. We shall analyze the background of Gamal Abd al-Nasir (Nasser) and his associates (including Anwar al-Sadat) in order to pose a fundamental question: were these individuals committed to genuine social change or did they remain bourgeois capitalists, psychologically tied to the West, and thus dependent on it? Subsequently, we shall examine Egypt's involvement with the Palestine Problem, dilemmas of economic growth, international alignments, and the 'Cold Peace' with Israel.", "name": "Topics In History", "section": "22", "topic": "Egypt under Nasser & Sadat", "course": "392-0", "meeting_time": ["MoWe 12:30PM - 1:50PM"], "path": "/class-descriptions/4650/WCAS/HISTORY/392-0/28387", "instructor": ["Carl Forbes   Petry"], "id": "28387", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "The Mughal Empire (1526-1857) is widely remembered as one of the most powerful, opulent empires of the early modern world, renowned both for the atmosphere of cultural pluralism that it promoted as well as the magnificent monuments (such as the famed Taj Mahal) that it produced. Less well known, however, are the remarkably rich - and remarkably diverse - literary cultures that the Mughal court promoted, and which saturated the cultural, political, and religious life of early modern India more generally. This course will introduce students to some of the basic features of these intersecting Indo-Persian, Sanskrit, and Hindi-Urdu literary worlds (in translation, of course), as well as to their lasting - and sometimes controversial - legacies in modern South Asian culture and politics, from British India to Bollywood.", "name": "Topics In History", "section": "26", "topic": "Literary Cultures of Mughal India", "course": "392-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4650/WCAS/HISTORY/392-0/22011", "instructor": ["Rajeev Kumar Kinra"], "id": "22011", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "From the building of railroads and telegraphs in the nineteenth century, to the so-called \"Facebook<br/>revolutions\" of 2009-2011, life in the Middle East during the last two centuries has been marked by<br/>intense engagement with new technologies. This course will explore the history of such technologies<br/>from the perspective of \"ordinary\" people, who have used them to travel, communicate, organize, pray,<br/>dress, have children (or not), seek entertainment, and more. Which technologies have played a major<br/>role in modern Middle Eastern societies? How have gender, class, and religion shaped the production and use of technology? How have familiar objects - telephones, sewing machines, computers - worked<br/>differently in different places? Exploring such questions will enable us to further our understanding of<br/>the transformation of the Middle East since the beginning of the region's industrialization, and to think<br/>more broadly and critically about the role of technology in history.", "name": "Topics In History", "section": "30", "topic": "Technology & Society  MidEast", "course": "392-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4650/WCAS/HISTORY/392-0/22013", "instructor": ["Daniel A Stolz"], "id": "22013", "subject": "HISTORY"}]