[{"class_mtg_info": [{"meet_t": "We 3:00PM - 5:50PM", "meet_l": "University Library 4770"}], "school": "SoC", "enrl_requirement": "Enrollment Requirements: Reserved for Comm Studies juniors.  Majors who study abroad a full year may enroll senior year.  Comm_ST 394-0 may not be repeated.", "qtr": "Spring 2016", "name": "36737", "title": "SoC COMM_ST 394-0-21 Communication Studies Research Seminar", "class_attributes": "Attendance at 1st class mandatory<br/><br/>Juniors Only<br/><br/>Department Majors/Minors Only<br/><br/>", "section": "36737", "instructors": [{"instructor_phone": "", "instructor_name": "Elena   Rodina", "instructor_addr": ""}], "topic": "The Sound of Silence. Censorship and the Global Me", "course": "394-0", "descriptions": [{"name": "Overview of class", "value": "In the era of proliferation of on-line media and increased accessibility of information from all around the globe, the question of media censorship is as important as it has ever been. Has Internet made state censorship obsolete, or has it just changed the way it works? Are on-line technologies allowing us to access more, or curtailing our worldview through endless commercial filtering and tailoring?<br/> <br/>In this course, we will examine how new communication technologies change the dynamics between the censors and the censored, dissecting such disparate cases as the on-line regulation by the Chinese government and &quot;Twitter revolution&quot; in the Middle East. We will also examine the cases when new technologies can themselves become a censoring mechanism, and read about &quot;filter bubble,&quot; &quot;echo chamber,&quot; and the effect of the new media metrics on journalistic production. Finally, we will discuss the gray area of journalistic self-censorship that is a concern for the countries with nascent democracies, and economic censorship, which does not spare even countries with established democratic societies, such as the United States."}], "lmod": "4/3/16 7:16 PM (CT)", "subject": "COMM_ST"}]