[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "University Library 4722"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Prerequisite: Students must have passed Japanese 211-3 with at least a C- or  be placed in according to placement test results.<br/><br/>Prerequisite: Students must have passed Japanese 211-3 with at least a C- or  be placed in according to placement test results.", "qtr": "Winter 2016", "name": "22839", "title": "WCAS JAPANESE 311-1-20 Japanese IV: Reading Modern Japanese Literature in Japanese", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "22839", "instructors": [{"instructor_phone": "8474912762", "instructor_name": "Junko   Sato", "instructor_addr": "1800 Sherman, 5th Floor, Suite 5400, Office 5415"}, {"instructor_phone": "8474912766", "instructor_name": "Phyllis I Lyons", "instructor_addr": "1800 Sherman Ave., 5th Floor, Suite 5400, Office 5418"}], "topic": "", "course": "311-1", "descriptions": [{"name": "Overview of class", "value": "Japanese IV is a series of four advanced Japanese language courses. Each course (JAPANESE 311, 312, 313, and 314) is designed to provide students with opportunities to further develop their overall Japanese language proficiency, to deepen their understanding of Japanese culture through attention to socio-linguistic elements, and to familiarize them with various styles of language use. The courses need not be taken in numerical sequence. Because the modern language was reformed after World War II, 311-1, &quot;Reading Japanese Literature in Japanese,&quot; introduces pre-1946 modern Japanese literature in its original, un-edited form (kyu-kanji and kyu-kanazukai) and focuses on translating with accuracy and fluency, and placing the writings in literary and historical context."}, {"name": "Registration Requirements", "value": "Completion of JAPANESE 211-3 (with grade of C or above), by placement test or with permission of the instructor. No P/N option for this section."}, {"name": "Learning Objectives", "value": "Each course prepares students to be more autonomous users of Japanese language."}, {"name": "Teaching Method", "value": "311-1 will require the use of English for in- and out-of-class translation."}, {"name": "Evaluation Method", "value": "Assignments; class participation and performance; project presentation and/or quizzes and exams."}, {"name": "Class Materials (Required)", "value": "Photocopied original literary texts, handouts; Nelson, Japanese-English Character Dictionary, 2nd edition"}], "lmod": "1/9/16 6:50 PM (CT)", "subject": "JAPANESE"}]