[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Locy Hall 318"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Spring 2016", "name": "33344", "title": "WCAS HISTORY 101-6-20 First-Year Seminar-European History", "class_attributes": "WCAS First-Year Seminar<br/><br/>Attendance at 1st class mandatory<br/><br/>Freshmen/Sophomores Only<br/><br/>", "section": "33344", "instructors": [{"instructor_phone": "847/491-3653", "instructor_name": "Edward Wallace   Muir Jr", "instructor_addr": "Harris Hall Room 244"}], "topic": "The Great Trials of Western Civilization", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "One of the distinguishing characteristics of western civilization has been its persistent concern to adjudicate disputes and to judge alleged wrong-doers through the process of a trial. The forms of trials and standards of evidence have changed a great deal since ancient times when Socrates was condemned to death, and yet the trial still remains the principal means through which society makes its most important judgments. Trials are also exceptionally revealing of the basic values in society. What distinguishes the great trials has been how they uncover conflicts about those values, how they preserve for prosperity a sensitivity for justice and injustice, how they symbolize conflicting values, and how often they have stimulated great works of philosophy and literature. In this course we shall analyze a few of the most famous trials from the ancient world to the twentieth century and ask such questions as what is justice and injustice, what is the role of persuasive rhetoric in trials, how have trials constructed evidence for and against defendants, and most importantly how have the trials of certain individuals stimulated a debate about the fundamental values of society?"}, {"name": "Teaching Method", "value": "Course meetings will be based entirely on class discussion, including small group sessions and mock trials."}, {"name": "Evaluation Method", "value": "Students will write 6 short papers. Papers are to be sent as a WORD attachment to e-muir@northwestern.edu. These papers will vary in length from one paragraph to 7 pages long. The papers will gradually increase in weight. The first 3 will each count for 10% of the grade; the last two count for 35% of the grade for written compositions. Students will be evaluated in three categories: (1) the quality of their preparation for class discussions, (2) the effectiveness of their contributions to group interactions, and (3) the effectiveness of the argument in their written compositions. 7 papers varying from one page to 7"}, {"name": "Class Materials (Required)", "value": "TENATIVE READING LIST: Plato, The Trial of Socrates; Marcus Tullius Cicero, &quot;The Trial of Verres&quot; from Selected Works; Joan of Arc, Joan of Arc: In Her Own Words; William Shakespeare, The Merchant of Venice; Michael Walzer, Regicide and Revolution: Speeches at the Trial of Louis XVI; Slavenka Drakulic, They Would Never Hurt a Fly: War Criminals on Trial in the Hague in conjunction with the website http://www.icty.org/ of the International Criminal Tribunal for the former Yugoslavia"}, {"name": "Class Notes", "value": "HISTORY AREA OF CONCENTRATION: European"}], "lmod": "4/3/16 8:03 PM (CT)", "subject": "HISTORY"}]