[{"class_mtg_info": [{"meet_t": "Tu 2:00PM - 2:50PM", "meet_l": "McCormick Foundation Ctr 2111"}, {"meet_t": "Th 12:30PM - 4:20PM", "meet_l": "McCormick Foundation Ctr 2111"}], "school": "JOUR", "enrl_requirement": "", "qtr": "Spring 2017", "name": "33193", "title": "JOUR JOUR 301-0-20 Journalism in Practice", "class_attributes": "No Freshmen<br/><br/>", "section": "33193", "instructors": [{"instructor_phone": "", "instructor_name": "Jack C Doppelt", "instructor_addr": ""}], "topic": "Connecting with Immigrants, Refugees and Multi-eth", "course": "301-0", "descriptions": [{"name": "Overview of class", "value": "Chicago is steeped in the immigrant tradition and alive right now with the energy and natural chaos of recent arrivals to the city and suburbs. The Chicago area ranks 5th among metropolitan areas. Chicago itself is more than 20% foreign born; home to almost 600,000 immigrants and refugees. Suburban Cook County is home to even more.<br/><br/>Immigrant groups aren't monolithic. They have both divergent and shared needs and interests. More than 50 percent of the Chicago-area immigrants, for instance, were born in three completely distinct parts of the world - Mexico, Poland, and India. Moreover, the balance of the immigrant population is even more diverse, with no country of origin comprising more than five percent of the population. In some ways, though, aggregate statistics or assumptions onthe foreign born do more to mask their characteristics and concerns than to illuminate them. Through stories, we cross ethnic, cultural, neighborhood and generational lines to document immigrant experiences that are as varied as the people involved. Though those stories surface every day, they often go untold, unshared and unappreciated.<br/><br/>This course will provide you opportunities to tell multimedia immigrant and refugee stories for publication, including this quarter those of Syrian refugees, and of course those of people, families and communities who are directly impacted by the Presidential election. By focusing on global immigration and refugee phenomena, with a watchful eye on national policy and presidential campaign rhetoric, the course will expose you to the communities where immigrants and refugees live and work, and in partnership with ethnic media outlets in the city and suburbs and with Immigrant Connect Chicago, an online network for immigrants, refugees, their families and communities, you will produce stories that matter and that animate the lives of those who give you access to their experiences and families."}, {"name": "Registration Requirements", "value": "Sophomore Standing"}], "lmod": "2/7/17 6:37 PM (CT)", "subject": "JOUR"}]