[{"school": "DOHA", "overview_of_class": "<p>In this course, students will reflect on the various ways in which messages do rhetorical (persuasive) work and will develop a more critical (analytical and evaluative) stance from which to read persuasive messages. In the first half of the semester, they will explore some of the theories and methods that communication scholars have used to study persuasive communication. In the second half of the semester, they will employ some of these theories and methods to develop a detailed critique of a rhetorical text (literary, audio-visual, performative, interactive, multimedia) of their choice. Students will write several short papers that summarize and comment upon the various critical theories and methods. Each student will co-teach (with me) one critical theory or method. Students will write a detailed rhetorical critique of a text of their choice in four steps (Text Description, Critical Stance, Interpretation, Evaluation) and will share their critique with the class in a formal presentation.</p>", "name": "Undergraduate Seminar", "section": "70", "location": "Carnegie Mellon Room 3035", "topic": "Rhetorical Criticism", "course": "398-0", "meeting_time": ["TuTh 08:30AM - 09:50AM (AST)"], "path": "/class-descriptions/4620/DOHA/MIT/398-0/30533", "instructor": ["Allwyn   Tellis"], "class_attributes": "", "id": "30533", "subject": "MIT"}, {"school": "DOHA", "overview_of_class": "<p>Health Communication is designed to provide students with a critical understanding of the main theories that explain the relationship between health communication and health behaviors with a focus on interpersonal and mediated communication as well as mass media campaigns. Students will develop the skills necessary to apply communication and other theories to communication situations to understand and strategically plan health communication campaigns. Health communication, both interpersonal and mediated, is of critical importance in helping to combat diseases such as diabetes and heart disease as well as encouraging people to live healthy lives. The class will help future media professionals understand how to develop and critically evaluate effective public health campaigns. While not strictly required, the skills gained in GEN_CMN Research Methods and MIT 205 Theories of Persuasion will be helpful for this course.</p>", "name": "Undergraduate Seminar", "section": "71", "location": "CMUQ3203", "topic": "Health Communication", "course": "398-0", "meeting_time": ["MoWe 01:30PM - 03:20PM (AST)"], "path": "/class-descriptions/4620/DOHA/MIT/398-0/30534", "instructor": ["Susan   Dun"], "class_attributes": "", "id": "30534", "subject": "MIT"}, {"school": "DOHA", "overview_of_class": "<p>Communication research and practice is an ideal discipline where an immersive-learning/teaching model can be implemented using real world applications. The primary goal of this course is for students to work collaboratively to investigate the development of children and youth role models on Arab television. Students will acquire an understanding of children and youth television production contexts and then act as a research/production team developing, planning, producing and disseminating their work. As a \"capstone\" course, students are expected to put into practice their conceptual, research and production skills. After conducting research with television practitioners, students are expected to collaborate on academic paper(s) and produce documentary \"vignettes.\" The course will comprise: discussions, workshops, and field productions.</p>", "name": "Undergraduate Seminar", "section": "72", "location": "Qatar Studio Building 012", "topic": "TV Role Models for Arab Youth", "course": "398-0", "meeting_time": ["Th 01:30PM - 04:20PM (AST)"], "path": "/class-descriptions/4620/DOHA/MIT/398-0/30535", "instructor": ["Joseph F Khalil"], "class_attributes": "", "id": "30535", "subject": "MIT"}]