[{"school": "JOUR", "overview_of_class": "Course description will be updated soon.", "name": "Practicum", "section": "20", "location": "McCormick Foundation Ctr 3127", "topic": "Media Automation", "course": "498-0", "meeting_time": ["Th 12:00PM - 2:50PM"], "path": "/class-descriptions/4660/JOUR/IMC/498-0/33974", "instructor": ["Martin Paul   Block", "Vijaymahadev   Viswanathan"], "class_attributes": "", "id": "33974", "subject": "IMC"}, {"school": "JOUR", "overview_of_class": "Sports Marketing provides an in-depth look at concepts and methods in marketing communications for brands within the sports environment. Sports marketing includes topics such as acquisition and retention of fans, celebrity management, event execution, crisis interventions, sponsorship and partnerships, ticket pricing, social media and digital innovation, tie-ins between teams and retail, and understanding the business of sports. Students will develop an understanding of how marketing works in sports through readings, guest lectures, case analysis and discussions. The course will help students understand how to make decisions in ambiguous sports marketing environments, using financial and market analysis, and considering legal and ethical concerns.", "name": "Practicum", "section": "21", "location": "McCormick Foundation Ctr 3107", "topic": "Sports Marketing", "course": "498-0", "meeting_time": ["We 6:00PM - 8:50PM"], "path": "/class-descriptions/4660/JOUR/IMC/498-0/33975", "instructor": ["Candy   Lee"], "class_attributes": "", "id": "33975", "subject": "IMC"}, {"school": "JOUR", "overview_of_class": "Data Privacy and Security: Critical Issues in Digital Marketing Communications: In the era of highly publicized privacy violations and data breaches, led by Google, Facebook, Target and Sony, a growing number of companies have faced costly regulatory enforcement actions and class action law suits for their misuse of and the misappropriation of their customer data. These events have resulted in an erosion of customer confidence levels and have had a devastating effect on their business performance.<br/><br/> This class will focus on the areas of data privacy and data security, potentially the biggest \"data\" issues that marketing communications professionals will face over the course of their careers. As such, the class will address the rapid move of companies toward digital marketing efforts, and the coming world of connected devices in the Internet of Things. It will highlight areas of risk that all marketing professionals should understand, emphasize ways to reduce and avoid these risks, and outline the consequences and costs that accompany serious privacy violations and data breaches.", "name": "Practicum", "section": "22", "location": "McCormick Foundation Ctr 3107", "topic": "Data Privay & Security: Issues in Digtl Mktg", "course": "498-0", "meeting_time": ["Tu 12:00PM - 2:50PM"], "path": "/class-descriptions/4660/JOUR/IMC/498-0/33976", "instructor": ["Thomas H Hayden"], "class_attributes": "", "id": "33976", "subject": "IMC"}, {"school": "JOUR", "overview_of_class": "Marketing Technologies are being increasingly adopted by firms to manage marketing campaigns, resource allocation, marketing analytics and content marketing. But how can marketing executives know which technologies are right for their organizations? <br/> <br/>This course helps students answer this question and starts with standardizing the taxonomy and categorization as well as a vocabulary to describe the processes, activities, and outcomes that marketing technologies seek to enable. When marketing executives are equipped with standardized definitions, taxonomy and categorization, they can better evaluate the value of various solutions and start to build the solutions that provide the greatest value for their organizations.<br/> <br/>This course is intended to be a lab where students from marketing and computer science backgrounds will collaborate on producing an integrated model that precisely describes the processes and activities and associates them with the target outcomes. Students will work on teams, each of which will tackle a different category of marketing (e.g., campaign management, marketing resource management). Our expectation is that the course will expose students to both marketing executives struggling to apply marketing technologies effectively and marketing technology vendors struggling to break through the noise.", "name": "Practicum", "section": "23", "location": "Garage Workspace Classroom 1", "topic": "Marketing Technologies", "course": "498-0", "meeting_time": ["Tu 6:00PM - 8:50PM"], "path": "/class-descriptions/4660/JOUR/IMC/498-0/33977", "instructor": ["Kristian J Hammond", "Jonathan R Copulsky"], "class_attributes": "", "id": "33977", "subject": "IMC"}, {"school": "JOUR", "overview_of_class": "The IMC Capstone course provides students the opportunity to bring all their course learning together to develop an integrated marketing communications program for a real-world client. Student teams will receive a brand challenge briefing directly from the client, and then work with faculty guidance through key stages to develop a marketing communications program to address brand needs. Along the way students will clarify the marketing objective, use qualitative and quantitative means to understand consumers, uncover brand building insights, identify an integrating idea, hold a strategic work session with the client, solidify brand positioning and develop a winning message strategy that includes creative content, consumer engagement platforms and measurement. Teams will compete to \"win the business\" and finish the quarter with a formal presentation of their recommended IMC plan directly to the client. Three faculty members with complementary experience in brand strategy, digital communications and creative development will share lecture and student engagement opportunities.", "name": "Practicum", "section": "24", "location": "Meets in Non-General PurposeRm", "topic": "IMC Capstone Project", "course": "498-0", "meeting_time": ["Tu 6:00PM - 8:50PM"], "path": "/class-descriptions/4660/JOUR/IMC/498-0/33978", "instructor": ["James Edward Lecinski", "Marshall R Kohr", "Daniel Wayne Fietsam"], "class_attributes": "", "id": "33978", "subject": "IMC"}, {"school": "JOUR", "overview_of_class": "Advanced Consumer Insight Methods builds on IMC 455, Consumer Insight, to cultivate an understanding of, and develop competencies in, culturally-oriented thinking and qualitative research methods needed in strategic development, advertising, branding, and market research positions. Using reading materials, video, and experiential assignments, the course takes a three pronged approach. First, it develops foundational knowledge in social science theory that lays the groundwork for cultural analysis. Second, it develops applied methodological skills for translating business questions into cultural questions, collecting and analyzing data, and generating insights. Third, it develops skills in connecting the insights back to the organizational problem.", "name": "Practicum", "section": "25", "location": "Meets in Non-General PurposeRm", "topic": "Advanced Consumer Insight Methods", "course": "498-0", "meeting_time": ["Tu 6:00PM - 8:50PM"], "path": "/class-descriptions/4660/JOUR/IMC/498-0/33979", "instructor": ["Michelle F Weinberger"], "class_attributes": "", "id": "33979", "subject": "IMC"}, {"school": "JOUR", "overview_of_class": "Brand Storytelling is a course that focuses on developing insights into a brand's unique story so that it can be told in a compelling manner that creates buzz across a variety of platforms. In a world where a consumer makes a decision in five seconds or less, this course will concentrate on developing quicker skills to use in a reactive marketplace. Whether a brand's story needs to be emotional, funny or factual, students will be challenged to generate communication to talk about a brand's benefits swiftly and capitalize. Students will study a variety of successes and failures of both new and established brands across platforms and will write in a hands-on workshop environment to develop the skills and tools that speak the target's language effectively whether its one-to-one, one-to-many, or one-to-all.<br/><br/>Classes will also feature marketplace professionals, both clients and creatives, who will share their accounts, perceptions and intuition into diverse brands' evolutions that eventually turned into a brand's success or failure. Students will be asked to share their written work and their insights with the class to practice key techniques while telling those stories.", "name": "Practicum", "section": "26", "location": "Meets in Non-General PurposeRm", "topic": "Brand Storytelling", "course": "498-0", "meeting_time": ["We 6:00PM - 8:50PM"], "path": "/class-descriptions/4660/JOUR/IMC/498-0/33980", "instructor": ["Melanie Saxer Johnston"], "class_attributes": "", "id": "33980", "subject": "IMC"}, {"school": "JOUR", "overview_of_class": "Narrative Structure in Storytelling is an immersive five weeks in the art of crafting stories for different media. Students will deconstruct, analyze, tear-apart and re-shape stories in an effort to understand how good stories come to be. Each week The course will focus on a different medium, from long-form magazine writing, to documentary film, to websites, to radio, to advertising messages and more and identify the core components of storytelling and how that medium uses them well (think characters, leads, arc, plot, audio, etc. etc.). Students will look at what all stories have in common as well as how mediums differ; at core tenets and when to break the rules. By the end of the five weeks, students should have a strong understanding of how to take a large body of information, organize it and then create meaningful, gripping narratives, across mediums. Guest speakers may include NPR reporters, documentary filmmakers, digital editors, advertising creatives, and long-form writers. Assignments will range from pure story analysis to editing and reimagining stories across mediums.", "name": "Practicum", "section": "27", "location": "Meets in Non-General PurposeRm", "topic": "Narrative Structure in Storytelling", "course": "498-0", "meeting_time": ["TBA"], "path": "/class-descriptions/4660/JOUR/IMC/498-0/33981", "instructor": ["Patti Lynne Wolter"], "class_attributes": "", "id": "33981", "subject": "IMC"}, {"school": "JOUR", "overview_of_class": "Visual Literacy offers an introduction to visual communication principles, aesthetics, research and applications in the field. The course will examine methods for effective communication using images and design as a language. It prepares students for further study in photojournalism, video storytelling, publication design and interactive storytelling. The class will follow the narrative arc of visual storytelling from the ancient 32,000 year old Chauvet Cave paintings in southern France all the way to the sophisticated eye track activity recognition systems that influence modern design. Students will learn and apply Gestalt theory to design problems and expand their visual lexicon. Photo history will be brought into context with the larger visual narrative and explore how light, shape, form and composition help communicate complex thought and emotion. Guest lecturers will frequent the class giving insight into how visual language is used to communicate and report beyond words.", "name": "Practicum", "section": "28", "location": "Meets in Non-General PurposeRm", "topic": "Visual Literacy", "course": "498-0", "meeting_time": ["TBA"], "path": "/class-descriptions/4660/JOUR/IMC/498-0/33982", "instructor": ["Susan Yvonne   Curtis"], "class_attributes": "", "id": "33982", "subject": "IMC"}]