[{"school": "WCAS", "overview_of_class": "Applied Geographic Information Systems II is a follow-up to Applied Geographic Information Systems and assumes a beginning level of proficiency in using the professional standard in GIS software: ArcGIS. This course builds on Applied GIS by introducing students to more sophisticated methods in raster processing, multi-dimensional data analysis and geostatistics. By working with LiDAR, remote sensing datasets, and Species Distribution Models, students will learn how to optimize visualization and analysis of large geospatial datasets. Students will also learn how to automate their geospatial analysis workflow using Model Builder and Python scripting. These skills will be introduced in the context of exemplar problems in climate science, hydrology, geochemistry, and ecology. Data is primarily analyzed using the professional standard in GIS software?ArcGIS?, though students swill often be using R Studio for statistical analyses and large data downloads. Instruction will assume some prior experience using ArcGIS?, however, no proficiency in the R language is expected of incoming students.", "name": "Special Topics in Environmental Sciences", "section": "20", "location": "Technological Institute MG51", "topic": "GIS II", "course": "390-0", "meeting_time": ["Tu 5:00PM - 7:50PM"], "path": "/class-descriptions/4660/WCAS/ENVR_SCI/390-0/33840", "instructor": ["Michael William Ribant"], "class_attributes": "", "id": "33840", "subject": "ENVR_SCI"}, {"school": "WCAS", "overview_of_class": "This course is designed to give students a broad scientific understanding of the causes and consequences of climate change from an ecological perspective. We will learn about the basics of climate: past, present and future. Through examination of the primary scientific literature, we will learn how individuals, populations, communities, and entire ecosystems response to changing climate conditions. We will examine the scientific evidence behind common misconceptions regarding contemporary climate change. We will learn how scientists forecast future climate conditions and climate change responses, and we will discuss what it means to be in the Anthropocene and what we can do about it.", "name": "Special Topics in Environmental Sciences", "section": "21", "location": "Technological Institute M345", "topic": "The Ecology of Climate Change", "course": "390-0", "meeting_time": ["MoWeFr 2:00PM - 2:50PM"], "path": "/class-descriptions/4660/WCAS/ENVR_SCI/390-0/33841", "instructor": ["Paul James Caradonna"], "class_attributes": "", "id": "33841", "subject": "ENVR_SCI"}]