[{"class_mtg_info": [{"meet_t": "Th 6:00PM - 9:15PM", "meet_l": "University Library Forum Room"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Winter 2016", "name": "26884", "title": "WCAS RELIGION 371-0-20 Religion and Film", "class_attributes": "", "section": "26884", "instructors": [{"instructor_phone": "847/491-2617", "instructor_name": "Sara A Vaux", "instructor_addr": "1940 Sheridan - Office of Fellowships"}], "topic": "Religious Belief and Practice on Scree", "course": "371-0", "descriptions": [{"name": "Overview of class", "value": "<u>Religious Belief and Practice on Screen</u><br/>We will explore the &quot;religious&quot; backgrounds and assumptions of films that pose universal ethical questions. In a few cases, <i>Day of Wrath</i> by Carl Theo. Dreyer, for instance, the plot unfolds within a Protestant community. Westerns such as Eastwood&#39;s operate within an American Protestant ethos. Catholicism on Film includes Kieslowski&#39;s Dekalog and Hausner&#39;s Lourdes. Iranian films (A Separation) present underlying conflicts between practitioners of conservative Islam and a secular worldview, each concerned with problems of relationship and responsibility. The Dardennes, reared in the Catholic tradition, mute obvious representations in favor of compassionate humanism (The Son). Petzold&#39;s Phoenix exposes the fragility of personal and religious &quot;identity,&quot; historical memory, betrayal, and justice after war. A final section comprises anti-war films that simultaneously attract viewers by their seductive beauty and sear the conscience."}, {"name": "Registration Requirements", "value": "Class members must be sophomores, juniors, or seniors, any major armed with some knowledge about films and a lively interest in the ways religious traditions affect cinematic storytelling. To obtain a permission number, please write to Dr. Vaux with a summary of what draws you to the class."}, {"name": "Learning Objectives", "value": "Students learn to move beyond story (tales that could apply equally to any film or novel of any quality), dissection the artistic elements in a film that affect its reception and its &quot;meanings,&quot; share insights across disciplines, and articulate ways that films probe questions that arise from our common human experience."}, {"name": "Teaching Method", "value": "Class participation: Grade partly determined by active participation<br/>Discussion: essential<br/>Films / videos: Weekly showings plus viewing assignments<br/>Guest speakers: yes<br/>Independent study: yes<br/>Lecture: Short orienting lecture at beginning of class<br/>Online work: Canvas blogs<br/>ReadingsWriting assignments: Short weekly essays<br/>"}, {"name": "Evaluation Method", "value": "Assignments: short weekly papers. Mid-term consultation. Final essay."}, {"name": "Class Materials (Required)", "value": "Vaux. The Ethical Vision of Clint Eastwood. <br/>ISBN 978-0-8028-6295<br/>Articles TBD"}, {"name": "Class Materials (Suggested)", "value": "Movies as assigned."}], "lmod": "1/9/16 6:53 PM (CT)", "subject": "RELIGION"}]