[{"class_mtg_info": [{"meet_t": "Th 1:30PM - 5:20PM", "meet_l": "Annie May Swift Hall 109"}], "school": "SoC", "overview_of_class": "Cinema has been global from the start and throughout its history displaced artists have made films that enriched the cinemas of both their homeland and adopted lands.  The films made by refugee, expatriate, exile, émigré, postcolonial, and transnational subjects are usually discussed under the rubrics of national cinemas, auteurism, genre cinema, or diaspora cinema.  The purpose of this course, however, is to problematize these concepts, particularly in the light of the current forms of displacement and globalization.  It examines the extent to which such films constitute a new mode of production and a new accented or transnational style?a style that signifies and signifies upon displacement and globalization.<br/> <br/>A wide range of cultural studies theories of cinema and media as well as of transnationalism, exile, and diaspora will be discussed.  Films by Argentinian, Armenian, Black British, Chicano, Indian, Iranian, Japanese, Lithuanian, Mexican, Palestinian, Pakistani, and Vietnamese filmmakers will be screened and discussed.", "qtr": "Winter 2016", "name": "Global Media", "title": "SoC RTVF 426-0-20 Global Media", "lmod": "1/9/16 6:39 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Hamid   Naficy", "instructor_addr": ""}], "topic": "", "course": "426-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Cinema has been global from the start and throughout its history displaced artists have made films that enriched the cinemas of both their homeland and adopted lands. The films made by refugee, expatriate, exile, émigré, postcolonial, and transnational subjects are usually discussed under the rubrics of national cinemas, auteurism, genre cinema, or diaspora cinema. The purpose of this course, however, is to problematize these concepts, particularly in the light of the current forms of displacement and globalization. It examines the extent to which such films constitute a new mode of production and a new accented or transnational style?a style that signifies and signifies upon displacement and globalization.<br/> <br/>A wide range of cultural studies theories of cinema and media as well as of transnationalism, exile, and diaspora will be discussed. Films by Argentinian, Armenian, Black British, Chicano, Indian, Iranian, Japanese, Lithuanian, Mexican, Palestinian, Pakistani, and Vietnamese filmmakers will be screened and discussed."}, {"name": "Class Materials (Required)", "value": "Each session will include student presentations, class discussions, readings reactions, and film screening. There will be two take hope paper assignments."}], "path": "/class-descriptions/4610/SoC/RTVF/426-0/22330", "instructor": ["Hamid   Naficy"], "class_attributes": "", "id": "22330", "subject": "RTVF"}]