[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "University Hall 122"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "12357", "title": "WCAS HISTORY 381-1-20 History of Modern China: Late Imperial China, 1600-1911", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "12357", "instructors": [{"instructor_phone": "847/491-2753", "instructor_name": "Peter J Carroll", "instructor_addr": "Harris Hall Room 216"}], "associated_classes": [{"component": "DIS", "room": "TBA", "meeting_time": "TBA"}, {"component": "DIS", "room": "TBA", "meeting_time": "TBA"}, {"component": "DIS", "room": "TBA", "meeting_time": "TBA"}], "topic": "", "course": "381-1", "descriptions": [{"name": "Overview of class", "value": "This is the first quarter of a two-quarter sequence on late imperial and modern China. (The second quarter covers twentieth-century China. Each course stands on its own; you will not be required to take both.) The themes linking both quarters are tensions regarding ethnic and national identity, shifts in gender ideals and family structure, and the effects of imperialist depredation. History 381-1 is a survey of Chinese history from the mid-16th c. second commercial revolution through the fall of the imperial order in 1911. Topics to be explored include Neo-Confucian thought, the imperial state and its problematic relationship with the gentry elite, the Manchu conquest, millenarian movements, commercial and industrial growth, early Chinese nationalism, and revolutionary radicalism. Both classes explore the definition and development of modernity in China. As part of this process, we will question the applicability of the term &quot;modern&quot; to Chinese history and consider how the Chinese experience with imperialism has fundamentally shaped their contemporary understanding of their own history."}, {"name": "Registration Requirements", "value": "AREA OF CONCENTRATION: Asia<br/>GRADING BASIS: Student option"}, {"name": "Teaching Method", "value": "TEACHING METHOD: Lecture and discussion"}, {"name": "Evaluation Method", "value": "EVALUATION METHOD: Take-home mid-term, analytic essay, final exam"}, {"name": "Class Materials (Required)", "value": "***Tentative until order posted to Norris website<br/>Jonathan Spence, The Search for Modern China, 2nd ed. 9780393307801.Shen Fu, Six Records of a Floating Life. 9780140444292.Philip Kuhn, Soulstealers: The Chinese Sorcery Scare of 1768. 9780674821521.Ning Lao t'ai-t'ai (as told to Ida Pruitt), A Daughter of Han: The Autobiography of a Chinese Working<br/>Woman. 9781614270942."}, {"name": "Class Notes", "value": "NOTES: Attendance at first class is mandatory"}], "lmod": "10/30/16 7:06 PM (CT)", "subject": "HISTORY"}]