[{"class_mtg_info": [{"meet_t": "MoWeFr 9:00AM - 9:50AM", "meet_l": "Technological Institute M177"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "35234", "title": "WCAS CHEM 350-3-01 Advanced Laboratory 3", "class_attributes": "", "section": "35234", "instructors": [{"instructor_phone": "", "instructor_name": "Frederick J Northrup", "instructor_addr": ""}], "associated_classes": [{"component": "LAB", "room": "Technological Institute B160", "meeting_time": "MoWe 1:00PM - 5:50PM"}, {"component": "LAB", "room": "Technological Institute B160", "meeting_time": "TuTh 1:00PM - 5:50PM"}], "topic": "", "course": "350-3", "descriptions": [{"name": "Overview of class", "value": "Chemistry 350-1,2,3 is a full-year, 3-quarter laboratory course intended to be taken by all students in the junior year of the chemistry major program. As there will be carryover of topics from one quarter to the next, the 3 quarters of the course must be taken in the designated sequence. As there may be continuation of some experiments from one quarter to the next (i.e. a compound synthesized in one quarter may be analyzed in a subsequent quarter), the 3 quarters of the course should be taken in the same academic year. Any deviation from this will require permission of the instructors.<br/><br/>The full 3 quarters of this course will cover advanced topics in methods of:<br/><br/>Instrumental analysis<br/>Synthesis of inorganic compounds<br/>Synthesis of organic compounds<br/>Spectroscopy<br/><br/>The course is designed for you to work in a &quot;research environment&quot;. That is, a research project usually requires a variety of different experiments to reach the desired conclusion. This requires sufficient knowledge to use a variety of experimental techniques and to interpret their results. For example:<br/>In these courses you will learn and practice specific techniques for synthesis and chemical analysis. You will apply these techniques both to assigned problems and to a problem of your choice at the end of the three courses. <br/><br/>CHEMISTRY 350-3: The 3rd course in this sequence covers the very important topic of spectroscopy from a physical chemistry point of view. It deals with the use of various spectroscopic techniques (FTIR spectroscopy, Raman spectroscopy, uv/visible absorption and fluorescence spectroscopy) for structure determination of gas and liquid phase molecules and for kinetics measurements. In addition, you will be asked to design and carry out a 4-week research project at the end of the quarter based on some aspect of course material in the entire Chem 350-1,2,3 sequence."}, {"name": "Registration Requirements", "value": "Prerequisites: Chemistry 342-2 or equivalent and 350-2 <br/><br/>Co-requisite: Chemistry 342-3 or 348"}, {"name": "Class Materials (Required)", "value": "&quot;Modern Spectroscopy&quot; by J. Michael Hollas, 4th edition, Wiley"}], "lmod": "2/6/17 8:39 AM (CT)", "subject": "CHEM"}]