[{"class_mtg_info": [{"meet_t": "MoWe 8:00AM - 9:50AM", "meet_l": "Technological Institute L150"}], "school": "MEAS", "overview_of_class": "COURSE DESCRIPTION / This course covers the fundamentals of traffic engineering. The objective is to introduce students to basic concepts, models, and methods related to the branch of traffic science that deals with the movement and control of vehicles on surface streets and freeways. Specifcally, these include traffic flow quantities, microscopic and macroscopic traffic flow models, as well as traffic signal operations. Students will not only gain hands-on experience with commercially available traffic control/simulation software, but also learn how to simulate traffic using computer codes developed by themselves. Students taking this course are expected to learn some of the essential knowledge in traffic engineering and to be able to apply their knowledge to traffic systems design and operations and to urban transportation planning.", "qtr": "Fall 2017", "name": "Transportation System Operations", "title": "MEAS CIV_ENV 376-0-20 Transportation System Operations", "lmod": "5/9/17 6:46 PM (CT)", "section": "20", "topic": "", "course": "376-0", "enrl_requirement": "Enrollment Requirements: REASON: Pre-registration is not allowed for this class. Please try again during regular registration.", "descriptions": [{"name": "Overview of class", "value": "COURSE DESCRIPTION / This course covers the fundamentals of traffic engineering. The objective is to introduce students to basic concepts, models, and methods related to the branch of traffic science that deals with the movement and control of vehicles on surface streets and freeways. Specifcally, these include traffic flow quantities, microscopic and macroscopic traffic flow models, as well as traffic signal operations. Students will not only gain hands-on experience with commercially available traffic control/simulation software, but also learn how to simulate traffic using computer codes developed by themselves. Students taking this course are expected to learn some of the essential knowledge in traffic engineering and to be able to apply their knowledge to traffic systems design and operations and to urban transportation planning."}, {"name": "Registration Requirements", "value": "Intended for upper level undergraduate and graduate students. Basic knowledge of calculus and statistics. Knowledge of MATLAB is desirable, but not required."}, {"name": "Teaching Method", "value": "CLASS/LAB SCHEDULE / The class meets twice a week for a 2-hr lecture."}, {"name": "Evaluation Method", "value": "1. Homework and projects: Homework will be assigned on a regular basis. A course project will be assigned that involves traffic simulation code development and a related case study. <br/><br/>2. Exams: There will be one in-class mid-term exam. The exam will be closed-book but you may bring one 8-1/2 by 11 inch sheet of paper to the exam. No final exam will be given. <br/><br/>3. Grading: The final grade will be assigned on the following basis: <br/>Homework<br/>Mid term exam<br/>Course project<br/><br/>4. Late submissions: Students are expected to submit their homework and project reports in time. Late homework will not be accepted unless it is the result of an officially excused absence. <br/><br/>5. Working Together: Working together on homework is accepted. However, students are expected to write up their own versions of solutions. Students are required to form teams to do the course project. A team may not have more than two members who will submit a joint project report and receive the same grade. Working together on exams, of course, is forbidden. <br/><br/>6. Calculator: Students may use a graphing calculator on exams and homework. Students may not use laptop computers and/or any machine with symbolic manipulation capabilities on exams."}, {"name": "Class Materials (Required)", "value": "For purchase at Norris Bookstore; Principles of Highway Engineering and Traffic Analysis / Fred L. Mannering et al / ISBN 978-1118120149/ 2012 / 5th / Wiley"}, {"name": "Class Materials (Suggested)", "value": "REFERENCES: 1. Calos F. Daganzo. (1997) Fundamentals of transportation and traffic operations, Elsevier Science, New York. <br/>2. Fred L. Mannering, Walter P. Kilareski and Scott S. Washburn. (2005) Principles of Highway Engineering and Traffic Analysis, John Wiley & Sons, Inc. <br/>3. James H. Banks. (2002) Introduction to Transportation Engineering, Second Edition, McGraw-Hill."}], "instructor": ["Yu   Nie"], "class_attributes": "", "id": "11574", "subject": "CIV_ENV"}]