[{"class_mtg_info": [{"meet_t": "TuWeTh 5:00PM - 5:50PM", "meet_l": "Technological Institute L211"}], "school": "MEAS", "enrl_requirement": "Enrollment Requirements: Students must have taken GEN_ENG 205-4 &amp; Math 234-0 in order to register for this course.", "qtr": "Spring 2017", "name": "30435", "title": "MEAS BMD_ENG 270-0-20 Fluid Mechanics", "class_attributes": "Prerequisites apply, see description<br/><br/>", "section": "30435", "instructors": [{"instructor_phone": "847/467-4633", "instructor_name": "Mitra J Hartmann", "instructor_addr": "Technological Institute, Rm B284, 2145 Sheridan Rd, EV CAMPUS"}], "associated_classes": [{"component": "DIS", "room": "TBA", "meeting_time": "Mo 2:00PM - 2:50PM"}, {"component": "DIS", "room": "TBA", "meeting_time": "Mo 3:00PM - 3:50PM"}, {"component": "DIS", "room": "TBA", "meeting_time": "Mo 4:00PM - 4:50PM"}], "topic": "", "course": "270-0", "descriptions": [{"name": "Overview of class", "value": "The flow of fluids is important in many biomedical applications ranging from blood flow in the human body to drug delivery. BME 270 provides a general introduction to fluid mechanics, both statics and dynamics. The laboratory component of the class consists of take-home experiments using aquarium pumps.<br/><br/>BMD_ENG 270 is a required course for the BS in BME. Undergraduates take this course at the end of their second year or at the beginning of their third year. The course uses integral calculus and differential equations, so these courses are prerequisites. It also helps to have taken physics and thermodynamics prior to this course. An equivalent course, ME 241, may also be taken."}, {"name": "Learning Objectives", "value": "An introduction to the del operator and the mathematics of fluids<br/> Basic fluid properties<br/> Hydrostatics: Pascal's law, buoyancy, calculation of forces on planar surfaces<br/> Bernoulli's principle<br/> Fluid kinematics and the Reynold's transport theorem<br/> Conservation of mass and momentum in integral form<br/> Conservation of energy in integral form. Pumps and turbines<br/> Pipe flow in practice and the Moody diagram<br/> The Navier-Stokes equation: Couette flow and Poiseuille flow<br/> Dimensional similitude and modeling"}, {"name": "Teaching Method", "value": "In spring 2016 students must arrange to be available to take a midterm exam starting at 4 pm on Friday, April 29th. Students are recommended to allow a minimum of three hours to complete the midterm exam. The final exam will also be held at 4 pm, with the day to be determined by the registrar's office. Students are recommended to allow a minimum of three hours to complete the final exam."}, {"name": "Evaluation Method", "value": "Grades will be based on problem sets, a midterm exam, a final exam, and laboratories."}, {"name": "Class Materials (Required)", "value": "Fundamentals of Fluid Mechanics by Munson et al., any of the 4th, 5th, 6th, or 7th edition."}], "lmod": "2/6/17 6:34 PM (CT)", "subject": "BMD_ENG"}]