[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "555 Clark B03"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "34023", "title": "WCAS LATINO 393-0-1 Topics in Latina and Latino Text and Representation", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "34023", "instructors": [{"instructor_phone": "847/467-3982", "instructor_name": "Frances R Aparicio", "instructor_addr": "Crowe Hall, Room 1131"}], "topic": "Cultural Politics of Latino Language", "course": "393-0", "descriptions": [{"name": "Overview of class", "value": "This course examines the cultural politics of Latinx languages in the United States in the context of the history of U.S. imperialism and the colonial conditions that have framed language use, attitudes, and hybridity among US Latinx communities. We will first study the relationship of language to national imaginaries, the colonial erasure of Spanish and the racialization of Spanish in the US, the English Only Movement in the 1980s, and the colonial violence deployed against the use of Spanish. The second part of the course will focus on practices of linguistic hybridity that combine English and Spanish, both in speech as well as in literature. The course aims to contest dominant notions of Spanish as a global and profitable language, focusing on the cultural politics of English and Spanish among U.S. Latinx speakers, and to exhort students to think critically about the power differentials accorded to languages in the context of the U.S. racial, cultural and linguistic politics.<br/><br/>Note: Course will be taught in Spanish. Papers can be submitted in English."}, {"name": "Learning Objectives", "value": "By the end of the course, students will be:<br/>1) Able to understand the history of linguistic exclusion among immigrant and minority communities in the United States;<br/>2) Familiar with the ways in which governments attempt to regulate language use;<br/>3) Able to understand the colonial and racialized status of Spanish in the United States;<br/>4) Able to reflect critically on their own access to English and Spanish;<br/>5) Able to understand and validate practices of linguistic code-switching."}, {"name": "Teaching Method", "value": "Class participationDiscussionGuest speakersPresentationsSeminarWriting assignments"}, {"name": "Evaluation Method", "value": "AttendanceClass participationExamsPapersPresentationsReadingsResearch projectWriting assignments"}, {"name": "Class Materials (Required)", "value": "Richard Rodríguez, Hunger of Memory. Bantam Books, 1982. $10.00<br/>Ariel Dorfman, Heading South, Looking North: A Bilingual Journey. Penguin Books, 1998. $10.00"}, {"name": "Class Notes", "value": "Note: Course will be taught in Spanish. Papers can be submitted in English."}], "lmod": "2/16/17 6:48 PM (CT)", "subject": "LATINO"}]