[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "Parkes Hall 213"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Winter 2017", "name": "25058", "title": "WCAS ENGLISH 105-6-22 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "25058", "instructors": [{"instructor_phone": "847/491-4969", "instructor_name": "Penny Gail Hirsch", "instructor_addr": "555 Clark St., 202"}], "topic": "Writing about Diversity, Identity &amp; Community", "course": "105-6", "descriptions": [{"name": "Overview of class", "value": "What creates community, why is community important, and who is considered a member? In a democracy - or on a college campus - does diversity enhance community, or challenge it? And how have the community or communities where you grew up affected your sense of identity? In this course, we will explore these questions by examining (a) the different ways that people collect information about community and identity and (b) how they express their ideas through various genres, such as personal narratives, academic studies, and news articles. As you hone your skills in writing, research, and critical thinking, we will consider the impact that histories and institutions have had on communities and individuals, particularly with regard to the US criminal justice system. Finally, you will complete a project related to community and diversity in a field of your choice, such as law, medicine, music, religion, public policy, higher education, or others."}, {"name": "Teaching Method", "value": "Discussion and workshop. Classes will include one field trip to a restorative justice café in Evanston and guest speakers from a transition home for formerly incarcerated women."}, {"name": "Evaluation Method", "value": "METHOD OF EVALUATION, INCLUDING WRITING ASSIGNMENTS: Grades will be based on three papers and class participation (no midterm or final exam). All papers will be written in stages and revised."}, {"name": "Class Materials (Required)", "value": "READING? A coursepack will include selections from books like the following: Bowling Alone: The Collapse and Revival of American Community by Robert Putnam; Hillbilly Elegy: A Memoir of a Family and Culture in Crisis by J.D. Vance; Portable Communities: The Social Dynamics of Online and Mobile Connectedness by Mary Chayko; The New Jim Crow: Mass Incarceration in the Age of Colorblindness by Michelle Alexander. <br/><br/>We will also use documentaries, articles from the New York Times and the Daily Northwestern, &quot;writing for re-entry&quot; pieces written by former prisoners, and some student writing from previous seminars at NU."}], "lmod": "12/29/16 6:57 PM (CT)", "subject": "ENGLISH"}]