[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "Kresge Centennial Hall 2-331"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "12364", "title": "WCAS HISTORY 392-0-26 Topics In History", "class_attributes": "", "section": "12364", "instructors": [{"instructor_phone": "", "instructor_name": "Ryan Christopher Burns", "instructor_addr": ""}], "topic": "The Golden Age of Piracy", "course": "392-0", "descriptions": [{"name": "Overview of class", "value": "This course will examine the rise and fall of piracy in the early modern Atlantic. No other band of outlaws can match the hold that pirates have on the popular imagination, from the &quot;sea dogs&quot; who prowled the Spanish Main to the fearsome exploits of Blackbeard. Setting piracy within the larger context of the Atlantic World, this course will explore the reasons why men, and occasionally women, risked their lives as buccaneers on the high seas. We will analyze the societies they sought to create, at sea and on land, grappling with themes of race, class, colonialism and rebellion. We will also consider our enduring fascination with pirates, from lurid contemporary newsletters to later legends of buried treasure, separating myth from reality in their time and our own."}, {"name": "Registration Requirements", "value": "AREA OF CONCENTRATION: Europe/Americas"}, {"name": "Teaching Method", "value": "TEACHING METHOD: Seminar"}, {"name": "Evaluation Method", "value": "EVALUATION METHOD: One Seminar Paper (10-12pp), Two Short Papers (3-4pp), Participation"}, {"name": "Class Materials (Required)", "value": "***Tentative until order posted to Norris website<br/>Daniel Defoe, A General History of the Pyrates. 978-0486404882Alexandre Exquemelin, The Buccaneers of America, translated by Alexis Brown. 9781420938128.Kris Lane, Pillaging the Empire: Global Piracy on the High Seas. 9780765602565.Newes from Sea of Two Notorious Pyrats: Ward the Englishman and Danseker the Dutchman"}, {"name": "Class Notes", "value": "NOTES:<br/>Attendance at first class is mandatory"}], "lmod": "10/30/16 7:06 PM (CT)", "subject": "HISTORY"}]