[{"school": "WCAS", "overview_of_class": "<p>This course will introduce students to the fundamentals of creative writing (prose), using the literary element of setting to frame discussions. Students will perform close readings of a survey of contemporary literature and discuss those works' merits and flaws, which is intended to assist and inspire students with their creation of original work to be shared with the class in a typical creative writing workshop setting. The class will be part literary analysis and part typical model creative writing workshop?setting will be the springboard into broader discussion in both cases. </p><br/><p>For the literary analysis portion of the class, we will read and discuss a survey of contemporary literature framed by the use of setting. For instance: imagined settings, such as a dystopic setting via something like Cormack McCarthy's The Road; fantasy/magical realism settings in Kelly Link or Gabriel Garcia Marquez's short stories, or a fairytale setting in Kate Bernheimer's work; realistic settings, such as an often overlooked setting in Clarice Lispector's The Hour of the Star; a travelogue/new territory setting via Teju Cole's Every Day is for the Thief; a reimagining or skewing of the everyday setting through work by George Saunders or Karen Russel; writing within an historical setting; further, we'll consider works with a deliberate lack of setting, such as Samuel Beckett's Malloy or Padgett Powell's Interrogative Mood. We'll also discuss work with illustrations/graphic novels to further explore how visuals affect setting, such as The Life and Times of Richard Onyango or work by Rutu Modan and Guy Delisle. </p><br/><p>Students will then implement the literary devices they've studies by writing original prose, which will be shared with the class for peer review, as well as with the instructor. Discussion of these pieces will include, but not be limited to, the writer's use of setting; however, writing assignments will be influenced by the type of settings we'll have been discussing at the time. Additionally, there will be field research trips to explore unfamiliar spaces, which will serve as writing prompts: these excursions may include a visit to the International Museum of Surgical Science, Belmont Harbor, the Baha'i Temple, the Pullman Historic District, the rooftop garden at Uncommon Ground, and more. </p>", "name": "Residence-Linked Seminar", "section": "20", "location": "Meets in Non-General PurposeRm", "topic": "Finding, Entering, and Writing a World", "course": "280-7", "meeting_time": ["Fr 9:00AM - 12:00PM"], "path": "/class-descriptions/4620/WCAS/GEN_LA/280-7/37800", "instructor": ["Thomas Searles Burke"], "class_attributes": "Permission of Instructor<br/><br/>", "id": "37800", "subject": "GEN_LA"}, {"school": "WCAS", "overview_of_class": "This course introduces students to Technology, Inequality and Societal Impacts (intended and unintended) of technology, with the goal of helping students develop arguments as to whether technology helps close, or exacerbate, inequality gaps. The course will use case studies to examine ways in which technology has affected inequality. There are several studies that have examined the impact of technology on labor, but not much on how technology has affected gaps in inequality.", "name": "Residence-Linked Seminar", "section": "21", "location": "Meets in Non-General PurposeRm", "topic": "Technology and Inequality", "course": "280-7", "meeting_time": ["Mo 6:00PM - 9:00PM"], "path": "/class-descriptions/4620/WCAS/GEN_LA/280-7/37807", "instructor": ["Richard Wayne Freeman"], "class_attributes": "Permission of Instructor<br/><br/>", "id": "37807", "subject": "GEN_LA"}]