[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "University Hall 121"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "22004", "title": "WCAS HISTORY 381-2-20 History of Modern China: 1911-present", "class_attributes": "Historical Studies Distro Area<br/><br/>Attendance at 1st class mandatory<br/><br/>", "section": "22004", "instructors": [{"instructor_phone": "847/491-2753", "instructor_name": "Peter J Carroll", "instructor_addr": "Harris Hall - Room 216"}], "associated_classes": [{"component": "DIS", "room": "University Hall 118", "meeting_time": "Fr 1:00PM - 1:50PM"}, {"component": "DIS", "room": "University Hall 118", "meeting_time": "Fr 2:00PM - 2:50PM"}, {"component": "DIS", "room": "University Hall 112", "meeting_time": "Fr 3:00PM - 3:50PM"}], "topic": "", "course": "381-2", "descriptions": [{"name": "Overview of class", "value": "This course is the second half of a two-quarter sequence on late imperial and modern China. (Each course stands on its own and you will not be required to take both). This class explores modern Chinese history from the late Qing to the present. The course will stress both the Nationalist and Communist eras and will consider the disintegration of the Chinese polity into warlordism, Nationalist efforts to reestablish a viable state authority, the disastrous eight year long War of Resistance against Japan, cooperation, conflict, and eventual civil war between the Guomindang and the Chinese Communist Party, and the triumphs and tribulations of communist rule. Within this chronological framework, we will explore such topics as the growth of modern urban mass culture, the development of new forms of artistic expression, attempts to ameliorate the status of Chinese women, revolutionary charisma and the effects of political campaigns, the economic and social effects of the Four Modernizations, and the place of the Patriotic Democratic Movement of 1989 in China's long tradition of intellectual and labor protest."}, {"name": "Teaching Method", "value": "Discussion sectionLecture"}, {"name": "Evaluation Method", "value": "Exam, finalExam, mid-term: (take-home)<br/>Papers"}, {"name": "Class Materials (Required)", "value": "***Tentative until posted to Norris website***<br/> Jonathan Spence. The Search for Modern China, 3rd ed. 9780393934519.<br/>Lu Xun. The True Story of Ah Q. 9780140455489.<br/>Edward Friedman, et al. Chinese Village, Socialist State. 9780300054286.<br/>Liang Heng and Judith Shapiro. Son of the Revolution. 9780394722740.<br/>Peter Gries. China's New Nationalism: Pride, Politics, and Diplomacy. 97800520244825.<br/>Additional readings will be available on Blackboard."}, {"name": "Class Notes", "value": "AREA OF CONCENTRATION: Asia/Middle East"}], "lmod": "12/24/16 7:00 PM (CT)", "subject": "HISTORY"}]