[{"school": "JOUR", "overview_of_class": "\"There is only one valid definition of business purpose: to create a customer. ?. Therefore, any business enterprise has two?and only two?basic functions: marketing and innovation.\"<br/><br/>Peter Drucker (1954), The Practice of Management<br/><br/>Digital Marketing, Media and Innovation covers to how marketing leaders face the daunting challenge of picking the best direction for their company, while dealing with constantly increasing data sources, evolving analytics tools, hyper-segmented consumer insights and channel explosion, all within ever shifting marketing conditions.<br/><br/>This course will introduce students to the fundamental considerations for developing a digital marketing and media strategy and facilitating the continuous innovation of products and services, including the organizational, cultural and infrastructural considerations for marketing strategists working in today's digital world.  <br/><br/>The course will also cover theories related to Marketing and Innovation Management as the cornerstone for developing and implementing strategies that retain existing customers and acquire new ones within an increasingly complex web of marketing communications.<br/><br/> In addition, students will also be provided with a more tactical introduction to new and emerging digital channels, platforms and technologies that are driving innovation in virtually every aspect of marketing, including social and mobile. The course will include interactive workshops and guest lectures from digital marketing leaders of global brands and innovative technologies. <br/><br/>Advisory note for online students: It is recommended that students complete IMC 452-6 Marketing Management in advance of this class.", "name": "Practicum", "section": "20", "location": "No Room Needed", "topic": "Digital Marketing, Media, & Innovation", "course": "498-6", "meeting_time": ["TBA"], "path": "/class-descriptions/4610/JOUR/IMC/498-6/25717", "instructor": ["Francis Xavier Dudley"], "class_attributes": "", "id": "25717", "subject": "IMC"}, {"school": "JOUR", "overview_of_class": "Marketing Measurement of Communication Effects <br/><br/> <br/><br/>Marketing Measurement of Communication Effects focuses on the art and science of strategic marketing measurement and practical application of marketing analytics to navigate the increasingly complicated path towards marketing accountability. Students use readings, cases and class exercises to develop skills in planning and conducting precise measurement of marketing communications effects. The exercises and interaction are structured to encourage more in-class learning by doing examples and projects with real data. The course provides actionable guidance for connecting marketing to business performance. The course will include a framework to help close the divide between finance, marketing, and the executive suite around the role of marketing investments in driving growth in value from three key dimensions - brands, customers, and marketing communications. Prerequisites IMC 451-0, IMC 460. Faculty Advisory Note for Online course: IMC 451 Statistics and Market Research and IMC 460 are recommended courses to take prior to Marketing Measurement", "name": "Practicum", "section": "21", "location": "No Room Needed", "topic": "Marketing Measurement", "course": "498-6", "meeting_time": ["TBA"], "path": "/class-descriptions/4610/JOUR/IMC/498-6/25718", "instructor": ["Pradeep Kumar Madathil"], "class_attributes": "", "id": "25718", "subject": "IMC"}]