[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "Kresge Centennial Hall 2-410"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24596", "title": "WCAS RELIGION 379-0-21 Topics in Comparative Religion", "class_attributes": "", "section": "24596", "instructors": [{"instructor_phone": "491-2614", "instructor_name": "Richard   Kieckhefer", "instructor_addr": "1860 Campus Drive, Crowe Hall # 4-141"}], "topic": "Pilgrimage", "course": "379-0", "descriptions": [{"name": "Overview of class", "value": "This class will examine pilgrimage in historical, anthropological, and comparative perspective. It will begin by examining the origins, history, and modern experience of the Camino to Santiago de Compostela, one of the most important Christian pilgrimages, and one to which many pilgrims still go by traditional means: on foot. The second unit of the course will be devoted to theories of pilgrimage-that of Victor and Edith Turner, and then critiques of and alternatives to the Turner interpretation of pilgrimage. The third will return to Christian pilgrimages, surveying a variety of medieval and modern examples, and will explore how pilgrimage has changed over time, particularly in response to the challenges of modernity. Finally, the course will turn to manifestations of pilgrimage in other religious traditions and ask how those affect our understanding of the phenomenon.<br/> <br/>The central question in much literature on pilgrimage is how far the experience is unifying and bonding (i.e., how far it engenders a sense of <i>communitas</i> among those who travel together to the holy places), and how far, to the contrary, pilgrimage is always an experience of difference and contestation. Those who write about pilgrimage ask also about motives and their implications: what difference it makes whether the stated motives for undertaking pilgrimage are religious, spiritual, or secular. Pilgrimage is also a metaphor for life, and those who go on pilgrimage often view it as a life-transforming experience; understanding its significance thus means also seeing how pilgrimage relates to broader conceptions of religious life and behavior."}, {"name": "Teaching Method", "value": "The course will entail a mix of lectures and discussion. Each student will write two short papers (five to eight pages each), one on Christian and one on non-Christian pilgrimage; both papers should show familiarity with theoretical work on pilgrimage. There will be no exams. Grades will be based on class participation and written work."}, {"name": "Class Materials (Required)", "value": "1. Conrad Rudolph, Pilgrimage to the End of the World: The Road to Santiago de Compostela (Chicago: University of Chicago Press, 2004). [pb. 9780226731278, $17.00]<br/><br/>2. Victor Turner and Edith Turner, Image and Pilgrimage in Christian Culture, new ed. (New York: Columbia University Press, 1978; new ed. 2011). [pb. 9780231157919, $34.00]<br/><br/>3. Simon Coleman and John Elsner, eds., Pilgrimage: Past and Present in the World Religions (Cambridge, Mass.: Harvard University Press, 1995). [0674667654, from $24.19] [291.446 C692p]<br/><br/>Plus photocopy pack"}, {"name": "Class Notes", "value": "Counts towards (RHM) Religion, Health and Medicine major concentration."}], "lmod": "12/29/16 7:05 PM (CT)", "subject": "RELIGION"}]