[{"class_mtg_info": [{"meet_t": "Th 2:00PM - 4:50PM", "meet_l": "Kresge 3438 Philosophy Sem. Rm"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "22787", "title": "WCAS PHIL 460-0-20 Seminar in Ethical Theory", "class_attributes": "Graduate Students Only<br/><br/>", "section": "22787", "instructors": [{"instructor_phone": "847/467-0437", "instructor_name": "Kyla Sue Ebels Duggan", "instructor_addr": "Crowe 2-148"}], "topic": "", "course": "460-0", "descriptions": [{"name": "Overview of class", "value": "We will consider the nature of love, and the relationship among love, reasons, and reasoning. We will ask after the reasons that we have to love, the reasons that we have to act out of love and the relationship between these. We will investigate some familiar worries about the idea that love is responsive to reasons, conceived as arising from properties or features of the beloved. If it were, would it make sense to stop loving someone who lost the features in question? Would it make sense to &quot;trade up,&quot; abandoning the person whom one loves for someone who better exemplifies these features? We will also consider the implications of the fact that love itself does not seem to be an attitude to which we could reason. In combination with the idea that it makes sense to act out of love, this seems to cause trouble for attempts to understood practical reasons reductively in terms of practical reasoning. So we will ask about what love tells us about the relationship between explicit practical reasoning and the reasons that we have to act. Does making sense of love require us to expand our conception of practical thinking beyond explicit reasoning? What implications, if any, does this have for moral thinking and reasoning?"}, {"name": "Registration Requirements", "value": "Instructor permission for non-phil graduate students and undergraduates."}, {"name": "Learning Objectives", "value": "Knowledge of issues concerning love standardly discussed in contemporary philosophical literature.<br/>Familiarity with important historical philosophical discussions of love.<br/>Developing understanding of the relationships among love, practical and moral reasons and practical reasoning."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Short weekly response papers, course participation and final seminar paper."}, {"name": "Class Materials (Required)", "value": "Selected excerpts and articles will be posted on the course web site. Likely historical readings include works by Plato, Augustine, Kant, Kierkegaard, and Murdoch. Likely contemporary readings include work by Frankfurt, Scheffler, Gaita, Kolodny, Velleman, Setiya and others."}], "lmod": "12/24/16 7:05 PM (CT)", "subject": "PHIL"}]