[{"class_mtg_info": [{"meet_t": "Th 9:00AM - 11:50AM", "meet_l": "SOCIOL Sem Rm 107 - 1812 Chi"}], "school": "WCAS", "overview_of_class": "This course introduces graduate students to the sociology of culture (understanding social influence on cultural formations) and cultural sociology (understanding cultural influences on social processes). Although the course has no prerequisites, some acquaintance with Weber, Durkheim, and Marx will be helpful.  Classes will be roughly half discussion, half lecture.  Students must come to class prepared to discuss the readings and their applications, and teams of students will lead each discussion.  <br/><br/>Course requirements are:<br/>1. Active and prepared participation in class discussions, including leadership (30%)<br/>2. A report on one of the recommended readings (a book or pair of articles) (30%)<br/>3. A term paper, including a short oral report (40%)", "qtr": "Winter 2016", "name": "Cultural Sociology and the Sociology of Culture", "title": "WCAS SOCIOL 420-0-20 Cultural Sociology and the Sociology of Culture", "lmod": "1/9/16 6:54 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Wendy   Griswold", "instructor_addr": "1810 Chicago Ave"}], "topic": "", "course": "420-0", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "descriptions": [{"name": "Overview of class", "value": "This course introduces graduate students to the sociology of culture (understanding social influence on cultural formations) and cultural sociology (understanding cultural influences on social processes). Although the course has no prerequisites, some acquaintance with Weber, Durkheim, and Marx will be helpful. Classes will be roughly half discussion, half lecture. Students must come to class prepared to discuss the readings and their applications, and teams of students will lead each discussion. <br/><br/>Course requirements are:<br/>1. Active and prepared participation in class discussions, including leadership (30%)<br/>2. A report on one of the recommended readings (a book or pair of articles) (30%)<br/>3. A term paper, including a short oral report (40%)"}, {"name": "Class Materials (Required)", "value": "This is a tentative booklist. Please confirm all books before purchase. <br/><br/><br/>Collins, Randall. 2004. Interaction Ritual Chains. Princeton, N.J.: Princeton University Press. ISBN-13: 978-0691123899<br/>Griswold, Wendy. 2012. Cultures and Societies in a Changing World, 4rd ed. Thousand Oaks, CA: Pine Forge Press. ISBN-13: 978-1412990547<br/>Jerolmack, Colin. 2013. The Global Pigeon. Chicago &amp; London: University of Chicago Press. ISBN-13: 9780226002088<br/>Saguy, Abigail C. 2003. What Is Sexual Harassment? Berkeley: University of California Press. ISBN-13: 978-0520237414<br/>Spillman, Lynn. 2002. Cultural Sociology. Malden, Mass. &amp; Oxford: Blackwell. [To be used repeatedly, so if you only buy one book, this should be it.] ISBN-13: 978-0631216537"}], "path": "/class-descriptions/4610/WCAS/SOCIOL/420-0/23910", "instructor": ["Wendy   Griswold"], "class_attributes": "", "id": "23910", "subject": "SOCIOL"}]