[{"class_mtg_info": [{"meet_t": "Tu 6:00PM - 8:50PM", "meet_l": "Garage Workspace Classroom 1"}], "school": "JOUR", "enrl_requirement": "Enrollment Requirements: Registration is reserved for IMC Full-Time Students only.<br/>Add Consent: Department Consent Required<br/>", "qtr": "Spring 2017", "name": "33977", "title": "JOUR IMC 498-0-23 Practicum", "class_attributes": "", "section": "33977", "instructors": [{"instructor_phone": "", "instructor_name": "Kristian J Hammond", "instructor_addr": ""}, {"instructor_phone": "", "instructor_name": "Jonathan R Copulsky", "instructor_addr": ""}], "topic": "Marketing Technologies", "course": "498-0", "descriptions": [{"name": "Overview of class", "value": "Marketing Technologies are being increasingly adopted by firms to manage marketing campaigns, resource allocation, marketing analytics and content marketing. But how can marketing executives know which technologies are right for their organizations? <br/> <br/>This course helps students answer this question and starts with standardizing the taxonomy and categorization as well as a vocabulary to describe the processes, activities, and outcomes that marketing technologies seek to enable. When marketing executives are equipped with standardized definitions, taxonomy and categorization, they can better evaluate the value of various solutions and start to build the solutions that provide the greatest value for their organizations.<br/> <br/>This course is intended to be a lab where students from marketing and computer science backgrounds will collaborate on producing an integrated model that precisely describes the processes and activities and associates them with the target outcomes. Students will work on teams, each of which will tackle a different category of marketing (e.g., campaign management, marketing resource management). Our expectation is that the course will expose students to both marketing executives struggling to apply marketing technologies effectively and marketing technology vendors struggling to break through the noise."}], "lmod": "2/19/17 6:39 PM (CT)", "subject": "IMC"}]