[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "University Hall 122"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "31592", "title": "WCAS PHIL 268-0-20 Ethics and the Environment", "class_attributes": "Ethics &amp; Values Distro Area<br/><br/>", "section": "31592", "instructors": [{"instructor_phone": "8474912552", "instructor_name": "Richard H Kraut", "instructor_addr": "Crowe Hall 1-178"}], "associated_classes": [{"component": "DIS", "room": "Fisk Hall 114", "meeting_time": "Fr 10:00AM - 10:50AM"}, {"component": "DIS", "room": "Fisk Hall 114", "meeting_time": "Fr 11:00AM - 11:50AM"}, {"component": "DIS", "room": "Harris Hall L05", "meeting_time": "Fr 12:00PM - 12:50PM"}, {"component": "DIS", "room": "Harris Hall L05", "meeting_time": "Fr 1:00PM - 1:50PM"}], "topic": "", "course": "268-0", "descriptions": [{"name": "Overview of class", "value": "We will discuss three issues: First, climate change. How should the burdens of addressing the problem be distributed among nations? Do you and I have a moral duty to reduce our carbon emissions? Is cost-benefit analysis an appropriate and workable tool for addressing the ethical issues? What sacrifices can future generations demand of us? - in fact, what standing do they have to make any demands, since the do not exist? Are we morally required to bring them into existence and to work for them? Should we care about the effects of climate change on other species, including plants? Why does it matter that many species are expected to become extinct? What about the possibility that the human species might itself be destroyed - isn't this bound to happen eventually? Our next two topics concern the relationship of human beings to the rest of the world - in particular to animals and to the environment. Do animals have a lower moral status than human beings, and if so, why? Is &quot;speciesism&quot; (a bias in favor of our own species) just as objectionable as sexism and racism? Do we owe it to animals, as a matter of justice, to treat them properly? Do they have rights, and should these be recognized in the courts? Is it permissible to kill them for our own purposes, so long as we do not make them suffer? If the only way to keep rodents out of our homes is to kill them, can we permissibly do so? Finally, our third issue concerns the aesthetic value of the environment. Is the beauty of the natural world, like all beauty, in the eyes of the beholder, and if so, why would it matter if the natural beauty some people respond to is no longer available to future generations? Is there something objectively valuable in nature and landscapes? Are there better and worse ways to orient ourselves to the world around us? Should we value natural beauty in the same way and for the same reasons that we value paintings and drawings?"}, {"name": "Learning Objectives", "value": "Understanding of key issues"}, {"name": "Teaching Method", "value": "Discussion sectionLecture"}, {"name": "Evaluation Method", "value": "Three papers and short reports due on each day of class."}, {"name": "Class Materials (Required)", "value": "John Broome: Climate Matters 978 039 306336 3 Roger Scruton. Beauty: A Very Short Introduction 978 019 922975 8 Cass R. Sunstein and Martha C. Nussbaum (eds.) : Animal Rights: Current Debates and New Directions 978 019 530510 4 Allen Carlson: Nature and Landscape: An Introduction to Environmental Aesthetics 978 023 114041 6"}], "lmod": "4/3/16 8:13 PM (CT)", "subject": "PHIL"}]