[{"school": "WCAS", "overview_of_class": "Thought Experiments: Ways of Knowing in Neuroscience and the Humanities<br/><br/>Until a couple of centuries ago, scholars made no distinction between Science and Literature, or Science and Art. Science, &quot;scientia,&quot; was the word for knowledge in the broadest sense?all subjects of inquiry. Poets wrote scientific treatises, Chaucer was known as a master of alchemy as well as the &quot;fadir of Englyshe poesie&quot; and figures we think of today as hard-core scientists, like Johannes Kepler, were practitioners of the creative arts, writing science fiction as well as scientific treatises. <br/><br/>What would it be like to revive this older paradigm, to reintegrate these supposedly disparate ways of thinking about thinking into a single classroom? Can the varied intellectual explorations of Thought from neuroscientific, literary, and artistic perspectives be harnessed and brought to bear on core issues that interest those seeking scholarly understanding of the human experience?namely, perception, memory, emotions, ethics, knowledge and madness? In this class, we will read literary texts, including Shakespeare's &quot;Hamlet,&quot; Jane Austen's &quot;Sense and Sensibility,&quot; and William Faulkner's &quot;The Sound and the Fury,&quot; as well as writings by neuroscientists, including chapters from David Linden's &quot;The Accidental Mind&quot; and Antonio Damasio's &quot;The Feeling of What Happens&quot; and short scientific articles on animal behavior, to explore different perspectives on what constitutes thought; what free will is and isn't; and what tools we have for making sense of feelings, logic, perception, and memory.<br/><br/>HUM 370-5/ENG 385/NEUROSCI 385 may count as either an Area V (Ethics and Values) or Area VI (Lit &amp; Fine Arts) distribution requirement. Please attend the first class for details.", "name": "Special Topics in the Humanities", "section": "20", "topic": "Thought Experiments", "course": "370-5", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4610/WCAS/HUM/370-5/27638", "instructor": ["Indira M Raman", "Susan E Phillips"], "id": "27638", "subject": "HUM"}, {"school": "WCAS", "overview_of_class": "Social epistemology is the study of the social dimensions of knowledge. In this course we will examine central issues in this area of philosophy with special focus on how to understand the knowledge attributed to groups (such as corporations and universities), what norms govern our assessment of the credibility of others, the extent to which people can be the victims of testimonial injustice, and the role that ignorance plays in epistemic culpability. The abilities to think, read, and write critically, to develop and defend arguments, and to appropriately justify one's views will be emphasized.", "name": "Special Topics in the Humanities", "section": "21", "topic": "Social Epistemology", "course": "370-5", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4610/WCAS/HUM/370-5/27639", "instructor": ["Jennifer Amy Lackey"], "id": "27639", "subject": "HUM"}]