[{"class_mtg_info": [{"meet_t": "Tu 2:00PM - 4:50PM", "meet_l": "Wirtz 235 Seminar Room 1"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: REASON: Pre-registration is not allowed for this class. Please try again during regular registration.<br/>Add Consent: Department Consent Required<br/>", "qtr": "Spring 2017", "name": "30844", "title": "WCAS AMER_ST 301-3-20 Seminar for Majors", "class_attributes": "Permission of department<br/><br/>", "section": "30844", "instructors": [{"instructor_phone": "", "instructor_name": "Elondust   Johnson", "instructor_addr": ""}, {"instructor_phone": "", "instructor_name": "Ramon H Rivera-Servera", "instructor_addr": ""}], "topic": "Blacktino Queer Performance", "course": "301-3", "descriptions": [{"name": "Overview of class", "value": "This course stages a conversation among blackness, Latinidad and sexuality by examining the work of<br/>black and brown artists in the black diaspora. Using &quot;blacktino&quot; as the framing device, the course will<br/>highlight how these artists index the specificities of black and brown social and political relations, while<br/>also waging a broader queer-of-color critique of institutionalized racism and homophobia. Students will<br/>engage these artists' work on various levels, including textual analysis, embodied experience, critical<br/>reception, and site specific engagement.*<br/><br/>*The class includes a mandatory experiential learning trip to New York City (May 26-29, 2017). Travel expenses will<br/>be subsidized for all enrolled students."}, {"name": "Registration Requirements", "value": "To apply for registration permission, please e-mail professors at e-johnson10@northwestern.edu and rrivera-<br/>servera@northwestern.edu with no more than a 500-word statement expressing interest in the<br/>course, fit into your current undergraduate study plan, and detailing any relevant coursework already<br/>taken in advance of enrollment or relevant experience by no later than February 17, 2017 @ 5pm.<br/>Applicants will be notified of admission by the opening of registration on February 20th."}], "lmod": "2/14/17 6:41 PM (CT)", "subject": "AMER_ST"}]