[{"class_mtg_info": [{"meet_t": "We 6:00PM - 8:50PM", "meet_l": "Annenberg Hall G30"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Students must have taken and passed PSYCH 303-0 to register.", "qtr": "Winter 2017", "name": "25589", "title": "WCAS PSYCH 376-0-20 Cognitive Behavior Therapy", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>Attendance at 1st class mandatory<br/><br/>", "section": "25589", "instructors": [{"instructor_phone": "312/320-1382", "instructor_name": "Helene D Moore", "instructor_addr": ""}], "topic": "", "course": "376-0", "descriptions": [{"name": "Overview of class", "value": "Cognitive Behavior Therapy is a leading treatment for many emotional and behavioral problems. This course will provide students with an understanding of the scientific foundation and treatment for a wide range of diagnoses including depression, anxiety, and personality disorders. Students will have an opportunity to study and observe the crucial link between cognitions, feelings, behaviors, physiology, and the environment. They will also learn and practice basic CBT interventions. This course will utilize didactic, experiential, and observational techniques, with an emphasis on case examples. For students considering a career in clinical psychology, this course may be of special interest."}, {"name": "Registration Requirements", "value": "Psych 303 Psychopathology is recommended."}, {"name": "Learning Objectives", "value": "Develop an understanding of the theoretical and historical background of CBT.<br/>Develop an understanding of CBT theory.<br/>Develop an understanding of CBT case conceptualization.<br/>Develop knowledge and skills for using basic CBT interventions, such as Socratic dialog, self-monitoring, activity scheduling, and cognitive restructuring."}, {"name": "Teaching Method", "value": "Lecture, Videos, Demonstrations, Case studies, Group work, Discussions, Class participation, CBT Exercises/Homework"}, {"name": "Evaluation Method", "value": "Attendance, Class participation, Workbook assignments, Relaxation technique paper/presentation, Mid-term paper/presentation, Final exam"}], "lmod": "12/25/16 7:06 PM (CT)", "subject": "PSYCH"}]