[{"class_mtg_info": [{"meet_t": "MoWeFr 11:00AM - 11:50AM", "meet_l": "Technological Institute L221"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "33222", "title": "WCAS CHEM 416-0-01 Practical Training in Chemical Biology Methods and Experimental Design", "class_attributes": "", "section": "33222", "instructors": [{"instructor_phone": "847/467-4362", "instructor_name": "Neil L Kelleher", "instructor_addr": "Silverman 3613"}], "associated_classes": [{"component": "LAB", "room": "Meets in Non-General PurposeRm", "meeting_time": "Th 2:00PM - 4:50PM"}], "topic": "", "course": "416-0", "descriptions": [{"name": "Overview of class", "value": "By the end of this course you will expected to have obtained a general understanding of many commonly used measurement techniques available to augment research at Northwestern. It features two weeks of classroom-based instruction on experimental design and analysis; supplemented by NIH Rigor And Reproducibility Training Modules. This overview will be followed by a combination of lectures and labs addressing a broad range of analytical techniques and imaging methods. These lessons will then be applied to inquiry-based learning in Northwestern's advanced instrumentation cores. <br/> <br/>In addition to lecture, students are expected to devise two Mini-Research Projects and will work on one of these with senior staff to apply specific services and protocols utilizing instrumentation available within Research Cores and University Centers. Students will design specific experiments in selected areas of their interest, and learn new sample preparation methods and instrumentation within one of the following areas: mass spectrometry; proteomics, in vivo and molecular imaging, small molecule synthesis and purification; high-throughput screening, x-ray crystallography, and analysis of bioelements. <br/> <br/>Material generated in the class counts for course credit will be usable in research group settings."}], "lmod": "4/3/16 7:52 PM (CT)", "subject": "CHEM"}]