[{"class_mtg_info": [{"meet_t": "MoWe 12:30PM - 1:50PM", "meet_l": "Parkes Hall 213"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-registration - Reserved for English students.", "qtr": "Spring 2017", "name": "33421", "title": "WCAS ENGLISH 397-0-20 Research Seminar for Literature Majors", "class_attributes": "", "section": "33421", "instructors": [{"instructor_phone": "", "instructor_name": "Rebecca Lynn Fall", "instructor_addr": ""}], "topic": "Early &amp; Modern Social Media", "course": "397-0", "descriptions": [{"name": "Overview of class", "value": "The digital &quot;social media revolution&quot; has been a powerful one, fundamentally changing how we communicate and interact with each other. To help you better understand the fascinating, often fraught relationship between media and social identity, this course will explore the history of &quot;popular&quot; media by comparing and contrasting today's with that of another revolutionary era, sixteenth- and seventeenth-century England. We will examine various types of media that were in some sense &quot;popular&quot; or &quot;social&quot; in early modern England (commercial drama, including Shakespeare; broadside ballads; manuscript miscellanies) alongside twenty-first-century popular media (Twitter, Instagram, and Tumblr, as well as television, film, and music). We will ask: in what ways does medium affect how we understand a text? How do different forms of media change the ways readers perceive themselves, or how communities interact? What does it mean for a medium to be &quot;popular,&quot; and what makes a medium social? In the process of developing a research project that culminates in a paper of 12-15 pages, students will have the opportunity to conduct archival research, practice navigating electronic databases, write abstracts and research proposals, create an annotated bibliography, and produce peer reviews."}, {"name": "Teaching Method", "value": "Seminar discussion and occasional short lectures."}, {"name": "Evaluation Method", "value": "Regular short writing assignments; complete research project (including annotated bibliography, project proposal, peer reviews, draft(s), and final essay); class participation."}, {"name": "Class Materials (Required)", "value": "A selection of early modern plays and short texts (including pamphlets and songs as well as Shakespeare's King Lear or The Winter's Tale); popular and scholarly articles about media then and now; selected examples from Tumblr, Twitter, Instagram, etc."}, {"name": "Class Notes", "value": "Open to juniors and seniors only. Students must successfully complete 4-6 300-level English courses before taking English 397."}], "lmod": "2/6/17 6:42 PM (CT)", "subject": "ENGLISH"}]