[{"class_mtg_info": [{"meet_t": "MoWe 9:30AM - 10:50AM", "meet_l": "Swift Hall 210"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores<br/>Add Consent: Department Consent Required<br/>Drop Consent: Department Consent Required<br/>", "qtr": "Fall 2016", "name": "10177", "title": "WCAS PSYCH 101-6-22 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>Attendance at 1st class mandatory<br/><br/>", "section": "10177", "instructors": [{"instructor_phone": "", "instructor_name": "Harry David   Smith", "instructor_addr": ""}], "topic": "Music and the Mind", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "For many, music serves a valuable function in everyday life. Music can serve as a mode of artistic expression, a method of relaxation, a means of influencing mood, and an avenue toward transcendence. This course will focus on the human experience of music by integrating research and theory from cognitive, social, and developmental psychology. Special attention will be given to topics such as the perception of music, the development of musical expertise and creativity, the effect of music on cognition, the emotional impact of music, and effective musical instruction."}, {"name": "Teaching Method", "value": "Class time will be spent mainly in discussion but I plan on showing videos and listening to musical excerpts. We will also attend musical performances outside of class."}, {"name": "Evaluation Method", "value": "Students will be evaluated based solely on written work.<br/><br/>NUMBER OF WRITING ASSIGNMENTS AND THEIR LENGTHS <br/>Introductory paper to be assigned the first week: Why Music? (2-3 pages)<br/>Research paper : Top musicians: What does the evidence say about the role of nature vs. nurture? (3-4 pages)<br/>Reaction paper based on attending a musical performance (2-3 pages)<br/>Final paper based on research project. (8-9 pages)"}, {"name": "Class Materials (Required)", "value": "Primary text:<br/>Levitan, Daniel J. (2006) This is Your Brain on Music: The Science of Human Obsession. Dutton, New York. ISBN-13: 9780452288522<br/><br/><br/>Plus a list of readings: TBD"}], "lmod": "10/30/16 7:09 PM (CT)", "subject": "PSYCH"}]