[{"school": "WCAS", "overview_of_class": "Writing in 1855, novelist Nathaniel Hawthorne complained that his own literary work was being overshadowed by &quot;a damned mob of scribbling women.&quot; Some female authors in the nineteenth century indeed produced unprecedented runaway bestsellers; most notably, Harriet Beecher Stowe's Uncle Tom's Cabin became the best-selling novel of the century. However, the act of writing remained a vexed vocation for women in this period. On the one hand, women writers were able to capitalize on the stereotype of feminine virtue to voice strident critiques of the status quo. On the other hand, women's writing was often treated as a niche market assumed to be read exclusively by other women. In this class, we will examine how women writers depict the act of writing and, by extension, the role of women in intervening in public and political discourse. Crucially, we will also examine differences among this cohort of writers, including the racial and class differences that produced divergent visions for the role of women in the public sphere.", "name": "Studies in American Literature", "section": "20", "topic": "19th C Amer Women Writers", "course": "378-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4650/WCAS/ENGLISH/378-0/23936", "instructor": ["Hosanna Grace Krienke"], "id": "23936", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "The period between the 1820s and the 1860s has traditionally been called the &quot;American Renaissance&quot;: a time when the U.S. nation, and its literature, flourished. The nineteenth century witnessed the publication of a number of important American texts that gave rise to a new national literary tradition, including familiar titles like The Scarlet Letter, Moby-Dick, and Leaves of Grass. Yet, as the nation stretched its geographical coordinates, writers from outside of this predominantly white, male literary heritage issued their own responses to the vision of a &quot;New World Democracy.&quot; This course surveys major authors of the American Renaissance while contextualizing critical responses to literary representations of American Democracy. Reading authors from Native American, Latino/a, African American, and French Creole cultures, we'll expand our study of American literature to include writers who interrogate the democratic project from both within and outside of the nation. While analyzing autobiographies, poems, short stories, and speeches we will also learn to read paintings, Native American pictographs, songs, and newspaper sketches, in an exploration of what it meant to be &quot;American&quot; and what counted as &quot;Literature&quot; in the golden era of American Letters.", "name": "Studies in American Literature", "section": "21", "topic": "The American Renaissance", "course": "378-0", "meeting_time": ["MoWe 12:30PM - 1:50PM"], "path": "/class-descriptions/4650/WCAS/ENGLISH/378-0/23937", "instructor": ["Alanna Lynn Hickey"], "id": "23937", "subject": "ENGLISH"}]