[{"school": "JOUR", "overview_of_class": "Students graduating from Northwestern will be involved in many organizations, from non-profit to government, from start-ups to large, international organizations. The skills that will be needed include communication, talent development, financial and economic literacy, organizational navigation, and growth objectives. This course provides frameworks for students to discover how an individual thrives and leads in organizations. From skill at communication to evaluating business plans, students will actively develop deeper skills for the future.<br/><br/>Students who complete this course will<br/><br/>* Communicate ideas orally in presentations<br/><br/>* Participate effectively in organizations as an employee, as a member of a team, as a new thought leader on the path to becoming a leader in an area of the company<br/><br/>* Explore fundamentals of economics, finance and management literacy<br/><br/>* Participate in growth plans for businesses to adapt to the future", "name": "Special Topics", "section": "21", "location": "McCormick Foundation Ctr 3107", "topic": "Leadership Strategies", "course": "390-0", "meeting_time": ["Tu 3:00PM - 5:50PM"], "path": "/class-descriptions/4650/JOUR/JOUR/390-0/23831", "instructor": ["Candy   Lee"], "class_attributes": "No Freshmen<br/><br/>", "id": "23831", "subject": "JOUR"}, {"school": "JOUR", "overview_of_class": "Each quarter, multidisciplinary teams of students, faculty, and professionals come together to collaborate in the Knight Lab to produce cutting-edge digital work, research, thought?innovating across every part of the media-making process. The Student Lab places journalism and computer science students together on teams to work on an important problem for the future of media, rapidly moving beyond conversation and hypothesis to well-reasoned action during the quarter. Each project is scoped for a single quarter but students are encouraged to join the lab for multiple quarters. Students will work closely with faculty and professional mentors along the way. Our process combines research, design thinking, building, user testing, critical and analytical work, storytelling, cutting-edge technology, and experimentation?often within the confines of a single, specific problem. Come to learn, experiment, and create the future of media with us.", "name": "Special Topics", "section": "22", "location": "Fisk Hall 111", "topic": "Knight Lab", "course": "390-0", "meeting_time": ["TuTh 9:00AM - 10:50AM"], "path": "/class-descriptions/4650/JOUR/JOUR/390-0/23832", "instructor": ["Zach   Wise", "Emily Lauren Withrow"], "class_attributes": "Registration is By Application Only<br/><br/>", "id": "23832", "subject": "JOUR"}, {"school": "JOUR", "overview_of_class": "This course will focus on the work of iconic American journalists?from Ben Franklin to Nellie Bly to Ida B. Wells to Edward R. Murrow to Tom Wolfe?that all journalism students needs to be aware of; students will read and view inspiring U.S. journalism masterpieces from the 1700s to the 2000s. The works studied will address such topics as: American independence; lynching and the KKK; McCarthyism; World War II and the Vietnam War; Watergate; the role of the Indigenous and ethnic media; civil rights, women's right and gay rights; protection of the environment. Selected short works?for example, Thomas Paine's Common Sense and John Hersey's Hiroshima?will be read in their entirety. During each class students will be invited to dissect and react to important works of American journalism. There will be no exams, just one final paper.<br/><br/>Estimated cost of books is $64 (based on Amazon): Judith Serrin, Muckraking! The Journalism That Changed America (paperback, $25.00); Ida B. Wells, On Lynching (Humanity Books paperback, $19.99), John Hersey,<br/><br/>Hiroshima (paperback, $7.95); James Agee and Walker Evans, Let Us Now Praise Famous Men (paperback, $10.88).", "name": "Special Topics", "section": "23", "location": "McCormick Foundation Ctr 2111", "topic": "The Journalists and Journalism that Have Shaped Am", "course": "390-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4650/JOUR/JOUR/390-0/23833", "instructor": ["Loren   Ghiglione"], "class_attributes": "", "id": "23833", "subject": "JOUR"}, {"school": "JOUR", "overview_of_class": "The goal for each student in this course is to develop a distinctive voice that stands out from the cacophony of opinions in the sporting world, to create commentary that is informative, thought-provoking and entertaining and to adapt those messages for delivery across multiple media platforms: the written word, television, radio, podcasts and social media.<br/><br/>Sports are more than just home runs and touchdowns. Collectively, they're part of a $200 billion industry. And within this realm all of the elements of our society are displayed: heroism and failure, racial harmony and discrimination, drugs, religion and crime. That's why it's so important to be aware of and capable of weighing in on all current issues, not just the latest sports results.<br/><br/>Students will learn to coalesce their observations, opinions and experiences into compelling arguments that reflect the essence of the sports column: \"I'm right, and this is why.\"", "name": "Special Topics", "section": "24", "location": "McCormick Foundation Ctr 4115", "topic": "Sport Commentary", "course": "390-0", "meeting_time": ["Tu 9:00AM - 11:50AM"], "path": "/class-descriptions/4650/JOUR/JOUR/390-0/25729", "instructor": ["Joshua A Adande"], "class_attributes": "No Freshmen<br/><br/>", "id": "25729", "subject": "JOUR"}, {"school": "JOUR", "overview_of_class": "This course is intended to be highly interactive. Attendance, punctuality, and quality class and field trip participation are critical and will be included in the course's final grade, as explained below in Section V. Students are expected to read all assigned materials in advance and to be prepared to discuss them in class, interacting with the instructors and guest lecturers. Makeup work for absences may be permitted at the instructors' discretion, but must be individually requested / negotiated. Students also are expected to participate in any trips scheduled during class time. The field trips are the most important part of the experience you will have in the Bay Area and Silicon Valley.<br/><br/>In addition, students must able to work both individually and collaboratively to complete assignments on time through reading, research, interviewing, and teamwork.", "name": "Special Topics", "section": "25", "location": "Meets in Non-General PurposeRm", "topic": "Media Innovation and Silicon Valley?s Startup Cult", "course": "390-0", "meeting_time": ["Mo 9:00AM - 11:50AM"], "path": "/class-descriptions/4650/JOUR/JOUR/390-0/27422", "instructor": ["Marcia Anne Parker-Porterfield"], "class_attributes": "", "id": "27422", "subject": "JOUR"}]