[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "Scott Hall 107 Burdick Room"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores<br/>Add Consent: Department Consent Required<br/>Drop Consent: Department Consent Required<br/>", "qtr": "Fall 2016", "name": "17604", "title": "WCAS POLI_SCI 101-6-25 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "17604", "instructors": [{"instructor_phone": "847/467-1574", "instructor_name": "William S Reno", "instructor_addr": "601 University Pl #106"}], "topic": "Understanding Contemporary Warfare", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "Prof. Will Reno, Understanding Contemporary Warfare, Fall 2016<br/>This course is designed to introduce students to the analytical approaches and research methods political scientists use to study questions related to contemporary conflicts. The course will begin with a focus on basic concepts, such as the organization and behavior of armed groups, their relationships with non-combatants, and the roles that violence and information play in the course of armed conflicts. The second part of the course will address broad questions relevant to recent and ongoing conflicts. Why does Islamic State use violence in particular ways? Do new information technologies and media changed how wars are fought? Have new forms of warfare reduced the utility of force, and if so, for whom? What do we know about suicide attacks? What is &quot;terrorism&quot; and does the category have any utility? The third part of the course will concentrate on policy debates. What is US policy with regard to contemporary conflicts? Has the way that the US fights wars changed to adapt to new conditions? Are US policy makers and US war fighters effective in achieving their goals? What is the impact of these choices on the societies where wars are fought?<br/>Professor Reno conducts research in Somalia and Iraq &amp; that will inform the course."}], "lmod": "10/30/16 7:08 PM (CT)", "subject": "POLI_SCI"}]