[{"school": "SoC", "overview_of_class": "In this course we will read, adapt, and perform selections from novels and short stories of these three major writers, focusing on the way they handle narration and voice, create unforgettable characters, offer social commentary explore ethical and moral dilemmas, and capture the landscape and soundscape of the drawing-rooms, houses, and cities in their fiction. The course will also allow us to use performance to explore the constructions of American identity and values, and enrich our understanding of social and literary history.", "name": "Topics in Performance Studies", "section": "20", "location": "Annie May Swift Hall 103", "topic": "Performing Austen, James, Wharton", "course": "330-0", "meeting_time": ["MoWe 2:00PM - 3:50PM"], "path": "/class-descriptions/4660/SoC/PERF_ST/330-0/30964", "instructor": ["Carol Simpson   Stern"], "class_attributes": "", "id": "30964", "subject": "PERF_ST"}, {"school": "SoC", "overview_of_class": "This course stages a conversation among blackness, Latinadad and sexuality by examining the work of black and brown artists in the black diaspora. Using \"Blacktino\" as a framing device, the course will highlight how these artists index the specificities of black and brown social and political relations, while also waging a broader queer-of-color critique of institutionalized racism and homophobia. Students will engage these artitsts' work on various levels, including textual analysis, embodied experience, critical reception, and site-specific engagement.<br/><br/>*This class includes a mandatory experimental learning trip to New York City (May 26-29, 2017). Travel expenses will be subsidized for all enrolled students.", "name": "Topics in Performance Studies", "section": "21", "location": "Wirtz 235 Seminar Room 1", "topic": "Blacktino Queer Performance", "course": "330-0", "meeting_time": ["Tu 2:00PM - 4:50PM"], "path": "/class-descriptions/4660/SoC/PERF_ST/330-0/30965", "instructor": ["Elondust   Johnson", "Ramon H Rivera-Servera"], "class_attributes": "", "id": "30965", "subject": "PERF_ST"}, {"school": "SoC", "overview_of_class": "The course will explore the nature and scope of black popular music across the African diaspora. We will reflect on what is \"black\" and what is \"popular\" about this broad and varied expression, and consider the ways in which the music both represents for black life and is expropriated into mainstream society. The course will help uncover the role music plays in social activism and in critique of power structures. We will examine how this role problematizes its understanding as entertainment.", "name": "Topics in Performance Studies", "section": "23", "location": "University Hall 122", "topic": "Black Popular Music", "course": "330-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4660/SoC/PERF_ST/330-0/30967", "instructor": ["Oluwafunmilayo Eunice Okiji"], "class_attributes": "", "id": "30967", "subject": "PERF_ST"}]