[{"school": "WCAS", "overview_of_class": "This course will provide an introduction to African-American Philosophy. African-American Philosophy has arguably existed as long as there have been African-Americans. But only comparatively recently, with the growing (though still very small) number of black professional philosophers, has it begun to receive the recognition it deserves. We will begin with some definitional questions and then turn to a conceptual and historical overview that locates African-American Philosophy in the broader category of Africana Philosophy, looking in the process at the work of some pioneering 18th, 19th, and 20th-century figures. We will then move on to an exploration of some of the classic black philosophical themes: identity, racialized experience, social justice.", "name": "First-Year Seminar in Philosophy", "section": "20", "location": "Crowe Hall Room 1-140", "topic": "African-American Philosophy", "course": "109-6", "meeting_time": ["MoWe 9:30AM - 10:50AM"], "path": "/class-descriptions/4620/WCAS/PHIL/109-6/31484", "instructor": ["Charles W Mills"], "class_attributes": "WCAS First-Year Seminar<br/><br/>Freshmen/Sophomores Only<br/><br/>", "id": "31484", "subject": "PHIL"}, {"school": "WCAS", "overview_of_class": "TOPIC: Methods of Inquiry from Sherlock Holmes to the Frontiers of Science<br/><br/>We will discuss the diversity of methods of human investigation, as well as their reach. Sherlock Holmes calls himself a master of deduction. However, as we will learn his work is best understood as a form of induction. We will discuss the scope and limits of induction and deduction of each of these methods of inquiry, with special interest in two questions (i) how do they help us predict the future? and (ii) how do they figure in science?", "name": "First-Year Seminar in Philosophy", "section": "21", "location": "Crowe Hall Room 1-140", "topic": "Methods of Inquiry from Sherlock Holmes to the Fro", "course": "109-6", "meeting_time": ["TuTh 9:30AM - 10:50AM"], "path": "/class-descriptions/4620/WCAS/PHIL/109-6/31485", "instructor": ["Fabrizio   Cariani"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "31485", "subject": "PHIL"}]