[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Fisk Hall 217"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "35508", "title": "WCAS POLI_SCI 348-0-20 Globalization", "class_attributes": "", "section": "35508", "instructors": [{"instructor_phone": "847 4912589", "instructor_name": "Stephen C Nelson", "instructor_addr": "601 University Place # 240"}], "associated_classes": [{"component": "DIS", "room": "Parkes Hall 213", "meeting_time": "Th 2:00PM - 2:50PM"}, {"component": "DIS", "room": "University Hall 112", "meeting_time": "Th 2:00PM - 2:50PM"}, {"component": "DIS", "room": "555 Clark 230", "meeting_time": "Th 3:00PM - 3:50PM"}, {"component": "DIS", "room": "University Hall 418", "meeting_time": "Th 3:00PM - 3:50PM"}, {"component": "DIS", "room": "University Hall 418", "meeting_time": "Th 4:00PM - 4:50PM"}, {"component": "DIS", "room": "Locy Hall 106", "meeting_time": "Th 4:00PM - 4:50PM"}, {"component": "DIS", "room": "University Hall 118", "meeting_time": "Th 5:00PM - 5:50PM"}, {"component": "DIS", "room": "University Hall 218", "meeting_time": "Th 5:00PM - 5:50PM"}], "topic": "", "course": "348-0", "descriptions": [{"name": "Overview of class", "value": "Globalization is arguably the most powerful force shaping international and domestic politics today. When observers discuss the effects of globalization, they may refer to any of a number of its different facets: economic, political, social, and environmental. In this course we will focus primarily on economic globalization - the increase in the cross-border flows of goods and services, workers, firms, and money. This course is intended to take stock of globalization in light of the global economic meltdown. What is globalization? Are its effects on the economic fortunes of individuals in wealthy democracies different than in developing countries? Does the reduction of barriers to economic exchange harm national cultures? Is terrorism linked to globalization? Does globalization erode or enhance American military power? Has globalization gone too far - or has it not gone far enough? These are the kinds of questions that will be discussed in the course. The course is organized around six major topics: (1) conceptualizing globalization; (2) assessing the constituent parts of economic globalization (trade, finance, multinational production, and immigration); (3) how different national styles of capitalism in the advanced industrial countries have adjusted to pressure from rising economic globalism; (4) how developing countries joined the globalization bandwagon and whether global economic inequality has increased or decreased as a result; (5) the consequences of increasing economic integration for distinct national cultures; (6) the challenges to globalization posed by transnational terrorism, geopolitical rivalries, and the series of economic crises after 2008."}, {"name": "Teaching Method", "value": "lecture &amp; discussion sections"}, {"name": "Class Materials (Required)", "value": "Dani Rodrik, The Globalization Paradox: Democracy and the Future of the World Economy. W. W. Norton &amp; Company, 2012. 9780393341287"}], "lmod": "2/20/17 6:49 PM (CT)", "subject": "POLI_SCI"}]