[{"school": "WCAS", "overview_of_class": "This seminar introduces the students to a range of art- historical approaches and to the writings of key figures in the history of the discipline. We will address two basic but difficult questions: What is art history? And how did it get this way? Through a series of short writing exercises, we will examine ways of thinking and writing concretely and rigorously about works of art in different mediums, and across different cultures. Intended for undergraduate majors.", "name": "Studies in Representation", "section": "1", "topic": "Writing Seminar", "course": "402-0", "meeting_time": ["Tu 2:00PM - 4:50PM"], "path": "/class-descriptions/4650/WCAS/ART_HIST/402-0/21634", "instructor": ["Stephen F Eisenman"], "id": "21634", "subject": "ART_HIST"}, {"school": "WCAS", "overview_of_class": "This seminar looks at the place of intention-or the absence thereof-in the making and reception of art. We will read critical and theoretical texts that grapple with this question, and test them out through a series of case studies generated by students from their own interests. The seminar addresses theory and historiography from Freud and phenomenology to the New Critics and analytic philosophy of mind to the poststructuralist Death of the Author. We will seek to understand why writers have questioned the place of authorial intent in the evaluation or interpretation of a work, as well as critiques and responses to this position. In wresting authority away from the producer, have we given over too much authority to the consumer? In order to examine human intention (artists, patrons, even viewers) and the various forms of its absence, students are asked to come to class on the first day with an example that raises interesting questions about intention. Possible examples include miraculous (&quot;acheiropoietic&quot;) objects, images &quot;made by nature&quot; and other nonhuman actors, artworks not intended for a human audience, artwork made using the operations of chance, collaborations in which any singular intention is difficult to establish, examples in which intention is simply inaccessible to the interpreter, and examples in which it is, or seems, all too apparent.", "name": "Studies in Representation", "section": "2", "topic": "The Intentional and the Unintentional", "course": "402-0", "meeting_time": ["We 2:00PM - 4:50PM"], "path": "/class-descriptions/4650/WCAS/ART_HIST/402-0/21635", "instructor": ["Rebecca Elizabeth Zorach"], "id": "21635", "subject": "ART_HIST"}]