[{"school": "WCAS", "overview_of_class": "Our focus will be the homosexuality in drama, and the drama of homosexuality, in Anglo-American theatre and culture, from Christopher Marlowe through Angels in America. Thus, in one sense, the course functions as a version of a traditional \"survey\" course, treating \"gay\" male characters, authors, themes, and issues in Anglo-American culture from the Renaissance to the present. But the syllabus is not bound by a survey course's promise of coverage and progressive chronology, and we will also be thinking theoretically about homosexuality's \"drama\"-that is, the connections in this culture (at least at certain moments, at least in certain contexts) between male homosexuality and the category of \"the dramatic.\" The course will therefore examine the emergence of \"homosexual\" and \"gay\" as historical categories and will analyze the connection between these categories and theatrically related terms like \"flamboyance,\" \"the closet,\" \"outing,\" \"gender trouble,\" \"drag,\" \"playing,\" \"camp,\" \"acts,\" \"identities,\" \"identification,\" and \"performativity.\" We will also be interested in the identificatory connections between gay men and particular dramatic genres like opera and the musical.", "name": "Studies in Drama", "section": "20", "location": "1801 Hinman Ave 2225", "topic": "The Drama of Homosexuality", "course": "312-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4620/WCAS/ENGLISH/312-0/37719", "instructor": ["Jeffrey A Masten"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "37719", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "\"Dancing the Postwar Avant-Garde\" surveys experimental dance performance from the 1960s to the present in the U.S., Europe, and Japan. We'll focus on four artistic movements?Judson Dance Theater, Butoh, Tanztheater (\"dance theatre\"), and black postmodernism. After situating each movement within the time and place of its initial formation, we'll follow its ideas and practices across national borders. Readings and viewings are supplemented by attendance at live performance and at a related exhibit and symposium at the Block Museum. Required are short writing assignments throughout the quarter and a major research project on an artist of the student's choice. This course does not require permission and is open to all interested students. It fulfills the history/ literature/theory requirement for Dance and Theatre majors and carries graduate credit for masters and doctoral students in Performance Studies and Theatre and Drama. <br/><br/>Artists studied include Yvonne Rainer, Simone Forti, and Trisha Brown; Tatsumi Hijikata and Kazuo Ohno; Pina Bausch and Sasha Waltz; Ralph Lemon, Reggie Wilson, Jawole Zollar, and Nora Chipaumire.", "name": "Studies in Drama", "section": "21", "location": "University Library Video Theat", "topic": "Dancing the Postwar Avant-Garde", "course": "312-0", "meeting_time": ["MoWe 12:30PM - 1:50PM"], "path": "/class-descriptions/4620/WCAS/ENGLISH/312-0/34915", "instructor": ["Susan A Manning"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "34915", "subject": "ENGLISH"}]