[{"class_mtg_info": [{"meet_t": "TuTh 4:00PM - 5:20PM", "meet_l": "Annenberg Hall G30"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Fall 2016", "name": "13196", "title": "WCAS LING 380-0-23 Spoken English for Non-Native Speakers", "class_attributes": "", "section": "13196", "instructors": [{"instructor_phone": "", "instructor_name": "Julia Margaret Moore", "instructor_addr": ""}, {"instructor_phone": "847/467-7092", "instructor_name": "Erin M. Leddon", "instructor_addr": "2016 Sheridan Rd, Rm. 305"}], "topic": "Integrated Academic Skills", "course": "380-0", "descriptions": [{"name": "Overview of class", "value": "This course explores strategies for international students to improve their intelligibility and effectiveness when communicating in English, with an emphasis on communication in the American academic context. Students will consider how communication in the academic context may vary across cultures, and become acquainted with American norms and expectations. They will develop key skills for academic interactions, such as making presentations, reporting on written information, leading and participating in discussions, and strategies for agreeing/disagreeing. Along the way, students will learn about the sound structure of English as they work towards improved pronunciation and fluency. Students will have an opportunity to consider their own oral English proficiency in light of proficiency assessments used at Northwestern, and will receive feedback on the Versant test performance as well as practice Versant sessions."}, {"name": "Registration Requirements", "value": "S/U"}, {"name": "Learning Objectives", "value": "By the end of this course, students should be able to:<br/> <br/>1. Describe key features of the sound structure of English, including the articulation of consonants and vowels, word stress, linking, intonation, and prosody.<br/> <br/>2. Compare and contrast academic norms and values across cultures. <br/> <br/>3. Employ strategies for effective communication in the American academic context, including class discussions, presentations, and email communications. <br/> <br/>4. Describe key components of English proficiency assessment and the Versant English Test. <br/> <br/>5. Identify their own specific strengths and weaknesses when using spoken English, and demonstrate progress toward improved proficiency (intelligibility and effectiveness)."}, {"name": "Teaching Method", "value": "DiscussionLectureOtherPresentationsand small group activities"}, {"name": "Evaluation Method", "value": "Class participationHomeworkPresentations"}, {"name": "Class Materials (Required)", "value": "Well Said, 3rd Edition by Linda Grant (ISBN: 978-1-4240-0625-0)."}], "lmod": "10/30/16 7:07 PM (CT)", "subject": "LING"}]