[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Frances Searle Building 3220"}], "school": "SoC", "enrl_requirement": "", "qtr": "Fall 2016", "name": "11016", "title": "SoC CSD 304-0-20 Statistics in Communication Sciences and Disorders", "class_attributes": "Formal Studies Distro Area<br/><br/>", "section": "11016", "instructors": [{"instructor_phone": "847/491-2477", "instructor_name": "Steven G Zecker", "instructor_addr": "2240 Campus Drive"}], "topic": "", "course": "304-0", "descriptions": [{"name": "Overview of class", "value": "An understanding of how to properly design experiments and analyze their results is essential to the study of Communication Sciences and Disorders. Sound design logically isolates the cause or causes of an effect. Given a sound design it remains a possibility that the results of an experiment originate not from the supposed cause but instead from random factors present in an experiment. This course will cover a range of statistical techniques appropriate for evaluating the relative influence of chance vs. effect factors in various kinds of experiments. You will learn how and when to use these techniques and how to properly interpret statistical results that will support or refute a hypothesis. A primary goal of the course is to allow you to become a critical reader and interpreter of the research literature in CSD."}, {"name": "Learning Objectives", "value": "1) know the various experimental designs and methodologies commonly used in CSD;<br/>2) be able to identify appropriate and inappropriate uses of statistics;<br/>3) be able to calculate and interpret descriptive statistics, including measures of dispersion and central tendency;<br/>4) be able to to calculate and interpret a range of parametric statistical tests;<br/>5) be able to calculate and interpret a range of nonparametric statistical tests;<br/>6) be able to utilize SPSS statistical software to conduct statistical calculations;<br/>7) be good consumers of the scientific literature by being able to identify strengths and weaknesses in data presentation, statistics employed and conclusions drawn in published research"}, {"name": "Teaching Method", "value": "The course will be a combination of lecture and discussion."}, {"name": "Evaluation Method", "value": "The requirements for the course include two examinations, regular computer assignments and an article critique. Most weeks you will have a computer assignment using SPSS. These will start out fairly basic (dealing with creating files and managing data) and become more complex at the quarter progresses.<br/>The article critique will require you to critically evaluate an article of your choosing from the CSD literature. The critique will concern several key issuesmethodology and design, the statistical analyses performed, presentation or the results and interpretation of the findings."}, {"name": "Class Materials (Required)", "value": "Two books:<br/>1) Huff, D. (1993) How to Lie with Statistics. New York: Norton. (this is a little paperback that will require maybe an hour to read from cover to cover) List price $13; Kindle $8, Amazon $3<br/>2) Welkowitz,J., Cohen, B. &amp; Lea, R (2012) Introductory Statistics for the Behavioral Sciences, 7th Edition. Hoboken, NJ: Wiley. List price $123; Kindle $74; Amazon $55<br/><br/>Required software:<br/>SPSS Statistics GradPack 21 or 22. You can download the package after purchasing for 6 or 12 months use. Also available on public PCs in library and other places around campus. Can also possibly have access to it through others (students, labs, etc.)"}], "lmod": "10/30/16 6:48 PM (CT)", "subject": "CSD"}]