[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Kresge Centennial Hall 3-410"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Prerequisite: Students must currently be enrolled in or have taken and passed FRENCH 271, 272,or 273 or obtain instructor consent to register.", "qtr": "Winter 2017", "name": "24111", "title": "WCAS FRENCH 384-0-20 Women Writing in French", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "24111", "instructors": [{"instructor_phone": "847/491-8262", "instructor_name": "Jane Bradley   Winston", "instructor_addr": "1860 S. Campus Drive, Crowe Hall #2-101"}], "topic": "", "course": "384-0", "descriptions": [{"name": "Overview of class", "value": "This introduction to women's writing extends from Beauvoir's groundbreaking 1949 essay, Le Deuxième Sexe to the last years of the 20th century and Linda Lê's riveting engagement with a childhood trauma. Central to our concerns are three overlapping forms of feminist thought and writing that emerged in postwar France-existentialist, psychoanalytic and marxist, and their shared view, articulated by Beauvoir, that one is not born a woman, but becomes one. Our questions include: how does a given author conceptualize 'woman' and 'becoming woman'? what are the implications of that process for women's lived existence? how does that understanding of the social construction of gender shape an author's conception of the political potential of writing? In addition to the literary works with which we begin, we will read numerous critical writings related to these concerns by authors including Cixous and Wittig."}, {"name": "Registration Requirements", "value": "Each student is expected to read the assigned works, and to do so in a responsible and rigorous fashion, and in a spirit of good faith and intellectual camaraderie. I hope we will all give ourselves fully to this class so as to make it as productive and stimulating as possible. (1) Since I conceive of every aspect of this course as a collective project, I will ask students to work in groups of 3 (or 4, if necessary) on daily presentations of the reading materials. Each group will present four times during the quarter. These presentations will situate the readings in relation to what has come before them, outline some of their central arguments, and/or determine which problems or issues might productively begin our general discussion. Presentations must not exceed 7 minutes in length and must be well and tightly organized serious intellectual engagements with the materials. (2) I ask all of you to come to class with questions a given reading has raised for you, to put those questions to the 'experts' first and then, if desired or as needed, to the broader class. (3) Each student will write a tightly organized and intellectually serious 2 page response to every novel, set of articles and film on our syllabus. The point of these papers is to ensure comprehension and begin to think about each particular reading as a possible focus for your final paper. (4) You will also complete one 10-13 page final paper, due on the day and at the time of our scheduled final exam (see below). All written work must include notes to sources and a bibliography in proper form (MLA or Chicago, as we will discuss in class). Please be wary of any internet sources and make sure you cite any used fully. This is an entirely French language course."}, {"name": "Evaluation Method", "value": "Final grades will be determined equally by 4 components: participation, presentations, response papers and final project."}, {"name": "Class Materials (Required)", "value": "Required Text:<br/>Simone de Beauvoir, Les Belles Images<br/>Marguerite Duras, Le Ravissement de Lol V. Stein<br/>Linda Lê, Les Trois Parques <br/>Monique Witting, Les Guérillères<br/><br/>On Reserve:<br/>Simone de Beauvoir, Le Deuxième Sexe<br/>Monique Witting, La Pensee straight<br/>Luce Irigaray, Ce sexe qui n'en est pas une (1977)<br/><br/>Course Reader will be available at Quartet Copies."}], "lmod": "12/24/16 6:58 PM (CT)", "subject": "FRENCH"}]