[{"class_mtg_info": [{"meet_t": "We 2:00PM - 4:50PM", "meet_l": "University Hall 018 English"}], "school": "WCAS", "overview_of_class": "The period between 1830 and 1860 was a time of massive social transformation, reformist zeal, and political crisis?a time when the fiction of the American union was breaking up as the linked issues of race, class, gender, capital, technology, imperial expansion, and war exposed major contradictions in the ideology of the American republic. Not coincidentally, these years corresponded with the period of immense literary creativity that F. O. Matthiessen called the \"American Renaissance\" in American Renaissance: Art and Expression in the Age of Emerson and Whitman (1941). This book not only defined a period and a canon (Emerson, Thoreau, Hawthorne, Melville, Whitman); it also set the critical and evaluative terms within which future readings and interpretations of American literature would occur. This course will focus on selection of antebellum writings and past and recent criticism and theory as a means of engaging critically with the transformations in the field imaginary of American literature that have taken place against the critical methodology, evaluative terms, canonical writers, readings, texts, contexts, and \"boundaries\" set in place by F. O. Matthiessen's now classic study.", "qtr": "Winter 2017", "name": "Studies in American Literature", "title": "WCAS ENGLISH 471-0-20 Studies in American Literature", "lmod": "2/5/17 6:43 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Betsy J Erkkila", "instructor_addr": ""}], "topic": "American Literature in Theory", "course": "471-0", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "descriptions": [{"name": "Overview of class", "value": "The period between 1830 and 1860 was a time of massive social transformation, reformist zeal, and political crisis?a time when the fiction of the American union was breaking up as the linked issues of race, class, gender, capital, technology, imperial expansion, and war exposed major contradictions in the ideology of the American republic. Not coincidentally, these years corresponded with the period of immense literary creativity that F. O. Matthiessen called the &quot;American Renaissance&quot; in American Renaissance: Art and Expression in the Age of Emerson and Whitman (1941). This book not only defined a period and a canon (Emerson, Thoreau, Hawthorne, Melville, Whitman); it also set the critical and evaluative terms within which future readings and interpretations of American literature would occur. This course will focus on selection of antebellum writings and past and recent criticism and theory as a means of engaging critically with the transformations in the field imaginary of American literature that have taken place against the critical methodology, evaluative terms, canonical writers, readings, texts, contexts, and &quot;boundaries&quot; set in place by F. O. Matthiessen's now classic study."}, {"name": "Registration Requirements", "value": "permission of Department required"}, {"name": "Evaluation Method", "value": "Book report/oral presentation on a major critical or theoretical text (3-4 pages); critical essay (12-15 pages); some exercises in critical reading and interpretation; Canvas postings; class participation."}, {"name": "Class Materials (Required)", "value": "The Autobiography of Black Hawk; <br/>Ralph Waldo Emerson, Essays and Poems; <br/>Margaret Fuller, Woman in the Nineteenth Century and selected dispatches on the Revolutions of 1848; <br/>Karl Marx and Friedrich Engels, The Communist Manifesto; <br/>Frederick Douglass, Narrative; <br/>Harriet Beecher Stowe, Uncle Tom's Cabin; <br/>Harriet Jacobs, Incidents in the Life of a Slave Girl; <br/>Nathaniel Hawthorne, The Scarlet Letter; <br/>Herman Melville, Moby Dick, or, The Whale; <br/>Walt Whitman, Leaves of Grass; <br/>Emily Dickinson, Poems; <br/>and a variety of critical and theoretical readings that highlight field transformations over the past few decades. These may include Pease, Lauter, Brooks, Coulthard, Lott, Gilroy, Spillers, Butler, Berlant, Hartman, Luciano, Marrs, McGill, and Jackson."}, {"name": "Class Notes", "value": "Note: For the first meeting students should read the introduction to Matthiessen's American Renaissance and C. L. R. James, Mariners, Renegades and Castaways: Herman Melville and the World We Live In (1953), ed. Donald E. Pease, including Pease's &quot;C.L.R. James's Mariners, Renegades and Castaways and the World We Live In,&quot; vii-xxxiii."}], "path": "/class-descriptions/4650/WCAS/ENGLISH/471-0/23989", "instructor": ["Betsy J Erkkila"], "class_attributes": "", "id": "23989", "subject": "ENGLISH"}]