[{"class_mtg_info": [{"meet_t": "MoWeFr 1:00PM - 1:50PM", "meet_l": "University Lib B183 - PC Lab"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "30864", "title": "WCAS SWAHILI 121-3-21 Swahili II", "class_attributes": "", "section": "30864", "instructors": [{"instructor_phone": "8474912765", "instructor_name": "Richard Marshall   Lepine", "instructor_addr": "620 Library Place, rm. 201"}], "topic": "", "course": "121-3", "descriptions": [{"name": "Overview of class", "value": "Third quarter of intermediate-level Swahili language for scholarly research and multimedia presentation, concluding the review of basic Swahili grammar and survey of forms not covered in first-year, including additional verb extensions and compound structures, and maintenance or development of oral interactive proficiency at Intermediate-Mid/High. There is a required minimum of 150 minutes per week of group class and instructor contact in a MultiMedia Learning Center (MMLC) lab. Besides the official MWF 11:00 period, an additional TTh 3:30-4:50 instructor-contact &quot;extended office hours&quot; track is available in the Deering Library's MMLC Activity Space in room 208. All coursework is accessed and assignments submitted via a dedicated Canvas course site."}, {"name": "Registration Requirements", "value": "Regardless of how the 150 min/wk requirement is completed, all students enroll officially in the MWF 11:00 course. Students must have completed Swahili 121-2, a MMLC-sponsored course. Admission by proficiency test requires not only ACTFL Intermediate-Mid oral and literacy skills, but familiarity with computer and web-based applications and presentation tools, as well as a reading knowledge of the first five chapters of the original edition of the novel Rosa Mistika, by Euphrase Kezilahabi."}, {"name": "Learning Objectives", "value": "By the end of the course, students will be expected to have a reading knowledge of the remaining eight chapters of Rosa Mistika (chapters one and two in Fall; three through five in Winter); to have contributed to a collaboratively-built wiki that is intended to be a useful resource for midterm and final comprehension tests on the novel; to have contributed personal information and scholarly content to an individual blog; to have chosen from one of six course films and research topics related to each, and to have submitted a revisable draft of a multimedia presentation on the topic by midterm; and by the end of the course to have completed a final draft of the presentation fit for an electronic portfolio, or claimed proudly as a credential on a c.v. or résumé. As in Fall and Winter, this will call for using digital video editing and presentation skills using MMLC and Canvas-based apps and tools."}, {"name": "Teaching Method", "value": "Minimum 150 min/wk classroom presentation of grammar review tops, demonstration of study and presentation techniques, conversation and reading performance practice to enhance audio processing skills needed for digital video work with Swahili-language sound tracks. Homework assignments all as Canvas-site-based exercises in the form of multimedia tests and as compositions presented via web page Text Editor fields; also Canvas-based blog and wiki work. Heavy on the homework, but except for the final comprehension quiz, all programmed to be completed in a no-GPA-risk environmentunlimited do-overs on quizzes, revisable drafts for Swahili-language compositions."}, {"name": "Evaluation Method", "value": "The most heavily-weighted assessed assignments are presentations: final (ideally, revised) versions of one or more blog postings and wiki entries. Individual postings are visible to all participants in the Swahili 121-3 Canvas site roster. These presentations include embedded digital audio of individual student voice performances. Most important is the successful completion of the final multimedia research project presentation based on one of the course films and its accompanying project description. Ongoing individual work will be the subject of demonstrations in lab class after the midterm rough draft submission deadline; final drafts are due during finals week and are not posted in an all-access format. Additionally, there is a midterm Canvas-based comprehension quiz on chapters one through nine of Rosa Mistika (chapter six marking the start of Spring-quarter story material). Based on the performance curve for the single-submission midterm, some students may be required to repeat the quiz in an unlimited do-over format whereby feedback is provided on each additional submission for purposes of learning from mistakes in a no-GPA-threat (and no-GPA-reward) environment. This will be mirrored by a final Canvas-based quiz on comprehension of all thirteen chapters of Rosa Mistika. As with the initial midterm attempt, there will be unrestricted access to the course wiki and other language resources, and no time limit, but again it is programmed for a single submission and display of the resulting score only. The basic minimum coursework required in order to receive a final grade is a good faith attempt at the single-submission, score-only version of the midterm quiz; one good faith attempt at the unlimited do-over version of the midterm quiz if required; a blog entry; a wiki entry; a rough draft of the multimedia research project by midterm; and a final revised draft of the research presentation during finals week."}, {"name": "Class Materials (Required)", "value": "Swahili Grammar and Workbook Paperback - October 16, 2014<br/>by Fidèle Mpiranya (Author)<br/>ISBN-13: 978-1138808263 ISBN-10: 1138808261 Edition: 1st<br/>(from Fall quarter; all other texts are on-line)"}, {"name": "Class Notes", "value": "no P/NP option if the course is being used to satisfy a College or School foreign language proficiency requirement"}], "lmod": "4/3/16 8:24 PM (CT)", "subject": "SWAHILI"}]