[{"class_mtg_info": [{"meet_t": "Th 3:00PM - 5:50PM", "meet_l": "Fisk Hall 114"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: REASON: Pre-registration is not allowed for this class. Please try again during regular registration.<br/>Add Consent: Department Consent Required<br/>", "qtr": "Spring 2017", "name": "32607", "title": "WCAS BUS_INST 394-0-20 Professional Linkage Seminar", "class_attributes": "Attendance at 1st class mandatory<br/><br/>Registration is By Application Only<br/><br/>", "section": "32607", "instructors": [{"instructor_phone": "", "instructor_name": "William Veeck Liam Krehbiel", "instructor_addr": ""}], "topic": "Lessons in Non-Profit Mgmt", "course": "394-0", "descriptions": [{"name": "Overview of class", "value": "*INFORMATION IS SUBJECT TO CHANGE*<br/><br/><br/>The instructor of &quot;Lessons in Non-Profit Management&quot; is: Liam Krehbiel<br/><br/><br/>This course is jointly sponsored by Business Institutions and a student organization called campusCatalyst. The course is taught by a leader in the Chicagoland non-profit community and combines both a consulting experience with area non-profits facing organizational strategy issues with classroom lectures and discussions on the nonprofit sector. The class is composed of 25 students who are split into teams of five, and matched with local non-profit organizations and Kellogg MBA mentors, to work on quarter-long consulting engagements. Students directly engage with their client organizations in the field and then collectively meet once per week to discuss issues and problems they are facing with one another and their instructor, as well as to attend a series of classroom lectures on the nonprofit sector. To inform and guide students' interactions with non-profits, the classroom sessions will provide an overview of the non-profit sector and the growing trends towards greater accountability, transparency and performance management. Students will explore the changing roles and responsibilities of non-profits, as shaped by both the public and private sector, and they will examine the implications of these trends. The course curriculum has two parts: 1) introducing students to the so-called Third Sector and the present political and economic systems that influence how it serves the public good and 2) examining business strategy and management and their applicability to non-profits. The over-arching goal of the course is to create a foundation of knowledge from which students can draw upon as they work together with community non-profits. This course is an opportunity to innovate, collaborate, learn and apply a new set of skills and knowledge while impacting the community."}, {"name": "Registration Requirements", "value": "Students must apply to take this course.<br/><br/>Information about application deadlines for future quarters and how to apply as well as more information about campusCatalyst can be found at: campuscatalystnu.org"}, {"name": "Learning Objectives", "value": "1. Students will successfully develop tangible solutions to specific, measurable problems faced by community-based nonprofit organizations.<br/><br/><br/>2. Students will gain an understanding of the basics of the consulting process and how to conduct a professional business relationship.<br/><br/><br/>3. Through readings, class discussion, and interaction with guest speakers, students will gain an understanding of the social sector and trends that are changing the way nonprofit organizations and other social enterprises pursue their charitable, philanthropic and broader, mission-oriented objectives.<br/><br/>"}, {"name": "Class Materials (Required)", "value": "Please check course syllabus and/or Norris Bookstore."}, {"name": "Class Notes", "value": "Application-only course. <br/><br/>Apply online: http://www.campuscatalystnu.org/apply/ <br/><br/>Those accepted to cC (Campus Catalyst) teams will be given permission to enroll in this course."}], "lmod": "2/14/17 6:43 PM (CT)", "subject": "BUS_INST"}]