[{"school": "DOHA", "overview_of_class": "<p>The British Empire played a major role in creating the world around us. From the middle of the 19th century to the middle of the 20th century Britain tried to control territory from Egypt to the Gulf. Of course, locals had their own ideas. Sometimes local populations worked with the British and sometimes they fought the British. The result was a series of compromises and conflicts that over a hundred years shaped the geography, politics and culture of the modern Middle East. This course explores the origins, evolution and legacy of that British involvement in the Middle East.</p>", "name": "History Adv Special Topics:", "section": "70", "location": "Carnegie Mellon Room 3177", "topic": "Britain and the Middle East", "course": "387-0", "meeting_time": ["TuSu 10:30AM - 11:50AM (AST)"], "path": "/class-descriptions/4640/DOHA/HISTORY/387-0/10035", "instructor": ["Christopher James Macintosh Sparshott"], "class_attributes": "", "id": "10035", "subject": "HISTORY"}, {"school": "DOHA", "overview_of_class": "<p>When Muslims in Mecca were a beleaguered few, Africa became the home of the first Muslim community in history. Today Africa may well be the only continent in the world with a Muslim majority. How did Islam come to have such primacy in African history? What are the currents of Islamic thought that have come to shape African lives? How did Africans affect Islamic religious culture? This course aims to answer such questions with an overview of fourteen centuries of Islam in Africa. Although not an exhaustive history, we will outline major historical shifts, consider broad intellectual currents and discuss some of the main historiographical debates surrounding Islam in Africa.</p>", "name": "History Adv Special Topics:", "section": "71", "location": "Carnegie Mellon Room 3046", "topic": "Islam & the Shaping of African History", "course": "387-0", "meeting_time": ["MoWe 10:30AM - 11:50AM (AST)"], "path": "/class-descriptions/4640/DOHA/HISTORY/387-0/10046", "instructor": ["Zachary Valentine Wright"], "class_attributes": "", "id": "10046", "subject": "HISTORY"}]