[{"class_mtg_info": [{"meet_t": "We 9:00AM - 11:50AM", "meet_l": "Parkes Hall 215"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-registration - Reserved for Political Science students.", "qtr": "Spring 2017", "name": "35411", "title": "WCAS POLI_SCI 361-0-20 Democratic Transitions", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "35411", "instructors": [{"instructor_phone": "", "instructor_name": "Basak   Taraktas", "instructor_addr": ""}], "topic": "", "course": "361-0", "descriptions": [{"name": "Overview of class", "value": "This course explores the concepts of democracy, democratization, and democratic transitions in a historical comparative perspective. We begin with a survey of the pre-modern and recent waves of democratic transitions. By drawing on the experiences of societies in various regions around the world, we will examine what separates, if ever, democratic transitions in Western from those in non-Western societies. The second part of the course focuses on theories of democratization. By contrasting and comparing existing theories, we will discuss what we know of democratization today. In the third part of the course, we consider the cases of failed democratic transitions. Using the case of post-2000 Turkey, we will discuss whether democratization and democratic reversal unfold in similar ways. The final part of the course reevaluates democratization with respect to the concept of &quot;de-democratization.&quot;"}, {"name": "Learning Objectives", "value": "By the end of this course, students will have developed a sense of democratic transitions, why societies undergo democratization in different times, and whether democratization is an irreversible type of political development."}, {"name": "Teaching Method", "value": "Lecture &amp; Discussion Sections"}, {"name": "Evaluation Method", "value": "? Papers I and II: %30 <br/>? Final exam: 30% <br/>? Class participation: 10%"}, {"name": "Class Materials (Required)", "value": "Charles Tilly, Democracy (Cambridge [England]; New York: Cambridge University Press, 2007)."}], "lmod": "2/9/17 6:45 PM (CT)", "subject": "POLI_SCI"}]