[{"school": "WCAS", "overview_of_class": "One of the many benefits of attending Northwestern is its proximity to one of the greatest cities in the world: Chicago. However, with classes and other commitments, it is often challenging for NU students to get beyond Chicago's front doors: Millennium Park or Wrigley Field or Michigan Avenue. In this course, we will explore a Chicago neighborhood and get to know Chicago better by listening to and learning from some of its residents. Students will be encouraged to continue their exploration of Chicago by focusing on an aspect that appeals to them, e.g. Chicago politics, theatre, business, education, safety, health, etc.?whatever interests the individual student.", "name": "First-Year Seminar", "section": "20", "topic": "Chicago Voices", "course": "105-6", "meeting_time": ["TuTh 9:30AM - 10:50AM"], "path": "/class-descriptions/4650/WCAS/ENGLISH/105-6/25056", "instructor": ["Jeanne Elizabeth   Herrick"], "id": "25056", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "Ever since Pentheus' fatal decision to spy on the revels of Dionysus, audiences have had a guilty fascination with the spectacle of addiction?a fascination which crosses not only centuries but disciplines, captivating scientists, policymakers, philosophers, artists, and laypeople alike. This class will trace the evolution of literary representations of addiction across several centuries, from classical depictions of god-induced madness, through the Gothic narratives of Poe and Stevenson, temperance classics such as Ten Nights in a Barroom (whose impact has often been compared to that of Uncle Tom's Cabin), to the twentieth- and twenty-first century comedies and confessionals that make the bestseller lists today. Through these readings and related critical texts, we will examine the ways that such literature provides a staging ground for public controversy and emerging theories about the artistic, cultural, ethical, and scientific significance and ramifications of addiction. <br/><br/>Course readings/viewing will include works of fiction, journalism, and writings from the natural and social sciences as well as popular films. We will also consider practical topics such as how University library resources and experts can help students locate and evaluate key sources and develop authoritative arguments.", "name": "First-Year Seminar", "section": "21", "topic": "Literatures of Addiction", "course": "105-6", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4650/WCAS/ENGLISH/105-6/25057", "instructor": ["Kathleen   Carmichael"], "id": "25057", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "What creates community, why is community important, and who is considered a member? In a democracy - or on a college campus - does diversity enhance community, or challenge it? And how have the community or communities where you grew up affected your sense of identity? In this course, we will explore these questions by examining (a) the different ways that people collect information about community and identity and (b) how they express their ideas through various genres, such as personal narratives, academic studies, and news articles. As you hone your skills in writing, research, and critical thinking, we will consider the impact that histories and institutions have had on communities and individuals, particularly with regard to the US criminal justice system. Finally, you will complete a project related to community and diversity in a field of your choice, such as law, medicine, music, religion, public policy, higher education, or others.", "name": "First-Year Seminar", "section": "22", "topic": "Writing about Diversity, Identity &amp; Community", "course": "105-6", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4650/WCAS/ENGLISH/105-6/25058", "instructor": ["Penny Gail Hirsch"], "id": "25058", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "This seminar will explore the many entertaining and serious meanings embedded in detective and spy novels and films. We will discuss and write about such topics as suspenseful action, elusive characters, deception, and challenging endings.<br/><br/>To discover these many meanings, we`ll address such questions as: What makes detective and spy fiction so riveting? Why are questions of disguised personal identity, mysterious legacies, political loyalties, treachery, and heroism suspenseful, chilling, and so popular?<br/> <br/>How do the historical settings and imagined political conflicts affect the shape and meanings of popular thrillers?<br/>THERE WILL BE OCCASIONAL FILM SHOWINGS ON TUESDAYS AT 6:30 PM", "name": "First-Year Seminar", "section": "23", "topic": "Spies, Sleuths &amp; Suspense", "course": "105-6", "meeting_time": ["MoWeFr 11:00AM - 11:50AM"], "path": "/class-descriptions/4650/WCAS/ENGLISH/105-6/25059", "instructor": ["Phyllis B Lassner"], "id": "25059", "subject": "ENGLISH"}]