[{"class_mtg_info": [{"meet_t": "We 2:00PM - 4:50PM", "meet_l": "ANTHRO Sem Rm 104 - 1810 Hinmn"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Graduate Students.", "qtr": "Spring 2017", "name": "32287", "title": "WCAS ANTHRO 490-0-22 Topics in Anthropology", "class_attributes": "Graduate Students Only<br/><br/>", "section": "32287", "instructors": [{"instructor_phone": "847/491-4835", "instructor_name": "Cynthia   Rivera", "instructor_addr": "1812 Hinman Ave., Room #104, EV Campus"}], "topic": "Household Archaeology", "course": "490-0", "descriptions": [{"name": "Overview of class", "value": "In a few short decades the field of household archaeology has emerged and exploded within contemporary archaeology. On an empirical level this may be because archaeological remains of houses are ubiquitous in the archaeological record: what site doesn't have houses? On a theoretical level this may be because studies of households lead us to focus on the archaeological record as a lived and peopled place. Thus despite its short history, household archaeology has taken a leading role in epistemological shifts which place people and their practices and differences at the center of archaeological interpretations of the past, rather than subsuming these into the &quot;noise&quot; of passive and depersonalized depictions of ancient social systems. Our studies of household archaeology will lead us to explore the importance of everyday life in the past. Households are an important, but not the only domain of people's everyday lives. Because all people in the past led daily lives, a study of everyday life in the past can lead to a more democratic understanding of societies inclusive of the full range of people that inhabited past societies. Studies of households and everyday life are not without their detractors and these detractors are often quite hostile. Because households and daily life are often considered &quot;micro&quot; domains were people interact with one another, they are not considered suitable areas of studies to answer &quot;macro&quot; questions of politics and society. In this class we will explore how &quot;micro&quot; and &quot;macro&quot; intersect in the analysis households and daily life making these vibrant domains to understand how micro (self, interaction, experience) and macro (institutions, power relations, society) merge as they shape and are shaped by people and societies. This class is designed to be a forum for collaborative discussion and debate on central issues in contemporary archaeology. We will critically assess approaches currently being used in studies of households and everyday life. Each class will entail a seminar discussion between all class participants."}, {"name": "Registration Requirements", "value": "No P/N. Open to all graduate students. Advanced undergraduates with instructor consent."}, {"name": "Teaching Method", "value": "Discussion"}, {"name": "Evaluation Method", "value": "Course evaluation is based on class participation, weekly reading notes, and a final paper."}, {"name": "Class Materials (Required)", "value": "Everyday Life Matters (Cynthia Robin, 2013). ISBN-10: 0813062101 $24.95. All readings for the course beyond the above mentioned book will be posted on the course blackboard site."}], "lmod": "2/8/17 6:40 PM (CT)", "subject": "ANTHRO"}]