[{"school": "WCAS", "overview_of_class": "Prof. Seawright, \"Populism in America and Worldwide\", Fall 2016<br/>\"Selfish, incompetent political elites are ruining the country, and real Americans need to stand up and take control back!\" This kind of ideology, called populism, is familiar to liberals and conservatives; worldwide, it has a history as old as democracy, if not older. What makes a politician a populist? How and when does populism connect with citizens? What are the results of populists in government? These questions are always important, and they take on new urgency given current directions in American politics. In this class, we will read populists' explanations of themselves, study scholarly and journalistic accounts, and work toward a final paper presenting our own perspectives on populism.", "name": "First-Year Seminar", "section": "20", "location": "Allison Residential Comm 1021", "topic": "Populism in America and Worldwide", "course": "101-6", "meeting_time": ["MoWe 9:30AM - 10:50AM"], "path": "/class-descriptions/4640/WCAS/POLI_SCI/101-6/12675", "instructor": ["Jason W Seawright"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "12675", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "Professor Julie Lee Merseth, \"Gender, Politics, and Power\", Fall 2016<br/>Professor Julie Lee Merseth, \"Gender, Politics, and Power\"<br/>This course examines the role of women and gender in American politics with a focus on women's participation as activists, voters, and candidates. Topics include historical and contemporary women's movements, issues concerning the political representation of women, barriers to women seeking office, and the role of gender stereotypes in campaigns and elections. Throughout the course we attend to the intersections of gender with other identities such as race, ethnicity, class, sexuality, and nativity and highlight, in particular, the participation and contributions of women of color. In addition, while this course concentrates on women as political actors in the United States, we briefly examine women's participation and representation in comparative perspective.", "name": "First-Year Seminar", "section": "21", "location": "University Library 4670", "topic": "Gender, Politics & Power", "course": "101-6", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4640/WCAS/POLI_SCI/101-6/12676", "instructor": ["Julianne Lee Merseth Cook"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "12676", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "Prof. Stuelpnagel \"Press and Political Process\", Fall 2016<br/><br/>Presidents and presidential candidates often claim that the press is either \"liberal\" or \"conservative.\" But many factors drive what the public receives as news. Those factors include: the economics of the business; information biases that come from striving to be \"objective;\" work routines by journalists; and the need to tell a story in a simple fashion so that readers and viewers can easily understand the subject. This course will examine the impact of those factors have on the information that the public receives as \"news.\"", "name": "First-Year Seminar", "section": "22", "location": "Parkes Hall 213", "topic": "The Press & the Political Process", "course": "101-6", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4640/WCAS/POLI_SCI/101-6/12677", "instructor": ["Lawrence L Stuelpnagel"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "12677", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "\"Hunger Games\": The Politics of Famine, Prof. Jeff Rice, Fall 2016, first-year seminar<br/>People starving is something that regularly appears on the news. Often described as a natural disaster it pulls at the hearts of people with food on their table. But what happens when it turns out that famines are not natural disasters but are the results of either incompetence or deliberate policies on the part of the state? How do we deal with this knowledge. How do we balance the concept of drought as distinct from the concept of famine? This class will address this issue beginning with the assumption that famines are not mere natural disasters about which little or nothing can be done. We will look into the mechanics of famine, the relationship between famine and war, famines and international aid (international aid and state reinforcement) as well as the 'marketing' of famines. In no way will this knowledge diminish the severity or brutality of famines but will, instead, explain them with more complexity. Examples will likely be Ireland, Ethiopia, and Bengal.", "name": "First-Year Seminar", "section": "23", "location": "Scott Hall 212", "topic": "?Hunger Games? The Politics of Famine", "course": "101-6", "meeting_time": ["TuTh 9:30AM - 10:50AM"], "path": "/class-descriptions/4640/WCAS/POLI_SCI/101-6/12678", "instructor": ["Jeffrey   Rice"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "12678", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "\"Political Inequality\", Prof. Thurston, Fall 2016<br/>This course examines various types of inequalities - in representation, in participation, and in resources - and their consequences for American politics and democracy. After surveying theoretical debates on the relationship of equality and democracy we will explore how social scientists have attempted to a variety of related questions: What are the consequences of the way electoral institutions are structured for representation and policy? Do policymakers weigh the concerns of their constituents equally? Do wealthier individuals or corporations have greater influence in the political system than ordinary voters?", "name": "First-Year Seminar", "section": "24", "location": "Scott Hall 107 Burdick Room", "topic": "Political Inequality", "course": "101-6", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4640/WCAS/POLI_SCI/101-6/12679", "instructor": ["Chloe Nicol Thurston"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "12679", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "Prof. Will Reno, Understanding Contemporary Warfare, Fall 2016<br/>This course is designed to introduce students to the analytical approaches and research methods political scientists use to study questions related to contemporary conflicts. The course will begin with a focus on basic concepts, such as the organization and behavior of armed groups, their relationships with non-combatants, and the roles that violence and information play in the course of armed conflicts. The second part of the course will address broad questions relevant to recent and ongoing conflicts. Why does Islamic State use violence in particular ways? Do new information technologies and media changed how wars are fought? Have new forms of warfare reduced the utility of force, and if so, for whom? What do we know about suicide attacks? What is \"terrorism\" and does the category have any utility? The third part of the course will concentrate on policy debates. What is US policy with regard to contemporary conflicts? Has the way that the US fights wars changed to adapt to new conditions? Are US policy makers and US war fighters effective in achieving their goals? What is the impact of these choices on the societies where wars are fought?<br/>Professor Reno conducts research in Somalia and Iraq & that will inform the course.", "name": "First-Year Seminar", "section": "25", "location": "Scott Hall 107 Burdick Room", "topic": "Understanding Contemporary Warfare", "course": "101-6", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4640/WCAS/POLI_SCI/101-6/17604", "instructor": ["William S Reno"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "17604", "subject": "POLI_SCI"}]