[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Locy Hall 314"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "27469", "title": "WCAS HUM 325-4-20 Humanities in the Digital Age", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "27469", "instructors": [{"instructor_phone": "847/467-3879", "instructor_name": "Michael J Kramer", "instructor_addr": "Harris Hall - Room 212"}], "topic": "Digitizing Folk Music History.", "course": "325-4", "descriptions": [{"name": "Overview of class", "value": "Digitizing Folk Music History<br/><br/>The United States folk music revival is typically thought of as an antimodern, even a Luddite, movement. Acoustic guitars, camp fires, overly sincere singers, and &quot;Kumbaya&quot; politics are the clichés many call to mind. To study it through digital means, however, reveals important connections between the history of the revival and issues of technology, culture, and politics in the modern world. In this research seminar, we examine the history of the US folk music revival through readings, audio listening, documentary films, seminar discussions, and, most of all, extensive digital analysis to investigate these connections.<br/><br/>Working in platforms such as Omeka and WordPress, with tools ranging from Audacity sound editing software to mapping, annotation, and timeline programs, we use the archives of the Berkeley Folk Music Festival (in Northwestern's Special Collections), the Old Town School of Folk Music (in Chicago), and the Alan Lomax Collection (online) to probe what was at stake in the folk revival in relation to American culture and politics; questions of race, class, gender, age, and region; and the strange workings of music-making, memory, and power. As we do so, we ask how digital technologies might help us to interpret history more meaningfully; simultaneously, we explore how both the folk revival itself and the methods of historical study might be crucial to understanding our contemporary digital moment more effectively.<br/><br/>Each student will be evaluated based on class participation, weekly digital mini-project experiments, presentations, and a final multimedia interpretive digital history podcast project that is the multimedia equivalent of a 15-20 page analytic essay based on original research."}, {"name": "Evaluation Method", "value": "Grading basis: P/N option"}, {"name": "Class Materials (Required)", "value": "Ronald D. Cohen, &quot;Rainbow Quest: The Folk Music Revival and American Society, 1940-1970&quot; (Amherst: University of Massachusetts Press, 2002) ISBN: 978-1-55849-348-3<br/><br/>Benjamin Filene, &quot;Romancing the Folk: Public Memory and American Roots Music&quot; (Chapel Hill: University of North Carolina Press, 1999) ISBN: 978-0807848623<br/><br/>Bob Dylan, &quot;Chronicles, Volume One&quot; (New York: Simon and Schuster, 2005) ISBN: 978-0743244589<br/><br/>Robert Cantwell, &quot;When We Were Good: The Folk Revival&quot; (Cambridge, MA: Harvard University Press, 1996), ISBN: 978-0674951334"}, {"name": "Class Notes", "value": "No previous digital or musical training is required for the course."}], "lmod": "12/24/16 7:02 PM (CT)", "subject": "HUM"}]