[{"class_mtg_info": [{"meet_t": "MoWe 10:00AM - 11:30AM", "meet_l": "Technological Institute F280"}], "school": "MEAS", "enrl_requirement": "Enrollment Requirements: REASON: Pre-registration is not allowed for this class. Please try again during regular registration.<br/>Add Consent: Department Consent Required<br/>", "qtr": "Spring 2017", "name": "31926", "title": "MEAS DSGN 455-0-20 Design Strategy", "class_attributes": "", "section": "31926", "instructors": [{"instructor_phone": "", "instructor_name": "Gregory James Holderfield", "instructor_addr": ""}], "topic": "", "course": "455-0", "descriptions": [{"name": "Overview of class", "value": "This course introduces students to the power of design as a differentiator in the marketplace. Change is constant, consumer culture and values evolve, business conditions change, and new technologies develop. Human-centered design and strategic design thinking is leading the charge in meaningful innovation that both consumers and business find relevant. Successful organizations innovate, through deep understandings of their customer, in order to stay relevant to their constituencies and competitive in the market. And while innovation is dependent on design, strategic design requires management.<br/><br/>The course focuses on design as a strategic offering from a product design and development perspective, with a strong emphasis on right-brain creative thinking. We will look at how product developers engineer for usability and design for the senses to create memorable product experiences. We will study the importance of understanding and transforming insights into ideas and then getting to the right idea. We will gain an understanding of the importance of ethnography, consumer empathy, creative collaboration, brainstorming, prototyping, industrial design and design language, brand, and storytelling. We will also carefully look at how to establish a culture of creative design innovation within business.<br/><br/>This course will be highly interactive with real-world examples and case studies, guest lectures from industry, class discussions and storytelling, along with hands-on design thinking exercises and assignments."}, {"name": "Registration Requirements", "value": "Open to EDI students only."}], "lmod": "2/14/17 6:35 PM (CT)", "subject": "DSGN"}]