[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "Harris Hall L28"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24157", "title": "WCAS GNDR_ST 362-0-20 Gender, Sexuality, and Drama", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "24157", "instructors": [{"instructor_phone": "", "instructor_name": "Whitney Blair Taylor", "instructor_addr": ""}], "topic": "Staging the Renaiss. Comedy", "course": "362-0", "descriptions": [{"name": "Overview of class", "value": "What happens when the conceits of poetry - gazes piercing hearts, floods of tears, rosy-cheeked and pearl-teethed women - are taken out of the realm of metaphorical abstraction and acted out in a play? This course will consider how English Renaissance poetic conventions are worked out and problematized in comedies of the same period. Specifically, we will focus on questions of desire, sexuality, the body, and gender raised by poetic tropes and conventions that the English import and adapt from Petrarch and Ovid. Two themes in particular will continue to surface: (1) literary representations of the (usually female) body in relation to theories such as the male gaze and early modern models of exchange and colonization, and (2) ways that women respond to these figurations of the body in early modern comedies. <br/><br/>Beginning with literary precedents for the English Renaissance, especially Petrarch's sonnets and Ovid's Metamorphoses, we will then read Shakespeare's adaptation of Ovid in his narrative poem, Venus and Adonis. We will spend the majority of the course focusing on questions of desire and gender in four of Shakespeare's comedies: A Midsummer Night's Dream, Twelfth Night, Merchant of Venice, and Much Ado About Nothing. The course concludes with Thomas Middleton and Thomas Dekker's city comedy, The Roaring Girl and/or Aphra Behn's The Rover. Throughout the course, plays will be paired with readings from poems by Shakespeare, John Donne, Philip Sidney, Edmund Spenser, Isabella Whitney, and Mary Wroth."}, {"name": "Teaching Method", "value": "LectureSeminar"}, {"name": "Evaluation Method", "value": "Class participationOnline workPapersPresentations"}, {"name": "Class Materials (Required)", "value": "Possible texts include William Shakespeare's Venus and Adonis, A Midsummer Night's Dream, Much Ado About Nothing, Twelfth Night, Merchant of Venice; Thomas Middleton and Thomas Dekker, The Roaring Girl; Aphra Behn, The Rover. Throughout the course, plays will be paired with short readings or poems from Petrarch, Ovid, John Donne, Philip Sidney, Shakespeare, Edmund Spenser, Isabella Whitney, and Mary Wroth"}], "lmod": "12/25/16 7:00 PM (CT)", "subject": "GNDR_ST"}]