[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Technological Institute LG68"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "30866", "title": "WCAS AFST 390-0-21 Topics in African Studies", "class_attributes": "", "section": "30866", "instructors": [{"instructor_phone": "847 491 2595", "instructor_name": "Richard A Joseph", "instructor_addr": "218 Chambers Hall"}], "topic": "Global Democracy and World Disorder", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "AFST 390-0-21 &quot;Global Democracy and World Disorder: Challenges in Africa and Beyond&quot;, Richard Joseph, Spring 2016 (combined with POLI_SCI 390-0-20, INTL_ST 390-0-24)<br/><br/> <br/>This course will explore the evolution from the &quot;democratic euphoria&quot; of the early 1990s, to the sober analyses of democratization later in that same decade, to the current theoretical and empirical challenges. The experiences of specific countries in a few world regions will be examined closely.<br/><br/>After the Cold War, the number of democracies in the world increased significantly. In recent years, however, that number has stagnated and even, by some accounts, declined. The global system today is characterized by growing insecurity and uncertainty. The aim of this course is to achieve a deeper understanding of these dynamics and their implications.<br/><br/>The expansion of liberal democracies and liberalized economies was adversely affected by the 9/11 Al Qaeda attack on the World Trade Center and the prolonged wars that followed in Iraq, Afghanistan, and Syria. The relentless upsurge in jihadist insurgencies has steadily shifted global priorities to the strengthening of security and political order. <br/><br/>The rise of China and the resurgence of authoritarianism in Russia have contributed to the complexities and uncertainties. So also have the erosion of state systems, forced migrations,and the upsurge in ethnic nationalism and religious sectarianism. The failures of the Arab Spring, and the fracturing of Iraq, Syria, and Libya have had wide ramifications.<br/><br/>Is liberal democracy being eclipsed by new forms of authoritarianism, or is it proving resilient and adaptive? Where are these trends and others evident? Writing in the Journal of Democracy about the &quot;renewed struggle between democracy and authoritarianism worldwide&quot;, Christopher Walker recently wrote: [Authoritarian] regimes show solidarity and coordination with one another, at least when it comes to contesting and containing democracy and the ideas central to it. Through this more internationalist approach and authoritarian learning, China, Russia, Iran, and other illiberal regimes have developed instruments to counter the democratic West's soft power.&quot; For these developments in Africa, see an essay by this course instructor: http://www.brookings.edu/research/opinions/2016/01/07-democracy-state-power-africa-joseph."}, {"name": "Teaching Method", "value": "A variety of course methods will be used, including lectures, open discussions, and student presentations."}, {"name": "Evaluation Method", "value": "Students will write a set of short essays and take a final examination."}, {"name": "Class Materials (Required)", "value": "A course packet of selected articles will be made available for purchase. Special use will be made of recent collections of essays by the Journal of Democracy, La Vanguardia, and other publications that cover the key thematic issues and country experiences."}], "lmod": "4/3/16 7:42 PM (CT)", "subject": "AFST"}]