[{"class_mtg_info": [{"meet_t": "Th 3:00PM - 6:00PM", "meet_l": "Kresge Centennial Hall 2-440"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "20540", "title": "WCAS GERMAN 402-0-20 History of Literature and Critical Thought 1832-1900", "class_attributes": "", "section": "20540", "instructors": [{"instructor_phone": "847/467-1849", "instructor_name": "Erica Suzanne Weitzman", "instructor_addr": "Kresge Hall, Rm 3333, 1880 Campus Drive"}], "topic": "Theories of Realism", "course": "402-0", "descriptions": [{"name": "Overview of class", "value": "This course looks at the notion of realism as both historical literary movement and epistemological/aesthetic problem. We will read classic theories of realism by Hegel, Auerbach, Barthes, Lukács, Blumenberg, and others, as well as significant new work by contemporary critics and theorists, together with exemplary texts of nineteenth-century European realist prose fiction. While the temporal focus of the class will be mid-to late-nineteenth-century Europe and the particular literary form that dominated at this time, we will also go beyond this to look at the philosophical and ideological underpinnings of the notion of &quot;realism&quot; itself. Special attention will be devoted to the following questions: the purpose of genre, the place of the human, the relationship between realism and reality (or the real), the elevation of the ordinary, and the possibilities and limits of representation."}, {"name": "Registration Requirements", "value": "This course is intended for graduate students and upper-level undergraduates (with permission); no prerequisites."}, {"name": "Learning Objectives", "value": "This course looks at the notion of realism as both historical literary movement and epistemological/aesthetic problem. We will read classic theories of realism by Hegel, Auerbach, Barthes, Lukács, Blumenberg, and others, as well as significant new work by contemporary critics and theorists, together with exemplary texts of nineteenth-century European realist prose fiction. The temporal focus of the class will be mid- to late-nineteenth-century Europe and the particular literary form that dominated at this time; however, we will also go beyond this to look at the philosophical and ideological underpinnings of the notion of &quot;realism&quot; itself. Special attention will be devoted to the following questions: the purpose of genre, the place of the human, the relationship between realism and reality (or the real), the elevation of the ordinary, and the possibilities and limits of representation."}, {"name": "Teaching Method", "value": "Class participationDiscussionPresentationsWriting assignments"}, {"name": "Evaluation Method", "value": "Class participationPaper, final"}, {"name": "Class Materials (Required)", "value": "Georg Büchner, Lenz (Archipelago, 2004)<br/>? ISBN-10: 0974968021<br/>? ISBN-13: 978-0974968025<br/><br/>Gustave Flaubert, Three Tales (Penguin, 2005)<br/>? ISBN-10: 0140448004<br/>? ISBN-13: 978-0140448009<br/><br/>Theodor Fontane, Effi Briest (Oxford World`s Classics, 2015)<br/>? ISBN-10: 0199675643<br/>? ISBN-13: 978-0199675647<br/><br/>Emile Zola, L`Assommoir (Oxford World`s Classics, 2009)<br/>? ISBN-10: 0199538689<br/>? ISBN-13: 978-0199538683<br/><br/>All other materials in photocopied course pack."}], "lmod": "12/24/16 6:59 PM (CT)", "subject": "GERMAN"}]