[{"class_mtg_info": [{"meet_t": "Mo 6:15PM - 9:15PM", "meet_l": "Wieboldt Hall 714"}], "school": "SCS", "overview_of_class": "With the recent success of programs like O.J.: Made in America, Making a Murderer, and Serial, there has been a surge in the popularity of true crime media. This course will provide students with a critical and historical introduction to this genre, tracing its development across film, television, and podcasts. Situating true crime media in relation to both documentary and exploitation cinema, with attention to the relationship and tensions between its critically acclaimed texts and those disdained for being morbid or sleazy, we will explore the social functions of the genre and the pleasures it offers its audiences. Students will gain familiarity with the genre's conventions and stylistic traits and will conduct formal analysis of true crime texts to examine how crime and criminal justice are represented. The history of true crime media will be surveyed with attention to issues of race, class, gender and sexuality, allowing us to question why certain crimes are privileged within the genre while others are overlooked. In doing so, we will examine how true crime shapes public perception of criminality and law enforcement and how it may intervene in criminal justice proceedings while interrogating central themes of truth and justice. Carries humanities credit.", "qtr": "Fall 2017", "name": "Genre", "title": "SCS RTVF 322-CN-12 Genre", "lmod": "9/12/17 6:57 PM (CT)", "section": "12", "topic": "True Crime Media", "course": "322-CN", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "With the recent success of programs like O.J.: Made in America, Making a Murderer, and Serial, there has been a surge in the popularity of true crime media. This course will provide students with a critical and historical introduction to this genre, tracing its development across film, television, and podcasts. Situating true crime media in relation to both documentary and exploitation cinema, with attention to the relationship and tensions between its critically acclaimed texts and those disdained for being morbid or sleazy, we will explore the social functions of the genre and the pleasures it offers its audiences. Students will gain familiarity with the genre's conventions and stylistic traits and will conduct formal analysis of true crime texts to examine how crime and criminal justice are represented. The history of true crime media will be surveyed with attention to issues of race, class, gender and sexuality, allowing us to question why certain crimes are privileged within the genre while others are overlooked. In doing so, we will examine how true crime shapes public perception of criminality and law enforcement and how it may intervene in criminal justice proceedings while interrogating central themes of truth and justice. Carries humanities credit."}, {"name": "Registration Requirements", "value": "None."}, {"name": "Learning Objectives", "value": "1. Identify key media texts and developments in the true crime genre and describe how true crime <br/>media texts have evolved over time<br/>2. Analyze film, television, and audio texts for their formal and narrative characteristics.<br/>3. Evaluate how crime and criminal justice are represented in different texts. <br/>4. Analyze the political, social, and cultural stakes of true crime media"}, {"name": "Teaching Method", "value": "Lecture<br/>Discussion<br/>Class participation<br/>Films/videos<br/>Readings<br/>Writing assignments"}, {"name": "Evaluation Method", "value": "Class attendance and participation; discussion preparation assignments; brief response papers; midterm essay; final essay."}, {"name": "Class Materials (Required)", "value": "Readings will be posted online to the course Canvas site and may include chapters from the following:<br/>The Rise of True Crime: Twentieth Century Murder and American Popular Culture, Jean Murley<br/>Media and Crime, Yvonne Jewkes <br/>Crime and Media, Chris Greer<br/>True Crime: Observations on Violence and Modernity, Mark Seltzer<br/>Practices of Looking, Sturken and Cartwright<br/>Representing Reality: Issues and Concepts in Documentary, Bill Nichols <br/>Speaking Truth with Film: Evidence, Ethics, Politics in Documentary, Bill Nichols <br/><br/><br/>Media texts may include O.J.: Made in America (Ezra Edelman, 2016); The Thin Blue Line (Errol Morris, 1988); Casting JonBenet (Kitty Green, 2017); Serial (Sarah Koenig, 2014); My Favorite Murder (Feral Audio, 2016-); The Central Park Five (Ken Burns, Sarah Burns, 2012); Forensic Files (1996-); Making a Murderer (Moira Demos, Laura Ricciardi, 2015); The Jinx (Andrew Jarecki, 2015); 4 Little Girls (Spike Lee, 1997); America's Most Wanted (1988-2012). Screenings for class that must be completed on your own prior to class meetings. Screenings will be made available as streaming videos on Canvas."}, {"name": "Class Notes", "value": "Due to the topic of the course, the films, TV shows and podcasts assigned in this class have content that may be difficult or triggering for some students."}], "instructor": ["Karly-Lynne   Scott"], "class_attributes": "", "id": "18132", "subject": "RTVF"}]