[{"class_mtg_info": [{"meet_t": "Th 6:15PM - 9:15PM", "meet_l": "Wieboldt Hall 413"}], "school": "SCS", "overview_of_class": "This course provides an introduction to microbiology with an emphasis on bacteria and viruses and their impact on human health and society. Topics covered include: a) introduction to microbiology including the evolution of microorganisms; b) essentials of bacterial, archaeal, eukaryotic and viruses morphological, physiological and genetic elements; c) the general principles of bacterial growth and control of microorganisms in the environment; d) principles of microbial molecular biology and genetics e) bacterial pathogenesis and current challenges regarding antimicrobial resistance. The purpose of the course is to familiarize students with the essential concepts of microbial evolution and diversity, and explore the relation structure-function to better understand the biology of bacteria and viruses. Students will have an opportunity to explore current topics in microbiology by preparing and presenting a short research talk on a topic of their choosing. This course will also provide an introduction to the primary microbiology literature.", "qtr": "Spring 2016", "name": "Microbiology", "title": "SCS BIOL_SCI 328-CN-16 Microbiology", "lmod": "4/3/16 7:31 PM (CT)", "section": "16", "instructors": [{"instructor_phone": "", "instructor_name": "Dorina   Veliceasa", "instructor_addr": ""}], "topic": "", "course": "328-CN", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "This course provides an introduction to microbiology with an emphasis on bacteria and viruses and their impact on human health and society. Topics covered include: a) introduction to microbiology including the evolution of microorganisms; b) essentials of bacterial, archaeal, eukaryotic and viruses morphological, physiological and genetic elements; c) the general principles of bacterial growth and control of microorganisms in the environment; d) principles of microbial molecular biology and genetics e) bacterial pathogenesis and current challenges regarding antimicrobial resistance. The purpose of the course is to familiarize students with the essential concepts of microbial evolution and diversity, and explore the relation structure-function to better understand the biology of bacteria and viruses. Students will have an opportunity to explore current topics in microbiology by preparing and presenting a short research talk on a topic of their choosing. This course will also provide an introduction to the primary microbiology literature."}, {"name": "Registration Requirements", "value": "Prerequisite: BIOL SCI 210-C or BIOL SCI 217"}, {"name": "Learning Objectives", "value": "1. Students will learn about the diversity of microorganisms and essential concepts of microbial evolution. Students will be able to explain the role of evolution as the driving force of all biological systems based on their understanding of scientific method used by microbiologists and other scientists.<br/>2. Students will have the opportunity to analyze scientific research papers and prepare written assignments demonstrating that they have understood the principles of the scientific method.<br/>3. Students will compare similarities and differences between microorganisms that are present in all domains of life: Bacteria, Archaea, Eukarya and Viruses, focusing on essential elements of microbial morphology, physiology, growth, microbial molecular biology and genetics. Throughout the course students will answer questions, solve quizzes, engage in group discussions that will help them in mastering section concepts before moving on to other topics.<br/>4. Students will develop their abilities to critically analyze information from the primary research literature, and to synthesize material from diverse sources to gain in-depth understanding of the current state of research on a given subject. Students will learn to conduct a small group study project on various current topics in microbiology and be able to present it orally to their peers"}, {"name": "Class Materials (Required)", "value": "Willey J, Sherwood L, and Woolverton C. 2013. Prescott's Microbiology, 9th edition (ISBN: 9780073402406) and other readings will likely include reasearch articles related to the topics covered during the lecture. The textbook is available at the Northwestern University, Chicago Official Bookstore, 710 N Lake Shore Drive, Chicago. Blackboard course site."}], "path": "/class-descriptions/4620/SCS/BIOL_SCI/328-CN/37849", "instructor": ["Dorina   Veliceasa"], "class_attributes": "", "id": "37849", "subject": "BIOL_SCI"}]