[{"class_mtg_info": [{"meet_t": "MoWeFr 12:30PM - 1:50PM", "meet_l": "Annenberg Hall G15"}], "school": "WCAS", "overview_of_class": "In most markets, firms compete for customers by making profit-maximizing decisions about prices, capacity, location, quality, variety, investment and product innovation. These decisions are especially interesting when there are several firms with interdependent payoffs; e.g., the choice of one firm to cut its price or close a retail store affects not only its profits, but also rival firms' profits. Inspired by both classical and modern readings about strategy, we develop and employ game theory tools to study firm behavior in a variety of scenarios, beginning with static (one period) models, and then turning to dynamic settings, in which firms may pursue profits through mergers, R&D investments, or the timing of a product launch. We also explore pricing schemes as well as tactics managers might use to modify the business environment in ways that enhance their firms' long-run profits. E.g., a firm may try to drive rivals out of the market, keep potential rivals from entering the market, or cooperate with rivals - strategies that may dampen competitive forces and possibly run afoul of antitrust laws.", "qtr": "Spring 2017", "name": "Business Strategy", "title": "WCAS ECON 249-0-20 Business Strategy", "lmod": "2/24/17 6:47 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "847/491-8220", "instructor_name": "James Andrew Hornsten", "instructor_addr": "Andersen Hall"}], "topic": "", "course": "249-0", "enrl_requirement": "Enrollment Requirements: Students who have taken Econ 349 may not register for Econ 249.", "descriptions": [{"name": "Overview of class", "value": "In most markets, firms compete for customers by making profit-maximizing decisions about prices, capacity, location, quality, variety, investment and product innovation. These decisions are especially interesting when there are several firms with interdependent payoffs; e.g., the choice of one firm to cut its price or close a retail store affects not only its profits, but also rival firms' profits. Inspired by both classical and modern readings about strategy, we develop and employ game theory tools to study firm behavior in a variety of scenarios, beginning with static (one period) models, and then turning to dynamic settings, in which firms may pursue profits through mergers, R&amp;D investments, or the timing of a product launch. We also explore pricing schemes as well as tactics managers might use to modify the business environment in ways that enhance their firms' long-run profits. E.g., a firm may try to drive rivals out of the market, keep potential rivals from entering the market, or cooperate with rivals - strategies that may dampen competitive forces and possibly run afoul of antitrust laws."}, {"name": "Registration Requirements", "value": "The prerequisites are ECON 202 (Introduction to Microeconomics) and MATH 220 (Single-Variable Derivative Calculus). We will be studying calculus-based models of profit-maximizing firms so (after a short review) you should be comfortable taking simple derivatives, using algebra to manipulate equations, and drawing and interpreting graphs. While this course is targeted to non-majors (especially Business Institutions minors), it is an ECON course that will use ECON analysis and provide ECON perspectives to complement those of other disciplines, though we will introduce and incorporate economic tools only as needed. Economics majors and minors cannot count ECON 249 towards their major/minor either as an elective or as a related course; such students should instead take ECON 349 (which covers similar topics while employing theoretical methods developed in ECON 310-1,2, the core microeconomic theory sequence)."}, {"name": "Teaching Method", "value": "Two 80-minute meetings per week, which will feature lectures, problem solving, and discussions of how to reconcile our models with current events. There will also be an enrollment-contingent discussion session, during which the teaching assistant will present some original material, work through practice exercises, and/or discuss the recent exam."}, {"name": "Evaluation Method", "value": "Three unit exams (25% each) and a project completed by a small team of students (25%)."}, {"name": "Class Materials (Suggested)", "value": "In lieu of a single required text, we will use a variety of readings (e.g., textbook chapters, economic journal articles, recent articles from the business press, and old teaching materials) that will be posted on Canvas in PDF format. Students who prefer a traditional textbook could obtain M. Baye and J. Prince (2015) Managerial Economics and Business Strategy 8/e, McGraw-Hill Irwin, ISBN 9780073523224. <br/>For timely application of business strategy, we will use a variety of readings (e.g., recent articles from The Economist, New York Times, Wall Street Journal, and Financial Times) that will be posted on Canvas in PDF format. We will also use selected chapters from the following: <br/>1. A. Dixit, S. Skeath, and D. Reiley (2015) Games of Strategy, 4/e, New York: W.W. Norton &amp; Company, ISBN 9780393919684. [An accessible undergraduate textbook on game theory] <br/>2. A. Dixit and B. Nalebuff (2008) The Art of Strategy: A Game Theorist's Guide to Success in Business and Life, New York: W.W. Norton &amp; Company, ISBN 9870393062434. [A non-technical, intuitive introduction to game theory] <br/>3. L. Freedman (2013) Strategy: A History, Oxford University Press, ISBN 9780199325153. [A historical account of the development of game theory to analyze business strategy]"}], "path": "/class-descriptions/4660/WCAS/ECON/249-0/35374", "instructor": ["James Andrew Hornsten"], "class_attributes": "", "id": "35374", "subject": "ECON"}]