[{"school": "JOUR", "overview_of_class": "Photojournalism is a visual reporting class that teaches students to make compelling images that convey multiple levels of information. Students will study past and current photojournalists and their contributions to journalism, as well as ethics while shooting and in the use of Photoshop. A foundation of camera knowledge and storytelling techniques will be enhanced with weekly critiques and discussions. Examining how photo editing impacts the presentation and perception of images is a key part of the course. Using provided equipment, students will complete the course with a portfolio of single images and in-depth photo stories.<br/><br/>Examples: * http://picturestory.knightlab.com/stories/lashonda.html * http://picturestory.knightlab.com/stories/jackie.html * http://picturestory.knightlab.com/stories/farm.html * http://picturestory.knightlab.com/stories/cattleranchers.html", "name": "Special Topics", "section": "20", "location": "Fisk Hall B11", "topic": "Advanced Photojournalism", "course": "390-0", "meeting_time": ["MoWe 10:00AM - 11:50AM"], "path": "/class-descriptions/4660/JOUR/JOUR/390-0/33209", "instructor": ["Zach   Wise"], "class_attributes": "See Class Details for Important Registration Info<br/><br/>Prerequisites apply, see description<br/><br/>", "id": "33209", "subject": "JOUR"}, {"school": "JOUR", "overview_of_class": "Is Facebook saving or destroying the news industry? Are claims about millennials ?fleeing' from the news true? What type of story structure elicits the most attention from audiences? These are important questions facing today's news industry. They are also empirical questions that can be addressed through systematic data collection and analysis. This class focuses on the foundations of social science research as it relates to the field of journalism. The class is designed to accomplish three inter-related goals: 1) to introduce the basic process, concepts, and techniques of journalism research; (2) to provide a framework for exploring questions about journalism and its effects; and (3) to gain hands-on experience in the process of conducting empirical investigations. While no prior experience in research or statistics is required, the class will involve computing and analyzing basic descriptive statistics and regression models.", "name": "Special Topics", "section": "21", "location": "Fisk Hall 306", "topic": "Journalism Research Methods: Collecting & Analyzin", "course": "390-0", "meeting_time": ["We 2:00PM - 4:50PM"], "path": "/class-descriptions/4660/JOUR/JOUR/390-0/33210", "instructor": ["Stephanie Lynn Edgerly"], "class_attributes": "No Freshmen<br/><br/>", "id": "33210", "subject": "JOUR"}, {"school": "JOUR", "overview_of_class": "Each quarter, multidisciplinary teams of students, faculty, and professionals come together to collaborate in the Knight Lab to produce cutting-edge digital work, research, and thought, innovating across every part of the media-making process. The Lab places students together on teams to work on an important problem for the future of media, rapidly moving beyond conversation and hypothesis to well-reasoned action during the quarter. Our process combines user and audience research, design thinking, critical and analytical work, iterative building, storytelling, new technology, and a healthy dose of experimentation?often within the confines of a single, specific problem. Projects are open by application. Spring 2017 includes projects on virtual reality, 3D photography, audience engagement, environmental reporting using sensors to measure air quality, and data explorations. Partners include ProPublica and Public Good Software. Full project details and application available at knightlab.com/class.", "name": "Special Topics", "section": "22", "location": "Fisk Hall 111", "topic": "Knight Lab", "course": "390-0", "meeting_time": ["TuTh 10:00AM - 11:50AM"], "path": "/class-descriptions/4660/JOUR/JOUR/390-0/33211", "instructor": ["Zach   Wise", "Emily Lauren Withrow"], "class_attributes": "Registration is By Application Only<br/><br/>", "id": "33211", "subject": "JOUR"}, {"school": "JOUR", "overview_of_class": "", "name": "Special Topics", "section": "23", "location": "McCormick Foundation Ctr 2107", "topic": "Media History & The Native American Experience", "course": "390-0", "meeting_time": ["Fr 10:00AM - 12:50PM"], "path": "/class-descriptions/4660/JOUR/JOUR/390-0/33212", "instructor": ["Loren   Ghiglione"], "class_attributes": "Sophomores Only<br/><br/>", "id": "33212", "subject": "JOUR"}, {"school": "JOUR", "overview_of_class": "Sports marketing provides an understanding of the key concepts and methods in marketing communications in both traditional and digital media within the world of sports. The course provides students with a foundation in the development and execution of communications strategies for any sports organization with added opportunities to learn the marketing environments that pertain to sports including organizations, leagues and brands. Primary emphasis is placed on consumer engagement, branding, market segmentation and positioning, message strategy, promotion and the execution of marketing strategies in the context of sport. Students will develop an understanding of how marketing works in sports through readings, lectures, case analysis and discussions and will demonstrate effective decision-making in ambiguous sports marketing environments, using financial and market analysis, and considering legal and ethical concerns. The course develops students' ability to think analytically and strategically by assessing examples and case studies of marketing communications problems and opportunities.", "name": "Special Topics", "section": "24", "location": "Meets in Non-General PurposeRm", "topic": "", "course": "390-0", "meeting_time": ["Mo 6:00PM - 9:00PM"], "path": "/class-descriptions/4660/JOUR/JOUR/390-0/37932", "instructor": ["Ivan Jason Meyers"], "class_attributes": "", "id": "37932", "subject": "JOUR"}, {"school": "JOUR", "overview_of_class": "When you're building the future, there's a natural tendency to assume the past isn't very relevant. This course argues, however, that one cannot appreciate the revolutionary impact of new media technologies and technology companies without understanding historical innovations. This course will fulfill the BSJ media history requirement and will also apply toward the Farley Center entrepreneurship certificate.", "name": "Special Topics", "section": "26", "location": "Meets in Non-General PurposeRm", "topic": "History and Future of Technology", "course": "390-0", "meeting_time": ["Mo 6:00PM - 9:00PM"], "path": "/class-descriptions/4660/JOUR/JOUR/390-0/37373", "instructor": ["Russel Parrish Nelson"], "class_attributes": "", "id": "37373", "subject": "JOUR"}]