[{"class_mtg_info": [{"meet_t": "Sa 9:00AM - 12:00PM", "meet_l": "Wieboldt Hall 408"}], "school": "SCS", "overview_of_class": "Managing change has become a constant for leaders across all organization types and industry sectors. This course will be integrating and building upon the fundamental subjects covered through the Leadership Certification program with a particular focus on how to identify and manage change at a system's level. We will be using John Kotter's eight-step change model as the primary framework and learning tool and the book Switch, which identifies two primary change characteristics. Within the context of formal change management best practices, we will study the impact and role of employee engagement and culture, corporate social responsibility, organizational structure and diversity on the types of adaptive/strategic change drivers that are now a fundamental part of organizational success.", "qtr": "Winter 2016", "name": "Organizational Change", "title": "SCS ORG_BEH 310-CN-17 Organizational Change", "lmod": "1/9/16 6:42 PM (CT)", "section": "17", "instructors": [{"instructor_phone": "", "instructor_name": "Aleen Marcia Bayard", "instructor_addr": ""}], "topic": "", "course": "310-CN", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Managing change has become a constant for leaders across all organization types and industry sectors. This course will be integrating and building upon the fundamental subjects covered through the Leadership Certification program with a particular focus on how to identify and manage change at a system's level. We will be using John Kotter's eight-step change model as the primary framework and learning tool and the book Switch, which identifies two primary change characteristics. Within the context of formal change management best practices, we will study the impact and role of employee engagement and culture, corporate social responsibility, organizational structure and diversity on the types of adaptive/strategic change drivers that are now a fundamental part of organizational success."}, {"name": "Registration Requirements", "value": "This course combines classroom lecture and discussion with an online component. For the lecture and discussion components, this course is paired with an afternoon session of LOB/ACCOUNT 201-CN taught by Steve Andes, and the in-class meetings are on alternate Saturdays: 1/10, 1/24, 2/7, 2/21, 3/7. For the online component, students must have ready access to the Internet.This course is open to Leadership and Organization Behavior year two cohort students only."}, {"name": "Learning Objectives", "value": "-Develop an understanding of, and ability to apply, change management best practices to business scenarios<br/>-Appreciate the role of stakeholders in accelerating or thwarting adoption in a change project<br/>-Create effective messaging to accelerate change adoption <br/>- Apply the Transition Management best practice framework"}, {"name": "Class Materials (Required)", "value": "Text: Switch by Dan &amp; Chip Heath ISBN: 0385528752 plus several readings, including:<br/><br/>Leading Change by John Kotter, How to Mobilize the Executive Team for Strategic Change: The SFO Readiness Assessment - by Terry Brown, The Hard Side of Change Management, Cracking the Code of Change <br/>http://hbr.org/2000/05/cracking-the-code-of-change<br/>*Mercer report on Employee Engagement, Leadership for Change: Enduring Skills for Change Masters, Diversity as a Strategy, Managing to Manage Across Generations, Problems of Matrix Organizations - http://hbr.org/1978/05/problems-of-matrix-organizations/ar/1<br/>*Mercer's M&amp;A report"}], "path": "/class-descriptions/4610/SCS/ORG_BEH/310-CN/27812", "instructor": ["Aleen Marcia Bayard"], "class_attributes": "", "id": "27812", "subject": "ORG_BEH"}]