[{"school": "WCAS", "overview_of_class": "Model operas, civilized plays, xiqu, avant-garde theater, musicals, spoken drama?the theatrical world of the 20th century in China saw many different incarnations and experimentations over the course of the century. From the star culture surrounding the female impersonators of the Republican era through xiqu reform and the model operas of the Cultural Revolution to the emergence of a director's theater in the post-Maoist era, the picture of modern Chinese theater is a complex web of evolving forces between audiences, actors, directors, playwrights, and the state. Entangled in this image are different reflections of the role of theater in marking or creating social change, not just with class revolution but in considering and redefining gender categories. In this course, we will explore significant plays of different genres from throughout the 20th century that highlight the key creators and turning points of modern Chinese theater. Among the topics we will consider are the myriad ways theater interacts with political forces, including mass mobilization, censorship, regulations of gender, representations of history, and interactions on the world stage.", "name": "Introductory Topics in Asian Languages and Cultures", "section": "20", "location": "Fisk Hall 114", "topic": "Reinventing the Chinese Stage in the 20th Century", "course": "290-0", "meeting_time": ["MoWe 11:00AM - 12:20PM"], "path": "/class-descriptions/4660/WCAS/ASIAN_LC/290-0/32520", "instructor": ["Anne Elizabeth Rebull"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "32520", "subject": "ASIAN_LC"}, {"school": "WCAS", "overview_of_class": "This class will an offer an introduction to the literature, arts and popular culture of Pakistan with a focus on the productive - if often fraught- relationship between artistic creation, social reform and political change. Looking beyond the confines of the modern nation-state, our examination will stretch from the leftist modernism of the 1930s to contemporary trends, including the recent appearance of hip-hop, \"Sufi rock,\" and animated programs such as Burka Avenger. The course will examine major movements and figures, reading them with reference to the historical context in which they were produced. While our primary focus will be on the written word - novels, short stories, and poetry - we will also devote significant attention to the place of music, television and film. By the end of the course, students will have a strong knowledge of Pakistan's political, cultural and artistic history, as well as its contemporary relevance. They will also gain a critical understanding of the relationship between the arts, politics and social reform.", "name": "Introductory Topics in Asian Languages and Cultures", "section": "21", "location": "Harris Hall L06", "topic": "Burning Embers and Burka Avengers: Society, the Ar", "course": "290-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4660/WCAS/ASIAN_LC/290-0/32521", "instructor": ["Daniel Joseph Majchrowicz"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "32521", "subject": "ASIAN_LC"}, {"school": "WCAS", "overview_of_class": "This interdisciplinary course explores 20th and 21st century Korean films as sites for historical inquiry and social analysis. We will examine how legacies of colonialism, national division, and the Cold War in East Asia are articulated through the medium of cinema in South and North Koreas. We will also look at how Korean national identities are produced in relation to the global circulation of films and transnational market forces. Through this course, students will gain an understanding of some of the major issues in modern Korean history and society, as well as learn to think critically about the language of cinema.", "name": "Introductory Topics in Asian Languages and Cultures", "section": "22", "location": "Harris Hall L28", "topic": "Korean Film and Society", "course": "290-0", "meeting_time": ["TuTh 9:30AM - 10:50AM"], "path": "/class-descriptions/4660/WCAS/ASIAN_LC/290-0/32522", "instructor": ["Mi-Ryong   Shim"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "32522", "subject": "ASIAN_LC"}, {"school": "WCAS", "overview_of_class": "When Japan first \"opened\" to the West in the mid-19th century, it was already one of the most highly urbanized societies in the world, and was home to one of the world's greatest metropolises: Edo, which would become modern-day Tokyo. In this course, we examine this indigenous urban tradition by exploring the literature, thought, and visual culture of early modern or Edo-period (1600-1868) Japan. Students will be introduced to the major paradigms of the city emerging in the 17th century?the traditional court capital (Kyoto), the center of commerce (Osaka), the administrative capital (Edo), and regional castle-towns?and their social, governmental, economic, and spatial structures. We also will survey the major historical stages of urban cultural production and their social triggers, from the blossoming of urban commoner culture in Kyoto and Osaka in the late 17th century to the \"eastward shift\" of cultural production to Edo in the mid-18th century, the flowering of amateur literati salons in the pleasure quarters of 18th-century Edo, and the broadening of urban audiences in the early 19th century. Reading representations of urban space in a variety of literary, philosophical, dramatic, and visual genres, we ask not only how the social and spatial structures of the city are reflected in them as documents, but also what they say about how the people of early modern Japan thought about and experienced city-ness; we seek to understand cultural texts not merely as documentary artifacts but as symbolic efforts at understanding and navigating spaces that were inhabited, walked, felt, and lived. All readings are in English; no knowledge of Japanese is required or expected.", "name": "Introductory Topics in Asian Languages and Cultures", "section": "23", "location": "Parkes Hall 212", "topic": "The City in Early Modern Japan", "course": "290-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4660/WCAS/ASIAN_LC/290-0/32523", "instructor": ["Thomas Martin Gaubatz"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "32523", "subject": "ASIAN_LC"}]