[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Frances Searle Building 2370"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Spring 2017", "name": "38018", "title": "WCAS STAT 332-0-1 Statistics for Life Sciences", "class_attributes": "", "section": "38018", "instructors": [{"instructor_phone": "847.467.1087", "instructor_name": "Hongmei   Jiang", "instructor_addr": "2006 Sheridan, Room 101A"}], "topic": "", "course": "332-0", "descriptions": [{"name": "Overview of class", "value": "This is a practical statistics course with emphasis on the application of statistical methods and data analysis techniques to the life sciences. We will cover topics including descriptive statistics, normal distribution, random variables, sampling distribution, confidence intervals, hypothesis tests, p-values and multiple correction, linear regression, model selection, diagnostics, logistic regression, contingency tables, resampling, clustering, dimension reduction, and genomics data analysis. In addition to classical parametric statistics (e.g., two-sample t-test), we will also cover nonparametric approaches (e.g., rank-based test) and resampling based approaches (e.g., permutation test) when data do not fit assumptions required by the standard approaches.<br/><br/>*PLEASE NOTE: This course does not count for major or minor credit"}, {"name": "Registration Requirements", "value": "Prerequisite is one introduction to statistics course"}, {"name": "Teaching Method", "value": "Lecture"}, {"name": "Class Materials (Required)", "value": "Statistics for the Life Sciences, 5th ed., 2016 Samuel, ML, Witmer, JA, and Schaffner AA."}, {"name": "Class Materials (Suggested)", "value": "Data Analysis for the Life Sciences with R, 2016, Irizarry, RA and Love, MI. (Recommended)<br/>Probability and Statistics with R, Second Edition, 2016, Ugarte MD, Militino AF, and Arnholt AT (Useful)"}, {"name": "Class Notes", "value": "Statistical software, R (RStudio) will be used for computing. R programming examples will be provided to help make the connection between statistical methods and implementation. <br/><br/>(1) Free software R from CRAN: http://www.r-project.org/<br/>(2) RStudio: http://www.rstudio.com/ <br/>(3) An introduction to R: http://cran.r-project.org/doc/manuals/R-intro.pdf"}], "lmod": "2/20/17 6:51 PM (CT)", "subject": "STAT"}]