[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "Kresge Centennial Hall 2-425"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "33289", "title": "WCAS ENGLISH 357-0-20 19th-Century British Fiction", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "33289", "instructors": [{"instructor_phone": "", "instructor_name": "Christopher   Herbert", "instructor_addr": ""}], "topic": "Classic Victorian Fiction", "course": "357-0", "descriptions": [{"name": "Overview of class", "value": "In this course, which might be titled &quot;The Golden Age of British Popular Fiction,&quot; we will read representative works by major British novelists of the nineteenth century other than Dickens, focusing on their analysis of modern social and psychological conditions and on the artistic innovations that these themes generated. Of particular interest will be the ways these writers use the vehicle of popular fiction to explore issues of gender roles and sex relations in a period of rapid cultural change that was fraught with self-contradiction. Sometimes such issues give rise in these novels to scalding satire that contemporary readers found shocking and distasteful; sometimes to a mood of paralyzing depressiveness; sometimes to subtly hilarious comedy; but in all its different modulations, the preoccupation with volatile issues of sex is rarely absent here, and this is where the special accent of the course will fall."}, {"name": "Teaching Method", "value": "Lecture, discussion."}, {"name": "Evaluation Method", "value": "Assigned work in the course includes class presentations, quizzes, and a term paper."}, {"name": "Class Materials (Required)", "value": "Readings include some of the most original (and most entertaining) novels of the times: W. M. Thackeray, Vanity Fair (1847-48); Charlotte Brontë, Villette (1853); Elizabeth Gaskell, Wives and Daughters (1864-66); and Thomas Hardy, Jude the Obscure (1895)."}, {"name": "Class Notes", "value": "Post 1830"}], "lmod": "2/19/17 6:48 PM (CT)", "subject": "ENGLISH"}]