[{"class_mtg_info": [{"meet_t": "MoWeFr 11:00AM - 11:50AM", "meet_l": "Kresge Centennial Hall 2-343"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "10928", "title": "WCAS LATIN 201-1-21 Introduction to Latin Literature", "class_attributes": "", "section": "10928", "instructors": [{"instructor_phone": "847/491-8043", "instructor_name": "Graziela Marieta Byros", "instructor_addr": "Crowe Hall 3-145"}], "topic": "", "course": "201-1", "descriptions": [{"name": "Overview of class", "value": "The goal of second-year Latin (201-1, 2, 3) is the development of proficiency in reading Latin through the introduction of the student to major works of Latin literature. In addition to the review and continued reinforcement of grammar and syntax, the class will read selections from Petronius and Cicero with attention to their interpretation and historical significance."}, {"name": "Registration Requirements", "value": "Successful completion of Latin 101-3 or by placement test. Students who have studied Latin prior to Northwestern must take a Latin placement exam. For further information, contact the Director of Latin Instruction Francesca Tataranni (f-tataranni@northwestern.edu)."}, {"name": "Teaching Method", "value": "Translation and discussion of daily reading assignments will emphasize grammar and syntax as essential tools for improving the student's ability to translate comfortably and accurately. Important concepts in grammar and syntax will be reviewed as needed."}, {"name": "Evaluation Method", "value": "Preparation and Class Participation 10% (two assignments excused)<br/>Midterm Exam 20%<br/>Quizzes 50% (lowest one dropped)<br/>Final Exam 20%<br/><br/>Class attendance and participation will be factored into the final letter grade. Attendance will be taken at every class session. If you are more than ten minutes late, you will be considered `absent' for that class (although you should still attend class). More than three absences will result in the loss of one full letter grade for the quarter. Five absences will result in automatic failure of the class. Missing a class does not excuse you from the material covered. Your success in this course is your responsibility. Furthermore, enthusiastic participation in class sessions is required!<br/><br/>HOMEWORK: You will have 2-3 hours of homework in preparation for each class. You are allowed to miss two assignments total over the course of the quarter without penalty. Assignments will be checked in class regularly.<br/>QUIZZES: Weekly quizzes will be held on Fridays. These will include grammar, vocabulary, and translation from the readings covered during the week. There will be 7 quizzes total over the course of the quarter. Your lowest quiz score may be dropped from your final average.<br/>MIDTERM EXAM: The midterm exam will be held in class on Friday, October 24. It will include grammar, vocabulary and translations from the readings covered since the beginning of the quarter (Petronius).<br/>FINAL EXAM: The final exam will be held on Monday, December 8, 9:00-11:00 a.m. in Locy Hall 109. It will include grammar, vocabulary and translations from the readings covered since the Midterm (Cicero).<br/>Academic Integrity: Academic integrity violation of any type or form will not be tolerated and will be dealt with according to the regulations set out by WCAS and Northwestern University. Please insure that all work submitted for this course is your own.<br/><br/>Disability Accommodations: Any student with a documented disability needing academic accommodations is encouraged to register with Accessible NU and to speak with the professor as soon as possible. All discussions will remain confidential."}, {"name": "Class Materials (Required)", "value": "B. Severy-Hoven, The Satyrica of Petronius. An Intermediate Reader (University of Oklahoma Press 2014). ISBN: 9780806144382 $17-$ 40<br/>E. Keitel &amp; J.W. Crawford, Cicero. Pro Caelio (Focus 2010). ISBN: 9781585101382 $15- $23"}, {"name": "Class Materials (Suggested)", "value": "A. Mahoney, Allen and Greenough's New Latin Grammar (Focus Publ./R. Pullins Co. 2001). ISBN: 9781585100279<br/>A good Latin dictionary. If buying new, recommended is An Elementary Latin Dictionary, by Charlton L. Lewis (Oxford)."}], "lmod": "10/30/16 7:07 PM (CT)", "subject": "LATIN"}]