[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "University Hall 318"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "25600", "title": "WCAS ENGLISH 397-0-20 Research Seminar for Literature Majors", "class_attributes": "Attendance at 1st class mandatory<br/><br/>Juniors/Seniors Only<br/><br/>", "section": "25600", "instructors": [{"instructor_phone": "847/491-3091", "instructor_name": "Susannah   Gottlieb", "instructor_addr": "University Hall 321"}], "topic": "", "course": "397-0", "descriptions": [{"name": "Overview of class", "value": "Nothing marks the modern world so much as the devastating and disruptive effects of imperialism. An understanding of this complex phenomenon is vital not only for an understanding of modern history and geography, but also for modern literature. Lenin and Arendt draw diametrically opposed interpretations of Hobson's original theory of imperialism: while Lenin understands imperialism as the last stage of capitalism, Arendt believes it is the first stage of rule by the bourgeoisie. At stake in this debate, at least for Arendt, is the ability of an interpretation of imperialism to explicate works of literature written under imperialist conditions. With a focus on the &quot;Age of Imperialism&quot; (especially the &quot;scramble for Africa&quot; and &quot;the Great Game&quot;), we will begin the class with an examination of some of the central theories and interpretations of European imperialism (those of Marx, Hobson, Lenin, and Arendt); continue with an exploration of the historical conditions of certain imperialized regions (India, Congo Free State, and Nigeria); and make use of both inquiries as we confront some of the most lucid and powerful literary encounters with imperialism in this century, including works by Kipling, Conrad, Achebe, and Desai."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Class Notes", "value": "Students must successfully complete 4-6 300-level English courses before taking English 397."}], "lmod": "1/9/16 6:47 PM (CT)", "subject": "ENGLISH"}]