[{"class_mtg_info": [{"meet_t": "MoTuWeFr 12:00PM - 12:50PM", "meet_l": "Kresge Centennial Hall 2-440"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: REASON: Pre-registration is not allowed for this class. Please try again during regular registration.", "qtr": "Spring 2017", "name": "34751", "title": "WCAS SLAVIC 102-3-21 Intermediate Russian", "class_attributes": "", "section": "34751", "instructors": [{"instructor_phone": "847/491-8252", "instructor_name": "Natalia   Malinina", "instructor_addr": "1880 Campus Dr. (Kresge) Office 3225"}], "topic": "", "course": "102-3", "descriptions": [{"name": "Overview of class", "value": "Intermediate Russian 102-3 is the continuation of a two-year sequence that enables students to acquire intermediate-level proficiency. This course is designed for students who have successfully mastered the language skills in Elementary Russian. It proposes the further development and command of skills and abilities in the areas of reading, writing, listening, and speaking. Emphasis is also placed on vocabulary expansion, especially in the areas of speaking and writing. A great deal of attention will be devoted to the learning of grammar in conjunction with the immediate activation of it in conversation. Video materials and audiotapes will be used throughout the course."}, {"name": "Teaching Method", "value": "Classes are centered on the textbook, Welcome Back!: Russian Stage Two, an integrated Russian language program. This program is a video-based course that continues the adventures of Tania and Olya in Moscow begun in Elementary Russian. Students, with the help of Tania and Olya, will acquire new language skills, learn how to use them effectively, and increase their understanding of Russian culture. Students are encouraged to take advantage of the wide range of materials offered by this course-text, workbook, video episodes, and audio."}, {"name": "Evaluation Method", "value": "Classroom participation, homework, quizzes, unit exams, and a final exam (written and oral parts)."}], "lmod": "2/13/17 6:48 PM (CT)", "subject": "SLAVIC"}]