[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "Kresge 4364 Classics Sem Rm"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "22506", "title": "WCAS GREEK 301-0-1 Readings in Greek Literature", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "22506", "instructors": [{"instructor_phone": "847/467-1843", "instructor_name": "John P F Wynne", "instructor_addr": "Kresge 4365"}], "topic": "Plato on Poetry", "course": "301-0", "descriptions": [{"name": "Overview of class", "value": "How is great art made by artists who cannot see the depth of their own work? A brilliant performer, who moves audiences profoundly, is shallow when asked about his performance. The scene is most familiar from Hollywood interviews. In Plato's Ion, all of which we shall read in Greek, the titular character is an award-winning ?rhapsode' or performer of poetry. Socrates interrogates Ion and we find that Ion is conceited but clueless. Socrates argues that performers and poets themselves are inspired by the gods. Is this a joke at Ion's expense? Or, as it seems, does Socrates seriously mean that Dante and your favorite recording artist are divinely inspired? If so, how does Socrates think inspiration works? How should a philosopher like him take advantage of it? How does Plato want us to see this argument alongside his infamous dismissal of artists like Homer and Ion in the Republic? We shall both sharpen our Greek on Plato's text and try to answer these interpretive questions. Since the Ion is short, we shall also have time to read brief passages on our theme from other works of Plato, notably the Republic."}, {"name": "Registration Requirements", "value": "Completion of Greek 201-3 or permission from instructor"}, {"name": "Evaluation Method", "value": "The goals of the class are to better our Greek and to interpret the Ion. I shall assess the achievement of these goals as follows:<br/><br/>? Final paper (35%): See below, ?Final Paper.'<br/><br/>? Two midterm exams (40%): translations and short commentaries on passages we shall have read. The second exam will not be cumulative. <br/><br/>? Language quiz(zes) (10%): in class when needed. I shall announce them no later than their previous class. <br/><br/>? Participation in class (15%).<br/><br/>(Graduate students should negotiate with me a grading scheme to suit their interests.)<br/><br/><br/>Final Paper.<br/><br/>Your paper should be 6-10 pages and address carefully a narrow topic in the interpretation of the Ion. The topic may be literary, philosophical, historical, &amp;c.. Please choose your topic creatively. Propose it to me as soon as you like, but no later than Wed 29th Feb. Proposals may be written or pitched in office hours."}, {"name": "Class Materials (Required)", "value": "Penelope Murray, Plato on poetry, Cambridge, 1995."}, {"name": "Class Notes", "value": "House Rules:<br/><br/>No computers, telephones, tablets, e-readers or other electronic impediments in class. <br/><br/>You may be absent without prior excuse once. After that, each such absence will lower your grade by a letter."}], "lmod": "12/29/16 6:59 PM (CT)", "subject": "GREEK"}]