[{"school": "WCAS", "overview_of_class": "The seminar discusses the historical background to the rise of political Islam within the Palestinian society, reviewing three periods: Mandatory Palestine (1920s - 1940s), the West Bank and Gaza under Jordan and Egypt's rule (1948-1967), and Israel since 1967. The central part of the seminar focuses in more detail on Hamas, \"Islamic Jihad,\" and the Islamic Movement in Israel. It analyses the causes for the rise of revivalist Islam in the territories and in Israel since the 1970s. It deals with the ideology and political platform of Hamas as outlined in its \"Charter\" (the Islamicization of the Israel-Arab conflict, the Islamicization of the Palestinian nation identity). We will examine the doctrinal and practical principle of Jihad and the idea of martyrdom in Islam (Istishad). A special emphasis will be laid on suicide bombing from a doctrinal and practical point of view. The seminar examines the political participation of Hamas (Municipal, Legislative Council elections - 2006) and its relationship with the PLO. Finally the seminar reviews the rise of the Islamic Movement in Israel, its particular characteristics, the political divide of the movement (1996) and its role as a social, economic and cultural agent of change in the life of the Arab minority in Israel.", "name": "Research Seminar", "section": "20", "location": "Locy Hall 305", "topic": "Hamas & \"Islamic Jihad\"", "course": "395-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4650/WCAS/HISTORY/395-0/22014", "instructor": ["Elie   Rekhess"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "id": "22014", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "This will be a seminar-colloquium focusing on the background of the July, 1952 Revolution and controversies surrounding the course of its development. We shall examine the major issues of the British occupation, the Palace faction and the centrist Wafd Party-in the context of their spiraling confrontation. We shall analyze the background of Gamal Abd al-Nasir (Nasser) and his associates (including Anwar al-Sadat) in order to pose a fundamental question: were these individuals committed to genuine social change or did they remain bourgeois capitalists, psychologically tied to the West, and thus dependent on it? Subsequently, we shall examine Egypt's involvement with the Palestine Problem, dilemmas of economic growth, international alignments, and the 'Cold Peace' with Israel.", "name": "Research Seminar", "section": "22", "location": "Harris Hall L06", "topic": "Egypt under Nasser & Sadat", "course": "395-0", "meeting_time": ["MoWe 12:30PM - 1:50PM"], "path": "/class-descriptions/4650/WCAS/HISTORY/395-0/28385", "instructor": ["Carl Forbes   Petry"], "class_attributes": "", "id": "28385", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "The Mughal Empire (1526-1857) is widely remembered as one of the most powerful, opulent empires of the early modern world, renowned both for the atmosphere of cultural pluralism that it promoted as well as the magnificent monuments (such as the famed Taj Mahal) that it produced. Less well known, however, are the remarkably rich - and remarkably diverse - literary cultures that the Mughal court promoted, and which saturated the cultural, political, and religious life of early modern India more generally. This course will introduce students to some of the basic features of these intersecting Indo-Persian, Sanskrit, and Hindi-Urdu literary worlds (in translation, of course), as well as to their lasting - and sometimes controversial - legacies in modern South Asian culture and politics, from British India to Bollywood.", "name": "Research Seminar", "section": "26", "location": "Fisk Hall 114", "topic": "Literary Cultures of Mughal India", "course": "395-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4650/WCAS/HISTORY/395-0/22017", "instructor": ["Rajeev Kumar Kinra"], "class_attributes": "", "id": "22017", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "The United States folk music revival is typically thought of as an antimodern, even a Luddite, movement. Acoustic guitars, camp fires, overly sincere singers, and \"Kumbaya\" politics are the clichés many call to mind. To study it through digital means, however, reveals important connections between the history of the revival and issues of technology, culture, and politics in the modern world. <br/><br/>In this research seminar, we examine the history of the US folk music revival through readings, audio listening, documentary films, seminar discussions, and, most of all, extensive digital analysis to investigate these connections. Working in platforms such as Omeka and WordPress, with tools ranging from Audacity sound editing software to mapping, annotation, and timeline programs, we use the archives of the Berkeley Folk Music Festival (in Northwestern's Special Collections and online) and other primary sources to probe what was at stake in the folk revival in relation to: American culture and politics; questions of race, class, gender, age, and region; and the strange workings of music-making, memory, and power. <br/><br/>As we do so, we ask how digital technologies might help us to interpret history more meaningfully; simultaneously, we explore how the folk revival itself might be useful for understanding digital approaches to history and the humanities today. In other words, how does the new inform the old, but also how can the old help us confront the new.<br/><br/>Each student will be evaluated based on class participation, weekly digital mini-project experiments, presentations, and a final multimedia interpretive digital history project that is the multimedia equivalent of a 15-20 page analytic essay based on original research. <br/><br/>No previous digital or musical training is required for the course. For students with advanced digital media/programming skills or musical training, the course presents an opportunity to connect that background to deep historical study; for students interested in acquiring digital or musical skills, the seminar offers an excellent introductory pathway to these areas of knowledge.", "name": "Research Seminar", "section": "28", "location": "Locy Hall 314", "topic": "Digitizing Folk Music History", "course": "395-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4650/WCAS/HISTORY/395-0/22018", "instructor": ["Michael J Kramer"], "class_attributes": "", "id": "22018", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "The half century between 1775 and 1825 was an age of American revolutions. From the shot heard ?round the world to the independence of Bolivia fifty years later, most of the Western Hemisphere?including all of Brazil, all of mainland Spanish America, much of British America, and the most lucrative colony in French America?broke away from Europe. People throughout the Americas were rejecting absolutism and embracing constitutionalism, and this new order for the New World raised powerful questions. How would wars against European authority impact social, racial, and gender hierarchies at home? How would enslaved men and women respond when they heard their masters talking of liberty? And in the multiracial nations that did emerge, who?if anyone?would be entitled to vote? In the process of addressing these questions, we will also focus on the art of historical research: how to find topics, frame research questions, identify and interpret sources, and build arguments. Although students can write their research papers on any of the revolutions that rocked the Western Hemisphere in this era, a plurality of our in-class discussions will focus on U.S. responses to Haitian and Latin American independence, and on what those responses suggest about the United States in this age of American revolutions.", "name": "Research Seminar", "section": "30", "location": "University Hall 318", "topic": "Age of American Revolutions", "course": "395-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4650/WCAS/HISTORY/395-0/27740", "instructor": ["Caitlin Annette Fitz"], "class_attributes": "", "id": "27740", "subject": "HISTORY"}]