[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "University Hall 412"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Freshmen may not register for this course.", "qtr": "Winter 2016", "name": "24972", "title": "WCAS HISTORY 395-0-32 Research Seminar", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "24972", "instructors": [{"instructor_phone": "847/491-7262", "instructor_name": "Henry Claxton   Binford", "instructor_addr": "Harris Hall Room 240"}], "topic": "Problems of Poverty in Anglo-American Culture", "course": "395-0", "descriptions": [{"name": "Overview of class", "value": "This course will explore recurrent attempts to define, explain, and ameliorate poverty in England and the United States from the 18th century to the late 20th. Topics include: the relationship between poverty and the commercial/industrial revolution; the place of poverty in Enlightenment and Utilitarian thought; changing (and unchanging) ideas about the connections between poverty and moral character, education, unemployment, gender, and ethnic/racial inheritance; the periodic emergence of poverty as a political issue; the concept of an &quot;underworld&quot; or &quot;underclass;&quot; and the shifting rhetoric of sympathy and fear. We will begin with selections from Jacob Riis, How the Other Half Lives (1890). After that initial discussion, the class will move back to the 18th century, to examine the ideological, political, and economic bases of later discussions about poverty. We will then move on to a consideration of 20th century changes (and continuities) in the nature of poverty and its place in English and American thinking."}, {"name": "Teaching Method", "value": "The first half of this course will emphasize reading and discussion. Mastering the reading assignments is essential preparation for both class sessions and the final papers. Every student will be expected to complete all of the reading before class each week, and everyone will be included in discussion. Students will also take turns leading the discussion. The second half of the course will emphasize research and writing."}, {"name": "Evaluation Method", "value": "There will be no exams. Discussion participation and presentations will count for 20% of the grade. Each student will write one 3 page paper due early in the quarter (5%). In work toward the final, research-based paper, students will submit a proposal, an outline, a bibliography, and a thesis paragraph, which together will count for 20%. The final paper of 15-20 pages will count for 55%."}, {"name": "Class Materials (Required)", "value": "Jacob Riis, How the Other Half Lives. ISBN 978-1438296630<br/><br/><br/>Jane Addams, Twenty Years at Hull House. ISBN 978-0451527394<br/><br/><br/>Michael Harrington, The Other America. ISBN 978-0684826783<br/><br/><br/>Walter Trattner, From Poor Law to Welfare State. ISBN 978-0684854717<br/><br/><br/>There will also be readings in a photocopied packet."}, {"name": "Class Notes", "value": "HISTORY OF CONCENTRATION: Americas"}], "lmod": "1/9/16 6:48 PM (CT)", "subject": "HISTORY"}]