[{"school": "WCAS", "overview_of_class": "This course is an introduction to the academic study of religion, which means it is an introduction to the way people think, talk, and analyze about religion(s). \"Religion,\" as we will study it this semester, is not a fixed and unchanging entity, but a way of being in the world that is affected by social, cultural, and historical perspectives. Religious Studies is the work of studying it. Religious Studies demands that we take care with our definitions, we work to understand classifications of religion, and that we use data from religion as it is lived to complicate and challenge our assumptions and explanations of religion. To study religion is to study a complex and messy dimension of human life. <br/><br/>This class asks you to think open-mindedly and creatively about religion. We may study ideas or people or traditions that are surprising to you. You may encounter worldviews with which you disagree. Be prepared to think with this material. I look forward to hearing and reading how you engage perspectives you may not have encountered before.<br/><br/>This class begins with a brief historical overview of how religion has been studied and what is at stake in studying religion. Part I is an introduction to five of the world's religions. Part II studies themes in the study of religion. During this part of the course, we turn our attention to four contemporary cases of dispute over what religion is, why it matters, and how it affects daily life. Each case study will help us think through a particular theme in Religious Studies: belief, sacred, prayer and ritual, gender. We will analyze the case studies through these terms. After each case study, students will submit a mini-project on the case study?a blog post, an image with analysis, religious service observation, and a series of tweets. Through this study, students will gain a foundation in the academic study of religion.", "name": "Introduction to Religion", "section": "20", "location": "Harris Hall 107", "topic": "", "course": "170-0", "meeting_time": ["MoWeFr 10:00AM - 10:50AM"], "path": "/class-descriptions/4620/WCAS/RELIGION/170-0/34703", "instructor": ["Katherine Anne Dugan"], "class_attributes": "Ethics &amp; Values Distro Area<br/><br/>", "id": "34703", "subject": "RELIGION"}]