[{"class_mtg_info": [{"meet_t": "We 2:00PM - 4:50PM", "meet_l": "Annie May Swift Hall 110"}], "school": "SoC", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Spring 2017", "name": "30982", "title": "SoC PERF_ST 516-1-20 Crit/Performance Ethnography: Theories and Fieldwork", "class_attributes": "", "section": "30982", "instructors": [{"instructor_phone": "", "instructor_name": "Deidra Soyin Madison", "instructor_addr": "Annie May Swift Hall, G06"}], "topic": "", "course": "516-1", "descriptions": [{"name": "Overview of class", "value": "This seminar will focus on theories and methods of fieldwork. Therefore, we will concentrate on the doing of fieldwork both as a theoretical examination AND as practical application in the critical engagement with Others within specific environments and locations. We will consider various fieldwork methods as our theoretical inquiries help us reflect upon the meanings and purposes of ethnographic praxis or critical ethnography. <br/> Because critical ethnography concerns the rhetorical, ethical, and political effects of what we DO, performance is a fundamental dynamic in this seminar. We will explore performance as theory, method, event, and everyday occurrence. We will examine the interpenetrating relationships among performance, ethnography, economy, and culture. Since culture is made visible to us through its representations, e.g., its structures, dramas, symbols, metaphors, habits, everyday practices, landscapes, language patterns, etc.,performance becomes those embodied enactments formed by and embedded within these representations, as it simultaneously generates them. Performance becomes a primary point of entry and inquiry where we may be/act, see/hear, feel/sense, and think/evaluate within an Other world and our own. We will examine the fieldwork experiences of selected ethnographers through a &quot;performance lens&quot; -merging theory and practice as we &quot;travel&quot; to the &quot;worlds&quot; of Others. The aim of the seminar, therefore, is to learn more about what is at stake critically and methodologically from a performance perspective when you begin to &quot;travel across worlds.&quot;"}], "lmod": "2/20/17 6:38 PM (CT)", "subject": "PERF_ST"}]