[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "University Hall 102"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "23092", "title": "WCAS ANTHRO 390-0-27 Topics In Anthropology", "class_attributes": "", "section": "23092", "instructors": [{"instructor_phone": "", "instructor_name": "Mitali   Thakor", "instructor_addr": ""}], "topic": "Queer Robotics: Cyborgs &amp; Fantasy in Postcolonial", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "What do representations of robots and cyborgs in popular film, sci-fi literature, and cultural anthropology tell us about gender, sexuality, race, and what it means to be &quot;human?&quot; In this class we will use critical race studies, queer and feminist theory, crip studies, and science and technology studies (STS) to analyze representations of &quot;cyborg&quot; bodies in speculative fiction and ethnography. Our case examples explore the politics of the body through narratives of military research, artificial intelligence, sex work, urbanism and segregation, deep space and deep ocean research, prosthetics and athleticism, new reproductive technologies, and more. We will engage with poetry, film, visual art, and speculative fiction to explore how bodies are dreamed, crafted, and represented. <br/><br/>Moving from the short stories of Octavia Butler, to Donna Haraway's &quot;Cyborg Manifesto,&quot; to recent films like Ex Machina, students will learn to question, blur, and play with dualist categories, e.g. human/nonhuman, female/male, heterosexual/ homosexual, global/local, and natural/cultural. Students will be able to describe how various scholars and artists have conceptualized the agency of human and nonhuman actors. This course will suggest that the &quot;cyborg&quot; is an especially useful analytic for looking at the construction of social categories that can deeply impact our daily practices, intimacies, livelihoods, and visions for the future."}, {"name": "Learning Objectives", "value": "By the end of the semester students will have an introduction to thinking critically about the relationships between gender, sexuality, race, and knowledge production, technoscience, and categories of identity. We will be dealing with some difficult texts?texts that are visual, tactile, and may be emotionally triggering. Building a community with your classmates is integral. To this end, students will form small groups for the quarter, culminating in a final presentation at the end of the semester. Small groups will meet regularly and discuss the readings and/or films. In addition to attendance, students are expected to be active participants in class and demonstrate proficiency with assigned readings."}, {"name": "Evaluation Method", "value": "? Reading memos, due every other week, reflecting on the readings and your cohort meeting of the past week (400 words) <br/>? One final presentation in Week 9 with your student cohort (10 min)<br/>? Final paper (12 pages for undergraduates; 18 pages for graduate students) due Week 10"}, {"name": "Class Materials (Required)", "value": "Ashby, Madeline. 2012. vN. New York: Angry Robot Press (Penguin Random House). <br/>978-0857662620<br/><br/>Bacigalupi, Paolo. 2009. The Windup Girl. San Francisco: Night Shade Books. <br/>9781597801584"}], "lmod": "12/24/16 6:53 PM (CT)", "subject": "ANTHRO"}]