[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:50PM", "meet_l": "Annie May Swift Hall 103"}], "school": "SoC", "enrl_requirement": "", "qtr": "Fall 2016", "name": "17512", "title": "SoC PERF_ST 328-0-20 Studies in James Joyce", "class_attributes": "", "section": "17512", "instructors": [{"instructor_phone": "", "instructor_name": "Carol Simpson   Stern", "instructor_addr": ""}], "topic": "Ulysses and Dubliners", "course": "328-0", "descriptions": [{"name": "Overview of class", "value": "This course will introduce students to Joyce's short stories in Dubliners and then move to an immersive engagement with Ulysses, a work that cries out to be performed and benefits enormously by being discussed, workshopped, and read aloud in class. It is a tour do force in any terms, influencing numerous writers and it is especially rich as a source of material for actors and directors. There will be two rounds of solo or group performances, short quizzes, two papers, a mid-term (l hr) and a final performance, solo or group. The Final performances constitute the final examination. Background information about IrIreland's history and Homer's The Odyssey ?will be woven into the course. Many students across many years attest to the powerful influence of this course on their reading and performing. And, the course is challenging and fun!"}, {"name": "Registration Requirements", "value": "One 200-level performance studies class recommended."}, {"name": "Teaching Method", "value": "Class enrollment is limited to 20 to allow students to enter actively into all that takes place in class. Although there will be an occasional lecture, most of the class will be conducted through workshops/performance/and discussion. Often we will experiment with different ways to perform Joyce's text in class, making sure we all understand the passages we are working with and then translating the words into performance."}, {"name": "Class Materials (Required)", "value": "James Joyce, ULYSSES (Vintage International Edition, 1990)<br/>James Joyce, DUBLINERS (Oxford, 2008)"}, {"name": "Class Materials (Suggested)", "value": "Don Gifford, ULYSSES ANNOTATED <br/>Stuart Gilbert, JAMES JOYCE'S ULYSSES<br/>James Joyce, DUBLINERS (Oxford, 2008)<br/>James Joyce, PORTRAIT OF THE ARTIST AS A YOUNG MAN (Penguin 2008)<br/>Homer, THE ODYSSEY (Fagel Translation)"}], "lmod": "10/30/16 6:50 PM (CT)", "subject": "PERF_ST"}]