[{"school": "WCAS", "overview_of_class": "Media hoaxes, copies, and remixes have existed for centuries. But is anything different about these phenomena in our digital age? For instance, since it's so easy to copy and remix digital data, do we do so more often? Do people feel pressure to make things up because they must produce content more frequently, faster, and across more platforms than ever before? Do technology and its crowd-sourcing capabilities render lies and thefts easier to uncover? In this course, we will explore answers to these questions as we examine several historic and contemporary examples of hoaxes, copies, and remixes. We'll ask questions about both the positive and negative aspects of such examples with the ultimate aim of discovering what they can show us about broader concepts such as individuality, uniqueness, and authenticity. Students will also have the opportunity to engage in independent research on a hoax, theft, or remix of their choosing.", "name": "First-Year Seminar", "section": "20", "topic": "Lying, Cheating, &amp; Stealing", "course": "105-6", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4610/WCAS/ENGLISH/105-6/23149", "instructor": ["Elizabeth Anne Lenaghan"], "id": "23149", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "Ever since Pentheus' fatal decision to spy on the revels of Dionysus, audiences have had a guilty fascination with the spectacle of addiction?a fascination which crosses not only centuries but disciplines, captivating scientists, policymakers, philosophers, artists, and laypeople alike. This class will trace the evolution of literary representations of addiction across several centuries, from classical depictions of god-induced madness, through the Gothic narratives of Poe and Stevenson, temperance classics such as Ten Nights in a Barroom (whose impact has often been compared to that of Uncle Tom's Cabin), to the twentieth- and twenty-first century comedies and confessionals that make the bestseller lists today.  Through these readings and related critical texts, we will examine the ways that such literature provides a staging ground for public controversy and emerging theories about the artistic, cultural, ethical, and scientific significance and ramifications of addiction. <br/><br/>Course discussions will also consider how recent literature?both popular and scientific?expands the definition of addiction to include an ever-increasing array of behaviors (such as eating disorders, gambling, and compulsive shopping), in ways that may point to both patterns in contemporary culture and new directions for scientific research into the perennial problem of &quot;disrupted free will.&quot;<br/><br/>Course readings/viewing will include works of fiction and non-fiction as well as popular films.  We will also consider practical topics such as how University library resources and experts can help students locate and evaluate key sources and develop authoritative arguments.", "name": "First-Year Seminar", "section": "21", "topic": "Literatures of Addiction", "course": "105-6", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4610/WCAS/ENGLISH/105-6/23150", "instructor": ["Kathleen   Carmichael"], "id": "23150", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "What creates community, why is community important, and who is considered a member? How does community affect personal identity, and in a democracy, does diversity enhance or challenge community? In this course, we will explore what you believe about community; consider the kind of community you have, or want, at home and at Northwestern; and then look more broadly at some forces that build or erode community. In this last area, we will examine the exploding prison population that threatens American communities and local programs designed to counter that trend. Each student will complete a final project that considers community in relation to a field of his or her choice, such as journalism, law, medicine, public policy, or higher education. At the same time, as we encounter the different genres in which people write about community-e.g. personal narratives, opinion pieces, academic studies-you will acquire techniques for becoming a more flexible and effective communicator, and thus a more powerful advocate for your values and beliefs.", "name": "First-Year Seminar", "section": "22", "topic": "Writing about Community &amp; Identity", "course": "105-6", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4610/WCAS/ENGLISH/105-6/23151", "instructor": ["Penny Gail Hirsch"], "id": "23151", "subject": "ENGLISH"}]