[{"school": "WCAS", "overview_of_class": "BLACK HOLES, NEUTRON STARS, PULSARS, AND ALL THAT There are two books to read for this class. These are both Sci-Fi books, but both authors sprinkled in some real astronomy. We will read in parallel the two books for this class. For Gateway, the reading will be about 18 pages/per discussion session. For the Dragon's Egg start with page 1 and read about 21 pages/discussion, except the last one where 6 more pages need to be read. Therefore the required reading is only about 68 pages week. At 1 minute per page, you won't be \"hurting.\" You should spend most of your time that you devote to this class to writing papers. This is not a lecture class devoted to teaching you many detailed facts about compact objects (black holes and neutron stars) nor is the expectation that you spend most of you writing assignment time on researching your topic. Each class will have a student discussion leader. The discussion topics can be science issues, history related (the black hole book), or how you found the writing (e.g. exceptionally good or bad, and give examples and talk about why). At the end of the quarter, the discussion time will be replaced by 10 minute presentations by each student. Facilities will be provided for either overhead or power point presentations .", "name": "First-Year Seminar", "section": "20", "location": "Dearborn Observatory 23", "topic": "Black Holes, Neutron Stars, Pulsars & all that", "course": "110-6", "meeting_time": ["MoWe 9:30AM - 10:50AM"], "path": "/class-descriptions/4640/WCAS/ASTRON/110-6/13898", "instructor": ["Melville P Ulmer"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "13898", "subject": "ASTRON"}, {"school": "WCAS", "overview_of_class": "Human perception and understanding of the universe has changed dramatically over the centuries. Astronomers used to believe that objects in the Heavens were attached to great crystalline spheres that moved about the Earth with accompanying music. Today, astronomers believe that the Heavens are dominated by a mysterious \"dark energy\" force that may ultimately tear the universe apart. On top of that, some physicists think that everything from electrons to gravity itself is made of vibrating loops of string-like energy moving through 11-dimensional space. Which is stranger? You decide. We will discuss (in a non-mathematical fashion) how our view of the cosmos has evolved thanks to the work of Galileo, Hubble, Einstein, Schrödinger and many others. We will explore not just their ideas, but also the intellectual struggles and the drama behind those ideas.", "name": "First-Year Seminar", "section": "21", "location": "Dearborn Observatory 23", "topic": "Perceptions of the Universe", "course": "110-6", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4640/WCAS/ASTRON/110-6/17455", "instructor": ["Michael F Smutko"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "17455", "subject": "ASTRON"}]