[{"class_mtg_info": [{"meet_t": "MoTuThFr 12:00PM - 12:50PM", "meet_l": "Kresge Centennial Hall 2-335"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Prerequisite: Students must have passed Chinese 121-3 with at least a C- or be placed in according to placement test results.<br/><br/>Prerequisite: Students must have passed Chinese 121-3 with at least a C- or be placed in according to placement test results.", "qtr": "Fall 2016", "name": "10656", "title": "WCAS CHINESE 211-1-22 Chinese III", "class_attributes": "", "section": "10656", "instructors": [{"instructor_phone": "8474674419", "instructor_name": "Hong   Jiang", "instructor_addr": "1880 Campus Drive, Kresge Hall, Office 4-437"}, {"instructor_phone": "847/467-1548", "instructor_name": "Jingjing   Ji", "instructor_addr": "1880 Campus Drive, Kresge Hall, Office 4-435"}], "topic": "", "course": "211-1", "descriptions": [{"name": "Overview of class", "value": "CHINESE 211 is a year-long intermediate-level course, designed to further develop students' communicative competence in listening, speaking, reading and writing in modern Chinese as well as to deepen understanding of Chinese culture and social issues. Student-centered communicative activities will follow instructor-led introduction to lesson vocabulary and sentence structures. Students will learn the use of the language for description and comparison through various tasks and activities. Chinese is the means of instruction. Upon satisfactory completion of the whole sequence course, students are expected to reach Intermediate-High level of the ACTFL proficiency guidelines."}, {"name": "Registration Requirements", "value": "Students must pass the preceding course with C- or above, or must be placed into the course by the departmental placement test."}, {"name": "Teaching Method", "value": "Student-centered communicative activities following instructor-led introduction to lesson vocabulary and sentence structures. Class conducted mostly in Chinese."}, {"name": "Evaluation Method", "value": "Class attendance and participation, homework, oral and written quizzes, projects, final oral and written exam."}, {"name": "Class Materials (Required)", "value": "Developing Chinese Fluency Textbook ($64) and Workbook ($43); Author: Phyllis Zhang; Publisher: Cengage Learning. ISBN: 978-1-111-34223-4."}], "lmod": "10/30/16 7:02 PM (CT)", "subject": "CHINESE"}]