[{"class_mtg_info": [{"meet_t": "Mo 6:15PM - 9:15PM", "meet_l": "Wieboldt Hall 409"}], "school": "SCS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "37886", "title": "SCS FINANCE 363-CN-12 Financial Markets and Institutions", "class_attributes": "", "section": "37886", "instructors": [{"instructor_phone": "", "instructor_name": "William J Arndt", "instructor_addr": ""}], "topic": "", "course": "363-CN", "descriptions": [{"name": "Overview of class", "value": "We will investigate the functions and operations of the major types of financial institutions and markets. Special emphasis will be placed on the commercial banking industry. We will look at the major risks that these players face on a daily basis and how they use financial derivatives to minimize those risks. We will conclude the course by considering how financial institutions in different countries and times reflect the political structures of those institutions, and the implications of such for a meaningful restructuring of the American financial system."}, {"name": "Registration Requirements", "value": "Prerequisite: FINANCE 202."}, {"name": "Learning Objectives", "value": "An appreciation of the roles that financial institutions and markets play in the global economy. Also, an appreciation of the types of risks faced by these institutions and some key ways they handle those risks. Finally, students will gain an appreciation of the role of cultural values and political structure in the evolution of financial institutions throughout the world at various times."}, {"name": "Teaching Method", "value": "Lectures/discussions; readings; problem sets"}, {"name": "Evaluation Method", "value": "Midterm exam, final exam, presentation, homework"}, {"name": "Class Materials (Required)", "value": "Suggested textbook: Financial Institutions Management: A risk Management Approach, by Saunders and Cornett. 8th Edition. Earlier edition is fine too. Required reading: Fragile by Design: The Political Origins of Banking Crises and Scarce Credit by Calomiris and Haber."}], "lmod": "4/3/16 7:32 PM (CT)", "subject": "FINANCE"}]