[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Fisk Hall 114"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "38241", "title": "WCAS GERMAN 366-0-20 The Rise and Fall of Modern Yiddish Culture", "class_attributes": "", "section": "38241", "instructors": [{"instructor_phone": "847/467-4712", "instructor_name": "Marcus G Moseley", "instructor_addr": "1800 Sherman, Suite 106"}], "topic": "", "course": "366-0", "descriptions": [{"name": "Overview of class", "value": "The Yiddish language is the most widespread of Jewish diaspora languages in world history. Prior to World War II, the language was spoken and read by around twelve million Jews, that is 40% of the global Jewish population. <br/><br/>From the late nineteenth century on, there began to develop a distinctively modern, secular Yiddish literature. By an extraordinarily accelerated process of development Yiddish literature essentially achieved in less than a century what had been in European literature in the course of half a millennium.<br/><br/>Following the Holocaust, secular Yiddish literature and culture survived as a spectral, haunted remnant. While this magnificent literature is well represented in English translation, it remains for the most part a dark continent for the increasing number of students pursuing studies in fields outside Jewish Studies for whom Jewish history and culture is of significant or central concern.<br/><br/>This course is aimed toward such students and provides an overview of emergence of a modern Jewish language and literature from consideration of the three classic writers-Mendele the Bookseller; Y.L. Peretz; Sholem Aleichem?to high Yiddish modernist poetry in early 20th Century America; the post-Holocaust poetry of Avrom Sutzkever and the Isaac Bashevis-Singer phenomenon. <br/><br/>Questions to be addressed include: What is a belated literature? What is a minor literature? What is national literature? What is dead literature? Can Diaspora literature, stateless, landless, constitute a trans-territorial, stateless state (a &quot;make-believe territory&quot;?Kemoy teritorie in the formulation of one leading Yiddish thinker)? Where, why and how does Yiddish survive in literature written in non-Jewish languages, by Jews and non-Jews? Do we find a parallel to this odd universal life in death/death in life and elsewhere? It is hoped that student will bring theoretical perspectives derived from their own fields to bear upon the texts studied."}, {"name": "Learning Objectives", "value": "A significant number of graduate students in the Humanities, literature and history in particular, place particular emphasis upon the Jewish aspects of their scholarly enterprises. However, many of these students, housed in departments of English, French, German, History, Slavic literatures etc., have had no background in Jewish Studies. The aim of the present course is to provide such graduates with an apprenticeship in modern Jewish cultural and literary history by means of close reading of and meditation upon, key Yiddish documents that illuminate the transformations of Jewish culture in Europe and the impact of these transformations in the shaping of European modernity."}, {"name": "Evaluation Method", "value": "Two informal oral presentations, Class Participation and a Final Paper."}], "lmod": "4/3/16 8:02 PM (CT)", "subject": "GERMAN"}]