[{"class_mtg_info": [{"meet_t": "We 6:00PM - 9:00PM", "meet_l": "Meets in Non-General PurposeRm"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Winter 2016", "name": "27715", "title": "WCAS GEN_LA 280-5-11 Residence-Linked Seminar - V (Ethics &amp; Values)", "class_attributes": "Ethics &amp; Values Distro Area<br/><br/>", "section": "27715", "instructors": [{"instructor_phone": "", "instructor_name": "John Carl   Kupetz Jr", "instructor_addr": ""}], "topic": "The Seven Deadly Sins as Portrayed in Cinema", "course": "280-5", "descriptions": [{"name": "Overview of class", "value": "&quot;The Seven Deadly Sins as Portrayed in Cinema&quot; aims first to help students distinguish between exploitation and exploration in cinematic art. It will focus on how cinematic artists have used their art form to explore and try to explain human conduct as well as complex and serious moral, philosophical, social, political, and psychological issues and themes within the context of the seven deadly sins. In addition, it will explore how an analysis of cinematic art can be enhanced by viewing a film through the thematic lens of the deadly sins. The class will examine why this theme has attracted and influenced so many directors and why it persists as a useful means of exploring a layer of meaning in a cinematic work. <br/><br/>In both realistic and expressionistic styles, American as well as international directors have made films influenced by notions of good and evil. While the concept of the deadly sins has its roots in religious beliefs, these notions of sin, punishment, good and evil show their influence on artists and audiences whose belief systems range from the believer to the non-believer. In the hands of serious artists, the films challenge illusions audience hold about morality and social order as well as existence itself. In horror films, the debate is often over which is the monster. In gangster films, the debate is often over who is the worse criminal. In western films, the debate is often what separates the outlaw from the sheriff. Students thus also will observe how the tension in defining the sins themselves continues to reflect and shape cultural, political, social and philosophical conflicts. The course specifically offers students the opportunity to integrate skills and concepts learned in previous courses and to synthesize questions explored in such areas as comparative religion, philosophy, ethics, culture, psychology, political science, history and sociology as well as social justice. The films viewed for this seminar hope to explore how notions of sin, punishment and redemption are complex and elusive. Finally, the course should offer students the opportunity to consider how to evaluate films by how willing they are to challenge the assumptions and deeply held beliefs of the audience."}, {"name": "Learning Objectives", "value": "After taking this course, students should be able to show they can:<br/><ul><br/><li>Describe in broad terms how popular understanding of the seven deadly sins has influenced the creation and interpretation of cinematic art. </li><br/><li>Identify genre conventions and describe how those conventions work to explore notions of sinful conduct. </li><br/><li>Analyze the use of expressionistic and realistic styles in exploring themes of sin, punishment and redemption. </li><br/><li>Recognize how cinematic artists introduce invented elements into their creations to confound the moral assumptions and conventional expectations of the cinematic audience. </li><br/><li>Explain and analyze how a cinematic artist explores serious social criticism through the notion of sin. </li><br/><li>Recognize scholarly debate and critically evaluate evidence used to support interpretation and assessment of artistic contributions to the cinematic arts. </li><br/><ul>"}, {"name": "Teaching Method", "value": "The course will include some lecturing but will mainly use guided discussions."}, {"name": "Evaluation Method", "value": "Students will work in two-person teams and lead discussion of the films to be viewed for each class. Each team also will choose a film for the class to view and will present a report placing that film in the context of the course. Students will be expected to participate actively in all discussions when they are not leading a panel or presenting a report. Students will submit substantive analytical essays for a take-home midterm and take-home final. The midterm will have three essay prompts and the final will have two, each asking the student to incorporate independent research and analysis with class discussions."}], "lmod": "1/9/16 6:47 PM (CT)", "subject": "GEN_LA"}]