[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "University Hall 102"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "31443", "title": "WCAS MENA 390-6-20 Advanced Topics in Middle East &amp; North African Studies", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "31443", "topic": "World Literature in a Comparative Frame: Narrative", "course": "390-6", "descriptions": [{"name": "Overview of class", "value": "Course taught by Rabih Alameddine, award-winning novelist. Rabih Alameddine, the bestselling author of &quot;An Unnecessary Woman&quot; and &quot;The Hakawati&quot; is teaching at Northwestern during the spring quarter only as the Center for Writing Arts' Visiting Author-in-Residence. One of the foremost Arab American writers of his generation, his most recent novel &quot;An Unnecessary Woman&quot; won the 2015 Arab American Book Award, the California Book Award, and was a finalist for the National Book Award. <br/><br/>This course addresses the question how one can tell a story. Basically, we look at the idea that &quot;no matter how good a story is, there's more at stake in the telling.&quot; It is a premise of the course that how one writes is more interesting than what one writes, but of course, &quot;how&quot; is informed and determined by &quot;what,&quot; as well as &quot;why.&quot; So subject matter informs and determines style, form, and structure, and vice versa. We will approach these questions by reading a variety of novels and some short stories by authors from a number of different national contexts. Authors will likely include W.G Sebald (The Emigrants), Claudio Magris (Microcosms), Antonio Muñoz Molina (Sepharad), Tayeb Saleh (Season of Migration to the North), Marguerite Yourcenar (Memoirs of Hadrian), Doris Lessing, Sadegh Hedayat (The Blind Owl), Gabriel García Márquez (Love in the Time of Cholera)."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "papers, presentations, classroom participation"}, {"name": "Class Materials (Required)", "value": "Authors will likely include W.G Sebald (The Emigrants), Claudio Magris (Microcosms), Antonio Muñoz Molina (Sepharad), Tayeb Saleh (Season of Migration to the North), Marguerite Yourcenar (Memoirs of Hadrian), Doris Lessing, Sadegh Hedayat (The Blind Owl), Gabriel García Márquez (Love in the Time of Cholera)."}], "lmod": "4/3/16 8:12 PM (CT)", "subject": "MENA"}]