[{"class_mtg_info": [{"meet_t": "MoWeFr 10:00AM - 10:50AM", "meet_l": "Harris Hall L05"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Winter 2016", "name": "25417", "title": "WCAS ENGLISH 101-6-20 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "25417", "instructors": [{"instructor_phone": "", "instructor_name": "Christopher Daniel Shirley", "instructor_addr": ""}], "topic": "Sex and the Renaissance", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "In many respects, the culture of Renaissance England held startling views on gender, sex, and sexuality. Medical authorities in the period thought that female genitalia was essentially inverted male genitalia, and that it was prone to spontaneous reversals that could make women into men; Renaissance men (all Renaissance men) were thought to be particularly prone to homoerotic desire in their youth; and poetry was seen as both threatening as an incitement to illicit sexual desires and ennobling as a tool with which to transform sexual pleasure into spiritual exaltation. This course will consider Renaissance representations and conceptualizations of sex, gender, and sexuality, primarily in poetry and also in prose, visual art, and theatre. How did physicians, philosophers, and others think about and represent gender and sexuality? How did poets, playwrights, essayists, and visual artists adopt and adapt their culture's views in their artistic practices? What insight into our cultures' views of gender, sex, and sexuality does the culture of Renaissance England provide us?"}, {"name": "Teaching Method", "value": "Discussion"}, {"name": "Evaluation Method", "value": "Participation (20%), Full Papers (60%), Small Group Presentation (10%), Response Papers (10%) Students will write three longer papers, two each of five pages and one of seven pages, as well as three short response papers of one to two pages."}, {"name": "Class Materials (Required)", "value": "We will read several poems from the most prominent poets of the Renaissance, including Thomas Wyatt, Philip Sidney, John Donne, William Shakespeare, and Andrew Marvell. We will also read short prose pieces by essayists such as Francis Bacon and Michel de Montaigne, works by Renaissance visual artists, and a play, The Roaring Girl, by Thomas Middleton and Thomas Dekker. Short readings by contemporary scholars will also be assigned to comment on our primary readings. The course will conclude with some contemporary material, such as episodes of the Showtime television series The Tudors and the film Shakespeare in Love, which will allow us to consider how sex in the Renaissance continues to fascinate and influence us in the twenty-first century. Norton Anthology of English Literature (Ninth Edition), Vol. B: The Renaissance and the Early Seventeenth Century (ISBN: 0393912507); Middleton and Dekker, The Roaring Girl (ISBN: 039393277X); course pack."}], "lmod": "1/9/16 6:46 PM (CT)", "subject": "ENGLISH"}]