[{"school": "WCAS", "overview_of_class": "\"War is men's business, not ladies',\" so we are told in \"Gone with the Wind.\" Catastrophic events in the twentieth century (two world wars, the Russian Revolution, world economic depression, the Nazi counter-revolution and Holocaust, and threat of nuclear war) demolished long standing myths that men go forth and fight in order to protect their women and children, who remain passive and secure at home. In the twentieth century, military strategy and technology blurred the boundaries between war zones and home fronts. Not only did civilian populations become military targets, but the strains of war also exposed them to food shortages, fuel rationing, forced evacuations, and violent death. At the same time, disillusioned soldiers and veterans saw their war experiences through the threat of gender inversions. During the war, women had been mobilized to do men's work. In the 1920s and ?30s, the \"new woman\" of the century - building on the beginnings of legal equality and the vote - enjoyed greater economic, political, intellectual, and sexual freedoms than their nineteenth century grandmothers and great-grandmothers. If conventional warfare was defined by (and reinforced) traditional notions of masculinity and femininity, did the disruption of those norms mean emancipation for women? Did the war open up utopian hopes for all forms of alternate gender and sexual alignments? Ultimately, was a traditional gendered social order restored after the half century of total war and revolutions? Despite the much touted return to happy domesticity, could the genie of sexual malcontent be ever fully re-contained?", "name": "Gender, Sexuality and History", "section": "20", "location": "University Hall 121", "topic": "Gender, War, and Revolution in the 20th Century", "course": "321-0", "meeting_time": ["MoWe 10:00AM - 10:50AM"], "path": "/class-descriptions/4640/WCAS/GNDR_ST/321-0/12232", "instructor": ["Tessie P Liu"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "12232", "subject": "GNDR_ST"}, {"school": "WCAS", "overview_of_class": "", "name": "Gender, Sexuality and History", "section": "21", "location": "Parkes Hall 212", "topic": "Female Pleasure: Feminism & Sexological Trad", "course": "321-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4640/WCAS/GNDR_ST/321-0/17566", "instructor": ["Amy Ruth Partridge"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "17566", "subject": "GNDR_ST"}]