[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Locy Hall 314"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Freshmen may not register for this course.", "qtr": "Winter 2016", "name": "24970", "title": "WCAS HISTORY 395-0-30 Research Seminar", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "24970", "instructors": [{"instructor_phone": "847/491-3154", "instructor_name": "Ipek Kocaomer Yosmaoglu", "instructor_addr": "Harris Hall Room 214"}], "topic": "World War I in the Middle East", "course": "395-0", "descriptions": [{"name": "Overview of class", "value": "The past year marked the centennial of the outbreak of WWI, inspiring various conferences, exhibitions, seminars and other public events commemorating a global war that had started as a small conflagration in Southeast Europe. This seminar will focus on an aspect of the Great War that has largely been ignored in popular histories, namely, its impact on the Middle East/North Africa region. Going beyond the romantic image of Lawrence leading the Bedouins against Ottoman domination, this seminar will explore how WWI shaped the Middle East as we know it. The imposition of colonial/mandate borders at the war's end is a well-known aspect of this history, but we will also explore the deep impact of the war on society. Our focus will be on the Ottoman Empire, the only Middle Eastern state that entered the war as an independent entity. We will discuss the war experience of soldiers and common people; the changing gender dynamics; social and ethnic engineering policies; and the international context for post-war settlements."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Class participationClass participation and a research paper"}, {"name": "Class Materials (Required)", "value": "Course Packet"}, {"name": "Class Notes", "value": "HISTORY AREA OF CONCENTRATION: Europe/Asia/Middle East"}], "lmod": "1/9/16 6:48 PM (CT)", "subject": "HISTORY"}]