[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "555 Clark B03"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "17198", "title": "WCAS GNDR_ST 382-0-21 Race, Gender, and Sexuality", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "17198", "instructors": [{"instructor_phone": "847/467-7114", "instructor_name": "Douglas Sadao Ishii", "instructor_addr": "Crowe Hall, Room 1117"}], "topic": "Asian Am Gender &amp; Sexualities", "course": "382-0", "descriptions": [{"name": "Overview of class", "value": "Lotus Blossoms, Yellow Fever, Asian Geeks: U.S. popular culture is filled with gendered images of Asian Americans that speak not only about race, but sex. As &quot;model minorities&quot; and &quot;forever foreigners,&quot; Asian and Asian American people are thought to have regressive views on gender roles and sexual norms and identities; these preconceptions make Asian American feminisms and LGBTQ organizing incomprehensible to many. Yet, many Asian Americans may have experienced gendered, sexual, or homophobic violence in their own lives. We will begin this course by reading through the rich writings of Asian American feminism for a historical and theoretical basis. Then, through multidisciplinary scholarship and cultural texts about Asian American genders and sexualities, we will discuss issues including, but not limited to, masculinities, femininities, feminisms, LGBTQ identities in Asian America, interracial and intraracial relationships, dating and marriage, queer of color critique, and families. We will end the course by conducting original interdisciplinary research on social and cultural questions at the intersection of race, gender, and sexuality."}, {"name": "Teaching Method", "value": "DiscussionLecturePresentationsReadingsWriting assignments- To theorize the co-construction of race, gender, and sexuality, and apply that intersectional lens to social and cultural texts<br/>- To analyze how personal experiences at the intersection of race, gender, and sexuality connect to cultural ideologies and representations, as well as to larger structural and historical forces<br/>- To understand the historical, social, and political contexts for Asian American feminisms and LGBTQ organizing<br/>- To practice socially engaged, interdisciplinary research and writing skills"}, {"name": "Evaluation Method", "value": "Class participationExamsField workPresentationsWriting assignments"}, {"name": "Class Materials (Required)", "value": "Chou, Rosalind S. Asian American Sexual Politics: The Construction of Race, Gender, and Sexuality (Rowman &amp; Littlefield Publishers, reprint ed., 2015) ISBN: 978-1442209251<br/>Espiritu, Yen Le. Asian American Women and Men: Labor, Laws, and Love (Rowman &amp; Littlefield Publishers; 2nd ed, 2007) ISBN: 978-0742560611<br/><br/>Recommended but will be available online<br/>Asian Women United of California. Making Waves: An Anthology of Writings By and About Asian American Women (Beacon Press, 1989) ISBN: 978-0807059050<br/>Masequesmay, Gina, and Sean Metzger, eds. Embodying Asian/American Sexualities (Lexington Books; Reprint ed., 2010) ISBN: 978-0739129043"}], "lmod": "10/30/16 7:05 PM (CT)", "subject": "GNDR_ST"}]