[{"class_mtg_info": [{"meet_t": "MoWeFr 9:00AM - 9:50AM", "meet_l": "Technological Institute L361"}], "school": "MEAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "30439", "title": "MEAS BMD_ENG 303-0-01 Systems Physiology", "class_attributes": "Prerequisites apply, see description<br/><br/>", "section": "30439", "instructors": [{"instructor_phone": "847/491-3043", "instructor_name": "Robert A Linsenmeier", "instructor_addr": "Tech Institute, Room E368, 2145 Sheridan Rd., Evanston"}], "associated_classes": [{"component": "DIS", "room": "Tech Institute Lecture Room 4", "meeting_time": "Th 2:00PM - 2:50PM"}, {"component": "DIS", "room": "Tech Institute Lecture Room 4", "meeting_time": "Th 3:00PM - 3:50PM"}], "topic": "", "course": "303-0", "descriptions": [{"name": "Overview of class", "value": "Cellular mechanisms of and quantitative systems approach to human renal, digestive, endocrine, and metabolic physiology.<br/><br/>BME 303 covers human renal, digestive, endocrine and metabolic physiology, at a relatively detailed systems level and with reference to diseases of these systems. Includes basic biochemistry of energy metabolism, and introductions to pharmacokinetics and immunology. The course is unified by a focus on metabolism, epithelial cell transport, and regulation. Evaluation is by several quantitative homework sets, use of clickers to answer questions in class, and three exams.<br/><br/>Required core course for BS in BME. Generally taken by juniors, but can be taken as early as sophomore year or as late as senior year. May be taken without BME 301 or BME 302, but BME 303 refers to material from those courses, and is more difficult if taken as the first course in the sequence."}, {"name": "Registration Requirements", "value": "Junior standing recommended."}, {"name": "Learning Objectives", "value": "Membrane Transport<br/> Water balance<br/> Renal physiology<br/> Control theory<br/> Energy metabolism<br/> Endocrine regulation of energy metabolism<br/> Autonomic and enteric nervous systems<br/> Gastrointestinal system<br/> Temperature regulation<br/> Pharmacokinetics<br/> Neuroendocrine systems<br/> Calcium regulation<br/> Immunology"}, {"name": "Class Materials (Required)", "value": "Silverthorn, D.U. Human Physiology, 6th ed. Students will also need a Turning Technologies &quot;clicker.&quot;"}], "lmod": "2/20/17 6:34 PM (CT)", "subject": "BMD_ENG"}]