[{"school": "JOUR", "overview_of_class": "Shopper Marketing is marketing to consumers who are in a &quot;shopping mode&quot; including being in a retail store. It is comprised of category management, retail display, personal selling, packaging, promotion, research and marketing brought together in retailer-specific programs designed to fit the mutual interests of brands and retailers. The course covers the core practices of shopper marketing, including understanding consumers in a shopping mode, and developing insights that drive the most successful shopper marketing programs. Students learn to deal with the sometimes conflicting interests of retailers and manufacturers in their efforts to influence their shared target consumers. Students identify best practices for executing and measuring the wide variety of in-store, near-store and online tactics and put these practices into use through a course-long shopper marketing project for a sponsoring company.", "name": "Special Topics", "section": "22", "topic": "Shopper Marketing", "course": "490-0", "meeting_time": ["Tu 6:00PM - 8:50PM"], "path": "/class-descriptions/4640/JOUR/IMC/490-0/13090", "instructor": ["April Lynn Carlisle", "Elizabeth T Harris"], "id": "13090", "subject": "IMC"}, {"school": "JOUR", "overview_of_class": "IMC Leadership focuses on how students' success as future leaders is allied to their ability to be part of an organization's growth. Each student may aspire to a different position, but all will develop leadership skills. Some students may want to lead marketing departments and others may want to lead companies, non-profits or government agencies. Some will work in global enterprises and others will have local customers. A few may become entrepreneurs. Many of the attributes of leadership and good management are applicable across industry and sector. First, the course looks at how students inspire others, a central aspect of leadership. How does each student communicate verbally and effectively to others? Then the course looks at organizational development, the skills students need to run organizations, and how to manage innovation. Students use readings, role-playing, and discussion to improve their experience with managing and overseeing talent, organization, economics and finance, accountability and business planning. So, the course begins with a student view of the organization and finishes with thought leadership and business planning for growth. Students will be expected to participate in class and make oral presentations. Students should view this course as an opportunity to grow as communicators within an organization. Students who complete this course will communicate ideas orally in presentations; become self-aware of areas of development; participate effectively in organizations as an employee, manager, team member, leader; explore and engage in economics, finance and management literacy; and create and evaluate growth plans for businesses.", "name": "Special Topics", "section": "23", "topic": "IMC Leadership", "course": "490-0", "meeting_time": ["We 6:00PM - 8:50PM"], "path": "/class-descriptions/4640/JOUR/IMC/490-0/13091", "instructor": ["Candy   Lee"], "id": "13091", "subject": "IMC"}, {"school": "JOUR", "overview_of_class": "Customer Value Innovation focuses on the uncertain and dynamic nature of innovation in the context of marketing communications and customer experiences. The course addresses key questions about how organizations innovate to create better value to strengthen the relevance of organizations to customers. A key area of emphasis is how organizations improve the way they introduce and nurture continuous value innovation. The course features a hands-on client project in which students develop a strategy for conducting marketing communications to enhance customer value.", "name": "Special Topics", "section": "24", "topic": "Customer Value Innovation", "course": "490-0", "meeting_time": ["Mo 6:00PM - 8:50PM"], "path": "/class-descriptions/4640/JOUR/IMC/490-0/13092", "instructor": ["Jonathan R Copulsky"], "id": "13092", "subject": "IMC"}, {"school": "JOUR", "overview_of_class": "IMC Leadership focuses on how students' success as future leaders is allied to their ability to be part of an organization's growth. Each student may aspire to a different position, but all will develop leadership skills. Some students may want to lead marketing departments and others may want to lead companies, non-profits or government agencies. Some will work in global enterprises and others will have local customers. A few may become entrepreneurs. Many of the attributes of leadership and good management are applicable across industry and sector. First, the course looks at how students inspire others, a central aspect of leadership. How does each student communicate verbally and effectively to others? Then the course looks at organizational development, the skills students need to run organizations, and how to manage innovation. Students use readings, role-playing, and discussion to improve their experience with managing and overseeing talent, organization, economics and finance, accountability and business planning. So, the course begins with a student view of the organization and finishes with thought leadership and business planning for growth. Students will be expected to participate in class and make oral presentations. Students should view this course as an opportunity to grow as communicators within an organization. Students who complete this course will communicate ideas orally in presentations; become self-aware of areas of development; participate effectively in organizations as an employee, manager, team member, leader; explore and engage in economics, finance and management literacy; and create and evaluate growth plans for businesses.", "name": "Special Topics", "section": "25", "topic": "IMC Leadership", "course": "490-0", "meeting_time": ["We 9:00AM - 11:50AM"], "path": "/class-descriptions/4640/JOUR/IMC/490-0/17755", "instructor": ["Candy   Lee"], "id": "17755", "subject": "IMC"}]