[{"class_mtg_info": [{"meet_t": "MoWe 1:00PM - 2:50PM", "meet_l": "Block Auditorium"}], "school": "SoC", "enrl_requirement": "", "qtr": "Winter 2016", "name": "22284", "title": "SoC RTVF 312-1-20 History of Film I", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "22284", "instructors": [{"instructor_phone": "", "instructor_name": "Ariel Rebecca Rogers", "instructor_addr": ""}], "associated_classes": [{"component": "DIS", "room": "Annie May Swift Hall 219", "meeting_time": "Fr 1:00PM - 1:50PM"}, {"component": "DIS", "room": "Annie May Swift Hall 219", "meeting_time": "Fr 2:00PM - 2:50PM"}, {"component": "DIS", "room": "Harris Hall L04", "meeting_time": "Fr 1:00PM - 1:50PM"}, {"component": "DIS", "room": "University Library 4670", "meeting_time": "Fr 2:00PM - 2:50PM"}], "topic": "", "course": "312-1", "descriptions": [{"name": "Overview of class", "value": "This course surveys the history of international cinema from its emergence through the 1930s. The course explores the diverse forms cinema took and functions it performed during this formative period by looking closely at a range of films and writings about them. We will examine the industrial, social, and historical contexts within which these films were produced and experienced as well as key theorizations of cinema that emerged concurrently with them. The course thus introduces students to the study of film history as well as to key national and international trends in making and thinking about cinema as it rose to prominence as a vital component of the art and culture of the twentieth century.<br/> <br/>Topics covered include the cinema of attractions; the development of narrative filmmaking in the United States and Europe; the studio systems of Hollywood and Japan; exhibition practices; the concept of national cinemas as exemplified by the cinemas of France, Germany, and the Soviet Union; the avant-garde and cinema's relation to art movements; the coming of synchronized sound; documentary cinema; and diverse conceptualizations of cinema's political possibilities and dangers."}, {"name": "Learning Objectives", "value": "The course will equip students to identify and analyze major movements in film history through the 1930s, compare key scholarly approaches to historicizing cinema, and conduct a research project pertaining to the history of cinema."}, {"name": "Evaluation Method", "value": "Students will be expected to do weekly reading assignments, participate in class discussion, complete short quizzes and essay assignments, write a research paper, and take a midterm and final exam."}, {"name": "Class Materials (Required)", "value": "Kristin Thompson and David Bordwell, Film History: An Introduction, 3rd edition (McGraw-Hill, 2009).<br/>All other readings to be available in a course pack."}], "lmod": "1/9/16 6:39 PM (CT)", "subject": "RTVF"}]