[{"school": "WCAS", "overview_of_class": "Whether described as a flourishing, an explosion, or a blossoming, the renaissance of African American women's writing that began in the 1970s is now commonly accepted as the starting point, if not the signature feature, of what we might consider the long era of contemporary African American literature. How did innovations in form and content push the publishing industry to suddenly open up to black women's literature in unprecedented ways? We will examine first editions and reprints of black women's writing published during the 1970s and 1980s to learn how to read and interpret a number of genres, including novels, short stories, poetry, drama, manifestos, anthologies, and essays. As we develop our skills of reading, interpretation, and revision, we will pay close attention to how literature works?that is, how writers tell stories and craft poems through manipulations of narration, point of view, character, plot, time, meter, voice, imagery, and language. We will explore a number of interpretive possibilities, applying various critical approaches?formalist, Marxist, historicist, poststructuralist, black feminist, critical race, queer, and postcolonial theory?across a wide range of groundbreaking texts.", "name": "Seminar in Reading and Interpretation", "section": "20", "topic": "Contemporary Black Women's Writing", "course": "300-0", "meeting_time": ["MoWe 12:30PM - 1:50PM"], "path": "/class-descriptions/4640/WCAS/ENGLISH/300-0/11966", "instructor": ["Shaundra J Myers"], "id": "11966", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "Charlotte Brontë loathed Jane Austen for her lack of passion; Charlotte Brontë, in turn, was deemed coarse and vulgar by some contemporary critics. In this course we will trace the trajectory of Brontë's most famous novel, Jane Eyre, from the time of its publication in 1847 to the present, when it is still an iconic text. We will begin with Austen's Northanger Abbey in in order to study Austin's send-up of the Gothic novel genre, before moving to the more serious appropriation of that genre in Jane Eyre (and maybe to irritate Brontë just a little on behalf of Austen!). We will then spend time studying Jane Eyre, the novel, its reception, and its literary fate in the 20th century. The ground-breaking critical text, Madwoman in the Attic by Sandra Gilbert and Susan Gubar will be a focus, as well as subsequent critiques of Madwoman. We will also discuss literary appropriations, in particular Wide Sargasso Sea by Jean Rhys. Finally, we will look at Jane Eyre through the lens of popular culture, and draw some conclusions about Jane Eyre and its eponymous character Jane Eyre in the 21st century.", "name": "Seminar in Reading and Interpretation", "section": "21", "topic": "Jane Eyre and Jane's Heirs", "course": "300-0", "meeting_time": ["TuTh 9:30AM - 10:50AM"], "path": "/class-descriptions/4640/WCAS/ENGLISH/300-0/11967", "instructor": ["Mary E Finn"], "id": "11967", "subject": "ENGLISH"}]