[{"class_mtg_info": [{"meet_t": "MoWe 4:30PM - 5:50PM", "meet_l": "Wirtz Center Ballroom"}], "school": "SoC", "enrl_requirement": "Enrollment Requirements: Reserved for Dance and Theater Majors and Minors &amp; Music Theatre Certificate Students<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Spring 2017", "name": "36693", "title": "SoC DANCE 160-0-20 Jazz l", "class_attributes": "", "section": "36693", "instructors": [{"instructor_phone": "847/491-3147", "instructor_name": "William Lewis   Siegenfeld", "instructor_addr": "10 Arts Circle Drive"}, {"instructor_phone": "", "instructor_name": "Joseph J Holtgreive", "instructor_addr": ""}], "topic": "Partnered Swing Dance", "course": "160-0", "descriptions": [{"name": "Overview of class", "value": "Whole-Body Thinking: Partnered Swing Dancing as Source of Collaborative Decision-Making In this approach to swing dancing, the goal is for two people to join hands and use the rhythms they hear in swinging, jazz-rhythm-based music as a means of connecting with each other in both motion and emotion. The partners make these connections physically through the hands; visually through the eyes; and vocally by scat-singing wordless rhythms that reflect the beat of the music they hear playing."}, {"name": "Learning Objectives", "value": "Learning Objectives<br/>How do we connect in these ways? Using the gravity-directed, injury-preventive alignment concept of Standing Down Straight® (SDS), partners work with each other on physically letting go of some of the &quot;holding patterns&quot; of tension in their body that can, unconsciously, accumulate in both the body's muscles and in the mind. Why let go of these excess tensions? It's the proposal of this class that they can oftentimes get in the way of creating mutually beneficial, non-judgmental collaborations with another person or persons, whether in this class, in a rehearsal, in a lab-partnership, or in everyday life. In addition to working at using SDS to gradually replace these holding patterns, partners also focus on working at becoming more adept at sensing when to initiate actions and when to yield. In dance-partnering terms, this form of give-and-take is referred to as sensing when to &quot;lead&quot; and when to &quot;follow.&quot; Such mutuality of leading and following, such equality of giving and receiving with another - as experienced through the hands, eyes and rhythm-singing voice in this class, as mentioned above - forms the foundation of the kind of weight-shared, rhythm-shared dancing we do with our dance partners here. The hope is that, in the future, it can also serve as a foundation for collaborative decision-making as practiced in rehearsals in the performing arts, partnerships in the sciences and other professions, and in everyday relationships."}], "lmod": "2/20/17 6:38 PM (CT)", "subject": "DANCE"}]