[{"class_mtg_info": [{"meet_t": "MoWeFr 12:00PM - 12:50PM", "meet_l": "Kresge 3354 German Seminar Rm."}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "30873", "title": "WCAS GERMAN 245-0-20 Special Topics in German Literature and Culture", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "30873", "instructors": [{"instructor_phone": "847/491-8290", "instructor_name": "Ingrid   Zeller", "instructor_addr": "1880 Campus Drive, Kresge Hall, Rm 3319"}], "topic": "German Architecture in Chicago", "course": "245-0", "descriptions": [{"name": "Overview of class", "value": "This cultural studies course explores the unique history of Chicago In the context of German-American architectural connections. Particular emphasis will be placed on the Bauhaus School and Movement that influenced architectural development in Chicago and its residences Weimar, Dessau, and Berlin. We will discuss the lives, works, and theories of German-born architects, who played a significant role in shaping the Chicago skyline and also designed signature works in Germany, including Ludwig Mies van der Rohe, Helmut Jahn and Dirk Lohan. Course materials are derived from a variety of sources and media, including articles on history and architecture, websites, photographs, paintings, videos, and films. Highlights include the attendance of architectural tours, including a river cruise, and the hands-on exploration of building materials and city neighborhoods."}, {"name": "Teaching Method", "value": "Class participation, Discussion, Fieldtrips, Films/videos, Group work, Guest speakers, Online work, Presentations, Readings, Writing assignments"}, {"name": "Evaluation Method", "value": "Attendance, Class participation, Field trips, Tour presentations, Group work, Homework, Online work, Final project, Quizzes, Writing assignments"}, {"name": "Class Materials (Suggested)", "value": "Course Packet"}], "lmod": "2/6/17 6:44 PM (CT)", "subject": "GERMAN"}]