[{"class_mtg_info": [{"meet_t": "MoWe 12:30PM - 1:50PM", "meet_l": "555 Clark 230"}], "school": "WCAS", "overview_of_class": "This course will focus on the relationship between literature and politics in the Neronian age. The primary materials will consist of a close reading of Seneca's Apocolocyntosis, supplemented by significant portions of Seneca's De Clementia.  While conducting a literary and historical analysis of these texts, students will address two fundamental questions: How does the literature composed and published in the time of the emperor Nero reflect the dominant ideology of the principate? To what extent does it reveal a social and political dissent, as well as an intellectual opposition to the imperial regime, its constraints and degeneration? Selected passages from the lives of Claudius and Nero, as portrayed by Suetonius and Tacitus, will allow us to place our readings in their historical context.", "qtr": "Winter 2016", "name": "Readings in Latin Literature", "title": "WCAS LATIN 310-0-20 Readings in Latin Literature", "lmod": "1/9/16 6:50 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "847/491-8029", "instructor_name": "Francesca   Tataranni", "instructor_addr": "Crowe Hall 3-171"}], "topic": "Literature & Power in the Age of Nero", "course": "310-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "This course will focus on the relationship between literature and politics in the Neronian age. The primary materials will consist of a close reading of Seneca's Apocolocyntosis, supplemented by significant portions of Seneca's De Clementia. While conducting a literary and historical analysis of these texts, students will address two fundamental questions: How does the literature composed and published in the time of the emperor Nero reflect the dominant ideology of the principate? To what extent does it reveal a social and political dissent, as well as an intellectual opposition to the imperial regime, its constraints and degeneration? Selected passages from the lives of Claudius and Nero, as portrayed by Suetonius and Tacitus, will allow us to place our readings in their historical context."}, {"name": "Registration Requirements", "value": "Course Prerequisites: Completion of Latin 201-3 (with a grade of C- or better) or a score of 5 on the AP Latin Exam. All freshmen who qualify for this class should contact the director of Latin instruction Francesca Tataranni (f-tataranni@northwestern.edu) before enrolling."}, {"name": "Learning Objectives", "value": "Students are expected to strengthen their ability to read and understand Latin texts, as well as to discuss scholarship on the author or authors being read during the quarter."}, {"name": "Teaching Method", "value": "Class participation<br/>Discussion<br/>Lecture<br/>Readings"}, {"name": "Evaluation Method", "value": "Attendance<br/>Class participation<br/>Midterm exams (2)<br/>Homework<br/>Final paper<br/>Readings"}, {"name": "Class Materials (Required)", "value": "Seneca, Apocolocyntosis, by P.T. Eden, Cambridge Greek and Latin Classics 1984 - ISBN -13: 978-0521288361<br/><br/>Seneca, Moral Essays, Vol. I (De Providentia. De Constantia. De Ira. De Clementia), translated by J.W. Basore, Loeb Classical Library (Series No. 214), Harvard University Press 1988 - ISBN13: 9780674992368"}, {"name": "Class Materials (Suggested)", "value": "A good Latin dictionary. If buying new, recommended is An Elementary Latin Dictionary, by Charlton L. Lewis, Oxford University Press 1969 - ISBN-13: 978-0199102051."}, {"name": "Class Notes", "value": "RESTRICTIONS: No P/N."}], "path": "/class-descriptions/4610/WCAS/LATIN/310-0/25256", "instructor": ["Francesca   Tataranni"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>Prerequisites apply, see description<br/><br/>", "id": "25256", "subject": "LATIN"}]