[{"class_mtg_info": [{"meet_t": "MoWeFr 9:00AM - 9:50AM", "meet_l": "Technological Institute LG66"}], "school": "MEAS", "overview_of_class": "Deflections of structures, energy concepts, idealization of structures, truss analysis, column stability, and influence lines. Introduction to indeterminate truss and frame analyses, slope-deflection analysis, and moment distribution. Portal method", "qtr": "Fall 2017", "name": "Theory of Structures I", "title": "MEAS CIV_ENV 221-0-01 Theory of Structures I", "lmod": "5/1/17 6:59 PM (CT)", "section": "01", "associated_classes": [{"component": "LAB", "room": "TBA", "meeting_time": "Th 9:30AM - 10:50AM"}], "topic": "", "course": "221-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Deflections of structures, energy concepts, idealization of structures, truss analysis, column stability, and influence lines. Introduction to indeterminate truss and frame analyses, slope-deflection analysis, and moment distribution. Portal method"}, {"name": "Registration Requirements", "value": "1. Classify if a structure is determinate or indeterminate<br/>2. Differentiate a plane truss from a plane rigid frame structure<br/>3. Analyze determinate and indeterminate plane trusses and plane rigid frames<br/>4. Determine the deflection of a structure under load (forces and other types) ? both plane rigid frames and<br/>plane trusses using virtual work<br/>5. Analyze a structure using consistent displacement method, slope deflection, and moment distribution method<br/>6. Use Excel proficiently as a calculation tool for the analyses discussed in the course<br/>7. Analyze a structure using commercial computer software<br/>8. Determine the maximum design force using influence lines<br/>9. Determine stability (buckling load capacity) of axial members<br/>10. Experimental stress analysis of beams and frame"}, {"name": "Learning Objectives", "value": "3b) an ability to design and conduct experiments, as well as to analyze and interpret data<br/>3e) an ability to identify, formulate, and solve engineering problems<br/>3g) an ability to communicate effectively (through proper presentation of homework solution)<br/>3k) an ability to use the techniques, skills, and modern engineering tools necessary for engineering practice"}, {"name": "Class Materials (Required)", "value": "No Formal Text"}], "instructor": ["Karen C Chou"], "class_attributes": "", "id": "11552", "subject": "CIV_ENV"}]