[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "University Library 3370"}], "school": "WCAS", "overview_of_class": "This independent quarterly course is designed to develop students' abilities to read short literary works in the original Chinese, with the continuing improvements of the other three language skills?listening, speaking and writing. Student will learn to read and understand authentic Chinese literary works in different written forms and different language styles by various authors. The course also introduces the social, cultural and historical background of each literary work through supplementary readings and lecture. Students are asked to participate in in-class discussions on assigned texts with a special focus on writing style as well as cultural and social background. The various topics covered in this course will deepen students' understanding of Chinese language, culture and recent history. Chinese is the means of instruction. At the end of the course, students will be able to read and understand Chinese-language short stories in various literary forms and linguistic styles.", "qtr": "Fall 2017", "name": "Chinese IV: Formal Speaking", "title": "WCAS CHINESE 311-1-20 Chinese IV: Formal Speaking", "lmod": "9/12/17 7:07 PM (CT)", "section": "20", "topic": "", "course": "311-1", "enrl_requirement": "Enrollment Requirements: Prerequisite: Students must have passed Chinese 211-3 with at least a C- or  be placed in according to placement test results.<br/><br/>Prerequisite: Students must have passed Chinese 211-3 with at least a C- or  be placed in according to placement test results.", "descriptions": [{"name": "Overview of class", "value": "This independent quarterly course is designed to develop students' abilities to read short literary works in the original Chinese, with the continuing improvements of the other three language skills?listening, speaking and writing. Student will learn to read and understand authentic Chinese literary works in different written forms and different language styles by various authors. The course also introduces the social, cultural and historical background of each literary work through supplementary readings and lecture. Students are asked to participate in in-class discussions on assigned texts with a special focus on writing style as well as cultural and social background. The various topics covered in this course will deepen students' understanding of Chinese language, culture and recent history. Chinese is the means of instruction. At the end of the course, students will be able to read and understand Chinese-language short stories in various literary forms and linguistic styles."}, {"name": "Registration Requirements", "value": "CHINESE 211-3 with grade C- or above. <br/>Students may be placed into this course by the departmental placement test."}, {"name": "Teaching Method", "value": "Class meets 3 hours per week. Students will improve their skills in reading authentic Chinese short literature works through reading and understanding authentic Chinese short short stories . Student will learn how to read and understand authentic Chinese literature works in different written forms and different language styles by different authors. Also, they will learn the social, cultural,historical, or even personal background of each literature work to help them to understand the works better. There are also discussions about the stories, the way/ style of the writing and as well as about the cultural/ socials background. The various topics/themes covered in this course will also help students understand better about the Chinese, their culture and their lives and their emotions. Chinese is the language used in class."}, {"name": "Evaluation Method", "value": "Attendance<br/>classroom participation<br/>Homework<br/>Papers<br/>Oral Presentations"}, {"name": "Class Materials (Required)", "value": "Fall quarter & Winter quarter:<br/>Textbook: Crossing Culture Boundaries (second edition) <br/>Author: Kunshan Carolyn Lee, Hsin-hsin Liang, Liwei Jiao, Julian K Wheatley<br/>ISBN: 978-0-415-77407-9<br/><br/>Spring quarter:<br/>Textbook: Reading Chinese  Short Short Stories <br/>Author: Aili Mu, Ling Mu, Rongzhen Li <br/>Printed by www.lulu.com ISBN: N/A"}], "instructor": ["Chin-Hung   Chang"], "class_attributes": "", "id": "10667", "subject": "CHINESE"}]