[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Kresge Centennial Hall 3-410"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "22901", "title": "WCAS POLI_SCI 390-0-23 Special Topics in Political Science", "class_attributes": "", "section": "22901", "instructors": [{"instructor_phone": "", "instructor_name": "Elizabeth S Hurd", "instructor_addr": "Scott, #209"}], "topic": "Religion and Politics Beyond Freedom", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "&quot;Religion and Politics beyond Freedom and Violence&quot; Prof. Elizabeth Shakman Hurd Winter 2017<br/>This course moves beyond liberal assumptions about religion, secularism and modernity to consider the complex entanglements of religion with human life, law, and public culture in the US and abroad. Beginning with the debates over yoga, the public display of crèches in the United States, and the question of who is a Jew in the United Kingdom, we will then move further afield to reflect on a series of dilemmas involving the law and politics of religious difference in other contexts. The course traverses disciplinary, geographic, and secular-religious boundaries, drawing on readings from politics, socio-legal studies, religious studies, anthropology, history, and popular culture. Students will also consider their own experiences of living with religious diversity, as we explore tools and strategies to think in new ways about the place of religion in the contemporary world."}, {"name": "Learning Objectives", "value": "Students will learn to think critically and clearly about the intersections between religion, law and politics in a variety of national and international contexts."}, {"name": "Teaching Method", "value": "Discussion"}, {"name": "Evaluation Method", "value": "There will be five written assignments over the course of the quarter: two 1-page reader's responses, two 3-5 pg. papers, and one 10-page final paper."}, {"name": "Class Materials (Required)", "value": "Steven K. Green, Inventing a Christian America: The Myth of the Religious Founding. Oxford: Oxford University Press, 2015.<br/><br/>Winnifred Fallers Sullivan, Elizabeth Shakman Hurd, Saba Mahmood and Peter G. Danchin, eds., Politics of Religious Freedom. Chicago: University of Chicago Press, 2015.<br/><br/>Above books will be available for purchase from Beck's bookstore."}], "lmod": "12/29/16 7:04 PM (CT)", "subject": "POLI_SCI"}]