[{"class_mtg_info": [{"meet_t": "TBA", "meet_l": "TBA"}], "school": "SCS", "overview_of_class": "Ever since we declared its pursuit as one of our inalienable rights, Americans have been hot on the trail of a happiness that often seems to be just beyond our grasp. The hunt takes many paths: finding love, wealth, or fame; earning an education, job, or lifestyle; attaining bliss, heaven, or a fairy tale ending. This writing class explores how we have defined, pursued and, at times, attained happiness. We ask the question: \"is happiness a goal or a journey?\" We examine how the ideal of happiness finds expression in our culture through philosophy, art, literature, music, and film. We also explore social phenomena such as the quest for higher education, the explosion of the self-help industry, and the ebb and flow of our consumer culture.<br/><br/>The course is conducted completely online. It will be asynchronous; students can participate in discussions and complete assignments by working at their own pace, as long as deadlines are met. A technology fee will be added to tuition.", "qtr": "Winter 2016", "name": "Writing Seminar II", "title": "SCS ENGLISH 111-DL-62 Writing Seminar II", "lmod": "1/9/16 6:41 PM (CT)", "section": "62", "instructors": [{"instructor_phone": "", "instructor_name": "Leslie   Fischer", "instructor_addr": "555 Clark St., 240"}], "topic": "The Pursuit of Happiness", "course": "111-DL", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Ever since we declared its pursuit as one of our inalienable rights, Americans have been hot on the trail of a happiness that often seems to be just beyond our grasp. The hunt takes many paths: finding love, wealth, or fame; earning an education, job, or lifestyle; attaining bliss, heaven, or a fairy tale ending. This writing class explores how we have defined, pursued and, at times, attained happiness. We ask the question: &quot;is happiness a goal or a journey?&quot; We examine how the ideal of happiness finds expression in our culture through philosophy, art, literature, music, and film. We also explore social phenomena such as the quest for higher education, the explosion of the self-help industry, and the ebb and flow of our consumer culture.<br/><br/>The course is conducted completely online. It will be asynchronous; students can participate in discussions and complete assignments by working at their own pace, as long as deadlines are met. A technology fee will be added to tuition."}, {"name": "Registration Requirements", "value": "ENGLISH 110 or equivalent. <br/><br/>Before taking this class, students should have a basic understanding of English grammar and mechanics, and should be able to write clear, competent sentences using standard English. Students who need more basic writing instruction should enroll in ENGLISH 110."}, {"name": "Learning Objectives", "value": "A. Research how our culture has defined, pursued and, at times, attained happiness. ?<br/>B. Write and read to enhance knowledge through inquiry, learning, thinking and communicating. ?<br/>C. Develop the intellectual processes and abilities to think critically, analyze ideas in context, and respond ?independently. ?<br/>D. Understand a research writing assignment as a process of engagement with the ideas of others, including ?locating, evaluating, analyzing and responding to appropriate primary and secondary sources. ?<br/>E. Employ flexible strategies for generating, revising and editing researched persuasive essays. ?<br/>F. Acknowledge sources and understand the dialogic relationship research writers engage in with those ?sources. ?<br/>G. Demonstrate knowledge of genre conventions, ranging from structure and paragraphing to tone and ?mechanics. ?<br/>H. Document sources using MLA format."}, {"name": "Teaching Method", "value": "Class participation<br/>Discussion Board<br/>Discussion<br/>Lecture<br/>Online work <br/>Readings<br/>Research project<br/>Writing assignments"}, {"name": "Evaluation Method", "value": "The student's final grade will be determined as follows: <br/>Participation - Discussion Forum - 20% <br/>Participation - Peer Review - 12% <br/>Annotation I - 1% <br/>Summary I - 2% <br/>Worksheet, Annotation and Summary II - 10% <br/>Review of the Literature - 10% <br/>Proposal - 10%<br/>Final Essay Draft - 10%<br/>Final Essay - 25%"}, {"name": "Class Materials (Required)", "value": "Text and materials may include:<br/>Pursuing Happiness: A Bedford Spotlight Reader<br/>Various Readings Available on Canvas"}], "path": "/class-descriptions/4610/SCS/ENGLISH/111-DL/27774", "instructor": ["Leslie   Fischer"], "class_attributes": "", "id": "27774", "subject": "ENGLISH"}]