[{"class_mtg_info": [{"meet_t": "TBA", "meet_l": "TBA"}], "school": "JOUR", "enrl_requirement": "Enrollment Requirements: Pre-requisite: Registration is restricted to students in IMC's Online Program only<br/><br/>Pre-requisite: Registration is restricted to students in IMC's Online Program only", "qtr": "Winter 2017", "name": "24242", "title": "JOUR IMC 451-6-20 Statistics and Marketing Research", "class_attributes": "", "section": "24242", "instructors": [{"instructor_phone": "", "instructor_name": "Gregory A Green", "instructor_addr": ""}], "topic": "", "course": "451-6", "descriptions": [{"name": "Overview of class", "value": "Statistics and Marketing Research overviews the marketing research process and goes into depth on marketing analytics with basic statistical analysis. Students learn how to transform strategic business challenges into analytics and research problems that resolve into high impact business presentations. Today's cross-channel marketing requires a fusion of advanced marketing analytics and research techniques as the &quot;Big Data&quot; exhaust of digital and social channels grows exponentially. The data exhaust of marketing channels augments the in-depth quantitative and qualitative gathering of data through more traditional research. The course covers data analytics, descriptive and causal research, questionnaire design, sampling and experimental design, univariate and multivariate descriptive statistics, confidence intervals and hypothesis tests for means and percents. The course provides innovative visualization techniques to present the marketing analytics and research results. Students learn how to analyze and extract value from customer databases and surveys using foundational software for both analysis and visualization.<br/><br/>Advisory notes for online students: The management of IMC disciplines demands a rich understanding in statistical and research methods. Those students whose work experience has not required this understanding are strongly encouraged to take this course early in the program, and if possible, without other courses in the quarter in which they take it. Additionally, for students less experienced in these methods, this course is strongly recommended prior to IMC 460 Strategic Process, which also demands familiarity with analytic techniques taught in IMC 451.?"}], "lmod": "12/29/16 6:44 PM (CT)", "subject": "IMC"}]