[{"class_mtg_info": [{"meet_t": "We 6:15PM - 9:15PM", "meet_l": "Lunt Hall 105"}], "school": "SCS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "27809", "title": "SCS MATH 336-A-65 Introduction to the Theory of Numbers", "class_attributes": "", "section": "27809", "instructors": [{"instructor_phone": "8474915564", "instructor_name": "Sandy L Zabell", "instructor_addr": "Lunt 227"}], "topic": "", "course": "336-A", "descriptions": [{"name": "Overview of class", "value": "This is an introduction to number theory, suitable for students with little more than high-school algebra experience. Nevertheless, one is able to quickly begin stating and proving some subtle, important, and beautiful results in this course. The topics to be covered include the Euclidean algorithm and unique factorization, the prime numbers, congruences, diophantine equations, approximating irrational numbers, and continued fractions. The topics will be enlivened by placing them in their historical context, and applications to cryptography will be given throughout. The capstone of the course will be a detailed discussion at the end of the RSA method of public-key encryption."}, {"name": "Registration Requirements", "value": "High school algebra. MATH 230 recommended in terms of previous coursework in SPS."}, {"name": "Learning Objectives", "value": "1. Understand some of the basic properties of the integers, including unique factorization, congruence, and rational approximation.<br/>2. Master some basic computational skills, such as solving linear congruences, algorithms for finding the prime factorization of an integer, solving some basic Diophantine equations, and finding the continued fraction expansion of a number.<br/>3. Gain an insight into why public-key encryption is possible."}, {"name": "Teaching Method", "value": "Lectures, problem sets, class discussion."}, {"name": "Evaluation Method", "value": "Problem set, midterm, final exam, class participation, attendance"}, {"name": "Class Materials (Required)", "value": "Course text: tentatively, Underwood Dudley, &quot;Elementary Number Theory&quot;, 2nd ed., 2009, Dover Publications; ISBN-10: 048646931X.<br/><br/>The text will be at the NU bookstore (although it is also easily purchased on Amazon)."}], "lmod": "1/9/16 6:41 PM (CT)", "subject": "MATH"}]