[{"school": "WCAS", "overview_of_class": "This course explores the modern American urban street gang. It looks at the long sociological tradition of theory and research on such gangs, much of it conducted right here in Chicago. It looks at the structure and activities of such gangs and the response of local community institutions including the police, and national urban and criminal justice policy with respect to street gangs.", "name": "Topics in Sociological Analysis", "section": "21", "location": "Locy Hall 111", "topic": "Gangs", "course": "376-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4650/WCAS/SOCIOL/376-0/24671", "instructor": ["Albert Dale   Hunter"], "class_attributes": "", "id": "24671", "subject": "SOCIOL"}, {"school": "WCAS", "overview_of_class": "SINCE THE APPEARANCE OF A \"MYSTERIOUS NEW ILLNESS\" AMONG GAY MEN IN THE U.S., HIV/AIDS HAS BEEN CLOSELY ASSOCIATED WITH SEXUALITY. THIS IS TRUE NOT ONLY BECAUSE A LARGE PERCENTAGE OF HIV-TRANSMISSION OCCURS VIA SEXUAL CONTACT, BUT ALSO BECAUSE OF CLOSE ASSOCIATIONS BETWEEN SEXUALITY AND MORALITY AND WHAT \"KINDS\" OF PEOPLE AND PRACTICES ARE SAID TO BE MORE LIKELY TO SPREAD HIV THAN OTHERS. IN THIS COURSE, WE DRAW UPON SCHOLARSHIP IN THE SOCIAL SCIENCES AND HUMANITIES TO EXAMINE THE INTERPLAY BETWEEN HIV/AIDS AND SEXUALITY, WITH AN EMPHASIS ON THE ROLE OF SCIENCE AND TECHNOLOGY. HOW DID ASSOCIATIONS BETWEEN SEXUALITY, DISEASE, AND MORALITY SHAPE WHAT WAS KNOWN ABOUT THE SPREAD OF HIV EARLY IN THE EPIDEMIC? HOW HAVE ONGOING EFFORTS TO KNOW, TREAT, AND PREVENT HIV SHAPED SEXUAL PRACTICES AND INTIMACIES, AND VICE VERSA? TOGETHER, WILL CONSIDER THE COMPLEX INTERPLAY OF HIV, SEXUALITY AND SCIENCE ACROSS A DIVERSE ARRAY OF TOPICS, INCLUDING: THE POLITICS OF HIV-RISK CATEGORIZATION; HIV-STIGMA AND DISCRIMINATION; SOCIAL MOVEMENTS AND ACCESS TO TREATMENT; SEXUAL PRACTICES AND INTIMACIES; AND NEW FRONTIERS IN HIV-PREVENTION, AMONG OTHERS.", "name": "Topics in Sociological Analysis", "section": "23", "location": "555 Clark B01", "topic": "Sexuality, Biomedicine, & HIV/AIDS", "course": "376-0", "meeting_time": ["MoWe 11:00AM - 12:20PM"], "path": "/class-descriptions/4650/WCAS/SOCIOL/376-0/24673", "instructor": ["Aaron Travis Norton"], "class_attributes": "", "id": "24673", "subject": "SOCIOL"}, {"school": "WCAS", "overview_of_class": "Global commons today are a cause for concern and hope, both at the same time. On one hand, forests, rivers, oceans, and pastures across the world are increasing targets for extraction and urbanization projects. Large-scale corporate and state-led land grabs in the global South bring up questions of food security and sovereignty. The challenge of climate change points to the limits of contemporary capitalism and the scope of environmental degradation. On the other hand, citizens now turn to commons to find inspiration for alternative forms of work, consumption, management, and ownership. Global climate justice mobilization demands recognition of locally informed environmental practices. By investigating the historical, environmental and social dimensions of global commons, the course introduces an increasingly controversial policy realm. Yet it also puts nature into challenging conversations with legality, property, and sovereignty while discussing the cultural and political potential of the struggle for commons.", "name": "Topics in Sociological Analysis", "section": "25", "location": "University Hall 122", "topic": "Global Commons, Dispossession and Resistance", "course": "376-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4650/WCAS/SOCIOL/376-0/27425", "instructor": ["Sinan   Erensu"], "class_attributes": "", "id": "27425", "subject": "SOCIOL"}]