[{"school": "WCAS", "overview_of_class": "Gender and Society introduces students to three pivotal concepts in the sociological study of gender: the social construction of gender, gender socialization, and gender as an institution. Students will learn about the social construction of gender by examining the creation of gender norms, which are defined as prevailing ideas about sex, gender, masculinities, femininities, and gender non-conformity. We will challenge the binary conceptualization of gender (men/women, masculinity/femininity) by discussing gender non-conformity and transgender experiences. Next, students will learn about the social and political sources of gender norms, including the media, family, schools, sports, and the government. We will examine how these entities actively contribute to gender socialization, defined as the process by which people come to learn about and perform gender in their own lives?otherwise known as \"doing gender.\" Students will then learn about the consequences of gender norms?specifically, gender inequality in the United States?to understand how gender operates as an institution. Gender inequality is defined as systematic social, economic, and political disparities among differently gendered people that take shape in the workplace, the household, educational settings, and political institutions. These inequalities stand to affect all of us as we build our own careers, families, and personal lives. Finally, students will evaluate ways to address gender inequality, including public policy, law, education, social change, and political participation and representation. Throughout the course we will employ the optic of intersectionality, which shows how gender does not operate in the same way for everyone but intersects with other social identities like race, class, sexuality, nationality, etc.", "name": "Gender and Society", "section": "20", "location": "Annenberg Hall G15", "topic": "", "course": "216-0", "meeting_time": ["MoWe 11:00AM - 12:20PM"], "path": "/class-descriptions/4660/WCAS/SOCIOL/216-0/35558", "instructor": ["Savina Jewel   Balasubramanian"], "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "id": "35558", "subject": "SOCIOL"}]