[{"class_mtg_info": [{"meet_t": "We 6:15PM - 9:15PM", "meet_l": "Parkes Hall 215"}], "school": "SCS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "37883", "title": "SCS ENGLISH 348-CN-65 Studies in Restoration and 18th-Century Literature", "class_attributes": "", "section": "37883", "instructors": [{"instructor_phone": "", "instructor_name": "Jeanine M Casler", "instructor_addr": ""}], "topic": "Bimbos or Bluestockings? Satires by and About Wome", "course": "348-CN", "descriptions": [{"name": "Overview of class", "value": "According to Vladimir Nabokov, &quot;Laughter is the best pesticide.&quot; Over the course of the quarter, we will test the validity of Nabokov's assertion, examining some of the best satirical works by and about women coming out of the Western literary tradition. Satire is a genre that has customarily been associated with masculinity, and based on most modern anthologies, one could easily come to the conclusion that women did not write satire at all until the modern era. Considering the ancient roots of satire and the often openly aggressive strategies used by the earliest male satirists and their descendants, it is perhaps to be expected that an intelligent, market-savvy female writer would hesitate to avow her satirical roots. However, there were more women writing satire over the years than most modern anthologies reflect. In addition to examining and evaluating some of the most (in)famous satires written targeting women (by Swift, Pope, Hitchens, etc.), we will read satires authored by women, from the 18th century to the modern era (including selected readings from Frances Burney, Lady Mary Montagu, Jane Collier, Margaret Atwood, Fay Weldon and Tina Fey. By the end of the quarter we should see that the traditional assumption that satire is a masculine genre is deeply flawed."}, {"name": "Registration Requirements", "value": "Students who enroll should have fulfilled the SPS writing requirement or taken equivalent writing courses."}, {"name": "Teaching Method", "value": "Class participation<br/>Discussion<br/>Films / videos<br/>Group work<br/>Lecture<br/>Online work <br/>Presentations<br/>Readings<br/>Research project<br/>Writing assignments"}, {"name": "Evaluation Method", "value": "Attendance<br/>Participation<br/>Online work - blog/journal<br/>Two 5-page papers<br/>Final research project and presentation"}, {"name": "Class Materials (Required)", "value": "There is a Canvas website for this class, and many of the readings will be posted there.<br/><br/>In addition we will be reading 3 satirical novels: <br/>Fay Weldon's Life and Loves of a She-Devil<br/>Jane Austen's Persuasion<br/>Frances Burney's Evelina. These will be available at the Norris Center Bookstore in Evanston."}], "lmod": "4/3/16 7:32 PM (CT)", "subject": "ENGLISH"}]