[{"school": "SoC", "overview_of_class": "RTVF 322-0 Sec. 20 RTVF Genre: Romantic Comedy <br/><br/>\"Boy meets girl; boy loses girl; boy gets girl.\" This is the classic, if banal, formulation of the prototypical romantic comedy. This class considers American romantic comedy films from the 1930s to the early 2000s with particular consideration of: 1) mistaken identities, reversals, and masquerades and 2) the norms, normative boundaries, and pliability of the genre, especially when it comes to race and sexuality. Many of the films we will see are based on confusions about who is whom, based on accidental misunderstanding, willful deceptions, or unruliness. Films include: My Man Godfrey, Bringing Up Baby, Some Like It Hot, Pillow Talk, You've Got Mail, Bringing Down the House, The Wedding Banquet, among others.<br/><br/>Students will be encouraged to research other aspects/variants/formulas of romantic comedy films (and other films) as an integral part of their class work. <br/> <br/>Evaluation method:   Class participation, short writing assignments in response to class screenings and/or readings; research and writing assignments building toward a final research project.<br/> <br/>Class materials:  Reading packet/students will need access to films (of their own choosing), based on their research project topic.", "name": "Radio/Television/Film Genre", "section": "20", "location": "Helmerich Auditorium", "topic": "Romantic Comedy", "course": "322-0", "meeting_time": ["MoWe 3:00PM - 5:20PM"], "path": "/class-descriptions/4660/SoC/RTVF/322-0/37374", "instructor": ["Miriam B White"], "class_attributes": "", "id": "37374", "subject": "RTVF"}, {"school": "SoC", "overview_of_class": "RTVF 322 Science Fiction Film & Television<br/><br/><br/>This class explores the popularity of science fiction in postwar American culture-from late 1945 through the present. This period marks the aftermath of Hiroshima and the rise of television, space technologies, artificial intelligence and genetic engineering; in short, during this time there was a virtual explosion of scientific knowledge. Not coincidentally, science fiction became an extremely popular genre in film, pulp literature, and on television. These media texts used the new science for storytelling purposes, and in so doing transformed scientific change into speculation about social change and utopias. <br/> This \"speculative\" aspect of science fiction will be the key concern of the course as we look at how the genre imagines social relationships between sexes, races, classes?as well as silicon and human life forms. What kinds of narrative strategies do these texts use to represent new social orders and relations? How has the genre changed over the last forty years, and in what ways can we make comparisons between generic changes and social changes? How has science fiction lent itself to self-reflexive exploration of cinema itself?especially cinematic time and space? And how does it build alternative futures or map dystopian nightmares? These questions form the focus of the various topics in the course. Evaluation is based on essay exams, a final paper/project, and oral presentations. Readings include articles, short stories, and books, and screenings will be required for each class (some screened in class, some on your own).<br/><br/>Required Books <br/>Sobchack, Vivian: Screening Space: The American Science Fiction Film (New Brunswick: Rutgers, 1997)<br/>Todorov, Tzvetan: The Fantastic: A Structural Approach to A Literary Genre (Ithaca: Cornell Up, 1973)", "name": "Radio/Television/Film Genre", "section": "21", "location": "Annie May Swift Hall 109", "topic": "Science Fiction Film & TV", "course": "322-0", "meeting_time": ["Mo 2:00PM - 5:50PM"], "path": "/class-descriptions/4660/SoC/RTVF/322-0/37375", "instructor": ["Lynn B Spigel"], "class_attributes": "Jrs, Srs, Grad Students Only<br/><br/>", "id": "37375", "subject": "RTVF"}]