[{"class_mtg_info": [{"meet_t": "MoWe 3:00PM - 4:20PM", "meet_l": "Wirtz Center WALLIS"}], "school": "SoC", "overview_of_class": "Class Description:  The point of view of this class, Standing Down Straight for Actors, honors and expands on the approach to acting Konstantin Stanislavski counseled in his seminal texts - an approach, of course, that has directly influenced and fueled the acting techniques developed by pioneer teachers like Stella Adler and Sanford Meisner, by their followers, and then by their followers' followers down through the generations, including the acting instructors currently teaching here at Northwestern. In particular, Standing Down Straight for Actors takes inspiration from what Konstantin Stanislavski said in An Actor Prepares:  \"[T]he organic bases of the laws of nature on which our art is founded will protect you in the future from going down the wrong path.\" (AAP 16).\"  For examples of such nature-driven art, Stanislavski suggests, in the chapter fittingly called \"Relaxation,\" that we observe what \"small children and animals do.\"  His reasoning:  all of their actions come across as - to use the two adjectives that course through his writings - not only \"natural\" but as \"truthful.\"  Natural, because when small children or animals are hungry or in danger, or exhausted, etc., they use their bodies (specifically, as focused on in this course, the body's primary expressive, goal-getting tools, the hands, eyes, and voice) to take the most direct route to satisfying their appetite.  Truthful, because animals and human infants especially don't conceal or lie when in the grips of an appetite.  Their behavior unashamedly and directly drives them toward satisfying it.", "qtr": "Winter 2016", "name": "Special Topics in Dance Research", "title": "SoC DANCE 335-0-20 Special Topics in Dance Research", "lmod": "1/9/16 6:39 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "847/491-3147", "instructor_name": "William Lewis   Siegenfeld", "instructor_addr": "10 Arts Circle Drive"}], "topic": "", "course": "335-0", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "descriptions": [{"name": "Overview of class", "value": "Class Description: The point of view of this class, Standing Down Straight for Actors, honors and expands on the approach to acting Konstantin Stanislavski counseled in his seminal texts - an approach, of course, that has directly influenced and fueled the acting techniques developed by pioneer teachers like Stella Adler and Sanford Meisner, by their followers, and then by their followers' followers down through the generations, including the acting instructors currently teaching here at Northwestern. In particular, Standing Down Straight for Actors takes inspiration from what Konstantin Stanislavski said in An Actor Prepares: &quot;[T]he organic bases of the laws of nature on which our art is founded will protect you in the future from going down the wrong path.&quot; (AAP 16).&quot; For examples of such nature-driven art, Stanislavski suggests, in the chapter fittingly called &quot;Relaxation,&quot; that we observe what &quot;small children and animals do.&quot; His reasoning: all of their actions come across as - to use the two adjectives that course through his writings - not only &quot;natural&quot; but as &quot;truthful.&quot; Natural, because when small children or animals are hungry or in danger, or exhausted, etc., they use their bodies (specifically, as focused on in this course, the body's primary expressive, goal-getting tools, the hands, eyes, and voice) to take the most direct route to satisfying their appetite. Truthful, because animals and human infants especially don't conceal or lie when in the grips of an appetite. Their behavior unashamedly and directly drives them toward satisfying it."}, {"name": "Class Materials (Required)", "value": "texts: Constantin Stanislavski, AN ACTOR PREPARES; Anne Bogart, A DIRECTOR PREPARES; Pema Chodron, TAKING THE LEAP"}, {"name": "Class Notes", "value": "About the alignment concept called &quot;Standing Down Straight&quot;<br/>Standing Down Straight® is a postural and motional concept developed by this instructor that explores three states of kinesthetic and emotional awareness: <br/><br/>1. What it feels like, kinesthetically and emotionally, to let the body's weight and motion<br/>give in to, not resist, the downward-pulling force of gravity. (&quot;The more we let go of our physical weight, the more we let go of our emotional weight.&quot;)<br/><br/>2. What it feels like, kinesthetically and emotionally, to use active relaxation as the springboard to vocalizing and moving in a focused forward-directed way. (&quot;Go down to go forward.&quot;)<br/><br/>3. What it feels like, kinesthetically and emotionally, to engage the four primary <br/>emotional articulators of the body - the hands, eyes, and voice - as the primary initiators for meeting a character's objectives. (&quot;Getting what you want.&quot;)<br/><br/>In short, Standing Down Straight aligns with Stanislavski's instruction (which he notes in the &quot;Relaxation&quot; chapter mentioned above) that acting students remain vigilant about not engaging &quot;superfluous, harmful tenseness&quot; or &quot;tense muscles&quot; when working.<br/><br/>Classwork will culminate in final projects consisting of a scene, either solo or with a partner, that incorporates the ideas covered in this class, especially those based in the 3 states of kinesthetic and emotional awareness described above under &quot;About the alignment concept called ?Standing Down Straight'.&quot; In tandem with whatever vocalizations the scene asks for (spoken, sung, non-verbally expressed), the scene will involve, if the text calls for it, the manipulation of an object or objects and moments involving hands-on interactions with your scene partner. NOTE: The term &quot;scene&quot; can be defined as you wish broadly as you wish. Here are some options: <br/><br/>-playwright-written monologues (edited if you wish), or self-written monologues;<br/>-playwright-written partnered scenes (edited if you wish), or self-written partnered scenes; <br/>-composer-written songs performed solo (edited if you wish), or self-composed solo-performed songs; <br/>-composer-written songs with partner (edited if you wish), or self-composed partnered songs; <br/>-other, outside-the-box, fused voice-movement forms of your own devising, performed either solo or with partner."}], "path": "/class-descriptions/4610/SoC/DANCE/335-0/22272", "instructor": ["William Lewis   Siegenfeld"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>No Freshmen<br/><br/>", "id": "22272", "subject": "DANCE"}]