[{"class_mtg_info": [{"meet_t": "Tu 6:00PM - 8:50PM", "meet_l": "University Hall 118"}], "school": "WCAS", "overview_of_class": "Fabulous Fictions is a writing class that focuses on writing that departs from realism. Often the subject matter of such writing explores states of mind that are referred to as non-ordinary reality. A wide variety of genres and subgenres fall under this heading: fabulism, myth, fairy tales, fantasy, science fiction, speculative fiction, horror, the grotesque, the supernatural, surrealism, etc. Obviously, in a mere quarter we could not hope to study each of these categories in the kind of detail that might be found in a literature class. The aim in 307 is to discern and employ writing techniques that overarch these various genres, to study the subject through doingby writing your own fabulist stories. We will read examples of fabulism as writers read: to understand how these fictions are madestudying them from the inside out, so to speak. Many of these genres overlap. For instance, they are all rooted in the tale, a kind of story that goes back to primitive sources. They all speculate: they ask the question What If? They all are stories that demand invention, which, along with the word transformation, will be the key terms in the course. The invention might be a monster, a method of time travel, an alien world, etc., but with rare exception the story will demand an invention and that invention will often also be the central image of the story. So, in discussing how these stories work we will also be learning some of the most basic, primitive moves in storytelling. To get you going I will be bringing in exercises that employ fabulist techniques and hopefully will promote stories. These time tested techniques will be your entrancesyour rabbit holes and magic doorways-into the figurative. You will be asked to keep a dream journal, which will serve as basis for one of the exercises. Besides the exercises, two full-length stories will be required, as well as written critiques of one another's work.  Because we all serve to make up an audience for the writer, attendance is mandatory.", "qtr": "Winter 2016", "name": "Advanced Creative Writing", "title": "WCAS ENGLISH 307-0-20 Advanced Creative Writing", "lmod": "1/9/16 6:47 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Stuart J Dybek", "instructor_addr": ""}], "topic": "Fabulous Fictions", "course": "307-0", "enrl_requirement": "Enrollment Requirements: Pre-Requisite:  Students must have taken &amp; passed English 206-0 to enroll.", "descriptions": [{"name": "Overview of class", "value": "Fabulous Fictions is a writing class that focuses on writing that departs from realism. Often the subject matter of such writing explores states of mind that are referred to as non-ordinary reality. A wide variety of genres and subgenres fall under this heading: fabulism, myth, fairy tales, fantasy, science fiction, speculative fiction, horror, the grotesque, the supernatural, surrealism, etc. Obviously, in a mere quarter we could not hope to study each of these categories in the kind of detail that might be found in a literature class. The aim in 307 is to discern and employ writing techniques that overarch these various genres, to study the subject through doingby writing your own fabulist stories. We will read examples of fabulism as writers read: to understand how these fictions are madestudying them from the inside out, so to speak. Many of these genres overlap. For instance, they are all rooted in the tale, a kind of story that goes back to primitive sources. They all speculate: they ask the question What If? They all are stories that demand invention, which, along with the word transformation, will be the key terms in the course. The invention might be a monster, a method of time travel, an alien world, etc., but with rare exception the story will demand an invention and that invention will often also be the central image of the story. So, in discussing how these stories work we will also be learning some of the most basic, primitive moves in storytelling. To get you going I will be bringing in exercises that employ fabulist techniques and hopefully will promote stories. These time tested techniques will be your entrancesyour rabbit holes and magic doorways-into the figurative. You will be asked to keep a dream journal, which will serve as basis for one of the exercises. Besides the exercises, two full-length stories will be required, as well as written critiques of one another's work. Because we all serve to make up an audience for the writer, attendance is mandatory."}, {"name": "Registration Requirements", "value": "Prerequisite English 206. No P/N registration. Attendance at first class is mandatory."}], "path": "/class-descriptions/4610/WCAS/ENGLISH/307-0/25454", "instructor": ["Stuart J Dybek"], "class_attributes": "Prerequisites apply, see description<br/><br/>", "id": "25454", "subject": "ENGLISH"}]