[{"class_mtg_info": [{"meet_t": "MoWeFr 10:00AM - 10:50AM", "meet_l": "Locy Hall 110"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "33890", "title": "WCAS FRENCH 125-1-20 Intensive Intermediate French", "class_attributes": "Attendance at 1st class mandatory<br/><br/>Prerequisites apply, see description<br/><br/>", "section": "33890", "instructors": [{"instructor_phone": "847/467-0899", "instructor_name": "Katia   Viot-Southard", "instructor_addr": "1860 S. Campus Drive, Crowe Hall #2-171"}], "topic": "", "course": "125-1", "descriptions": [{"name": "Overview of class", "value": "French 125-1 is the first quarter of the three-quarter Intensive Intermediate French course for students who have completed French 115-2 or have been placed in that course by the French department. The primary goal of this course is to strengthen oral and written communication skills by immersing students in authentic cultural contexts and language. A review of essential grammar will reinforce linguistic foundations. Class meets three times a week and will be conducted in French."}, {"name": "Teaching Method", "value": "The primary goal of this course is to develop students speaking, listening, reading and writing skills in a cultural context and to foster their critical thinking. Through study, exercises, conversation and various class activities, students will review and practice basic grammar, while exploring contemporary French and Francophone cultures. Students are expected to attend class daily, to actively participate and to spend at least 2 hours of work outside of class for each contact hour. Students will be asked to attend two extracurricular cultural enrichment activities of their choice during the course of the quarter (details given in class). P/N not allowed."}, {"name": "Evaluation Method", "value": "Class participation, homework &amp; quizzes, four compositions, four lesson tests and end-of-quarter oral test."}, {"name": "Class Materials (Required)", "value": "Réseau: Communication, Intégration, Intersections.<br/>Jean Marie Schultz, Marie-Paule Tranvouez, Second edition, Pearson.<br/>Online Student Activities Manual for Réseau: Communication, Intégration, Intersections. Pearson."}], "lmod": "2/16/17 6:46 PM (CT)", "subject": "FRENCH"}]