[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "Parkes Hall 215"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores<br/>Add Consent: Department Consent Required<br/>Drop Consent: Department Consent Required<br/>", "qtr": "Fall 2016", "name": "14131", "title": "WCAS RELIGION 101-6-21 First-Year Seminar", "class_attributes": "", "section": "14131", "instructors": [{"instructor_phone": "847/467-5410", "instructor_name": "Sylvester Alric Johnson", "instructor_addr": "5-128 Crowe, 1860 Campus Dr"}], "topic": "Religion, Artificial Intelligence, and the Life of", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "For the past several centuries, human nature has been described through the unique capacity to think and reason. Over the past several decades, however, humans have become increasingly successful at designing machines to think and reason, the very activity that seems so central to human experience. The rapid emergence of intelligent machines is creating new attention to older questions that have concerned religion scholars for some time. Could a machine ever be spiritual? Is consciousness unique to humans? Could consciousness reside in things such as machines? How did Westerners come to view matter-versus-spirit in an oppositional manner? How has religion shaped the way Westerners view the capacity to be sentient and to act (subjectivity) and the lack of this capacity (objecthood)? What have the intellectual and religious traditions of West Africa (Orisha ontology), East Asia, and Indigenous America asserted about the nature of things versus the nature of people? Do all societies today share the same assumptions about the nature of personhood? If technologists throughout the globe succeed in developing cognitive machines that rival or surpass human intelligence, will these machines become human? <br/><br/>This course examines the problems of religion and humanity that artificial intelligence (AI) is currently generating. Students will read texts by religion scholars, AI technologists, cognitive scientists, and philosophers of the mind to understand the theoretical, philosophical, and technological foundations for older religious claims about the nature of people and things. Students will study and understand (1) the conceptual paradigms on which claims of human exceptional are based; (2) religious claims about bodies and souls; 3) the basic architecture of cognitive machines; (4) what recent brain research reveals about human cognition; and (5) recent theoretical efforts (e.g., integrated information theory) to account for consciousness in things and people. On this basis, students will learn to engage skillfully with both classical and contemporary accounts of people versus things that are emerging in response to the rapid progress in AI."}, {"name": "Registration Requirements", "value": "As this is a freshman seminar, the registration process is the same as for all other freshman seminars."}, {"name": "Learning Objectives", "value": "By the end of the course, students will be expected to demonstrated knowledge of:<br/>(1) the conceptual paradigms on which claims of human exceptional are based; (2) religious claims about bodies and souls; 3) the basic architecture of cognitive machines; (4) what recent brain research reveals about human cognition; and (5) recent theoretical efforts (e.g., integrated information theory) to account for consciousness in things and people."}, {"name": "Teaching Method", "value": "Case studiesDemonstrationsDiscussionGuest speakersLecture"}, {"name": "Class Materials (Required)", "value": "Matt Carter, Minds and Computers: An Introduction to the Philosophy of Artificial Intelligence [ISBN: 978-0748620999]<br/>Jay W. Richard, ed. Are We Spiritual Machines [ISBN: 978-0963865434]"}], "lmod": "10/30/16 7:09 PM (CT)", "subject": "RELIGION"}]