[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Frances Searle Building 2378"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "31495", "title": "WCAS PHIL 311-0-20 Studies in Medieval Philosophy", "class_attributes": "", "section": "31495", "instructors": [{"instructor_phone": "847/491-2553", "instructor_name": "Sean Christopher Ebels Duggan", "instructor_addr": "Crowe 1-155"}], "topic": "Universals, Logic, and Reality", "course": "311-0", "descriptions": [{"name": "Overview of class", "value": "TOPIC: Universals, Logic, and Reality<br/><br/>General knowledge is interesting knowledge, involving judgments that group particulars items under a common heading. This and that are boring by themselves, but interesting in both being cookies. But what is it that makes this and that cookies? Presumably they share the features of cookies?for instance, being sweet. But what is it for separate items to share a common trait? Is there something?sweetness?separate from the particular cookies, but existing in both of them? Or is sweetness just a conventional grouping, having no more reality than the name we give it? These questions vexed medieval philosophers writing in both Arabic and Latin. In response they developed sophisticated conceptual tools for addressing them?tools that reveal the relation between logic, metaphysics, the nature of language, the nature of mind, and the nature of God. This course will explore the development of the problem of general knowledge through the Middle Ages, with particular focus on the thirteenth and fourteenth centuries. Readings from Porphyry, Boethius, Abelard, Ibn Sina, Aquinas, Duns Scotus, and Ockham."}, {"name": "Learning Objectives", "value": "Writing effectively, knowledge of philosophical arguments of the past, and how they bear on the present."}, {"name": "Teaching Method", "value": "LecturePresentationsSeminar"}, {"name": "Evaluation Method", "value": "Papers, exams, in-class presentations, participation in discussion."}, {"name": "Class Materials (Required)", "value": "Required Books: Paul Vincent Spade, ed. Five Texts on the Mediaeval Problem of Universals. ISBN 978-0-87220-249-8 Other material posted online."}], "lmod": "4/3/16 8:13 PM (CT)", "subject": "PHIL"}]