[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "University Library 4770"}], "school": "WCAS", "overview_of_class": "The Many Faces of Roman Egypt: Materials Science and Socioeconomics of Portrait Mummies from Ancient Fayum<br/><br/>In this unique one-time seminar, we will look at the role scientific examination plays in investigating the production of ancient Egyptian mummy portraits and how these objects fit into the larger socioeconomic context of Roman Egypt in the 2nd century CE. These explorations will be presented in an exhibition at the Block Museum during Winter 2018. Students will have the opportunity for hands-on work in a laboratory environment with an actual mummy from this period to assess how it was made, used, and buried, and what these data mean in a wider archaeological context. Students will gain insight into and actively contribute to exhibition layout and interpretation, and publicly share their research through a public program in winter 2018.", "qtr": "Fall 2017", "name": "Special Topics in the Humanities", "title": "WCAS HUM 370-4-20 Special Topics in the Humanities", "lmod": "5/14/17 6:52 PM (CT)", "section": "20", "topic": "Materiality & Economy in Mummy Portrait Painting", "course": "370-4", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "The Many Faces of Roman Egypt: Materials Science and Socioeconomics of Portrait Mummies from Ancient Fayum<br/><br/>In this unique one-time seminar, we will look at the role scientific examination plays in investigating the production of ancient Egyptian mummy portraits and how these objects fit into the larger socioeconomic context of Roman Egypt in the 2nd century CE. These explorations will be presented in an exhibition at the Block Museum during Winter 2018. Students will have the opportunity for hands-on work in a laboratory environment with an actual mummy from this period to assess how it was made, used, and buried, and what these data mean in a wider archaeological context. Students will gain insight into and actively contribute to exhibition layout and interpretation, and publicly share their research through a public program in winter 2018."}, {"name": "Learning Objectives", "value": "Students will have acquired a thorough understanding of both the materials science and the socioeconomic aspects of mummy portrait production in Roman Egypt. They will also have acquired hands-on knowledge about how to present that information to the general public in a museum setting."}, {"name": "Teaching Method", "value": "Case studiesClass participationField tripsIndependent studyLabLecturePresentationsResearch projectWriting assignments"}, {"name": "Evaluation Method", "value": "Class participation: 30% of final grade<br/>Exam, final: 20% of final grade<br/>Presentations: 40% of final grade<br/>Writing assignments: 3 x 10% = 30% of final grade<br/>"}, {"name": "Class Materials (Required)", "value": "Readings will be made available through Canvas."}], "instructor": ["Taco Tjitte Terpstra", "Marc Sebastian Walton"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "12913", "subject": "HUM"}, {"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Fisk Hall 114"}], "school": "WCAS", "overview_of_class": "This course examines one of the most important ideals of our time?freedom?within the context of slavery and religion. Rather than assuming slavery and freedom are unrelated opposites, this class focuses on the relationship between freedom and slavery within the context of religion and philosophy from ancient to modern times. Four general periods receive focus: antiquity, medieval, early modernity, and developments since the nineteenth century. The course readings will focus on key themes that include: the role of slavery and freedom in religious traditions; Hegel's conception of freedom and slavery; the Haitian Revolution; slavery and abolition; the causal relation between slavery and freedom; gender and reform movements and their relation to slavery and feminism; the sex-trade and slavery; and recent movements for abolition democracy.", "qtr": "Fall 2017", "name": "Special Topics in the Humanities", "title": "WCAS HUM 370-4-21 Special Topics in the Humanities", "lmod": "5/14/17 6:52 PM (CT)", "section": "21", "topic": "Slavery, Religion, Philosophy of Freedom (in Ancie", "course": "370-4", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "This course examines one of the most important ideals of our time?freedom?within the context of slavery and religion. Rather than assuming slavery and freedom are unrelated opposites, this class focuses on the relationship between freedom and slavery within the context of religion and philosophy from ancient to modern times. Four general periods receive focus: antiquity, medieval, early modernity, and developments since the nineteenth century. The course readings will focus on key themes that include: the role of slavery and freedom in religious traditions; Hegel's conception of freedom and slavery; the Haitian Revolution; slavery and abolition; the causal relation between slavery and freedom; gender and reform movements and their relation to slavery and feminism; the sex-trade and slavery; and recent movements for abolition democracy."}, {"name": "Learning Objectives", "value": "Students will understand the early and contemporary philosophies of freedom and slavery through the influences of such authors as Plato, Aristotle, and Hegel<br/><br/>Students will be able to discuss and analyze the impact or racial slavery on the history of freedom and slavery<br/><br/>Students will be able to assess and develop arguments concerning the causal relationship between freedom and slavery<br/><br/>Students will assess scholarly arguments concerning freedom and slavery in relation to gender<br/><br/>Students will be able to explain and assess histories of slavery and freedom in non-Western context"}, {"name": "Teaching Method", "value": "Discussion: Students will participate in class discussions based on assigned readings<br/>Lecture: Two 70-minute lectures weekly<br/>Readings: Assigned class readings for all class meetings<br/>Writing assignments: Two response papers (500 words)<br/>"}, {"name": "Evaluation Method", "value": "Exam, final"}, {"name": "Class Materials (Required)", "value": "Assigned readings include:<br/>Saidiya Hartman, Scenes of Subjection<br/>Susan Buck-Morris, Hegel and Haiti<br/>Hegel, selections from the Phenomenology of Spirit<br/>Aristotle, Book I of the Politics<br/>Paul of Tarsus, New Testament letters<br/>Orlando Patterson, Freedom in the Making of Western Culture<br/>Elizabeth Anderson, \"The Social Epistemology of Morality: Learning from the Forgotten History of the Abolition of Slavery\"<br/>Condorcet, Reflexions sur l'esclavage des negres, trans. (In Sala-Molins 2006)<br/>C. L. R. James, The Black Jacobins<br/>David Brion Davis, The Problem of Slavery in Western Culture<br/>DuBois, \"The Suppression of the African Slave Trade\" and \"John Brown\""}], "instructor": ["Mark Vinzenz Alznauer"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "12914", "subject": "HUM"}]