[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "University Library 4722"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Spring 2017", "name": "35378", "title": "WCAS POLI_SCI 101-6-21 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "35378", "instructors": [{"instructor_phone": "", "instructor_name": "Sidra   Hamidi", "instructor_addr": ""}], "topic": "Global Nuclear Politics", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "101-6-21 First Year Seminar Sidra Hamidi &quot;Global Nuclear Politics&quot;<br/>Nuclear politics dominates headlines in contemporary international relations. From the growing threat of nuclear proliferation to controversies over the safety and security of nuclear weapons stockpiles to the growth of local anti-nuclear activism around the world, the conflict over nuclear energy and weaponry continues to be a major site of contestation in global politics. How can we understand the development of nuclear technology and its international and domestic consequences? What is the relationship between this technological development and politics, both local and interstate? This course will explore both the historical development of and contemporary conflicts surrounding the growth of nuclear technology. The seminar will take an interdisciplinary approach to the study of nuclear politics by combining perspectives from history, sociology, and political science. We will start with an examination of nuclear technology, highlighting some technical and scientific details about nuclear energy and its potential weaponization. We will then discuss the historical origins of the development of nuclear technology in the politics of the Cold War. Here we will discuss the logic of deterrence and address other logics of nuclear desire, including the military and symbolic value of nuclear weaponry. We will then move onto the global nuclear regime that governs the growth of nuclear proliferation including the Nuclear Non-Proliferation Treaty (NPT), the International Atomic Energy Agency (IAEA), the Strategic Arms Reduction Treaty (START), and the Comprehensive Test Ban Treaty (CTBT). From a discussion of international politics, we will then turn to the way that the growth of nuclear technology affects domestic politics through a discussion of nuclear safety and anti-nuclear activism around the world. The second half of the course will use the resources of the first half of the course explore nuclear proliferation in regional contexts including Latin America, South Asia, and the Middle East. And we will close with a discussion of contemporary crises in nuclear politics and discuss prospects for the future."}, {"name": "Learning Objectives", "value": "1. Analyze the history of nuclear technology throughout the 20th and into the 21st century and identify the ways in which the history of nuclear proliferation affects the kinds of contemporary political conflicts that exist in the global nuclear regime. <br/>2. Apply theoretical concepts to specific regional contexts in order to understand the relationship between theoretical concepts and practical politics. <br/>3. Create a policy memo addressing the ratification of the Comprehensive Test Ban Treaty (CTBT) from the perspective of the United States government."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Class Materials (Required)", "value": "Scott Sagan and Kenneth Waltz, The Spread of Nuclear Weapons: An Enduring Debate (Third Edition), W.W. Norton and Company, 978-0393920109<br/><br/>Francis Gavin, Nuclear Statecraft: History and Strategy in America's Atomic Age, 2015, Cornell University Press, 978-0801456756<br/><br/>Joseph Cirincione, Bomb Scare: The History and Future of Nuclear Weapons, 2007, Columbia University Press, 978-0231135115"}], "lmod": "2/19/17 6:51 PM (CT)", "subject": "POLI_SCI"}]