[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Harris Hall L05"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Winter 2017", "name": "24656", "title": "WCAS SOCIOL 101-6-20 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>Freshmen/Sophomores Only<br/><br/>", "section": "24656", "instructors": [{"instructor_phone": "", "instructor_name": "Zachary Graham Sommers", "instructor_addr": ""}], "topic": "Crime and Criminology.", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "This course examines a variety of topics relating to crime and the social scientific study of crime, or criminology. Using a wide range of in-class media and interactive activities, we will explore research investigating the effects of crime and what it means to be a criminal. After a brief overview of the field, we will examine criminological and sociological research on the different stages of the criminal justice system (policing, courts, and prisons) before turning our focus to a few specific substantive areas of research, such as capital punishment, gangs, and crime as depicted in pop culture. As with all first-year seminars, writing and in-class participation will be the core requirements"}, {"name": "Registration Requirements", "value": "Must be a first-year to register."}, {"name": "Learning Objectives", "value": "1. Identify Empirical Trends in late-20th and 21st century crime<br/>2. Understand the various methodological approaches used by criminologists<br/>3. Compare the leading theories of punishment and criminal offending<br/>4. Survey the empirical literature on a crime-related topic and evaluate the existing evidence<br/>5. Develop a research proposal that engages with and builds upon existing criminological research"}, {"name": "Teaching Method", "value": "LectureOur typical class will begin with a few minutes of background lecture, followed by discussion and interactive learning."}, {"name": "Evaluation Method", "value": "AttendancePapersIn-class participation and three papers."}, {"name": "Class Materials (Required)", "value": "All readings will be posted on Canvas. A subscription to Top Hat, an interactive educational platform, is required."}], "lmod": "12/24/16 7:08 PM (CT)", "subject": "SOCIOL"}]