[{"class_mtg_info": [{"meet_t": "Th 6:15PM - 9:15PM", "meet_l": "Kresge Centennial Hall 3-410"}], "school": "SCS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "38101", "title": "SCS ORG_BEH 311-CN-64 Conflict Resolution", "class_attributes": "", "section": "38101", "instructors": [{"instructor_phone": "", "instructor_name": "Marina R Davis", "instructor_addr": ""}], "topic": "", "course": "311-CN", "descriptions": [{"name": "Overview of class", "value": "No matter the type or size, conflict takes place daily within every organization. Despite that frequency, conflict still is misunderstood and mismanaged. Based on research, there are generally accepted two types of conflict; one has the ability to increase productivity, effectiveness and satisfaction -and the other that can create the exact opposite effect. This course explores both the positive and negative impacts of conflict, and will include strategies used to identify and resolve conflicts so that benefits can be received, issues addressed, and relationships maintained."}, {"name": "Registration Requirements", "value": "For the online component, students must have access to reliable internet. First class attendance is mandatory"}, {"name": "Learning Objectives", "value": "-Identify the process of &quot;how&quot; emotional conflict occurs within organizational relationships<br/>-Describe strategies to resolve conflict<br/>Apply conflict resolution techniques and concepts to a variety of organizational situations<br/>-Assess conflict situations and generate possible response options<br/>-Utilize a variety of conflict resolution styles to address conflict situations appropriately and as effectively as possible<br/>-Classify his/her own: conflict management style and personality preference. The student will then learn how to appraise how these styles affect conflict both from his/her perspective and others.<br/>-Define types of conflict and responses to each<br/>-Discuss negotiation techniques and application<br/>-Describe the role and responsibilities of the leader within an organizational conflict."}, {"name": "Class Materials (Required)", "value": "Difficult Conversations ISBN-13: 978-0143118442<br/>Getting to Yes ISBN - 13: 978-0143118756<br/>MBTI assessment and Introduction to Type"}], "lmod": "2/20/17 6:41 PM (CT)", "subject": "ORG_BEH"}]