[{"class_mtg_info": [{"meet_t": "MoTuWeFr 10:00AM - 10:50AM", "meet_l": "Kresge Centennial Hall 2-319"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "20515", "title": "WCAS GERMAN 102-2-21 Intermediate German", "class_attributes": "", "section": "20515", "instructors": [{"instructor_phone": "847/491-8295", "instructor_name": "Saein   Park", "instructor_addr": "Kresge Hall, Rm 3327, 1880 Campus Drive"}], "topic": "", "course": "102-2", "descriptions": [{"name": "Overview of class", "value": "This is the second quarter of a three-quarter sequence of Intermediate German. Its primary goal is the continued development of proficiency in all German language skills (speaking, listening, reading, writing). Class activities will be communicative. The thematic focus this quarter is on contemporary Germany as a multi-ethnic society. As materials we will use the TV show Türkisch für Anfänger and articles from a variety of German magazines or newspapers. We will follow recent debates around immigration to Germany and other 21st-century German cultural and political questions.<br/>All language skills are practiced throughout the year, but each quarter focuses on different language areas resulting in a more specific focus. In the Winter quarter we focus on colloquial and idiomatic contemporary language. The Spring quarter will be devoted to excerpts from German literary works of varying genres and discussion arising from them. The fall quarter was dedicated to 20 century German history and politics through a literary lens."}, {"name": "Registration Requirements", "value": "102-1 or equivalent; students with other background, please see Course Coordinator, Martina Kerlova"}, {"name": "Learning Objectives", "value": "Students will be able to converse and write in German at the intermediate level and develop increased listening and reading comprehension.<br/>They will have a knowledge of cultural, social, and political issues in contemporary Germany."}, {"name": "Teaching Method", "value": "Class participationDiscussionFilms / videosGroup workListening exercisesPresentationsReadingsWriting assignments"}, {"name": "Evaluation Method", "value": "Attendance: 10%<br/>Class participation: 10%<br/>Homework: 12%<br/>Presentations: 8%<br/>Quizzes: 48%<br/>Writing assignments: 12%<br/>"}, {"name": "Class Materials (Required)", "value": "Course Reader: (available at Quartet Copies)"}], "lmod": "12/29/16 6:58 PM (CT)", "subject": "GERMAN"}]