[{"class_mtg_info": [{"meet_t": "Tu 3:00PM - 5:50PM", "meet_l": "Annie May Swift Hall 219"}], "school": "SoC", "enrl_requirement": "Enrollment Requirements: Prerequisite: Students must have taken and passed RTVF 260-0.<br/>Add Consent: Department Consent Required<br/>", "qtr": "Winter 2016", "name": "27371", "title": "SoC RTVF 360-0-26 Topics in Media Writing", "class_attributes": "", "section": "27371", "instructors": [{"instructor_phone": "", "instructor_name": "Rebecca C. Gilman", "instructor_addr": ""}], "topic": "Writing Styles", "course": "360-0", "descriptions": [{"name": "Overview of class", "value": "Writers rarely set out to write in a particular literary mode when they begin a project, but a thorough knowledge of such modes not only helps an artist define the tone and point of view of a piece, it also encourages artistic exploration. This class will examine a variety of stylistic modes including Naturalism, Expressionism, Surrealism, and Epic Theatre. We will analyze examples of each style from film and theatre. Through readings, screenings of films, lectures, and discussion, we will examine the historical context of each mode, and the ways in which certain artists have created works which are both grounded in historical styles and highly original. Each student will then write a short screenplay or play in each style. These short pieces will lead to the development of a final project: the first thirty pages and complete outline of a full-length screenplay or play."}, {"name": "Class Materials (Required)", "value": "The Lower Depths, Maxim Gorky <br/>Broke-ology, Nathan Louis Jackson<br/>The Bald Soprano and Other Plays, Eugene Ionesco <br/>Blue Heart, Caryl Churchill <br/>Machinal, Sophie Treadwell (handout)<br/>Blasted, Sarah Kane<br/>Mother Courage, Bertolt Brecht <br/>The Octaroon, Branden Jacobs-Jenkins<br/><br/>In addition to these required texts, each student will be responsible for providing 12 copies of four ten-page scripts to the class."}], "lmod": "1/9/16 6:39 PM (CT)", "subject": "RTVF"}]