[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "University Hall 118"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Spring 2016", "name": "34884", "title": "WCAS ENGLISH 101-6-23 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "34884", "instructors": [{"instructor_phone": "", "instructor_name": "Whitney Blair Taylor", "instructor_addr": ""}], "topic": "Memory and Imagination", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "Does memory have a history? How do writers evoke and represent memories, and to what extent - and does it matter if - those representations are true to reality? How has the &quot;art of memory&quot; changed over time, and what &quot;futures of memory&quot; might we imagine? This course will consider changing concepts of memory, especially the metaphors we use to conceive of and talk about memory. While attending to the interdisciplinary nature of the topic of memory, the course will focus on representations of memories, remembering, forgetting, and commemoration in literature and culture. We will explore topics including classical and medieval concepts of memory and imagination, the relationship between memory and writing, memory and identity, nostalgia, how our senses trigger memories, trauma theory, collective memory and memorialization, and how changing technologies are changing our metaphors for and concepts of personal and collective memory.<br/><br/>Readings will include short fiction, poetry, essays, and academic writing by a variety of writers, including Augustine, James Baldwin, Elizabeth Bishop, Charles Bukowski, Jorge Luis Borges, Italo Calvino, John Donne, Mavis Gallant, Primo Levi, W.S. Merwin, Toni Morrison, Tim O'Brien, Vladimir Nabokov, Walker Percy, Plato, Marcel Proust, Natasha Trethewey, Frances Yates, and W.B. Yeats. We will also read articles on memory and cognition, memory and technology, and different possibilities writers and filmmakers have imagined for the future of memory, including the novella, The Memory Thieves, and episodes from the television show, Black Mirror."}], "lmod": "4/3/16 7:57 PM (CT)", "subject": "ENGLISH"}]