[{"class_mtg_info": [{"meet_t": "MoWeFr 1:00PM - 1:50PM", "meet_l": "University Library 5746"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24109", "title": "WCAS FRENCH 305-0-20 French Phonetics", "class_attributes": "Attendance at 1st class mandatory<br/><br/>Prerequisites apply, see description<br/><br/>Read &amp; Discuss in language<br/><br/>", "section": "24109", "instructors": [{"instructor_phone": "847/467-3685", "instructor_name": "Patricia L Scarampi", "instructor_addr": "1860 Campus Drive, Crowe Hall #2-117"}], "topic": "Theory and Practice of French Sounds", "course": "305-0", "descriptions": [{"name": "Overview of class", "value": "This course is designed to help you improve the pronunciation, intonation, and fluency of your spoken French, as well as to give you an overall understanding of the phonetic system of the contemporary French language."}, {"name": "Registration Requirements", "value": "French 202 or consent of instructor"}, {"name": "Learning Objectives", "value": "The goal of the course is the development of native-like spoken French, through intense practice in correct production of the sounds of the language. Emphasis will be placed on intonation patterns, rhythm, liaison, etc. Oral practice is given within a communicative and cultural context, with attention to features of current usage referring to standard French.The course will also address issues in theoretical phonetics, particularly articulatory description and phonetic transcriptions using the International Phonetic Alphabet."}, {"name": "Teaching Method", "value": "The teaching method consists of lectures and discussions with numerous exercises geared towards specific problems, of extensive use of songs and poetry that reflect different registers of language, both formal and casual, and recordings of texts on a computer. The class is conducted entirely in French."}, {"name": "Evaluation Method", "value": "Students will be evaluated based on their participation, oral and written homework, quizzes and exams, and a final oral exam."}, {"name": "Class Materials (Required)", "value": "Diane Dansereau, Savoir Dire, 2nd ed. Houghton Mifflin,2006"}], "lmod": "12/24/16 6:58 PM (CT)", "subject": "FRENCH"}]