[{"class_mtg_info": [{"meet_t": "We 6:15PM - 9:15PM", "meet_l": "Wieboldt Hall 505"}], "school": "SCS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "37837", "title": "SCS ANTHRO 211-CN-15 Culture and Society", "class_attributes": "", "section": "37837", "instructors": [{"instructor_phone": "", "instructor_name": "Jesse Stewart Mumm", "instructor_addr": ""}], "topic": "", "course": "211-CN", "descriptions": [{"name": "Overview of class", "value": "Anthropology is the study of humanity across space and time. It is the most interpretive science of all the social sciences, meaning that its methods are just as much scientific as they are relative and subjective. Cultural anthropology focuses on commonalities and differences, in order to understand human beings as social creatures embedded in systems of race, class, and gender. In Culture and Society, students learn about the discipline by reading recent scholarship and experimenting with its research methods. The course addresses language and art, gender and sexuality, kinship and family, race and ethnicity, economics and politics, religion and health, and globalization and migration. Students develop an appreciation for cultural diversity as they read the results of anthropological research conducted the world over and hone their analytical skills as they investigate the cultural worlds they engage with right here in Chicago. An understanding of human cultural diversity will be developed, as well as a cross-cultural perspective of subsistence practices, political and economic systems, marriage patterns and kinship, ritual and religion, and ethnicity. Students will design and conduct their own short research projects, and will also explore cultural relativism, the holistic approach, observations and ethnography, through readings but also by real practice. Students will be evaluated on weekly responses to readings and quizzes, and two papers involving their own ethnography and analysis, and a class format focusing on writing and discussion."}, {"name": "Registration Requirements", "value": "None."}, {"name": "Learning Objectives", "value": "Become fluent in the major terms and approaches in cultural anthropology.<br/>Identify and analyze the relations between political economy and culture.<br/>Achieve an understanding of the tensions in ethnocentrism and cultural relativism.<br/>Find your anthropological voice in writing persuasive interpretations of human life."}, {"name": "Teaching Method", "value": "Class participation<br/>Discussion and debate<br/>Films/videos<br/>Group work<br/>Lecture<br/>Presentations<br/>Readings<br/>Research Projects<br/>Writing Assignments"}, {"name": "Evaluation Method", "value": "Weekly Reading Reviews<br/>Weekly Quizzes<br/>Participation<br/>Leading Discussion<br/>Two Research Project Reports"}, {"name": "Class Materials (Required)", "value": "One required cultural anthropology textbook plus one required ethnography book plus additional articles on related topics made available on Canvas."}, {"name": "Class Notes", "value": "This course will be reading and writing intensive, and class sessions are based on dialogue and participation by all students in reflection, argument and interpretation of culture and society."}], "lmod": "4/3/16 7:31 PM (CT)", "subject": "ANTHRO"}]