[{"class_mtg_info": [{"meet_t": "MoWe 10:00AM - 11:50AM", "meet_l": "Technological Institute F279"}], "school": "MEAS", "overview_of_class": "COURSE DESCRIPTION / <br/>This course focuses on the design, administration and analysis of various types of surveys aimed at collecting transportation data. Topics include: theories and techniques of sampling for travel surveys; methods and modes of survey implementation; types of information (revealed, stated or retrospective) collected through different questionnaires; and design of stated preference experiments for discrete choice modelling. Participants will design their own survey step-by step, administer to a sample of respondents and then process and analyze the data. Techniques of data-exploration and modelling using R software, on real survey data, will be taught. Appropriate methods for collecting travel survey data is necessary for planning and management of transportation systems. The knowledge gained from this course is valuable for research and professional practice in transportation planning, operations and management.<br/><br/> <br/>GOALS / <br/>A graduate level course in survey design and data analysis that puts the learning into practice by effectively designing a mini-study including collecting and analyzing data and communicating the results", "qtr": "Spring 2016", "name": "Survey methods, data and analysis", "title": "MEAS CIV_ENV 473-0-1 Survey methods, data and analysis", "lmod": "4/3/16 6:58 PM (CT)", "section": "1", "instructors": [{"instructor_phone": "847/491-5629", "instructor_name": "Amanda Irini Blomberg Stathopoulos", "instructor_addr": "Tech Institue / Room A335"}], "topic": "", "course": "473-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "COURSE DESCRIPTION / <br/>This course focuses on the design, administration and analysis of various types of surveys aimed at collecting transportation data. Topics include: theories and techniques of sampling for travel surveys; methods and modes of survey implementation; types of information (revealed, stated or retrospective) collected through different questionnaires; and design of stated preference experiments for discrete choice modelling. Participants will design their own survey step-by step, administer to a sample of respondents and then process and analyze the data. Techniques of data-exploration and modelling using R software, on real survey data, will be taught. Appropriate methods for collecting travel survey data is necessary for planning and management of transportation systems. The knowledge gained from this course is valuable for research and professional practice in transportation planning, operations and management.<br/><br/> <br/>GOALS / <br/>A graduate level course in survey design and data analysis that puts the learning into practice by effectively designing a mini-study including collecting and analyzing data and communicating the results"}, {"name": "Registration Requirements", "value": "No prerequisite"}, {"name": "Learning Objectives", "value": "? Understand and evaluate existing survey techniques appropriate for collecting transportation behavior data <br/>? Gain the ability to develop an experimental behavioral survey, including sampling, experimental design, and administration methods<br/>? Gain hands-on experience in using relevant software and methods to analyze travel survey data.<br/>? Learn how to properly interpret and analyze data and how to communicate the analysis<br/>Points 2-4 are put into practice by effectively designing a mini-study including collecting and analyzing data and communicating the results"}, {"name": "Teaching Method", "value": "Classes are combination of lectures, student-led discussions, peer-laboratory and computer laboratory work. In parallel with teaching the different components the class will develop their own surveys and learn the material in practice."}, {"name": "Evaluation Method", "value": "Class participation: 20%<br/>Exam, final: 20%<br/>Homework: 60%<br/>The grade is based on a series of assignments of various nature, both individual and group homework assignments, class presentation, and discussions. <br/>For individual homework assignments students may collaborate but need to prepare and present results and interpretations independently. For group homework assignments a single collective report is handed in and students choose their preferred method to collaborate. Assignments will be handed in to Canvas not sent by email to facilitate the administration. The grade will be based on the following components;"}, {"name": "Class Materials (Required)", "value": "An important part of our work in class will be from articles. But it is a good idea to begin assembling a library of basic references. The reference textbook for the course is: Peter Stopher, Collecting, Managing, and Assessing Data Using Sample Surveys, Cambridge University Press, 2012. The class will also draw on the Transportation Research Board online travel survey manual <br/>plus distributed notes and supplemental readings posted on Canvas or e-mailed to you."}], "path": "/class-descriptions/4620/MEAS/CIV_ENV/473-0/37668", "instructor": ["Amanda Irini Blomberg Stathopoulos"], "class_attributes": "", "id": "37668", "subject": "CIV_ENV"}]