[{"class_mtg_info": [{"meet_t": "Tu 9:30AM - 12:20PM", "meet_l": "Parkes Hall 224"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: No freshmen allowed. Pre-registration is for Global Health Studies Minor only. Registration is open to other students after pre-registration.", "qtr": "Spring 2017", "name": "33932", "title": "WCAS GBL_HLTH 390-0-21 Special Topics in Global Health", "class_attributes": "No Freshmen<br/><br/>", "section": "33932", "instructors": [{"instructor_phone": "", "instructor_name": "Peter Andrew Locke", "instructor_addr": "1812 Hinman Avenue"}], "topic": "Trauma and its Afterlives", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "This course draws on perspectives from anthropology, related social scientific fields, and the humanities to provide a critical introduction to psychological trauma and its increasingly significant place in contemporary global health discourses and agendas. We will explore the history of the concept and its applications in Western literature, science, and medicine; consider the relatively recent construction of Post-Traumatic Stress Disorder (PTSD) as a diagnostic category and the clinical approaches developed to treat it; and examine the politics and effects of applying the concept abroad through humanitarian psychiatry and/or global mental health projects. Key questions of the course will include: how and why has trauma become one of the most important signifiers of our era?and a key criterion of &quot;victimhood?&quot; What politics and debates have shaped the development and application of the PTSD diagnosis in recent decades? And how have notions of trauma and their varied applications transformed politics, suffering, and care in diverse communities around the world?"}, {"name": "Class Materials (Required)", "value": "FASSIN, Didier, and Richard Rechtman. 2009. The Empire of Trauma: An Inquiry into the Condition of Victimhood. Princeton: Princeton University Press.<br/><br/>FINLEY, Erin P. 2011. Fields of Combat: Understanding PTSD among Veterans of Iraq and Afghanistan. Ithaca: Cornell University Press.<br/><br/>Remainder of readings will be available on Canvas."}], "lmod": "2/14/17 6:45 PM (CT)", "subject": "GBL_HLTH"}]