[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "University Hall 121"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-Registration restricted to African Studies Adjunct Majors.", "qtr": "Spring 2017", "name": "32233", "title": "WCAS AFST 390-0-23 Topics in African Studies", "class_attributes": "", "section": "32233", "instructors": [{"instructor_phone": "", "instructor_name": "Philippa Ann Skotnes", "instructor_addr": ""}], "topic": "Other Histories and the Limits of Archive", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "AFST 390-0-23 &quot;Other Histories and the Limits of Archive&quot; Pippa Skotnes, Spring 2017 (Also HISTORY 392-0-40)<br/><br/>In many colonial contexts, the pre-colonial has been cast as outside of history. And yet there are places where individuals and their lives have survived the oblivion of history and where something of their lived experience can be recovered. These places indicate productive sites of knowing not only about the small histories of the past, but how these speak to, and elucidate, relations of power and aspects of global history. While this course will focus specifically on an archive assembled in the 1870s and 1880s in colonial South Africa (the Bleek and Lloyd Archive), comprising thousands of pages of interviews with several prisoners described at the time as indigenous hunter-gatherers, or &quot;Cape Bushmen&quot; (now known as |xam), and 4 young displaced boys from northern Namibia, it will also be attentive to the importance of thinking about archives in unconventional ways. The course will give students the opportunity to work with primary sources, - including photographs, maps, genealogies and drawings, as well as stories of origin, of conflict with settlers and relationships with animals, of murder, hunting, personal histories, and of times stretching into the pre-colonial past - to consider visual and object sources, and to think about the effect the making of an archive has on the histories it is able to generate."}, {"name": "Learning Objectives", "value": "At the end of the course students will be familiar with a unique African archive (the Bleek and Lloyd archive) as well as ways of thinking about both colonial archives, their limits and their possibilities, and about how the various individuals in this archive present us with diverse ways of conceptualising history, taxonomies, intellectual and creative traditions. Students will be expected to think about how the archive intersects with global histories, for example a history of ivory trade, or genocide; as well how it intersects with the understanding of European traditions, such as Upper Palaeolithic rock art. The course will assist students to see the value of interdisciplinary approaches to the archive, where archaeological, literary, historical, curatorial and anthropological approaches may be seen to both challenge and enrich each other. Students will be expected to apply the insights of the course to other archives and other histories. The course will introduce students to some of the complexities and ethics of working with this kind of primary material related to a history of people whose lives were characterised, in the colonial era, by exploitation and extermination."}, {"name": "Teaching Method", "value": "The course will include lectures, discussion sessions and seminars"}, {"name": "Evaluation Method", "value": "There will be no exam in this course. Two projects will be required. The one will take the form of an essay related to topics introduced around archive and the Bleek and Lloyd material, requiring students to draw on the digitised but unpublished 19th century texts. For the second project, students will be able to select an archive of their own (a digital or online archive, a family archive, or an object collection) and, in writing about an aspect of this archive, show how it integrates with other, broader histories, helping to elucidated these. Students will be assessed on the basis of these two projects as well as on written responses to weekly readings."}, {"name": "Class Materials (Required)", "value": "A course reader with weekly readings will be available for this course"}], "lmod": "2/13/17 6:40 PM (CT)", "subject": "AFST"}]