[{"class_mtg_info": [{"meet_t": "Tu 2:00PM - 4:50PM", "meet_l": "Locy Hall 109"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Juniors &amp; Seniors<br/>Add Consent: Department Consent Required<br/>", "qtr": "Spring 2016", "name": "30911", "title": "WCAS BUS_INST 394-0-24 Professional Linkage Seminar", "class_attributes": "Attendance at 1st class mandatory<br/><br/>Juniors/Seniors Only<br/><br/>", "section": "30911", "instructors": [{"instructor_phone": "", "instructor_name": "Seth Jacob Green", "instructor_addr": ""}], "topic": "Lessons in Non-Profit Mgmt", "course": "394-0", "descriptions": [{"name": "Overview of class", "value": "*INFORMATION IS SUBJECT TO CHANGE*<br/><br/><br/>The instructor of &quot;Lessons in Non-Profit Management&quot; is: Seth Green.<br/><br/><br/>In this course, we will dive into the exciting world of non-profits and immerse ourselves in everything from how non-profits finance their efforts to how they measure their performance. We will also look at what makes a great consultant, as you serve as a consultant to a non-profit client.<br/><br/><br/>This course brings together students from a variety of academic disciplines and leverages their diverse talents in the field to consult nonprofits facing organizational challenges in addressing issues such as poverty, homelessness and education. Bridging the divide between academic experience and civic engagement, teams of five undergraduate students have the opportunity to work on ten-week engagements with nonprofits under the supervision of Kellogg MBA students.<br/><br/><br/>To inform and guide students` interaction with nonprofits, this course will provide an overview of the nonprofit sector and the growing trends towards greater accountability, transparency and performance management. Students will explore the changing roles and responsibilities of nonprofits, as shaped by both the public and private sector, and they will examine the implications of these trends. The first half of the course will be spent introducing students to the Third Sector and the present political and economic systems that influence how it serves the public good. The second half of the course will be spent examining business strategy and management and their applicability to nonprofits. The overarching goal of the course is to create a foundation of knowledge from which students can draw upon as they work together with community nonprofits. This course is an opportunity to innovate, collaborate, learn and apply a new set of skills and knowledge while impacting the community."}, {"name": "Registration Requirements", "value": "Enrollment Requirements: Juniors/Seniors Only<br/><br/>Add Consent: Department Consent Required<br/><br/>Applications Only: http://www.campuscatalystnu.org<br/>"}, {"name": "Learning Objectives", "value": "1. Students will successfully develop tangible solutions to specific, measurable problems faced by community-based nonprofit organizations.<br/><br/><br/>2. Students will gain an understanding of the basics of the consulting process and how to conduct a professional business relationship.<br/><br/><br/>3. Through readings, class discussion, and interaction with guest speakers, students will gain an understanding of the social sector and trends that are changing the way nonprofit organizations and other social enterprises pursue their charitable, philanthropic and broader, mission-oriented objectives.<br/><br/>"}, {"name": "Teaching Method", "value": "This course will meet once weekly in a seminar format. Class participation and discussion will be required to make the course successful. There will be weekly reading assignments. <br/><br/><br/>The major requirements of this class, in addition to class preparation and participation, include:<br/><ul><br/><li>Group PowerPoint presentations at Weeks 4 and 8</li><br/><li>Final PowerPoint presentation at project conclusion</li><br/><li>Work with nonprofit client</li><br/><li>Weekly meeting with mentor</li><br/></ul>"}, {"name": "Evaluation Method", "value": "The Final Grade has two-parts:<br/><br/><br/>Individual: 50% <br/><br/>- 30% Participation in and evidence of preparation for class discussions - I am seeking active participation in our class discussions, clearly informed by your knowledge of our weekly readings. Part of your preparation for class participation will be writing a key question, problem or concept from the readings that particularly resonated with you or your project, and posting your thoughts on Blackboard by midnight on the Sunday before each class where readings will be discussed. As we only have 8 class discussions during the quarter (3 of the classes will be presentations), my expectation is that you will be at every class and participating in each class discussion. If you have an unexcused absence, your grade will be reduced. If you have an excused absence, then you must submit a one-page response to a weekly reading of your choice as a substitute for your class discussion grade for that week.<br/><br/><br/>- 10% Concept Paper - You will write a two-page conceptual paper (to hand in on week ten) outlining how you envision being involved in social change after you graduate from Northwestern and the skills you seek to gain to be the change you wish to see in the world.<br/><br/><br/>- 10% Team Member Evaluation - As part of your project, you will be evaluated by your teammates on your participation and work with your consulting team <br/><br/><br/>Team: 50% <br/><br/>10% Presentation #1, Week Four - After this presentation, I will meet with your team to discuss your scope of work, presentation and recommendations on how you should proceed to Presentation #2. <br/><br/><br/>10% Presentation #2, Week Eight - This grade will be based on the progress made from Presentation #1 and the methodology and workplan as you move towards your final recommendations to the client. <br/><br/><br/>25% Final Presentation and Report (including project case study), Finals Week - This grade is based on your final deliverable and case study.<br/><br/><br/>5% Client Evaluation - your team will be evaluated by your client.<br/><br/>"}, {"name": "Class Materials (Required)", "value": "&quot;The Jossey-Bass Handbook of Nonprofit Leadership and Management&quot; by David O. Renz, 3rd edition."}, {"name": "Class Notes", "value": "Application-only course. <br/><br/>Those accepted to cC (Campus Catalyst) teams will be given permission numbers for this course."}], "lmod": "4/3/16 7:50 PM (CT)", "subject": "BUS_INST"}]