[{"school": "SCS", "overview_of_class": "Presidential elections are hard fought and can be controversial. The historic 2008 election of President Barack Obama saw the election of America's first African American chief executive and a contest where women candidates in both parties were center stage in both the primary and general elections. Another controversial election was the 2000 battle between George W. Bush and Al Gore. While Bush was ultimately elected, the fallout from the recount and the Supreme Court decision that gave Bush the victory will be felt and studied for years to come. This course will examine presidential races using the 2012, 2008 and 2000 races and the press coverage of the controversies that surrounded them as its central point. We will also explore the coverage of previous races and challenge some of the myths about elections and their outcomes. We will be following the events of the 2016 campaign closely and discuss the latest tactics and developments in the race each week.", "name": "Special Topics", "section": "64", "location": "Parkes Hall 212", "topic": "Press, Presidential Elections", "course": "390-CN", "meeting_time": ["Tu 6:15PM - 9:15PM"], "path": "/class-descriptions/4620/SCS/POLI_SCI/390-CN/37916", "instructor": ["Lawrence L Stuelpnagel"], "class_attributes": "", "id": "37916", "subject": "POLI_SCI"}, {"school": "SCS", "overview_of_class": "Growth, Democracy and Security: Africa in the Obama Era <br/><br/>\"After 1989, many authoritarian systems across the world collapsed while the fortunes of liberal democracy rose. In Africa, democratization received a boost from renewed economic growth. Free-market economies seemed a natural fit with liberalized political systems. Yet many autocratic regimes discovered they could open their economies to market forces while preventing the emergence of fully competitive political systems. The terrorist bombing of the U.S. embassies in Kenya and Tanzania in August 1998, followed by the attacks on the World Trade Center and the Pentagon in September 2001, added a complicating dimension: Stability and security, priorities of the Cold War era, returned to prominence in Africa and elsewhere.\"- R. Joseph, \"Growth, Security, and Democracy in Africa,\" Journal of Democracy (October 2014). <br/><br/>This course will include the core concerns of this article: \"Development without Democracy,\" \"New and Old Authoritarianism,\" \"Democracy Promotion and Security Dilemmas,\" and \"The Nigerian Experience.\" Other topics will be President Obama's Foreign Policy Vision and Impact, and the South African Experience. Students will read analyses of African and global developments, and guest lecturers will report on ongoing research connected to the topics. Students will be able to explore relevant issues and country experiences of interest to them. Real-world developments in Africa will be taken up in class sessions and connect to ongoing collaborative initiatives.<br/><br/>The instructor has just returned from delivering a major address in Nigeria on the topic. Read more at: http://www.tribuneonlineng.com/nigeria-must-increase-its-capacity-to-meet-domestic-regional-global-challenges-prof-richardjoseph.", "name": "Special Topics", "section": "65", "location": "Parkes Hall 212", "topic": "Growth, Democracy in Africa", "course": "390-CN", "meeting_time": ["We 6:15PM - 9:15PM"], "path": "/class-descriptions/4620/SCS/POLI_SCI/390-CN/37917", "instructor": ["Richard A Joseph"], "class_attributes": "", "id": "37917", "subject": "POLI_SCI"}]