[{"class_mtg_info": [{"meet_t": "TuTh 5:00PM - 6:20PM", "meet_l": "Frances Searle Building 3220"}], "school": "SoC", "enrl_requirement": "", "qtr": "Winter 2016", "name": "22964", "title": "SoC CSD 307-0-20 Acoustic Phonetics", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "22964", "instructors": [{"instructor_phone": "", "instructor_name": "Sazzad Mahmud Nasir", "instructor_addr": ""}], "associated_classes": [{"component": "DIS", "room": "CSD Sem Rm B302 - Frances Srle", "meeting_time": "We 5:00PM - 5:50PM"}], "topic": "", "course": "307-0", "descriptions": [{"name": "Overview of class", "value": ".The goal of the course is to understand acoustical properties of speech sounds. Why does the speech sound the way it is? What are the roles of articulators in shaping speech sounds? In this course we will focus on some of these questions under the umbrella of the source-filter theory. <br/><br/>We will begin by laying a foundation of the basic acoustics: study fundamental properties of sound waves, types of sound sources and resonant properties of the oral cavity. We will then develop tools for analyzing speech signals. We will next learn about auditory representation of speech sounds as it relates to perception, properties of vowels and consonants, speech in context, prosodic features, perception and hearing loss. <br/><br/>At the conclusion of the course, students will be able to:<br/>1. Summarize the Acoustic Theory of Speech Production, including source and filter components and their interactions.<br/>2. Relate how listeners interpret acoustic properties of sounds in order to recognize speech and discuss how these are different in clinical populations.<br/>3. Relate ways in which acoustic measures could be used as methodological tools in the study of normal and disordered phonology as well as pre-post treatment measures. <br/>4. Apply concepts of acoustic features and perceptual saliency in explaining diagnostic findings.<br/>5. Generate and interpret visual and numerical acoustic data related to voice and speech production, using appropriate equipment and computer software. <br/>6. Compare acoustic features of consonants and vowels under conditions of relative isolation and naturalistic speech, including stress and intonation.<br/>7. Describe categories of vowels and consonants according to their frequency, intensity, and temporal features.<br/><br/><br/><br/>Texts:<br/>· Johnson, K. Acoustic and Auditory Phonetics, 3rd Edition. Wiley-Blackwell. Recommended (KJ).<br/>· Ladefoged, P. Elements of Acoustic Phonetics, 2nd Edition. University of Chicago. Recommended."}, {"name": "Teaching Method", "value": "Instructor-led presentations, class discussion, student presentations, in-class student group activities, lab projects and assignments."}, {"name": "Evaluation Method", "value": "The final course grade will be based on 3-4 quizzes, class participation, student presentations, and lab projects. Examination questions will include multiple-choice, true/false and short answer formats."}, {"name": "Class Materials (Required)", "value": "Acoustics and auditory phonetics by Keith Johnson (2003) [KJ] &amp; Elements of Acoustic Phonetics by Peter Ladefoged (1995) [PL]. Additional handouts will be provided as needed."}, {"name": "Class Notes", "value": "Tentative lab assignments: Recording speech; types of spectrograms; vowel formants; sibilants; voicing; prosody; coarticulation; categorical perception. Lab schedules to be announced later."}], "lmod": "1/9/16 6:38 PM (CT)", "subject": "CSD"}]