[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Frances Searle Building 1421"}], "school": "MEAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "31649", "title": "MEAS MECH_ENG 495-0-25 Selected Topics in Mechanical Engg", "class_attributes": "", "section": "31649", "instructors": [{"instructor_phone": "847/491-3054", "instructor_name": "Oluwaseyi   Balogun", "instructor_addr": "Catalysis Bldg, Rm 325, 2137 Tech Drive, EV CAMPUS"}], "topic": "Elastic Waves in Periodic Media", "course": "495-0", "descriptions": [{"name": "Overview of class", "value": "This course is designed to provide a theoretical background on the propagation of elastic stress waves in solids with periodic variation in geometry or elastic properties, a review of experimental techniques for actuation and detection of elastic waves, and an overview of state-of-the art applications of wave propagation in linear and nonlinear periodic media.<br/><br/>Mini Syllabus<br/>? Introduction to stress waves in a 1D elastic continuum<br/>? Concepts of wave dispersion, group velocity, phase velocity<br/>? Experimental methods<br/>? Finite element simulation of stress waves in solids<br/>? Wave propagation in 1D and 2D atomic chains<br/>? Design of phononic structures and metamaterials<br/>? Review of the state-of-the-art (phononic bandgaps, acoustic filters, topological insulators, etc.)"}, {"name": "Registration Requirements", "value": "The course content is tailored to senior undergraduate and graduate students majoring in civil engineering, mechanical engineering, applied mathematics, and physics."}, {"name": "Learning Objectives", "value": "The course provides a basic understanding of approaches to exploit geometry and mechanical properties in the context of periodic structures to realize novel system behavior. Some applications of these structures include, sound insulation in buildings for earthquake protection, vibration cloaking of sensitive components, super-resolution imaging using elastic or acoustic waves, multifunctional sensors and actuators for controlling vibration of beams and plates, and energy conversion. In this course, we will explore analytical and numerical approaches to design and study the behavior of elastic waves in complex periodic structures. The course has the potential to serve as a spring board for pursuing research in the growing field of elastic metamaterials and periodic structures."}, {"name": "Class Materials (Required)", "value": "Class notes will be provided. We will consult chapters from the references below<br/><br/>? J.D. Achenbach, Wave Propagation in Elastic Solids <br/>? K.F. Graff, Wave Motion in Elastic Solids<br/>? L. Brillouin, Wave Propagation in Periodic Structures, 1953<br/>? M. Maldovan, E.L. Thomas, Periodic Materials and Interference Lithography for Photonics, Phononics and Mechanics, by Wiley-VCH.<br/>? J.F. Doyle, J.F., Wave Propagation in Structures, Springer, NY, 1989"}, {"name": "Class Notes", "value": "Graduate Standing, Senior undergraduate or permission of instructor."}], "lmod": "2/16/17 6:37 PM (CT)", "subject": "MECH_ENG"}]