[{"class_mtg_info": [{"meet_t": "Fr 9:00AM - 11:50AM", "meet_l": "Swift Hall 210"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-requisite: Students must have completed Psych 205 and either Psych 361 or Psych 363 to enroll in this course.", "qtr": "Winter 2017", "name": "25588", "title": "WCAS PSYCH 368-0-20 Human Memory", "class_attributes": "Natural Sciences Distro Area<br/><br/>Social &amp; Behavioral Sciences Distro Area<br/><br/>Attendance at 1st class mandatory<br/><br/>", "section": "25588", "instructors": [{"instructor_phone": "", "instructor_name": "Eric William Gobel", "instructor_addr": ""}], "topic": "", "course": "368-0", "descriptions": [{"name": "Overview of class", "value": "This course concerns the scientific study of human memory. In a discussion format, students will learn about the experimental methods as well as the principles of human memory that are revealed with these methods. Each week students will analyze research results in detail to determine whether scientists' conclusions are convincing. Students will learn to think carefully about how scientists gain knowledge about various aspects of human memory, including encoding, retrieval, consolidation, false remembering, and forgetting. A cognitive neuroscience perspective will be emphasized."}, {"name": "Registration Requirements", "value": "Prerequisites: Psych 361, 363, or 365. Students must also complete Psych 205 before taking this course."}, {"name": "Teaching Method", "value": "Student-led presentations and class discussion guided by the instructor."}, {"name": "Evaluation Method", "value": "Grades will be based on participation in class discussion, short weekly papers due before every class, presentations, and the final paper."}, {"name": "Class Materials (Required)", "value": "Readings gathered from the contemporary literature on human memory (available online), along with a textbook, Memory (Second Edition), by Alan Baddeley, Michael W. Eysench, and Michael C. Anderson, Psychology Press, 2015. Paperback ­ ISBN: 978­1­84872­184­5"}], "lmod": "12/25/16 7:06 PM (CT)", "subject": "PSYCH"}]