[{"class_mtg_info": [{"meet_t": "Mo 6:15PM - 9:15PM", "meet_l": "University Hall 118"}], "school": "SCS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "27778", "title": "SCS ENGLISH 378-CN-62 Studies in American Literature:", "class_attributes": "", "section": "27778", "instructors": [{"instructor_phone": "8474914965", "instructor_name": "Charles S Yarnoff", "instructor_addr": "555 Clark St., 243"}], "topic": "The American Short Story", "course": "378-CN", "descriptions": [{"name": "Overview of class", "value": "Among the literary masterpieces of the past 100 years are the short stories of American writers such as Ernest Hemingway, Flannery O'Connor, Eudora Welty, and Raymond Carver. We will explore style and theme in the works of these and other short story writers. We will also examine the influences that these writers had on each other and on the development of the short story in general. Class will be conducted primarily by group discussion with the instructor giving brief lectures to provide background on the authors."}, {"name": "Registration Requirements", "value": "Students should have fulfilled the SPS writing requirement or taken equivalent writing courses."}, {"name": "Learning Objectives", "value": "Students will:<br/>-gain an understanding of the continuities and changes in thematic concerns expressed in American short stories over the last one hundred years.<br/>-gain an understanding of the continuities and changes in artistic techniques used by American short story writers over the last one hundred years.<br/>-develop their ability to write papers on literature."}, {"name": "Teaching Method", "value": "Class discussion<br/>Lecture<br/>Readings<br/>Writing assignments"}, {"name": "Evaluation Method", "value": "Take-home midterm exam <br/>Take-home final exam<br/>Course paper <br/>Class attendance and participation"}, {"name": "Class Materials (Required)", "value": "Coursepack of stories (available at Quartet Copies in Evanston)"}, {"name": "Class Notes", "value": "You will have the opportunity to revise both your midterm exam essay and course paper after receiving feedback from the instructor. <br/><br/>For the course paper, you will have two options: (1) an analysis of a particular author's work that we've studied, or (2) a short story of your own written in the style of an author that we've studied."}], "lmod": "1/9/16 6:41 PM (CT)", "subject": "ENGLISH"}]