[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "Parkes Hall 213"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Winter 2017", "name": "25056", "title": "WCAS ENGLISH 105-6-20 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "25056", "instructors": [{"instructor_phone": "847/491-4560", "instructor_name": "Jeanne Elizabeth   Herrick", "instructor_addr": "555 Clark St., 237"}], "topic": "Chicago Voices", "course": "105-6", "descriptions": [{"name": "Overview of class", "value": "One of the many benefits of attending Northwestern is its proximity to one of the greatest cities in the world: Chicago. However, with classes and other commitments, it is often challenging for NU students to get beyond Chicago's front doors: Millennium Park or Wrigley Field or Michigan Avenue. In this course, we will explore a Chicago neighborhood and get to know Chicago better by listening to and learning from some of its residents. Students will be encouraged to continue their exploration of Chicago by focusing on an aspect that appeals to them, e.g. Chicago politics, theatre, business, education, safety, health, etc.?whatever interests the individual student."}, {"name": "Teaching Method", "value": "There will be one required field trip to Chicago so that students can interview and record the oral histories of a Chicagoan. Other optional field trips may be arranged if there is student interest. However, the majority of the course will be class discussions, some limited lectures, and in class activities."}, {"name": "Evaluation Method", "value": "Writing will account for 80% of the course grade, while the remaining 20% will be based on students' demonstrated engagement in the course through participation in class discussions, workshops, the field trip, and writing exercises. <br/><br/>NUMBER OF WRITING ASSIGNMENTS AND THEIR LENGTHS:<br/>Students will write three papers, revising each at least twice.<br/>Essay One ? 4-6 pages;<br/>Essay Two ? 5-7 pages;<br/>Essay Three ? 6-8 pages (based on outside research).<br/><br/>There will be no final exam. In addition to the three formal papers, students will write several brief summaries (a paragraph) and/or responses to readings and a few writing exercises, most of which will be written in class."}, {"name": "Class Materials (Required)", "value": "We will begin with reading Erik Larson's National Book Award winning Devil in the White City, scheduled to be made into a movie directed by Martin Scorsese and starring Leonardo DiCaprio. In addition, we will read Bruce Norris's Pulitzer Prize winning play Clybourne Park, and update of Lorraine Hansberry's A Raisin in the Sun. There will also be a course pack of shorter readings including Chicago oral histories, biographies, politics and journalism."}], "lmod": "12/25/16 6:58 PM (CT)", "subject": "ENGLISH"}]