[{"class_mtg_info": [{"meet_t": "Th 2:00PM - 4:50PM", "meet_l": "Annenberg Hall 101"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "34021", "title": "WCAS JWSH_ST 390-0-1 Topics in Jewish Studies", "class_attributes": "", "section": "34021", "instructors": [{"instructor_phone": "847/491-9902", "instructor_name": "Aaron   Packman", "instructor_addr": "2145 N. Sheridan / Tech A314"}], "topic": "Water in Isr &amp; Mid East: Confl Chal &amp; Sol", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "Water in Israel and the Middle East: Resilience, Sustainability, Security<br/><br/>The course will provide an overview of the climatic and geographical limitations on water availability in Israel and the Middle East, discuss ancient and modern societal responses to these limitations, and define opportunities for development of sustainable solutions for regional stability and prosperity. OPEN TO SENIORS AND GRADUATE STUDENTS."}, {"name": "Registration Requirements", "value": "Must be seniors or graduate students."}, {"name": "Learning Objectives", "value": "The course will provide an overview of the climatic and geographical limitations on water availability in Israel and the Middle East, discuss ancient and modern societal responses to these limitations, and define opportunities for development of sustainable solutions for regional stability and prosperity."}, {"name": "Evaluation Method", "value": "Students will read relevant selections from the literature each week, prepare a brief position paper exploring one major aspect of each set of readings, and participate in a structured, in-depth discussion of major themes by critically evaluating and cross-comparing the positions that each student articulated in their position papers. The course explicitly cross-cuts historical, social, geopolitical, scientific, and technological themes, so students are expected to lead discussions within their primary domain(s) of interest and contribute to broader class discussions of cross-cutting themes."}, {"name": "Class Materials (Required)", "value": "Pearce, Fred. When the rivers run dry: Water, the defining crisis of the twenty-first century. Beacon Press, 2006.<br/><br/>Siegel, Seth M. Let There Be Water: Israel's Solution for a Water-Starved World. Macmillan, 2015.<br/><br/>Amery, Hussein A., and Aaron T. Wolf, eds. Water in the Middle East: A geography of peace. University of Texas Press, 2010.<br/><br/>Jerusalem Archaeological Sites: Biblical Water Systems, Jewish Virtual Library, https://www.jewishvirtuallibrary.org/jsource/Archaeology/jerwater.html<br/> <br/>Selections from the current literature on water resources, climate change, and emerging water technologies in Israel and the Middle East."}], "lmod": "2/6/17 8:42 AM (CT)", "subject": "JWSH_ST"}]