[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Harris Hall L28"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "34423", "title": "WCAS SOCIOL 309-0-20 Political Sociology", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "34423", "instructors": [{"instructor_phone": "847/491-3719", "instructor_name": "Ann Shola   Orloff", "instructor_addr": "1808 Chicago Ave. Rm. 201"}], "topic": "", "course": "309-0", "descriptions": [{"name": "Overview of class", "value": "Key concepts for the analysis of politics in both political sociology and political science include power, the political, citizenship, states, social movements. Typically, these are investigated with reference to social relationships based on class, or, sometimes (especially in the US), race - how do social relations and distributions of power and resources affect political processes, and how, in turn, do politics shape social relations? In this class, we turn the focus to the relationships among gender, politics and policy. We will examine the gendered character of citizenship, political participation and representation, social rights and economic rights. We aim to understand gendered politics and policy from both &quot;top down&quot; and &quot;bottom up&quot; perspectives. What do states do, via citizenship rights and policies, to shape gender relations? How do gender relations influence the nature of policy and citizenship? How has feminism emerged as a radical challenge to the androcentrism and restricted character of the democratic public sphere? We expand on conventional conceptions of political participation and citizenship rights to include the grassroots democratic activism that gave birth to the modern women's movement. We explore how women's political efforts have given rise to the creation of counter-public spheres and alternative visions of democracy, social provision and economic participation, as well as reshaping formal politics and policies. Our main focus is on the US since the late 19th century, and we trace the development of gendered politics and policy since that time, as situated in comparative and global perspective."}, {"name": "Registration Requirements", "value": "Open to sociology majors and minors during pre-registration. This class is open to all students during regular registration beginning February 22, 2016."}, {"name": "Evaluation Method", "value": "To demonstrate knowledge and critical analysis of the readings and general themes of the course, you will have several formal assignments:<br/><br/><br/>- (short) in-class quiz (15% of the grade) <br/><br/><br/>- (full-session) in-class exam (50% of total grade)<br/><br/><br/>- short final paper (25% of total grade) on the question of social policy and social change. <br/><br/><br/>Attendance is mandatory. (N.B.: Unexcused absences may result in your grade being lowered.)<br/><br/><br/>In addition to the formal assignments, there will be several informal assignments, noted on the syllabus. You are required to complete all informal assignments (10% of your grade)."}, {"name": "Class Materials (Required)", "value": "You will read three books, which will be available on reserve, and are for sale at Norris or online:<br/><br/><br/>R.W. Connell, Masculinities (Berkeley: University of California Press, second edition, 2005)<br/><br/><br/><br/>Kimberly Morgan, Working Mothers and the Welfare State: Religion and the Politics of Work-Family Policies in Western Europe and the United States (Stanford, CA: Stanford University Press, 2006)<br/>ISBN-13: 9780804754132<br/><br/><br/><br/>Sheryl Sandberg, Lean In: Women, Work and the Will to Lead (New York: Alfred Knopf, 2013)<br/>ISBN 978-0-385-34994-9"}, {"name": "Class Materials (Suggested)", "value": "As a supplemental (not required) text for those who would like some background in gender studies, Raewyn Connell's Gender in World Perspective (second edition) Malden, MA: Polity, 2009) is a good, short introduction. ISBN-13: 9780745645674<br/><br/><br/><br/>We will also read several articles; these readings will be available online on Blackboard or via the Web."}], "lmod": "4/3/16 8:22 PM (CT)", "subject": "SOCIOL"}]