[{"class_mtg_info": [{"meet_t": "Tu 9:00AM - 11:50AM", "meet_l": "Scott Hall 201 Ripton Room"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "35531", "title": "WCAS POLI_SCI 419-0-20 American Political Development", "class_attributes": "", "section": "35531", "instructors": [{"instructor_phone": "847 491 2641", "instructor_name": "Daniel J Galvin", "instructor_addr": "601 University Place, 103 Scott Hall"}], "topic": "", "course": "419-0", "descriptions": [{"name": "Overview of class", "value": "American Political Development (APD) is a growing subfield of American Politics with important links to other fields of political science, such as political theory, comparative politics, and public law, as well as political sociology and history. Most, but not all, APD work falls within the broad category of historical institutionalism. Its substantive inquiries range widely, but all leading work seeks to conceptualize processes and dynamics of change as they unfold over time, to identify political patterns over the long durée, and to theorize about relations of continuity and change. This seminar surveys classic and contemporary APD scholarship across a range of topics."}, {"name": "Learning Objectives", "value": "By the end of the course, students will have surveyed classic and contemporary works in the field and will understand key theoretical debates and major methodological approaches."}, {"name": "Teaching Method", "value": "Open seminar-style discussion."}, {"name": "Evaluation Method", "value": "Discussion (40%), online comments (20%), final exam or research paper (40%)"}, {"name": "Class Materials (Required)", "value": "&quot;Stephen Skowronek, Building a New American State (New York: Cambridge University Press, 1982). ISBN-10: 0521288657. ISBN-13: 978-0521288651.<br/><br/>Karen Orren, Belated Feudalism: Labor, the Law and Liberal Development in the United States (Cambridge University Press, 1991). ISBN-13: 978-0521422543. ISBN-10: 052142254X.<br/><br/>Suzanne Mettler, Dividing Citizens: Gender and Federalism in New Deal Public Policy (Cornell University Press, 1998). ISBN-10: 0801485460. ISBN-13: 978-0801485466.<br/><br/>Emily Zackin, Looking for Rights in All the Wrong Places: Why State Constitutions Contain America's Positive Rights (Princeton University Press, 2013). ISBN-10: 069115578X. ISBN-13: 978-0691155784<br/><br/>Robert M. Mickey, Paths out of Dixie: The Democratization of Authoritarian Enclaves in America's Deep South, 1944-1972 (Princeton University Press, 2015). ISBN-10: 0691149631. ISBN-13: 978-0691149639.<br/><br/>Eric Schickler, Racial Realignment: The Transformation of American Liberalism, 1932-1965 (Princeton University Press, 2016). ISBN-10: 0691153884. ISBN-13: 978-0691153889.&quot;"}], "lmod": "2/8/17 6:45 PM (CT)", "subject": "POLI_SCI"}]