[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Harris Hall L04"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-Requisite:  Students must have taken &amp; passed English 206-0 to enroll.", "qtr": "Spring 2016", "name": "34914", "title": "WCAS ENGLISH 307-0-21 Advanced Creative Writing", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "34914", "instructors": [{"instructor_phone": "", "instructor_name": "Peter M Orner", "instructor_addr": ""}], "topic": "Fiction", "course": "307-0", "descriptions": [{"name": "Overview of class", "value": "The playwright Anna Deveare Smith has written that to develop an ear, one must develop an ear. This class for fiction writers will be all about paying attention, with particular focus on the myriad ways writers listen - to themselves, to their characters, to the world - in order to create moving stories. We will closely read published stories in order to discuss and write about their impact, zeroing in on such key elements as characterization, tension, and compression. The class will also be reading Italo Calvino's Six Memos for the Next Millennium with an eye toward how the future of storytelling might be influenced by the past. Students will write 2 to 3 stories of their own, revising one of them. Student work will be workshopped and also reviewed during student-teacher conferences."}, {"name": "Class Notes", "value": "Instructor Bio: Peter Orner is the author of four books of fiction, most recently Last Car Over the Sagamore Bridge, a New York Times Editor's Choice book. Orner is also the editor of two books of non-fiction, including Underground America, an oral history of undocumented people living in the U.S., and Hope Deferred: Narratives of Zimbabwean Lives. His fiction and non-fiction has appeared in the Atlantic Monthly, The New York Times, The Paris Review, Granta, Best American Stories, and received two Pushcart Prizes."}], "lmod": "4/3/16 7:58 PM (CT)", "subject": "ENGLISH"}]