[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "Swift Hall 107"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24165", "title": "WCAS GNDR_ST 220-0-20 Sexual Subjects: Introduction to Sexuality Studies", "class_attributes": "Historical Studies Distro Area<br/><br/>Interdisciplinary Distro - See Rules<br/><br/>Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "24165", "instructors": [{"instructor_phone": "847/491-3433", "instructor_name": "Nicholas K Davis", "instructor_addr": "1897 Sheridan, Uh 215, Evanston, IL 60208"}], "associated_classes": [{"component": "DIS", "room": "Kresge Centennial Hall 2-410", "meeting_time": "Fr 9:00AM - 9:50AM"}, {"component": "DIS", "room": "Kresge Centennial Hall 2-343", "meeting_time": "Fr 10:00AM - 10:50AM"}, {"component": "DIS", "room": "Fisk Hall 114", "meeting_time": "Fr 11:00AM - 11:50AM"}, {"component": "DIS", "room": "Kresge Centennial Hall 2-410", "meeting_time": "Fr 12:00PM - 12:50PM"}, {"component": "DIS", "room": "Parkes Hall 213", "meeting_time": "Fr 1:00PM - 1:50PM"}, {"component": "DIS", "room": "Kresge Centennial Hall 2-331", "meeting_time": "Fr 2:00PM - 2:50PM"}], "topic": "", "course": "220-0", "descriptions": [{"name": "Overview of class", "value": "What does it mean to study sex and sexuality within humanities and social science traditions? What constitutes knowledge or evidence in this field? What kinds of categories and arguments simultaneously produce and challenge conventional wisdom about sex? How have fields and movements like history, feminism, psychoanalysis, biology, critical race studies, anthropology, sociology, and literature fostered a multi-disciplinary scholarly tradition that today we call &quot;sexuality studies&quot;? What &quot;natural,&quot; &quot;obvious,&quot; or &quot;timeless&quot; ideas about sex or sexuality turn out to be none of those things? This lecture course will address these and other questions across two major &quot;movements&quot; in the syllabus, each putting its own spin on the course title. In the first half of the quarter, students will absorb some fundamental texts that continue to frame sexuality as a subject of investigation in various branches of the humanities and social sciences. These include famous pieces, in full or in excerpt, by Michel Foucault, Sigmund Freud, Audre Lorde, Gayle Rubin, Erving Goffman, Cherríe Moraga, John D'Emilio, Anne Fausto-Sterling, Eve Sedgwick, Anne Koedt, and Alfred Kinsey. In the second half of the quarter, we will adopt more of a &quot;case history&quot; approach to certain human subjects often defined by their sexuality. Likely subjects include the black lesbian, the Asian male, the welfare mother, the cis- or trans-gendered sex worker, the HIV/AIDS patient, the porn actor, the horny teen, the sex therapist, and the consenting sexual partner. In general, the course is designed to offer a strong foundation for future coursework in gender and sexuality studies or to provide a useful and, in many senses, a diverse primer for students whose major curricula lead them in other directions."}, {"name": "Teaching Method", "value": "Discussion sectionLectureLectures will emphasize key points from assigned material, elicit spontaneous interactions between the students and professor, and encompass film clips and possible guest appearances by other local experts."}, {"name": "Evaluation Method", "value": "Two argument-driven essays related to course readings and lecture materials, including a final paper. Two short reading quizzes. Shorter writing assignments, including responses to readings, short film analyses, and brief experiments in social-science methods (i.e., interviews, field observations, data tagging, etc.). Graded participation in discussion sections, with extra credit for vocal contributions in lecture."}, {"name": "Class Materials (Required)", "value": "All readings will be available electronically on the Canvas site for the course and/or as a physical course packet, purchasable at Quartet Copies."}], "lmod": "12/25/16 7:00 PM (CT)", "subject": "GNDR_ST"}]