[{"school": "SoC", "overview_of_class": "This seminar focuses on public commemoration as a rhetorical phenomenon. Seminar participants will read and discuss contemporary rhetorical scholarship on commemoration and will practice skills in critical reading and analysis. Students who successfully complete this course should expect to be conversant in the disciplinary vocabularies of commemorative rhetorical practice and should expect to have produced an essay-length critical work.", "name": "Seminar-Problems in Comm Studies", "section": "20", "location": "Parkes Hall 215", "topic": "Rhetoric & Commemoration", "course": "525-0", "meeting_time": ["Th 2:00PM - 4:50PM"], "path": "/class-descriptions/4660/SoC/COMM_ST/525-0/33030", "instructor": ["Angela   Ray"], "class_attributes": "Graduate Students Only<br/><br/>", "id": "33030", "subject": "COMM_ST"}, {"school": "SoC", "overview_of_class": "This class is designed to introduce students to the opportunities and challenges involved in the cultural analysis of communicative forms, genres, and practices as situated in given contexts and historical moments. Given the complexity of such a task, the course aims not for theoretical or methodological mastery, but seeks to begin the process of mapping relevant traditions and literatures that have influenced recent attempts to connect rhetoric and culture. The course will survey some of the concepts of \"culture\" that have been used to describe and analyze the constitution and consequences of communicative behavior in the past and survey some of the most influential work that has been based upon such conceptualizations.", "name": "Seminar-Problems in Comm Studies", "section": "21", "location": "Harris Hall L04", "topic": "Modes of Cultural Analysis/Intro to Cultural Studi", "course": "525-0", "meeting_time": ["We 2:00PM - 4:50PM"], "path": "/class-descriptions/4660/SoC/COMM_ST/525-0/33031", "instructor": ["Janice A Radway"], "class_attributes": "Graduate Students Only<br/><br/>", "id": "33031", "subject": "COMM_ST"}]