[{"class_mtg_info": [{"meet_t": "We 9:00AM - 11:50AM", "meet_l": "Harris Hall L40"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "33405", "title": "WCAS HISTORY 405-0-24 Seminar in Historical Analysis", "class_attributes": "Graduate Students Only<br/><br/>", "section": "33405", "instructors": [{"instructor_phone": "847/491-3653", "instructor_name": "Edward Wallace   Muir Jr", "instructor_addr": "Harris Hall Room 244"}], "topic": "Microhistory", "course": "405-0", "descriptions": [{"name": "Overview of class", "value": "In recent years historians have developed a new technique called microhistory for capturing the lives of the people who have been lost to history?peasants, heretics, poor women, gays, and con-conformists of all sorts. These were the people who because of their low social status, rural origins, illiteracy, or unpopular beliefs were ignored, despised, or persecuted by the dominant society. Microhistory is a method of investigation that usually relies on the evidence from judicial trials of otherwise obscure people who found themselves in trouble with the authorities. The method gives a voice to those who otherwise left no written record of their lives. The result of the studies has been a remarkable re-evaluation of the experiences and beliefs of the common people of pre-modern Europe."}, {"name": "Teaching Method", "value": "Discussion"}, {"name": "Evaluation Method", "value": "Oral presentations, participation in discussions, lead at least one presentation, 4 position papers."}, {"name": "Class Materials (Required)", "value": "READING LIST: <br/><br/>Edward Muir and Guido Ruggiero, eds. Microhistory and the Lost Peoples of Europe, ISBN: 978-0801841835 <br/>Carlo Ginzburg, Clues, Myths, and the Historical Method ISBN 0-8018-4388-x <br/>Carlo Ginzburg, The Night Battles, ISBN: 978-1421409924 <br/>Carlo Ginzburg, The Cheese and the Worms: The Cosmos of a Sixteenth-Century Miller, ISBN: 978-0801843877 <br/>Natalie Zemon Davis, The Return of Martin Guerre, ISBN: 978-0674766914 <br/>Simon Schama, Dead Certainties, ISBN: 9780679736134 <br/>Richard White, Remembering Ahanagran: A Story of Stories, ISBN: 9780295983554 <br/>Donna Merwick, Death of a Notary: Conquest and Change in Colonial New York, ISBN: 9780801487880 <br/>Steven Bednarski, A Poisoned Past: The Life and times of Margarida de Portu, a Fourteenth-Century Accused Poisoner, ISBN: 978-1-4426-0477-3 <br/>Richard Prince, First Time: The Historical Vision of an African American People, ISBN: 978-0226680606"}], "lmod": "4/3/16 8:04 PM (CT)", "subject": "HISTORY"}]