[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Harris Hall L28"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "37801", "title": "WCAS POLI_SCI 390-0-28 Special Topics in Political Science", "class_attributes": "", "section": "37801", "instructors": [{"instructor_phone": "847/491-3719", "instructor_name": "Ann Shola   Orloff", "instructor_addr": "1808 Chicago Ave. Rm. 201"}], "topic": "Political Sociology", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "Prof. Orloff &quot;Political Sociology&quot; Spring 2016<br/>This course will investigate the relationships among gender, society and politics. We will examine the gendered character of citizenship, political participation and representation, social rights and economic rights. We aim to understand gendered politics and policy from both &quot;top down&quot; and &quot;bottom up&quot; perspectives. What do states do, via institutions of political participation and representation, citizenship rights and policies, to shape gender relations? How do gender relations influence the nature of policy and citizenship? How has feminism emerged as a radical challenge to the androcentrism and restricted character of the democratic public sphere? We expand on conventional conceptions of political participation and citizenship rights to include the grassroots democratic activism that gave birth to the modern women's movement. We explore how women's political efforts have given rise to the creation of counter-public spheres and alternative visions of democracy, social provision and economic participation, as well as reshaping formal politics and policies. By the end of the class, students will know some of the history of gendered politics in the US, with some sense of comparative context, and will gain a basic understanding of the factors influencing gendered participation and representation as well as the character of gendered policies."}, {"name": "Teaching Method", "value": "Lecture, Class Discussion, Group Presentations"}, {"name": "Evaluation Method", "value": "To demonstrate knowledge and critical analysis of the readings and general themes of the course through formal assignments (85% of course grade), you will take an in-class exam (60% of total grade), and write a short final paper (25% of final grade) applying what you have learned in the course to some aspect of contemporary gender politics or policy, in the US or elsewhere. To encourage your contribution to the content of the course and regular reflection on the readings, I ask that you come to class prepared with very brief reading notes, to be checked in various ways through the quarter, and doing informal assignments, such as examining websites of different research and advocacy groups specializing in gender issues. These tasks will not be graded, but simply checked off for completion (and will constitute 15% of your grade)."}, {"name": "Class Materials (Required)", "value": "We will read one book, and a number of articles which will be available online on Blackboard.<br/><br/>The following required book will be available for purchase at Norris (or you may order it online), and will also be placed on reserve:<br/><br/>Janet Gornick and Marcia Meyers, editors, Gender Equality: Transforming Family Divisions of Labor (Verso, 2009). ISBN-13: 9781844673254"}, {"name": "Class Materials (Suggested)", "value": "As a supplemental (not required) text for those who would like some background in gender studies, Raewyn Connell's Gender in World Perspective (second edition) Malden, MA: Polity, 2009) is a good, short introduction. ISBN-13: 9780745645674"}], "lmod": "4/3/16 8:17 PM (CT)", "subject": "POLI_SCI"}]