[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Harris Hall L07"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "23930", "title": "WCAS ENGLISH 353-0-20 Studies in Romantic Literature", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "23930", "instructors": [{"instructor_phone": "", "instructor_name": "Nicholas Pardee Valvo", "instructor_addr": ""}], "topic": "Romanticism and Feeling", "course": "353-0", "descriptions": [{"name": "Overview of class", "value": "Wordsworth's &quot;Preface&quot; to Lyrical Ballads offers a definition of poetry sometimes read as a kind of motto for British Romanticism: &quot;Poetry is the spontaneous overflow of powerful feelings&quot; which &quot;takes its origin from emotion recollected in tranquility.&quot; Feeling and its representation are at the center of this vision of the Romantic project, in poetry, but also in fiction and across the arts and philosophy. In this course, we're going to cast a measured, critical eye over every part of this received account. In units on spontaneity, consciousness, the sensible body, and modern theories of emotion, we will set this literary movement in the historical, literary and intellectual contexts from which it emerged. We will read widely; highlights will likely include, in part or in whole, William Wordsworth's 1798 &quot;Prelude&quot;, Charlotte Smith's Elegiac Sonnets, Jane Austen's Sense and Sensibility, and Mary Shelley's Frankenstein."}, {"name": "Teaching Method", "value": "Mixed discussion and lecture."}, {"name": "Evaluation Method", "value": "Written assignments."}, {"name": "Class Materials (Required)", "value": "Poetry from William Wordsworth, John Clare, Helen Maria Williams, Charlotte Smith, George Crabbe, Samuel Taylor Coleridge, Percy Bysshe Shelley, William Cowper, Robert Burns; prose from Thomas De Quincey, William Hazlitt, Frances Burney, Mary Shelley, Jane Austen."}], "lmod": "12/29/16 6:57 PM (CT)", "subject": "ENGLISH"}]