[{"class_mtg_info": [{"meet_t": "MoWe 9:30AM - 10:50AM", "meet_l": "Annenberg Hall G28"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "31181", "title": "WCAS HUM 370-4-22 Special Topics in the Humanities", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "31181", "instructors": [{"instructor_phone": "", "instructor_name": "Sheila Two Wille", "instructor_addr": "1800 Sherman Avenue, Suite 1-200"}], "topic": "Apocalypse: Environ, Hist, Sci, Relig", "course": "370-4", "descriptions": [{"name": "Overview of class", "value": "Apocalypse: Environment, History, Science and Religion in the West<br/><br/>The theme of the &quot;end of days&quot; threatens to overwhelm us in popular media; even the United States government is capitalizing on the obsession with the &quot;zombie&quot; apocalypse to encourage emergency preparedness. Apocalypses are not just exciting stories, they have long roots in the Western tradition, particularly in Christianity, science, and the Enlightenment, and they have many uses. They can narrate a great victory for the morally righteous, become a foil for a critique of enlightenment or industrial progress, and unveil the gateway to utopia. Apocalyptic stories also often reinforce previously held assumptions about humans, nature, and human nature, holding within them a regenerative moment when humanity (or some select part of it) could finally get things right. As a result, the end of days makes an excellent category of historical analysis.<br/><br/>In this class, we will take a long view on the history of Western apocalypse stories both providential and dystopian. Our guiding query will be always to ask: what work did these narratives do for people in different historical contexts? What can the examination these narratives tell us about history in these various times and places? Our reading will focus heavily on the histories of empire, science, religion, and nature/environment in Europe (particularly Britain) and America. Specific themes will include the link between the revolutionary and the apocalyptic, human and divine agency, limits/scarcity and growth/abundance, utopias, concepts of time, and history."}, {"name": "Registration Requirements", "value": "No prerequisites"}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "9-10 page final paper based on a mix of course content and outside sources, an in-class presentation, and participation."}, {"name": "Class Materials (Required)", "value": "(This list is subject to change)<br/>King James Bible (reference and readings)<br/>E. Kolbert, The Sixth Extinction (any edition)<br/>N. Oreskes, The Collapse Of Western Civilization: A View From The Future. <br/>P. Robertson, The New World Order (any edition)<br/>H. G. Wells, Time Machine (Norton Critical Edition)<br/>P. Sabin, The Bet: Paul Erlich, Julian Simon, and Our Gamble over Earth's Future (any edition)"}], "lmod": "4/3/16 8:08 PM (CT)", "subject": "HUM"}]