[{"school": "WCAS", "overview_of_class": "Prof. Daniel Krcmaric, &quot;International Responses to Mass Atrocities&quot; Fall 2016<br/>When genocides, mass killings, and war crimes occur, how should the international community respond? Students will write a paper and give a simulated policy briefing on how to respond to a specific case of mass atrocites.", "name": "Special Topics in Political Science", "section": "20", "topic": "International Responses to Mass Atrocities", "course": "390-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4640/WCAS/POLI_SCI/390-0/12752", "instructor": ["Daniel Joseph Krcmaric"], "id": "12752", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "Professor Julie Lee Merseth, &quot;Immigration Politics and Policy&quot; Fall 2016<br/>This course provides an introduction to immigration politics and policy in the United States with a focus on the contemporary incorporation of post-1965 immigrants. We begin by foregrounding the role of the state and the history of U.S. immigration policies that continue to shape social and political experiences among the foreign-born. We then examine public opinion toward immigrants and immigration issues, highlighting the ways in which they are ideologically contested. Building from this, we turn our attention to how immigrants are incorporated in the U.S., with an emphasis on the significance of race and ethnicity in immigrant communities. Finally, drawing on empirical studies in the field of American politics, we focus on questions and explanations of immigrant participation and mobilization in the twenty-first century.", "name": "Special Topics in Political Science", "section": "21", "topic": "Immigration Politics and Policy", "course": "390-0", "meeting_time": ["Tu 2:00PM - 4:50PM"], "path": "/class-descriptions/4640/WCAS/POLI_SCI/390-0/12753", "instructor": ["Julianne Lee Merseth Cook"], "id": "12753", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "Prof. Orloff &quot;Gender, Social Movements, Political Participation and Policy&quot; Fall 2016<br/>In this class, we will investigate how gender - as a set of relations, identities and cultural schemas - shapes politics, including political participation and representation, the formation of social movements (e.g., the feminist and anti-ERA movements), and social policy, as well as how, in turn, political institutions and policy shape gender. We aim to understand gendered politics and policy from both &quot;top down&quot; and &quot;bottom up&quot; perspectives. And we will take advantage of the fact that we are in the middle of a Presidential election to examine gendered politics in the contemporary United States.", "name": "Special Topics in Political Science", "section": "22", "topic": "Gender, Social Movements, Poli Particip &amp; Policy", "course": "390-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4640/WCAS/POLI_SCI/390-0/17487", "instructor": ["Ann Shola   Orloff"], "id": "17487", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "Prof. Robert Braun, SOC 376-0-20/POLI SCI 390-0-23, Understanding Genocide, Fall 2016<br/>Why did some communities during the Armenian genocide protect victims of mass persecution while others did not? Why did some but not all Germans decide to actively participate in the killing of Jews during the Holocaust? Why did mass violence break out in Rwanda in the 1990s and not in equally instable Ivory Coast during the 2000s? / / In this course we will examine one of the most destructive, evil and perplexing phenomena haunting society: genocide - i.e. , the on a large scale organized exclusion and killing of populations defined by race, ethnicity, nationality or religion. In the first section of this course students will be introduced to ideational, rational and psychological explanations of genocide. Causes of genocide can be found at different levels of analysis. We will focus on theories at three different levels. First, we will look at how national and international processes such as modernization and political leadership cause genocide (macro level). Second, we will look at why individuals decide to participate in or condone mass killings (micro level). Third, we will look at what role subnational groups such as religious communities play (meso level). In the second part of this course, we will assess the validity of different explanations through the comparative study of three particular cases: the Holocaust, the Armenian Genocide and Rwanda. Students will explore a fourth case on their own. We will end the course with a discussion on foreign intervention. / / Students will improve their analytical skills by drawing connections between social science theory, historical monographs, graphic novels, memoirs of genocide survivors, journalistic accounts, policy documents, and public debates on foreign intervention. Upon completing the course, students will not only be acquainted with the main types of explanations offered for genocide, but they will also be able to evaluate the evidence supporting the various explanations. In turn, this should help students to develop and evaluate proposals to end and prevent mass killing.", "name": "Special Topics in Political Science", "section": "23", "topic": "Understanding Genocide", "course": "390-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4640/WCAS/POLI_SCI/390-0/17618", "instructor": ["Robert   Braun"], "id": "17618", "subject": "POLI_SCI"}]