[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Kresge Centennial Hall 2-420"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "33914", "title": "WCAS GNDR_ST 361-0-20 Gender, Sexuality, and Literature", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "33914", "instructors": [{"instructor_phone": "", "instructor_name": "Hannah Molly Chaskin", "instructor_addr": ""}], "topic": "Prostitutes of the Pen: Queer Women?s Writing from", "course": "361-0", "descriptions": [{"name": "Overview of class", "value": "In the early eighteenth century, men often suggested that women writing for money was equivalent to women displaying their bodies publicly. Society saw women's writing as transgressive, scandalous, gratuitous, even obscene. In a word, women's writing?no matter how normative in its intentions?was almost always perceived as queer. Over the course of the eighteenth century, a normative strand of &quot;proper&quot; women's fiction began to emerge; yet women's writing remained controversial and has continued to challenge heteropatriarchal social norms to the present day. This class will look at social discourses designed to discipline and domesticate women's writing, but we will focus on the varied, shrewd, and often playful methods employed by women to subvert such discourses and expectations. We will be exploring many related questions. What does it mean for a woman to write &quot;queerly&quot;? How does queerness show up in both content and in subversive narrative structures? How can we account for the ever-shifting definition of the normative and, therefore, the queer? How do race and class intersect with queer femininity across time? <br/><br/>We will read women's writing from a variety of genres across time: Aphra Behn's play The Rover, Anne Lister's diary, Emily Dickinson's poetry, Virginia Woolf's Orlando, Audre Lorde's essays, Emma Donoghue's queer fairy tales, Octavia Butler's Fledgling, and Alison Bechdel's comic strip, Dykes to Watch Out For."}, {"name": "Teaching Method", "value": "DiscussionSeminar"}, {"name": "Evaluation Method", "value": "Group projectPaper, finalPaper, mid-term"}, {"name": "Class Materials (Required)", "value": "Behn, Aphra. The Rover (ISBN 978-1551112145)<br/>Woolf, Virginia. Orlando (ISBN 978-0156031516)<br/>Lorde, Audre. Sister Outsider (ISBN 978-1580911863)<br/>Butler, Octavia. Fledgling (ISBN 978-0446696166)<br/>Bechdel, Alison. The Essential Dykes to Watch Out For (ISBN 978-0618968800)<br/><br/>All other readings will be provided through Canvas."}], "lmod": "2/19/17 6:48 PM (CT)", "subject": "GNDR_ST"}]