[{"class_mtg_info": [{"meet_t": "We 2:00PM - 5:00PM", "meet_l": "Harris Hall L04"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Fall 2016", "name": "12107", "title": "WCAS ENGLISH 410-0-20 Introduction to Graduate Study", "class_attributes": "", "section": "12107", "instructors": [{"instructor_phone": "", "instructor_name": "William N West", "instructor_addr": ""}], "topic": "", "course": "410-0", "descriptions": [{"name": "Overview of class", "value": "Pragmatist philosopher and literary theorist Richard Rorty arrestingly and infuriatingly defined his adopted discipline of literary studies as &quot;the way we do things around here.&quot; But what are those ways? What do we do around here, as professors and graduate students in a department of English? This introduction to the graduate study of literature as a discipline and a craft will attempt to exemplify and practice, if not determine, some of what we do around here. Its aim is to introduce students to some practices and ways of doing things that are typical of the profession of literature in the academy, and to some of the important theories?of literature, of language?that underlie them. Our main focus will be on what is arguably a shared core of what we do, a practice that are generally grouped together as reading. The doubtful legibility of the course's titles is meant to signal some of the unexpected challenges that reading may present. We will discuss what reading has meant to some of its principal theorists in the twentieth and twenty-first centuries, from psychoanalysts to New Critics to mythographers to deconstructionists to New Historicists and cultural critics. We will also examine and produce some of the forms of reading and writing that advanced students of literature, such as the conference paper, the seminar paper, and the article."}, {"name": "Registration Requirements", "value": "English doctoral students only"}, {"name": "Class Notes", "value": "permission of department required"}], "lmod": "10/30/16 7:04 PM (CT)", "subject": "ENGLISH"}]