[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "University Hall 102"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "17376", "title": "WCAS GNDR_ST 361-0-20 Gender, Sexuality, and Literature", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "17376", "instructors": [{"instructor_phone": "", "instructor_name": "Shaundra J Myers", "instructor_addr": ""}], "topic": "Toni Morrison and the Form of Freedom", "course": "361-0", "descriptions": [{"name": "Overview of class", "value": "In this course we will study the relations among gender, race, and freedom in novels by Toni Morrison. We will pay special attention to the narrative forms and strategies Morrison employs to depict the (im)possibilities of freedom in the post­-civil rights era. While considering how narrative strategies and structures animate depictions of freedom, we will also discuss how the novels themselves enact freedom by transgressing the limits of genre through manipulations of knowledge, space, and time. We will continually address issues of gender, race, and place in relation to African American desires for freedom. Our study will be guided by several questions: What forms does freedom take, both aesthetically and politically, in these novels? What demands do aesthetic forms of freedom, that is, innovative writing, place on the reader, in terms of literacy and ethics? How does Morrison imagine freedom differently across texts and decades and for what purposes? Our discussions will place Morrison's treatment of freedom at the center of contemporary debates over the prospects of a post-racial America, the utility of the history of slavery, and the protocols of racial representation."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "A Canvas posting and informal presentation of discussion responses are required for most classes; 2 or 3 papers, occasional quizzes or in-class writing, formal presentation, graded participation, and attendance."}, {"name": "Class Materials (Required)", "value": "Texts may include The Bluest Eye (1970), Sula (1973), Song of Solomon (1977), Beloved (1987), or Paradise (1997), as well as additional critical and theoretical readings."}], "lmod": "10/30/16 7:05 PM (CT)", "subject": "GNDR_ST"}]