[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "Annenberg Hall G32"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "35415", "title": "WCAS POLI_SCI 390-0-23 Special Topics in Political Science", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "35415", "instructors": [{"instructor_phone": "847/491-3468", "instructor_name": "Lawrence L Stuelpnagel", "instructor_addr": "McCormick Foundation Building/4-135"}], "topic": "The Press &amp; Presidential Elections", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "POLI SCI 390-0-23 Spring 2017 &quot;The Press &amp; Presidential Elections&quot; Prof. Lawrence Stuelpnagel<br/>Presidential elections are hard fought and can be controversial. In 2016 two unpopular candidates, former Secretary of State Hillary Clinton and reality show host and real estate mogul, Donald Trump, waged bitter campaigns. In 2000 George W. Bush and Al Gore fought in an election that was decided by the Supreme Court. In 2008 American elected its first African American President, Barack Obama and reelected him in 2012. <br/> This class will examine presidential races primarily using the 2000, 2008 and 2016 races and the press coverage of the controversies that surrounded them as its central point. We will also explore the coverage of previous races and challenge some of the myths about elections and their outcomes"}, {"name": "Learning Objectives", "value": "There are several learning goals for this class. The first is to give you a historical context for how the modern presidential campaign has evolved from 1952 to the present day. The second is to give you insights about campaign messages and behavior and how those actions shape press and social media coverage of a candidate or issue. The first two goals are meant to help you achieve the third goal, which is to form you into a more critical consumers of both campaigns and the media and make you a smarter voter."}, {"name": "Teaching Method", "value": "Lecture/Discussion"}, {"name": "Evaluation Method", "value": "&quot;Your grade will be determined by a one-to-two page Op-Ed article (25%), an 8-10 page term paper (30%), a take-home final exam (30%) which will be due on the last night of class and your class participation (15%). <br/>&quot;"}, {"name": "Class Materials (Required)", "value": "The required texts for this class are: The Obama Victory: How Media, Money, and Message Shaped the 2008 Election, by Kate Knewski, Bruce W. Hardy and Kathleen Hall Jamieson; The Selling of the President: A Classic Account of the Packaging of a Candidate, by Joe McGinnis. The books are available in the Norris Center bookstore In addition I have also made PDF's of selected chapters from Everything You Think You Know About Politics and Why You're Wrong, by Kathleen Hall Jamieson and The Control Room: How Television Calls the Shots in Presidential Elections by Martin Plissner. I will also be uploading additional readings about Obama New Media and get out the vote strategies to our Canvas site"}], "lmod": "2/6/17 8:43 AM (CT)", "subject": "POLI_SCI"}]