[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Kresge 3354 German Seminar Rm."}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: PRE-REG only: Reserved for German majors.", "qtr": "Spring 2017", "name": "30900", "title": "WCAS GERMAN 327-0-20 German Expressionism", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "30900", "instructors": [{"instructor_phone": "847/467-1849", "instructor_name": "Erica Suzanne Weitzman", "instructor_addr": "1880 Campus Drive, Kresge Hall, Rm 3333"}], "topic": "Modernity, Madness, Revolution", "course": "327-0", "descriptions": [{"name": "Overview of class", "value": "This class will look at the rise and fall of German Expressionism in literature, visual art, and film from the late nineteenth century to the ascent of the Third Reich. We will discuss how the artistic and technical innovations of Expressionism reflected distinctive political, philosophical, and social ideas and conditions of Germany in the years just before and in the wake of the first World War, looking closely at the aesthetics and poetics of this short-lived but influential movement. We will also consider certain themes and issues that Expressionist art particularly addressed, including: urbanization and cosmopolitanization; capitalism and inequality; war and trauma; portrayals of extreme states such as violence, ecstasy, and mental illness; sexuality, desire, and the representation of women; horror and the occult; the role of ethnic and cultural minorities; the appeal of the exotic; and the exploration of new or marginal psychological realities."}, {"name": "Registration Requirements", "value": "Prerequisite in German: High Intermediate skills in speaking, advanced skills in reading and writing."}, {"name": "Learning Objectives", "value": "- To become familiar with major works of German Expressionism in literature, art, and film<br/> - To understand cultural and political developments in Germany and German-speaking countries in the first few decades of the twentieth century<br/> - To develop critical and analytic skills in literature, visual arts, film, and other media<br/> - To increase facility in spoken, written, and read German"}, {"name": "Teaching Method", "value": "Class participationDiscussionFilms / videosReadingsWriting assignments"}, {"name": "Evaluation Method", "value": "Class participationOnline workPapersWriting assignments"}, {"name": "Class Materials (Required)", "value": "Course reader"}], "lmod": "2/12/17 6:54 PM (CT)", "subject": "GERMAN"}]