[{"class_mtg_info": [{"meet_t": "MoWe 12:30PM - 1:50PM", "meet_l": "Harris Hall L28"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "25049", "title": "WCAS HISTORY 300-0-30 New Lectures in History", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "25049", "instructors": [{"instructor_phone": "", "instructor_name": "Lina M Britto", "instructor_addr": "Harris Hall 302"}], "topic": "Music &amp; Nation in Latin Americ", "course": "300-0", "descriptions": [{"name": "Overview of class", "value": "This course takes students along a sonorous trip through Latin America and the Spanish-speaking Caribbean. We will travel from country to country studying son in Cuba, samba in Brazil, tango in Argentina, corrido in Mexico, and vallenato in Colombia, among others, in order to comprehend how certain sounds became emblems of modern nations. We will also navigate the circuits in which certain sounds, such as cumbia, salsa, rock, hip hop, and reggaeton crossed geographic boundaries and evolved into transnational genres that express the collective experience of exile and migration of large populations. We address these histories in an interdisciplinary manner, reading history, anthropology, sociology, and ethnomusicology, and analyzing critically song lyrics, music videos, feature films, and documentaries. The goal is to help students understand why popular music has been a vehicle of nation-state formation in the region. By the end of the course, students should be able to explain how popular music in Latin America figures in struggles over hegemony, socio-economic mobility, and urbanization, as a means of protests and revolt, as a field for developing patterns of consumption for emerging national markets, and as symbolic currency in international negotiations involving issues of representation, legitimacy, and self-determination."}, {"name": "Teaching Method", "value": "Lecture"}, {"name": "Evaluation Method", "value": "AttendanceClass participationPaper, finalPapersQuizzesAttendance and participation, response papers, quizzes, and a final paper"}, {"name": "Class Materials (Required)", "value": "Paul Austerlitz, Merengue. Dominican Music and Dominican Identity (1997). ISBN 156639483X (cloth : alk. paper) 1566394848 (paper : alk. paper)<br/><br/><br/>Eric Zolov, Refried Elvis. The Rise of the Mexican Counterculture (1999). ISBN 9780520215146<br/><br/><br/>Peter Wade, Music, Race and Nation. Música Tropical in Colombia (2000). ISBN 0226868443 (cloth : alk. paper) 0226868451 (pbk. : alk. paper)<br/><br/><br/>Raúl R. Romero, Debating the Past. Music, Memory, and Identity in the Andes (2001). ISBN 0195138813<br/><br/><br/>Walter Aaron Clark, ed., From Tejano to Tango. Latin American Popular Music (2002). ISBN 81533639X 0815336403 (pbk.)<br/><br/><br/>Robin D. Moore, Music and Revolution. Cultural Change in Socialist Cuba (2006). ISBN 0520247108 (cloth : alk. paper) 0520247116 (pbk. : alk. paper)<br/><br/><br/>Deborah Pacini Hernández, Oye como va! Hybridity and Identity in Latino Popular Music (2010). ISBN 9781439900895 (cloth : alk. paper) 1439900892 (cloth : alk. paper) 9781439900901 (pbk. : alk. paper) 1439900906 (pbk. : alk. paper)<br/><br/><br/>Marc A. Hertzman, Making Samba. A New History of Race and Music in Brazil (2013). ISBN 9780822354154 (cloth : alk. paper) 0822354152 (cloth : alk. paper) 9780822354307 (pbk. : alk. paper) 0822354306 (pbk. : alk. paper)."}, {"name": "Class Notes", "value": "Attendance and participation are evaluated. No lap-top use in classroom. Special cases will be considered. Electronic devices should be silenced or turned off.<br/><br/>HISTORY AREA OF CONCENTRATION: Americas"}], "lmod": "1/9/16 6:48 PM (CT)", "subject": "HISTORY"}]