[{"class_mtg_info": [{"meet_t": "MoWeFr 10:00AM - 10:50AM", "meet_l": "Frances Searle Building 3220"}], "school": "SoC", "enrl_requirement": "Enrollment Requirements: Reserved for CSD Undergrads Only", "qtr": "Spring 2017", "name": "32762", "title": "SoC CSD 444-0-1 Development and Disorders of Mathematics", "class_attributes": "", "section": "32762", "instructors": [{"instructor_phone": "847/491-2477", "instructor_name": "Steven G Zecker", "instructor_addr": "2240 Campus Drive"}], "topic": "", "course": "444-0", "descriptions": [{"name": "Overview of class", "value": "Theory and research on math development and disorders. Identification, assessment and remediation of disorders of mathematics and related areas."}, {"name": "Registration Requirements", "value": "None"}, {"name": "Learning Objectives", "value": "Upon successful completion of all course requirements, students will:<ol><br/><li>understand the different paradigms that have been utilized in research in math L.D.</li><br/><li>understand the relation between normal and atypical cognitive development and mathematics achievement</li><br/><li>know the various types of mathematics curricula commonly in use today, and their strengths and weaknesses</li><br/><li>be able to administer, score, and interpret several commonly utilized standardized tests of mathematics</li><br/><li>be able to conduct error analyses on a range of formal and informal mathematics tests</li><br/><li>be able to identify, determine underlying causes of, and provide appropriate remedial approaches for math fact deficits, difficulties in solving math story problems, and problems involving time and money</li><br/><li>be able to select appropriate manipulatives and utilize them effectively in teaching math concepts</li><br/><li>understand the role linguistic factors play in math achievement, and be able to utilize this information in planning appropriate remedial activities </li><br/><li>understand gender, cultural, and social factors that may impact on the math achievement of some individuals.</li><br/></ol>"}, {"name": "Class Materials (Required)", "value": "Texbook and course reader"}, {"name": "Class Notes", "value": "None"}], "lmod": "2/13/17 6:38 PM (CT)", "subject": "CSD"}]