[{"class_mtg_info": [{"meet_t": "MoWe 9:30AM - 10:50AM", "meet_l": "Harris Hall L07"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "23074", "title": "WCAS ANTHRO 215-0-01 The Study of Culture through Language", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "23074", "instructors": [{"instructor_phone": "847 4914565", "instructor_name": "Emily N Haynes", "instructor_addr": "1810 Hinman Ave 206"}], "associated_classes": [{"component": "DIS", "room": "ANTHRO Sem Rm B07 - 1810 Hinmn", "meeting_time": "Mo 8:30AM - 9:20AM"}, {"component": "DIS", "room": "ANTHRO Sem Rm B07 - 1810 Hinmn", "meeting_time": "Tu 8:30AM - 9:20AM"}, {"component": "DIS", "room": "ANTHRO Sem Rm B07 - 1810 Hinmn", "meeting_time": "Tu 9:30AM - 10:20AM"}, {"component": "DIS", "room": "ANTHRO Sem Rm B07 - 1810 Hinmn", "meeting_time": "We 8:30AM - 9:20AM"}, {"component": "DIS", "room": "ANTHRO Sem Rm B07 - 1810 Hinmn", "meeting_time": "Th 8:30AM - 9:20AM"}, {"component": "DIS", "room": "ANTHRO Sem Rm B07 - 1810 Hinmn", "meeting_time": "Th 9:30AM - 10:20AM"}], "topic": "", "course": "215-0", "descriptions": [{"name": "Overview of class", "value": "Language is universally practiced by humans, but commonsense understandings about language, its appropriate use, and its inherent qualities vary widely both between and within societies. Using the anthropological method of comparative, cross-cultural, qualitative analysis, this course looks outside our own society to ask basic questions about the relationship between language, culture, and society. We explore the dynamics of everyday talk as well as the social and political forces that shape the ways we talk and evaluate others' speech. How does language shape collective culture and individual thought, and how do culture and thought shape language? How do adults use language to help children become culturally competent? Why have some languages disappeared altogether while others have spread? How have forces like colonialism and economic globalization brought about changes in the ways small-scale societies use language?"}, {"name": "Learning Objectives", "value": "Students will be able to<br/>1. understand human diversity and similarity <br/>2. understand key topics and methodological approaches in linguistic anthropology <br/>3. understand the foundational concepts for different textual analysis <br/>4. enhance their creative, critical, and informed thinking about language and culture<br/>5. understand of the interdisciplinary nature of linguistic anthropological research <br/>6. conduct analysis using a variety of styles <br/>7. engage with the significance of theoretical debates regarding the relationships among language, culture, and power"}, {"name": "Teaching Method", "value": "Lecture and Discussion"}, {"name": "Evaluation Method", "value": "Discussion section: Participation<br/>Exams: 2 Exams"}, {"name": "Class Materials (Required)", "value": "VEILED SENTIMENTS: HONOR AND POETRY IN A BEDOUIN SOCIETY<br/>Lila Abu-Lughod<br/>ISBN: 9780520292499<br/><br/>Gossip and the Everyday Production of Politics<br/>Author: Besnier, Niko;<br/>ISBN: 978-0-8248-3338-1"}], "lmod": "12/25/16 6:54 PM (CT)", "subject": "ANTHRO"}]