[{"class_mtg_info": [{"meet_t": "Sa 1:00PM - 4:00PM", "meet_l": "TBA"}], "school": "SCS", "overview_of_class": "This course is designed to explore the processes of bargaining and negotiation as theoretical, social, and managerial activities. Special emphasis will be given the areas of interpersonal and intergroup conflict as well as strategic decision-making and its links to negotiating. In addition, interpersonal influence techniques and the tactics and strategies involved with improved bargaining and negotiation will be covered. The major purpose of the course is for each participant to gain insight into his or her own negotiating style and to become a more effective negotiator, as well as a more astute observer of social processes. The course will involve extensive use of cases, role-plays, and related participative activities, enhanced by rigorous self-review and introspection.<br/><br/>Changes in society, the global economy, and ways people work have made negotiating skills more important than ever. The challenges are legion: dealing with history's most diverse work force, doing business with customers who tell you how to run your business, negotiating with foreign counterparts, among other challenges faced in the workplace. These are not just issues of corporate concern; they are also of increasing importance to your personal success.<br/><br/>By participating in this course you will come to recognize the pervasiveness and importance of negotiation. You will acquire a new repertoire of negotiating skills. You will develop a systematic and positive approach to negotiating with colleagues, bosses, clients, other stakeholders, external groups of all kinds, and perhaps even in social situations - in ways that equip you to deal with all manner of conditions and circumstances.", "qtr": "Spring 2017", "name": "Bargaining and Negotiation", "title": "SCS COMM_ST 363-CN-19 Bargaining and Negotiation", "lmod": "2/22/17 6:41 PM (CT)", "section": "19", "instructors": [{"instructor_phone": "", "instructor_name": "Samuel Robert Tepper", "instructor_addr": ""}], "topic": "", "course": "363-CN", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "This course is designed to explore the processes of bargaining and negotiation as theoretical, social, and managerial activities. Special emphasis will be given the areas of interpersonal and intergroup conflict as well as strategic decision-making and its links to negotiating. In addition, interpersonal influence techniques and the tactics and strategies involved with improved bargaining and negotiation will be covered. The major purpose of the course is for each participant to gain insight into his or her own negotiating style and to become a more effective negotiator, as well as a more astute observer of social processes. The course will involve extensive use of cases, role-plays, and related participative activities, enhanced by rigorous self-review and introspection.<br/><br/>Changes in society, the global economy, and ways people work have made negotiating skills more important than ever. The challenges are legion: dealing with history's most diverse work force, doing business with customers who tell you how to run your business, negotiating with foreign counterparts, among other challenges faced in the workplace. These are not just issues of corporate concern; they are also of increasing importance to your personal success.<br/><br/>By participating in this course you will come to recognize the pervasiveness and importance of negotiation. You will acquire a new repertoire of negotiating skills. You will develop a systematic and positive approach to negotiating with colleagues, bosses, clients, other stakeholders, external groups of all kinds, and perhaps even in social situations - in ways that equip you to deal with all manner of conditions and circumstances."}, {"name": "Registration Requirements", "value": "COMM ST 205"}, {"name": "Learning Objectives", "value": "This course aims to help you develop the negotiating skills needed to meet the challenges facing today's executives as well as to cover extant academic research in bargaining and negotiation in general. The course integrates experiential and intellectual components of negotiation. <br/><br/>First, it will help you develop concrete analytical tools with regards to bargaining and conflict in relationships. Along with this comes learning about your own individual negotiating style.<br/><br/>Second, this course uses various techniques to help you understand, among other things:<br/><br/>1. the basic elements of negotiation<br/>2. mapping of the agreement zone<br/>3. when to reach a deal and when to walk away<br/>4. how to overcome impasse<br/>5. how to build ongoing productive relationships through your negotiations<br/>6. how to affect market forces in a positive way and retain corporate and personal equity"}, {"name": "Teaching Method", "value": "Both lecture and discussion-based, interactive, with various participatory exercises."}, {"name": "Evaluation Method", "value": "Students' grades in this course will be determined by their performance on a final paper and class participation. The paper will be worth 70% of the grade and class participation will be worth 30%. <br/><br/>Attendance and Participation:<br/>Active involvement in the class is essential to making it a useful learning experience. Attendance is mandatory. In addition to attending each class session, students are expected to come prepared to discuss the readings assigned for each class (i.e. students are expected to read the assigned readings prior to attending class, including any relevant materials in addition to the text that are assigned). In-class activities will also count towards the total participation grade."}, {"name": "Class Materials (Required)", "value": "Texts may include the following. Visit the campus bookstore or its website to confirm materials for the course.<br/><br/>NEGOTIATION. <br/>Author: LEWICKI <br/>Edition:6TH 10<br/>Publisher:MCG<br/>ISBN: 9780073381206"}], "path": "/class-descriptions/4660/SCS/COMM_ST/363-CN/38084", "instructor": ["Samuel Robert Tepper"], "class_attributes": "", "id": "38084", "subject": "COMM_ST"}]