[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "555 Clark B03"}], "school": "WCAS", "overview_of_class": "This course examines the cultural politics of Latinx languages in the United States in the context of the history of U.S. imperialism and the colonial conditions that have framed language use, attitudes, and hybridity among US Latinx communities. We will first study the relationship of language to national imaginaries, the colonial erasure of Spanish and the racialization of Spanish in the US, the English Only Movement in the 1980s, and the colonial violence deployed against the use of Spanish. The second part of the course will focus on practices of linguistic hybridity that combine English and Spanish, both in speech as well as in literature. The course aims to contest dominant notions of Spanish as a global and profitable language, focusing on the cultural politics of English and Spanish among U.S. Latinx speakers, and to exhort students to think critically about the power differentials accorded to languages in the context of the U.S. racial, cultural and linguistic politics.<br/><br/>Note: Course will be taught in Spanish. Papers can be submitted in English.", "qtr": "Spring 2017", "name": "Topics in Latina and Latino Text and Representation", "title": "WCAS LATINO 393-0-1 Topics in Latina and Latino Text and Representation", "lmod": "2/26/17 6:48 PM (CT)", "section": "1", "instructors": [{"instructor_phone": "847/467-3982", "instructor_name": "Frances R Aparicio", "instructor_addr": "Crowe Hall, Room 1131"}], "topic": "Cultural Politics of Latino Language", "course": "393-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "This course examines the cultural politics of Latinx languages in the United States in the context of the history of U.S. imperialism and the colonial conditions that have framed language use, attitudes, and hybridity among US Latinx communities. We will first study the relationship of language to national imaginaries, the colonial erasure of Spanish and the racialization of Spanish in the US, the English Only Movement in the 1980s, and the colonial violence deployed against the use of Spanish. The second part of the course will focus on practices of linguistic hybridity that combine English and Spanish, both in speech as well as in literature. The course aims to contest dominant notions of Spanish as a global and profitable language, focusing on the cultural politics of English and Spanish among U.S. Latinx speakers, and to exhort students to think critically about the power differentials accorded to languages in the context of the U.S. racial, cultural and linguistic politics.<br/><br/>Note: Course will be taught in Spanish. Papers can be submitted in English."}, {"name": "Learning Objectives", "value": "By the end of the course, students will be:<br/>1) Able to understand the history of linguistic exclusion among immigrant and minority communities in the United States;<br/>2) Familiar with the ways in which governments attempt to regulate language use;<br/>3) Able to understand the colonial and racialized status of Spanish in the United States;<br/>4) Able to reflect critically on their own access to English and Spanish;<br/>5) Able to understand and validate practices of linguistic code-switching."}, {"name": "Teaching Method", "value": "Class participationDiscussionGuest speakersPresentationsSeminarWriting assignments"}, {"name": "Evaluation Method", "value": "AttendanceClass participationExamsPapersPresentationsReadingsResearch projectWriting assignments"}, {"name": "Class Materials (Required)", "value": "Richard Rodríguez, Hunger of Memory. Bantam Books, 1982. $10.00<br/>Ariel Dorfman, Heading South, Looking North: A Bilingual Journey. Penguin Books, 1998. $10.00"}, {"name": "Class Notes", "value": "Note: Course will be taught in Spanish. Papers can be submitted in English."}], "path": "/class-descriptions/4660/WCAS/LATINO/393-0/34023", "instructor": ["Frances R Aparicio"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "34023", "subject": "LATINO"}, {"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "Kresge Centennial Hall 2-410"}], "school": "WCAS", "overview_of_class": "We live in a world where historically and culturally Latinos are often equated with Catholic or Christian identity. In this course, we will examine how and why Muslim identity and Islamic culture have been marginalized within Latino culture and society despite their strong influence, as revealed by historical, cultural, and social evidence. This course will explore four historical moments of Islamic cultural and religious influence on Latinos/as in the Americas that include: 1) Islamic Culture in Moorish Spain, 2) Arab and Islamic Migrations to the Americas, 3) African American Islam, and 4) Islamic Conversions after 9/11. The following questions will guide our examination of these historical periods: How has Islam influenced Latino/a culture and society and why are these influences erased or forgotten by most Latinos/as in their Westernized lives? How did Latino/a Catholic identity come to be figured as normative and opposed to Muslim identity? What does it mean for Latinos/as to remember and claim their Islamic heritage within a Judeo-Christian national order, especially after 9/11? In the final section, the class will examine scholarship, literature, and art produced by Latino/a Muslims to compare the ways individuals and groups express their racial, cultural, social and religious identities and challenge rigid notions of Latino identity.", "qtr": "Spring 2017", "name": "Topics in Latina and Latino Text and Representation", "title": "WCAS LATINO 393-0-2 Topics in Latina and Latino Text and Representation", "lmod": "2/26/17 6:48 PM (CT)", "section": "2", "instructors": [{"instructor_phone": "", "instructor_name": "Yamil   Avivi", "instructor_addr": ""}], "topic": "Latinos and Islam", "course": "393-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "We live in a world where historically and culturally Latinos are often equated with Catholic or Christian identity. In this course, we will examine how and why Muslim identity and Islamic culture have been marginalized within Latino culture and society despite their strong influence, as revealed by historical, cultural, and social evidence. This course will explore four historical moments of Islamic cultural and religious influence on Latinos/as in the Americas that include: 1) Islamic Culture in Moorish Spain, 2) Arab and Islamic Migrations to the Americas, 3) African American Islam, and 4) Islamic Conversions after 9/11. The following questions will guide our examination of these historical periods: How has Islam influenced Latino/a culture and society and why are these influences erased or forgotten by most Latinos/as in their Westernized lives? How did Latino/a Catholic identity come to be figured as normative and opposed to Muslim identity? What does it mean for Latinos/as to remember and claim their Islamic heritage within a Judeo-Christian national order, especially after 9/11? In the final section, the class will examine scholarship, literature, and art produced by Latino/a Muslims to compare the ways individuals and groups express their racial, cultural, social and religious identities and challenge rigid notions of Latino identity."}, {"name": "Learning Objectives", "value": "critical thinking of U.S. empire, (self-)orientalism and decolonization of Latinxs in the Western Hemisphere and Latin/o America."}, {"name": "Teaching Method", "value": "Class participationDiscussionField tripsFilms / videosGuest speakersOnline workReadings"}, {"name": "Evaluation Method", "value": "AttendanceClass participationExam, mid-termOnline workPaper, finalQuizzes"}, {"name": "Class Materials (Required)", "value": "Moorish Spain <br/><br/>Shohat, Ella. \"The Moorish Atlantic: Orientalism/Occidentalism between the Middle East and the Americas.\" Eds. Evelyn Alsultany and Ella Shohat. Between the Middle East and the Americas: The Cultural Politics of Diaspora. Ann Arbor: University of Michigan Press, 2012. Print. <br/><br/>Castro, Americo. The Spaniards: An Introduction to Their History. Berkeley: University of California Press, 1971. Print. <br/><br/>Fletcher, Richard. Moorish Spain. New York: Holt, 1992. Print.<br/><br/>Jayyusi, Salma Khadra, ed. The Legacy of Muslim Spain. Leiden: Rill, 1992. Print.<br/><br/>Perry, Mary Elizabeth. The Handless Maiden: Mosricos and the Politics of Religion in Early Modern Spain. Princeton: Princeton University Press, 2005. Print. <br/><br/>Arab and Muslim Migrations to the Americas<br/><br/>Alfaro-Velcamp, Theresa. So far from Allah, So Close to Mexico: Middle Eastern Immigrants in Modern Mexico. Austin: University of Texas Press, 2007. Print.<br/><br/>Civantos, Christina. Between Argentines and Arabs: Argentine Orientalism, Arab Immigrants, and the Writing of Identity. Albany: State University of New York Press, 2006. Print.<br/><br/>Gomez, Michael A. Black Crescent: The Experience and Legacy of African Muslims in the Americas. New York: Cambridge University Press, 2005. Print. <br/><br/>Karam, John Tofik. Another Arabesque: Syrian-Lebanese Ethnicity in Neoliberal Brazil. Philadelphia: Temple University Press, 2007. Print.<br/><br/>Kilch, Ignacio and Jeffrey Lesser, eds. Arab and Jewish Immigrants in Latin American: Images and Realities. London: Frank Cass, 1998. Print. <br/><br/>Quick, Abdullah Hakim. Deeper Roots: Muslims in the Americas and the Caribbean from before Columbus to the Present. London: Ta-Ha, 1996. Print.<br/><br/>African American Islam (Influence on Latinos) <br/><br/>Bowden, Patrick D. \"U.S. Latina/o Muslims Since 1920: From ?Moors' to ?Latino Muslims.' Journal of Religious History 37.2 (2013): 165-184. Print.<br/><br/>Curtis IV, Edward E. Islam and Black America: Identity, Liberation, and Difference in African American Islamic Thought. Albany: State University of New York Press, 2002. Print.<br/><br/>Haddad, Yvonne Yazbeck and Jane I. Smith. Mission to America: Five Islamic Sectarian Communities in North America. Gainesville: University of Florida Press, 1993. Print.<br/><br/>Smith, Jane I. Islam in America. New York: Columbia University Press, 1999. Print.<br/><br/>Latino/a Conversion to Islam Post 9/11 <br/><br/>Martinez-Vazquez, Hjamil. Latina/o y Musulman: The Construction of Latina/o Identity among Latina/o Muslims in the United States. Eugene: Pickwick Publications, 2010. Print. <br/><br/>Essenberg, Richie. \"The New Nativism and Muslim and Latino immigration.\" Muslims and American Popular Culture. Eds. Iraj Omidvar and Anne R. Richards. Santa Barbara: Praeger, 2014. Print. <br/><br/>Ramos-Zayas, Ana. \"Delinquent Citizenship, National Performances: Racializations, Surveillance, and the Politics of ?Worthiness in Puerto Rican Chicago.\" Latinos and Citizenship: The Dilemma of Belonging. Ed. Suzanne Oboler. New York: Palgrave MacMillian, 2006. 275-300. Print. <br/><br/>Wilson, Nikkeshia. \"Latinos and Islamic conversion in the United States.\" Muslims and American Popular Culture. Eds. Iraj Omidvar and Anne R. Richards. Santa Barbara: Praeger, 2014. Print. <br/><br/><br/>Artistic and Musical Productions of Latino/a Muslims <br/><br/>Aidi, Hisham. \"We Ain't White.\" Rebel Music: Race, Empire and the New Muslim Youth Culture. New York: Pantheon Books, 2014. 159-194. Print. <br/><br/>Aidi, Hisham. \"Verily, There Is Only One Hip Hop Umma: Islam, Cultural Protest, and Urban Marginality.\" Socialism and Democracy 18.2 (2004): 107-126. Print. <br/><br/>Cooke, Miriam and Bruce B. Lawrence. Muslim Networks from Hajj to Hip Hop. Chapel Hill: University of North Carolina Press, 2005. Print.<br/><br/>Independent Films <br/><br/>Brook, Yoni and Musa Syeed, dirs. A Son's Sacrifice. Foment Films, 2008.<br/><br/>Maytorena Taylor, Jennifer, dir. New Muslim Cool. Specific Pictures, 2009. <br/><br/>**These titles may changed based on any alternations made before the course begins. Not all of these titles will be used. This should give the student a strong idea of what topics and readings will be examined throughout the quarter."}], "path": "/class-descriptions/4660/WCAS/LATINO/393-0/34024", "instructor": ["Yamil   Avivi"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "34024", "subject": "LATINO"}]