[{"school": "WCAS", "overview_of_class": "This course examines the cultural politics of Latinx languages in the United States in the context of the history of U.S. imperialism and the colonial conditions that have framed language use, attitudes, and hybridity among US Latinx communities. We will first study the relationship of language to national imaginaries, the colonial erasure of Spanish and the racialization of Spanish in the US, the English Only Movement in the 1980s, and the colonial violence deployed against the use of Spanish. The second part of the course will focus on practices of linguistic hybridity that combine English and Spanish, both in speech as well as in literature. The course aims to contest dominant notions of Spanish as a global and profitable language, focusing on the cultural politics of English and Spanish among U.S. Latinx speakers, and to exhort students to think critically about the power differentials accorded to languages in the context of the U.S. racial, cultural and linguistic politics.<br/><br/>Note: Course will be taught in Spanish. Papers can be submitted in English.", "name": "Topics in Latina and Latino Text and Representation", "section": "1", "location": "555 Clark B03", "topic": "Cultural Politics of Latino Language", "course": "393-0", "meeting_time": ["TuTh 9:30AM - 10:50AM"], "path": "/class-descriptions/4660/WCAS/LATINO/393-0/34023", "instructor": ["Frances R Aparicio"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "34023", "subject": "LATINO"}, {"school": "WCAS", "overview_of_class": "We live in a world where historically and culturally Latinos are often equated with Catholic or Christian identity. In this course, we will examine how and why Muslim identity and Islamic culture have been marginalized within Latino culture and society despite their strong influence, as revealed by historical, cultural, and social evidence. This course will explore four historical moments of Islamic cultural and religious influence on Latinos/as in the Americas that include: 1) Islamic Culture in Moorish Spain, 2) Arab and Islamic Migrations to the Americas, 3) African American Islam, and 4) Islamic Conversions after 9/11. The following questions will guide our examination of these historical periods: How has Islam influenced Latino/a culture and society and why are these influences erased or forgotten by most Latinos/as in their Westernized lives? How did Latino/a Catholic identity come to be figured as normative and opposed to Muslim identity? What does it mean for Latinos/as to remember and claim their Islamic heritage within a Judeo-Christian national order, especially after 9/11? In the final section, the class will examine scholarship, literature, and art produced by Latino/a Muslims to compare the ways individuals and groups express their racial, cultural, social and religious identities and challenge rigid notions of Latino identity.", "name": "Topics in Latina and Latino Text and Representation", "section": "2", "location": "Kresge Centennial Hall 2-410", "topic": "Latinos and Islam", "course": "393-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4660/WCAS/LATINO/393-0/34024", "instructor": ["Yamil   Avivi"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "34024", "subject": "LATINO"}]