[{"school": "SoC", "overview_of_class": "This junior tutorial will focus on preparing you to exit the educational theatrical management process and enter the profession. To be frank, you will be hired based on your skill, personality and who you know.<br/>We will review any skills that you need to be the most competitive in the job market.<br/>We will discuss:<br/>? Professional Expectations<br/>? Looking Back at Past Work<br/>? The Markets<br/>? Cover Letters, Resumes, Positioning<br/>? Letters of Rec.<br/>? Internships, Apprenticeships, Employment<br/>? Networking<br/>? Skills and Transferable Skills", "name": "Junior Tutorial", "section": "21", "location": "Locy Hall 213", "topic": "Transitioning - Ed. Mgmt. to Prof. Theatre", "course": "380-7", "meeting_time": ["Mo 11:00AM - 12:50PM", "TBA"], "path": "/class-descriptions/4650/SoC/CMN/380-7/27494", "instructor": ["Barbara A Butts"], "class_attributes": "Permission of School<br/><br/>Juniors Only<br/><br/>", "id": "27494", "subject": "CMN"}, {"school": "SoC", "overview_of_class": "A hands on class in building a skill set of how to effectively communicate what you need, identify what your actor needs and keep creative impulses flowing. Using scenes from contemporary texts, we will fill the role of actor and director to offer experiences replicating the rehearsal process. A portion of the class will involve observing rehearsals on campus, speaking with professional directors and surveying actors and directors for their biased input.", "name": "Junior Tutorial", "section": "22", "location": "TBA", "topic": "", "course": "380-7", "meeting_time": ["TBA"], "path": "/class-descriptions/4650/SoC/CMN/380-7/27495", "instructor": [""], "class_attributes": "Permission of School<br/><br/>Juniors Only<br/><br/>", "id": "27495", "subject": "CMN"}, {"school": "SoC", "overview_of_class": "DESCRIPTION:<br/>Filmmakers will learn the craft of writing for the stage. Students will be assigned weekly plays to read that we will discuss in class, they will write three original short plays of their own, and we will workshop all material in class. In-class workshop of their original plays will be the primary focus of evaluation. Plays will be evaluated on professionalism, creativity, and the ability to effectively convey a story.", "name": "Junior Tutorial", "section": "23", "location": "Parkes Hall 215", "topic": "Playwriting for Filmmakers", "course": "380-7", "meeting_time": ["Th 12:00PM - 2:50PM"], "path": "/class-descriptions/4650/SoC/CMN/380-7/27496", "instructor": ["Erik Steven Gernand"], "class_attributes": "", "id": "27496", "subject": "CMN"}, {"school": "SoC", "overview_of_class": "What is a modern-day tragedy, and what is the difference between a tragedy and a drama with tragic results? In this course, students will read contemporary tragedies, complete weekly writing exercises exercises experimenting with the form, and ultimately craft an original tragedy of their own. Open to students of all levels of writing experience.", "name": "Junior Tutorial", "section": "24", "location": "Locy Hall 213", "topic": "Writing the Contemporary Tragedy", "course": "380-7", "meeting_time": ["We 3:00PM - 5:50PM"], "path": "/class-descriptions/4650/SoC/CMN/380-7/27497", "instructor": ["Laura J. Schellhardt"], "class_attributes": "", "id": "27497", "subject": "CMN"}]