[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "Kresge Centennial Hall 3-410"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores<br/>Add Consent: Department Consent Required<br/>Drop Consent: Department Consent Required<br/>", "qtr": "Fall 2016", "name": "13742", "title": "WCAS PHIL 109-6-20 First-Year Seminar in Philosophy", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "13742", "instructors": [{"instructor_phone": "8474912558", "instructor_name": "Axel   Mueller", "instructor_addr": "Crowe 1-111"}], "topic": "What is Democracy?", "course": "109-6", "descriptions": [{"name": "Overview of class", "value": "In this seminar we will examine some of the fundamental ideas and questions behind democracy and provide a reading of their &quot;inventors&quot;. Some of the questions are: What is democracy? Is it a form of government, a value, an ideal, a political system, a form of life, a bit of all this? Is democracy always the best political solution (in wartime? general starvation?)? Why should the whole of the people decide and not the specialists in the respective questions? Are all democratically taken decisions automatically legitimate (what about minorities' rights?)? How should all citizens in a democracy participate in politics? By direct self-government of the people or by voting representatives? Is everything democratically decidable or does the individual have unalterable rights? Is tolerance and/or free speech necessary for democracy and how far can it go?"}, {"name": "Learning Objectives", "value": "This Seminar will acquaint the students with the core ideas of major classics of democratic theory from Aristotle to Habermas. The method will be that of a historically guided systematic development of the normative ideal &quot;democratic state&quot;, on which students at the conclusion of the course will be able to write a competent research paper that uses central sources. Writing with sources and producing a standard academic research paper will be the other main focus of the instruction in the Seminar."}, {"name": "Teaching Method", "value": "Group workLectureSeminar"}, {"name": "Evaluation Method", "value": "PARTICIPATION: ? 2 informal 10-minute presentations, ? 4 300-word reaction papers, ? steady and dedicated in-class discussion ? 1 draft of final paper &amp; discussion thereof WRITTEN ASSIGNMENTS: ? 2 1000-word short papers ? 1 2500-word final research paper. PROPORTION (rule of thumb): Participation: ~33% (of which: reaction paper total ~15%, presentations ~25%, draft ~20%, class-discussion ~40%) + Short Papers (total) ~28% + Final Paper ~39%."}, {"name": "Class Materials (Required)", "value": "Course Reader containing excerpts from (Books NOT REQUIRED) ? Aristotle: Politics, Oxford, New York: Oxford University Press, 1995. ? Locke, John: Second Treatise of Government, Indianapolis: Hackett, 1980. ? de Montesquieu, Charles-Louis: The Spirit of Law, Cambridge, New York: Cambridge University Press, 1989. ? Madison, James: The Federalist Papers, ed. by Isaac Kramnick, Harmondsworth: Penguin 1987. ? de Tocqueville, Alexis: Democracy In America, quoted from Cahn, Steven M. (ed.) Classics of Modern Political Theory, Oxford: Oxford University Press, 1997, 722-752. ? Rousseau, Jean-Jacques: The Social Contract, Indianapolis: Hackett, 1987. ? Kant, Immanuel: Metaphysics of Morals, Cambridge, New York: Cambridge University Press, 1991, Perpetual Peace, Indianapolis: Hackett, 1982. ? Mill, John Stuart: On Liberty, Indianapolis: Hackett, 1978. ? Habermas, Juergen: &quot;On the pragmatic, the ethical and the moral employments of practical reason,&quot; in Justification and application, Cambridge, MA: MIT Press, 1993. ? The Declaration of Independence, The Constitution of the United States of America, quoted from The Federalist Papers, ed. by Isaac Kramnick, Harmondsworth: Penguin 1987."}], "lmod": "10/30/16 7:08 PM (CT)", "subject": "PHIL"}]