[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:50PM", "meet_l": "Technological Institute LG72"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-Requisite: Students must have taken BIOL_SCI 241 or 308 in order to register for this class.", "qtr": "Winter 2017", "name": "21305", "title": "WCAS BIOL_SCI 323-0-1 Bioinformatics:  Sequence and Structure Analysis", "class_attributes": "Prerequisites apply, see description<br/><br/>", "section": "21305", "instructors": [{"instructor_phone": "847/467-1173", "instructor_name": "Ishwar   Radhakrishnan", "instructor_addr": "Cook Hall, Room 4135"}], "topic": "", "course": "323-0", "descriptions": [{"name": "Overview of class", "value": "The course will explore through case studies and classroom discussions, the principles and practical applications of computational tools in contemporary molecular biology research. Besides gaining an appreciation for the algorithmic aspects of these tools, students will learn to code in Python and R, design and perform experiments in silico and critically evaluate results."}, {"name": "Registration Requirements", "value": "BIOL SCI 218, BIOL SCI 301, BIOL SCI 309 OR equivalent; BIOL SCI 361 OR equivalent recommended but not required. <br/><br/>Aptitude for computers and software is required; coding experience would be advantageous but not required."}, {"name": "Teaching Method", "value": "Lecture, discussion, and in-class discovery sessions"}, {"name": "Evaluation Method", "value": "Grades will be assigned based on class participation (attendance and class-work assignments and presentations; 30%), homework assignments (30%), and final exam (40%). The final exam will be comprehensive, so expect to be challenged in all areas that were covered in the course; the exam will be a take-home exam."}, {"name": "Class Materials (Required)", "value": "Understanding Bioinformatics, 1st Ed., by Marketa Zvelebil &amp; Jeremy Baum. Publisher: Garland Science<br/>ISBN: 0-8153-4024-9<br/><br/>Python for Biologists: A Complete Programming Course for Beginners, 1st Ed., by Martin Jones. Publisher: CreateSpace Independent Publishing Platform. ISBN: 1-4923-4613-6<br/><br/>Getting Started with R: An Introduction for Biologists, 1st Ed., by Andrew Beckerman &amp; Owen Petchey. Publisher: Oxford University Press ISBN: 0-1996-0162-3"}, {"name": "Class Materials (Suggested)", "value": "Bioinformatics Programming using Python by Mitchell Model. Publisher: O'Reilly. ISBN 978-0-596-15450-9<br/><br/>Bioinformatics and Functional Genomics, 2nd Ed., by Jonathan Pevsner. Publisher: Wiley-Blackwell<br/>ISBN: 978-0-470-08585-1<br/><br/>Building Bioinformatics solutions: with Perl, R and MySQL Conrad Bessant, Ian Shadforth and Darren Oakley. Publisher: Oxford University Press ISBN: 0-1992-3023-4"}], "lmod": "12/29/16 6:54 PM (CT)", "subject": "BIOL_SCI"}]