[{"class_mtg_info": [{"meet_t": "Fr 1:00PM - 2:50PM", "meet_l": "Swift Hall 210"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Fall 2016", "name": "10201", "title": "WCAS PSYCH 401-1-20 Proseminar-Biological &amp; Cognitive Bases of Behavior", "class_attributes": "Attendance at 1st class mandatory<br/><br/>Prerequisites apply, see description<br/><br/>", "section": "10201", "instructors": [{"instructor_phone": "", "instructor_name": "Mark Elliot Beeman", "instructor_addr": ""}], "topic": "", "course": "401-1", "descriptions": [{"name": "Overview of class", "value": "This 2-quarter sequence serves as the Psychology Department's Proseminar for incoming Ph.D. students. The two courses aim to provide a strong background in basic principles of and topics in psychological science, focusing on biological and cognitive approaches in the fall quarter (401-1) and social and emotional bases of behavior in the winter quarter (401-2). The course features guest appearances by most of the faculty members in the Psychology Department. In the fall quarter, professors affiliated mainly with the Brain, Behavior, and Cognition area (BBC) and the Cognitive Psychology area will teach the class. In the winter, professors affiliated mainly with the Social Psychology area, the Clinical Psychology area, and the new Personality and Health (P &amp; H) area will be featured. Across both quarters, Professor Mark Beeman (Department Chair) will sit in on all classes and help to facilitate discussion, in order to provide continuity from one session to the next.<br/><br/>Each class period is divided into 2 one-hour slots. Each slot features a topic and corresponding faculty member, although in many cases the two slots for the given date are combined into one topic. For each class meeting, 2-4 readings will be assigned. Each reading is a journal article or book chapter that is designed to raise fundamental issues in a given field while still being accessible to a broad audience. The readings appear as pdfs on the Blackboard website for this course. (Many are also available through the campus library, including electronic resources.) It is imperative that each student read the assigned articles or chapters before the class meeting when they are due, and submit questions/comments via Prof Beeman by Thursday at noon (to be relayed to the week's presenters). The main agenda item for the class meeting will be a discussion of the issues raised in the readings. The readings are listed below under the corresponding dates when they are due."}, {"name": "Evaluation Method", "value": "The grade will be based 50% on the end-of-the-quarter examination and 50% on in-class participation. The examination will be a take-home essay exercise to be administered at the end of each quarter. In the fall quarter, the exam will be designed and graded by the faculty members in BBC and Cognitive; in the winter, the exam will be graded by the faculty members in Social, Clinical, and Personality &amp; Health. More information on the examinations will be forthcoming. It is expected that students will do well in this class (and on the exams) if they (1) complete the readings in a timely and conscientious fashion and (2) actively engage in the class discussions."}], "lmod": "10/30/16 7:09 PM (CT)", "subject": "PSYCH"}]