[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "ANTHRO Sem Rm B07 - 1810 Hinmn"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "36525", "title": "WCAS ASIAN_ST 390-3-22 Advanced Topics in Asian Studies", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "36525", "instructors": [{"instructor_phone": "", "instructor_name": "Stefan   Henning", "instructor_addr": "Sociology Department, 1810 Chicago Ave."}], "topic": "Islam in Asia", "course": "390-3", "descriptions": [{"name": "Overview of class", "value": "This class introduces you to a wide variety of ethnographies on Muslim communities in Asia, both in the range of regions and states - Iran, Pakistan, India, Malaysia, Indonesia, and China - as well as in terms of themes - how Muslims engage secularizing states, coexist with hegemonic non-Muslim majorities, survive as refugees on the battleground of rival nation states, and, with native languages other than Arabic, make the Qur'an collectively meaningful.<br/><br/>At the same time, you will sharpen your ability to read and evaluate difficult books. We will analyze the ethnographies as texts to understand how the authors combined different kinds of texts to achieve the effect of a unified ethnographic whole, which different fieldwork activities yielded specific forms of data or emprirical materials, which writing techniques authors used to give voice to different groups of informants, and how authors attempted to represent the hold of the past on the &quot;now&quot; of fieldwork.<br/><br/>This class is reading-intensive and will focus on discussion. You will take turns leading discussions. This class works only if you participate actively in discussion. Preparation for class discussion by keeping up with the readings is crucial and will figure into the grading."}, {"name": "Teaching Method", "value": "This class is reading-intensive and will focus on discussion. You will take turns leading discussions. This class works only if you participate actively in discussion. Preparation for class discussion by keeping up with the readings is crucial and will figure into the grading."}, {"name": "Evaluation Method", "value": "50% Discussion. You are expected to participate actively in the discussion of every class meeting. You can only do this if you read the assigned chapters carefully and take reading notes. Each student will lead class discussion once. Attendance is required and will factor into the discussion part of your grade. I expect you to invest six hours per week in preparing the assigned readings. I expect you to take reading notes - whether in a notebook or your computer, to review your notes the day of, or even better, the night before class, and to bring your reading notes to class.<br/><br/>30% Take-home exams. Each of two five-page take-home exams will count for 15%.<br/><br/>20% Final paper. Write a 2,500-word paper on how academic scholarship approaches Asian Muslim communities in the present and in the recent past. The titles of the ethnographies in our class include words like &quot;violence,&quot; &quot;warrior,&quot; &quot;pogrom,&quot; &quot;vengeance,&quot; and &quot;victim.&quot; One book jacket displays a view through crosshairs. Is this perspective, which highlights conflict, killing, and hatred, partisan? Are there other topics and themes in recent ethnographies on Muslims in Asia? Are there different perspectives on conflict and violence in Asian Muslim communities? Is scholarship split into pro- and anti-Muslim camps? To find out, start with amazon.com. Follow Amazon's networking pathways to find other ethnographies on Muslims in Asia. You may also stray into neighboring fields like political science and recent history. I am not asking you to read more books; quickly skim introductions and conclusions to anwer the questions above. Limit yourselves to books from university presses and write about a minimum of eight books."}, {"name": "Class Materials (Required)", "value": "Shahla Talebi. Ghosts of Revolution. Rekindled Memories of Imprisonment in Iran. Stanford 2011.<br/><br/>Naveeda Khan. Muslim Becoming. Aspiration and Skepticism in Pakistan. Duke 2012.<br/><br/>Parvis Ghassem-Fachandi. Pogrom in Gujarat. Hindu Nationalism and Anti-Muslim Violence in India. Princeton 2012.<br/><br/>Cabeiri deBergh Robinson. Body of Victim, Body of Warrior. Refugee Families and the Making of Kashmiri Jihadists. California 2013.<br/><br/>Richard Baxstrom. Houses in Motion. The Experience of Place and the Problem of Belief in Urban Malaysia. Stanford 2008.<br/><br/>Anne K. Rasmussen. Women, the Recited Qur'an, and Islamic Music in Indonesia. California 2010.<br/><br/>Christopher R. Duncan. Violence and Vengeance. Religious Conflict and Its Aftermath in Eastern Indonesia. Cornell 2013."}], "lmod": "2/21/17 6:44 PM (CT)", "subject": "ASIAN_ST"}]