[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Harris Hall L05"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "23373", "title": "WCAS GERMAN 322-0-20 German Contributions to World Literature", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>Given in English<br/><br/>", "section": "23373", "instructors": [{"instructor_phone": "847/491-5788", "instructor_name": "Martina F Kerlova", "instructor_addr": "1800 Sherman, 3rd floor, room 3-502"}], "topic": "Prague: City of Cultures, City of Conflict", "course": "322-0", "descriptions": [{"name": "Overview of class", "value": "This course examines Prague, one of the most beautiful and culturally vibrant cities in Europe. The city`s magnificent streets and buildings, however, both conceal and reveal a past full of multiethnic coexistence and interethnic conflict. The goal of our course will be to understand how Prague's various communities built the city and its culture(s) and how they struggled to control it.<br/>The course will follow the twentieth-century transformation of the city from Cosmopolitan and Bourgeois Prague to Nazi and Communist Prague to Revolutionary and Capitalist Prague. We will read a range of literary and historical sources, including writings by Bohumil Hrabal, Václav Havel, Franz Kafka and Milan Kundera. We will also watch films set on the city`s streets and squares."}, {"name": "Registration Requirements", "value": "Taught in English"}, {"name": "Learning Objectives", "value": "Understand processes of societal integration and disintegration over several generations of changing political, social and cultural regimes. To consider the productive (as well as the destructive) consequences of interethnic strife and political repression, in particular, in the development of literature. To investigate how cultural producers and consumers respond to divisive pressures from within and censorious pressures from without.<br/>To understand the contingent and malleable nature of national and other identities."}, {"name": "Teaching Method", "value": "Readings, discussion, presentations, lecture, films"}, {"name": "Evaluation Method", "value": "Class attendance, participation, journals and presentation - 25%<br/>Three medium-length papers (5-6 pp.) - 75%"}], "lmod": "1/9/16 6:47 PM (CT)", "subject": "GERMAN"}]