[{"class_mtg_info": [{"meet_t": "MoWeFr 9:00AM - 9:50AM", "meet_l": "Fisk Hall 217"}], "school": "MEAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "30484", "title": "MEAS BMD_ENG 403-0-01 Advanced Systems Physiology", "class_attributes": "", "section": "30484", "instructors": [{"instructor_phone": "847/491-3043", "instructor_name": "Robert A Linsenmeier", "instructor_addr": "Tech Institute, Room E368, 2145 Sheridan Rd., Evanston"}], "associated_classes": [{"component": "DIS", "room": "Fisk Hall 217", "meeting_time": "Th 2:00PM - 2:50PM"}, {"component": "DIS", "room": "Tech Institute Lecture Room 4", "meeting_time": "Th 3:00PM - 3:50PM"}, {"component": "LAB", "room": "Technological Institute M349", "meeting_time": "Fr 10:00AM - 11:30AM"}], "topic": "", "course": "403-0", "descriptions": [{"name": "Overview of class", "value": "Physiology of the renal, digestive, and endocrine systems. Membrane transport, epithelia, and second messenger systems from an engineering perspective. General overview and in-depth study of original work.<br/><br/>BME 403 covers human renal, digestive, endocrine and metabolic physiology, at a relatively detailed systems level and with reference to diseases of these systems. Includes basic biochemistry of energy metabolism, and introductions to pharmacokinetics and immunology. The course is unified by a focus on metabolism, epithelial cell transport, and regulation. Graduate students in 403 attend the same lectures as undergraduates in BME 303 and do the same quantitative homework sets, use clickers to answer questions in class, and take the same two midterms as BME 303 students. However, BME 403 includes an additional weekly session in which students read, present and discuss papers from the research literature covering the course topics. The BME 403 final exam includes questions on these readings."}, {"name": "Learning Objectives", "value": "Membrane Transport<br/> Water balance<br/> Renal physiology<br/> Control theory<br/> Energy metabolism<br/> Endocrine regulation of energy metabolism<br/> Autonomic and enteric nervous systems<br/> Gastrointestinal system<br/> Temperature regulation<br/> Pharmacokinetics<br/> Neuroendocrine systems<br/> Calcium regulation<br/> Immunology"}, {"name": "Class Materials (Required)", "value": "Silverthorn, D.U. Human Physiology, 6th ed. Students will also need a Turning Technologies &quot;clicker.&quot;"}], "lmod": "2/9/17 6:34 PM (CT)", "subject": "BMD_ENG"}]