[{"class_mtg_info": [{"meet_t": "MoTuThFr 2:00PM - 2:50PM", "meet_l": "Kresge Centennial Hall 2-329"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Prerequisite: Students must have passed Chinese 211-2 with at least a C- or be placed in according to placement test results.<br/><br/>Prerequisite: Students must have passed Chinese 211-2 with at least a C- or be placed in according to placement test results.", "qtr": "Spring 2017", "name": "32583", "title": "WCAS CHINESE 212-0-20 Chinese III: Chinese in Business Practice", "class_attributes": "", "section": "32583", "instructors": [{"instructor_phone": "847/467-4792", "instructor_name": "Wen-pin   Hsieh", "instructor_addr": "1880 Campus Drive, Kresge Hall, Office 4-536"}], "topic": "", "course": "212-0", "descriptions": [{"name": "Overview of class", "value": "This is a one-quarter, non-sequential course offered in the spring quarter every year. This course focuses on using the target language properly in a professional social setting and is designed for students aspiring to China-focused careers and those interested in learning Chinese with materials related to business. In this course students will acquire business-related Chinese language skills, and gain a cross-cultural perspective of Chinese business practices. The emphasis will be on communicative situations such as social interactions, business travel, oral and written contact with peers, superiors and customers. This course integrates the study of language, cross-cultural awareness, and professional interaction. In addition to gaining enhanced overall fluency in and comprehension of the Chinese language, by the end of the course, students will be able to demonstrate adequate manners in social interactions with Chinese people, make fluent use of a basic business-related vocabulary, develop business communication skills in spoken and written Chinese, read and write using the textual forms and genres common to business settings."}, {"name": "Registration Requirements", "value": "Chinese 211-2 with a minimum grade C- or equivalent."}, {"name": "Teaching Method", "value": "The emphasis will be on communicative situations such as social interactions, business travel, oral and written contact with peers, superiors and customers. This course integrates the study of language, cross-cultural awareness, and professional interaction."}, {"name": "Evaluation Method", "value": "Attendance and classroom participation, oral midterms, written midterms, daily quizzes, final exam, oral presentations"}, {"name": "Class Materials (Required)", "value": "? New Silk Road Business Chinese - Intermediate Level - Comprehensive Course - (Business) - 1 ?????????????(???)&quot;<br/>? Publisher: Peking University Press; ISBN 978-7-301-20344-6/H. 3017)<br/>? and other supplementary materials compiled by the instructor."}], "lmod": "2/12/17 6:51 PM (CT)", "subject": "CHINESE"}]