[{"school": "SoC", "overview_of_class": "What happens when a factory closes in Illinois and relocates south of the Mexican border? How do US media and everyday race representations affect how race is conceptualized in Puerto Rico and the Dominican Republic? What is the relationship between nationalism, urban tourism and advertising? How is the &quot;global' constructed in foreign correspondents' accounts and in the speech scripts of call centers? How is it that Poland and Brazil are key countries in conducting experiments for the US pharmaceutical market? How was cotton central in the creation and consolidation of capitalism at a planetary scale? What makes a city &quot;global?&quot; <br/> <br/>The course looks at both classic and contemporary studies of globalization, in order to understand how it is that capital, labor and knowledge travel from one context to another, and what happens when this occurs. The first part of the course focuses on key theoretical approaches (e.g., Braudel, Abu Lughod, Sassen, Appadurai, Burawoy, Tsing) in which the global appears as a diagnostic, a condition and a method. The second part of the course looks at historical and anthropological work on commodity chains as to better understand the relationships that are forged between multiple locales through the production, distribution and consumption of a particular product, be it bananas, timber, sushi or flip flops. The third part of the course elucidates how knowledge (about race, architecture, economics or medicine) is transformed when diffused. The final quarter of the course interrogates what happens with communication at a global scale, by looking at the work of call centers, advertising agencies and foreign correspondents. We conclude by looking at &quot;globalization from below&quot; and transnationalism as two revealing perspectives for looking at the movement of people, objects and labor. <br/> <br/>The course follows a mixed lecture/seminar format, combining formal presentations, short lectures, and group discussion. We will have a couple of guest scholars later in the semester, invited to discuss with us their work on globalization and culture.", "name": "Seminar-Problems in Comm Studies", "section": "20", "topic": "Culture and Globalization", "course": "525-0", "meeting_time": ["Tu 3:00PM - 5:50PM"], "path": "/class-descriptions/4620/SoC/COMM_ST/525-0/35252", "instructor": ["Claudio Ezequiel Benzecry"], "id": "35252", "subject": "COMM_ST"}]