[{"class_mtg_info": [{"meet_t": "We 1:00PM - 3:50PM", "meet_l": "University Hall 418"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: No freshmen allowed. Pre-registration is for Global Health Studies Minor only. Registration is open to other students after pre-registration.", "qtr": "Spring 2017", "name": "33939", "title": "WCAS GBL_HLTH 320-0-3 Qualitative Research Methods in Global Health", "class_attributes": "No Freshmen<br/><br/>", "section": "33939", "instructors": [{"instructor_phone": "847/467-2780", "instructor_name": "Noelle   Sullivan", "instructor_addr": "1812 Hinman Avenue, #303, Evanston"}], "topic": "", "course": "320-0", "descriptions": [{"name": "Overview of class", "value": "The course tacks between understanding the theoretical underpinnings of qualitative approaches and the development of practical skills necessary to conducting rigorous qualitative research on global health topics. Students will become familiar with qualitative research not only through seminar-style discussion and workshop exercises, but also by &quot;doing&quot; research through a series of assignments. This course will provide an introduction to the landscape of health-related qualitative research practice, including design, data collection, analysis, and write-up. Throughout the class, we will discuss the ethical dilemmas and methodological challenges that face qualitative researchers working in global health at each step in the process. Methods students will learn include: writing ethnographic fieldnotes, qualitative semi-structured interview techniques, focus groups, life histories, coding and analysis."}, {"name": "Class Materials (Required)", "value": "Emerson, R. M. et al (2011). Writing Ethnographic Fieldnotes. Second Edition. Chicago: University of Chicago Press. ISBN 0226206831<br/><br/>Weiss, Robert S. (1995) Learning from Strangers: The Art and Method of Qualitative Interview Studies. Free Press. ISBN 0684823128<br/><br/>Course pack will be available or students can download the additional readings from Canvas"}], "lmod": "2/14/17 6:45 PM (CT)", "subject": "GBL_HLTH"}]