[{"class_mtg_info": [{"meet_t": "MoWeFr 1:00PM - 1:50PM", "meet_l": "University Lib B183 - PC Lab"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "20880", "title": "WCAS SWAHILI 111-2-20 Swahili I", "class_attributes": "", "section": "20880", "instructors": [{"instructor_phone": "8474912765", "instructor_name": "Richard Marshall   Lepine", "instructor_addr": "Kresge 4-404 (via 4-400)"}], "topic": "", "course": "111-2", "descriptions": [{"name": "Overview of class", "value": "This is the second quarter of the beginner's Swahili course sequence, and is open to undergraduate and graduate students. The course presents the essentials of modern Standard Swahili grammar while proficiency in the language is developed. Units 11-19 of the year-long text are covered in this quarter. Course work is Blackboard-based (NU web course management system), and the Student Response System (SRS) &quot;clickers&quot; are required for classroom participation."}, {"name": "Registration Requirements", "value": "Complete Swahili 111-1 (Fall quarter version of Swahili I, the first ten units of the required course textbook); or the equivalent with the consent of the instructor. Course may be taken P/N if not used to satisfy WCAS or other (Communication, Music, Medill, International Studies, Middle Eastern Studies) language proficiency requirement."}, {"name": "Learning Objectives", "value": "In addition to Fall verb-stem and non-verb-stem predicate material, four more verb tenses (affirmative and negative); all noun-class subject prefixes, object prefixes, adjective prefixes, and possessive prefixes; two of four demonstratives for all noun-classes. In addition to Fall cultural context information derived from the textbook, nine more units of cultural material."}, {"name": "Teaching Method", "value": "Students attend three sessions each week as a group. There are oral, written, audiovisual and computer class exercises, written homework assignments and projects, and regular quizzes and longer tests. Most are Blackboard-based, but in-class quizzes that are PowerPoint-based are used in the SRS system."}, {"name": "Evaluation Method", "value": "Attendance in lectures and labs, participation in classroom exercises, performance on homework, quizzes, tests and special projects will all potentially contribute to developing Swahili language skills. These skills, especially literacy, are periodically assessed, and determine the final course grade. Graded tests and assignments during the course are intended primarily as means of discovering and correcting problem areas, i.e. a poor performance does not carve into stone a bad course grade, but rather leads to the diagnosis and correction of a problem. There is an ongoing assessment of oral proficiency skills in classroom and lab sessions, so absences which impair language acquisition in this skill area also represent missed opportunities to demonstrate assessable oral interactive skills, and consequently affect the final course grade. In addition to numerous but relatively brief assessed written exercises throughout the course, there will be two writing skills tests, one at mid-term and the other at the end of the term. Review classes are held during Reading Week. There is a 2-hour written final test and an on-line audio test during exam week, as well as projects that must be posted to Google Tools and on the course blog and wiki."}, {"name": "Class Materials (Required)", "value": "Thomas Hinnebusch &amp; Sarah Mirza, Swahili, A Foundation for Speaking, Reading and Writing, University Press of America, 1998 revised edition. ISBN-13: 978-0761809722"}], "lmod": "1/9/16 6:54 PM (CT)", "subject": "SWAHILI"}]