[{"class_mtg_info": [{"meet_t": "Th 6:15PM - 9:15PM", "meet_l": "Wieboldt Hall 509"}], "school": "SCS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "37884", "title": "SCS ENGLISH 358-CN-16 Dickens", "class_attributes": "", "section": "37884", "instructors": [{"instructor_phone": "", "instructor_name": "Peter Paul Kaye", "instructor_addr": ""}], "topic": "", "course": "358-CN", "descriptions": [{"name": "Overview of class", "value": "This course is an introduction to some major works by Charles Dickens, who is arguably England's second greatest writer next to Shakespeare. He came of age as a writer while mass media was being created, and he made use of those communication tools to gain enormous popularity and influence. Some have even called him the world's first literary celebrity. The course examines three novels in the context of Victorian society-its values, tensions, and problems-and the complex relationship between the author and his audience, whom Dickens aimed both to please and to chastise. We will also look at some of Dickens's short essays, published in journals that he edited, which help explain the range of his interests. Texts include the novels Bleak House, Hard Times, and Our Mutual Friend."}, {"name": "Registration Requirements", "value": "Students who enroll should have fulfilled the SPS writing requirement or taken equivalent writing courses. Previous literature course strongly recommended."}, {"name": "Learning Objectives", "value": "To recognize the defining attributes of Dickens's fiction, both in term of style and content -What makes Dickens distinctive <br/><br/>To articulate Dickens's agenda as a writer by analyzing his use of characters, themes, and structures-What Dickens is trying to accomplish <br/><br/>To explain the relationship between Dickens's literature and Victorian society, focusing especially on the relationship between the author and his readers-How to understand the relation between the author and his society<br/><br/>To develop proficiency in writing literary analyses that employ textual evidence and, where appropriate, external research, to advance an argument-How to illuminate the complexity of the literature through analytic writing."}, {"name": "Teaching Method", "value": "The class will be primarily discussion-based, though short lectures will be provided to give relevant background information. We will often begin each session with a small-group activity to focus our thoughts and stimulate discussion."}, {"name": "Evaluation Method", "value": "Grades will be based on class participation and attendance (10%), two short 5-page papers (25% each), and an 8-page paper (40%) that will utilize focused research to add greater depth to the treatment of the topic."}, {"name": "Class Materials (Required)", "value": "Charles Dickens. Hard Times. New York: Dover, 2001. ISBN 13 978-0-486-41920<br/> ____. Bleak House.New York: Norton, 1978. ISBN 0-393-09332-8.<br/> ____. Our Mutual Friend. Oxford: Oxford UP. ISBN 0-19-283523-8."}], "lmod": "4/3/16 7:32 PM (CT)", "subject": "ENGLISH"}]