[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "555 Clark 230"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "34260", "title": "WCAS HISTORY 392-0-20 Topics In History", "class_attributes": "", "section": "34260", "instructors": [{"instructor_phone": "847/467-3399", "instructor_name": "Yohanan   Petrovsky-Shtern", "instructor_addr": "Harris Hall - Room 317"}], "topic": "Origins of Zionism", "course": "392-0", "descriptions": [{"name": "Overview of class", "value": "In many colonial contexts, the pre-colonial has been cast as outside of history. And yet there are places where individuals and their lives have survived the oblivion of history and where something of their lived experience can be recovered. These places indicate productive sites of knowing not only about the small histories of the past, but how these speak to, and elucidate, relations of power and aspects of global history. While this course will focus specifically on an archive assembled in the 1870s and 1880s in colonial South Africa (the Bleek and Lloyd Archive), comprising thousands of pages of interviews with several prisoners described at the time as indigenous hunter-gatherers, or &quot;Cape Bushmen&quot; (now known as |xam), and 4 young displaced boys from northern Namibia, it will also be attentive to the importance of thinking about archives in unconventional ways. The course will give students the opportunity to work with primary sources, - including photographs, maps, genealogies and drawings, as well as stories of origin, of conflict with settlers and relationships with animals, of murder, hunting, personal histories, and of times stretching into the pre-colonial past - to consider visual and object sources, and to think about the effect the making of an archive has on the histories it is able to generate."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Participation, Presentations, Papers, &amp; Final Exam (25%)"}, {"name": "Class Materials (Required)", "value": "Course Packet"}], "lmod": "2/8/17 6:43 PM (CT)", "subject": "HISTORY"}]