[{"school": "WCAS", "overview_of_class": "We sometimes think of Christian mysticism?the experiential knowledge of God?as a tradition that flourished in the Middle Ages. But it is still very much alive and well. In this course we will read important mystical writers from the mid-20th century to the present in the Roman Catholic, Orthodox, Protestant, and Anglican traditions. Some of the questions we will ask include: What is mystical or contemplative prayer? How is it possible to know God by experience in a secular, scientific age? What is the relationship between mystical prayer and political action? And why does mystical thought so often express itself in literary form?", "name": "Topics in Christianity", "section": "20", "location": "University Hall 112", "topic": "Modern Christian Mystics", "course": "349-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4620/WCAS/RELIGION/349-0/34730", "instructor": ["Barbara Jane   Newman"], "class_attributes": "Ethics &amp; Values Distro Area<br/><br/>", "id": "34730", "subject": "RELIGION"}, {"school": "WCAS", "overview_of_class": "This seminar will give undergraduates the opportunity to reflect critically, thoughtfully, and together with peers, on the question: why go to college? There are many expectations that parents and society place on the college experience. But now that we are in college, how shall we think about it? Is it an experience or is it an education? Is it a ticket to a job or is it the pursuit of knowledge? What do professors do? How is contemporary culture reflected in the university? We address various facets of college life, from diversity and justice to sex and sexism on campus, from the \"party pathway\" to technology. We explore the value of the humanities. We survey the history of the university, investigate its religious origins, and learn about the \"crisis\" of the contemporary university.", "name": "Topics in Christianity", "section": "21", "location": "McMillen Crowe Hall 4-138", "topic": "Why College?", "course": "349-0", "meeting_time": ["Th 2:00PM - 4:50PM"], "path": "/class-descriptions/4620/WCAS/RELIGION/349-0/34731", "instructor": ["Christine M Helmer"], "class_attributes": "Ethics &amp; Values Distro Area<br/><br/>", "id": "34731", "subject": "RELIGION"}]