[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "University Hall 318"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24070", "title": "WCAS ENGLISH 397-0-20 Research Seminar for Literature Majors", "class_attributes": "Attendance at 1st class mandatory<br/><br/>Juniors/Seniors Only<br/><br/>", "section": "24070", "instructors": [{"instructor_phone": "", "instructor_name": "Christine   Froula", "instructor_addr": ""}], "topic": "Tech &amp; Landscape in 20th C Lit", "course": "397-0", "descriptions": [{"name": "Overview of class", "value": "Conrad's Marlow piloting a rattletrap steamship carrying armed &quot;pilgrims&quot; up the Congo; industrial war machines shelling tiny, fragile human bodies in fields of red poppies in France; Hemingway driving an ambulance on the Italian front; Chaplin's Tramp cast opposite a zeppelin in a censored wartime short film; Eliot's London typist coming home at teatime to play her gramophone; the clanking newsroom presses and the printed newspapers, ads, posters, and flyers that beckon, call and cry to Dubliners in Ulysses's river-threaded cityscapes; Forster's train to the Caves and automobile accident on the Marabar Road in A Passage to India; Mrs Dalloway's aeroplane writing on the sky above astonished Londoners; Giles Oliver's vision of Hitler bombing the village church to smithereens on the festival day of the annual pageant in 1939 in Woolf's Between the Acts; Time Magazine bringing the shocking news of the atomic bombing of Hiroshima to the American prison camp in Pisa, where it reverberates in Pound's Pisan Cantos: twentieth-century literature abounds in depictions of emergent technologies in specific landscapes shaping conditions and events of human life and thought. <br/><br/>In our research seminar, we'll read a selection of such works alongside essays by Benjamin, Kittler, Woolf, Leopold, Hansen, and others. Working closely with the instructor and our Humanities Bibliographer, Charlotte Cubbage, each student will zero in on a topic and design a juicy, imaginative, feasible project that combines scholarly research and literary interpretation. One for all and all for one, we'll learn to frame promising research questions; to navigate scholarly databases and archives; to evaluate sources; to explore readings in context while capturing and testing our own insights and ideas; and to give and take constructive critique. Each student will produce a work notebook, a preliminary proposal, an annotated bibliography, a working proposal and bibliography, and a 12-15 page research paper."}, {"name": "Teaching Method", "value": "Seminar discussions and workshops and individual conferences."}, {"name": "Evaluation Method", "value": "Attendance, preparation, class participation; exercises, such as posts, peer review, and in-class workshops; a preliminary proposal and bibliography, annotated bibliography, working proposal and bibliography, drafts, and the 12-15 page research paper."}, {"name": "Class Materials (Required)", "value": "Some exemplary selected works, excerpts, essays, and research guides to be read by us all; plus each student's particular bibliography. Everyone will learn from each other's projects while pursuing his or her own."}, {"name": "Class Notes", "value": "Prerequisites: Open to juniors and seniors only. Students must successfully complete 4-6 300-level English courses before taking English 397."}], "lmod": "12/24/16 6:58 PM (CT)", "subject": "ENGLISH"}]