[{"class_mtg_info": [{"meet_t": "MoWeFr 10:00AM - 10:50AM", "meet_l": "University Lib B183 - PC Lab"}], "school": "WCAS", "overview_of_class": "Third quarter of beginner-level Swahili language and cultural studies, concluding the learning of Swahili grammar and a solid core vocabulary, with the goal of achieving oral interactive proficiency and literacy at the ACTFL Intermediate-mid level.", "qtr": "Spring 2016", "name": "Swahili I", "title": "WCAS SWAHILI 111-3-20 Swahili I", "lmod": "4/3/16 8:24 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "8474912765", "instructor_name": "Richard Marshall   Lepine", "instructor_addr": "620 Library Place, rm. 201"}], "topic": "", "course": "111-3", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Third quarter of beginner-level Swahili language and cultural studies, concluding the learning of Swahili grammar and a solid core vocabulary, with the goal of achieving oral interactive proficiency and literacy at the ACTFL Intermediate-mid level."}, {"name": "Registration Requirements", "value": "Must have completed Swahili 111-2, or demonstrated the equivalent proficiency by NU Swahili placement test."}, {"name": "Learning Objectives", "value": "By the end of the course, students will be expected to have acquired basic proficiency in Swahili and to demonstrate this by using the language for academic research projects and presentations."}, {"name": "Teaching Method", "value": "Minimum 150 min/wk classroom lecturing, demonstration of study and presentation techniques, conversation and reading performance practice. Homework assignments all as Canvas-site-based exercises in the form of multimedia quizzes and compositions; also Canvas-based blog and wiki work. Heavy on the homework, but except for final quizzes, all programmed to be completed in a no-GPA-risk environmentunlimited do-overs on quizzes, revisable drafts for Swahili-language compositions."}, {"name": "Evaluation Method", "value": "The most heavily-weighted assessed assignments are presentations: final (revised) versions of one or more blog postings and wiki entrieswork that is visible to all participants in the Swahili 111-3 Canvas site roster. These presentations include embedded digital audio of individual student voice performances. Additionally, there are three midterm exams (Swahili-to-Swahili, Swahili-to-English, English-to-Swahili) in the form of Canvas-based quizzes programmed for unlimited do-overs, no time limits, and correct answers displayed after each submission. These will be mirrored by three final Canvas quizzes, also without time limits, but programmed for single submission and no display of correct answers. All compositions and presentation assignments and at least one attempt at each of the six Canvas midterm and final quizzes are the basic minimum coursework required in order to receive a final grade. Canvas-based homework exercises stand as no-GPA-risk/no-GPA-reward Swahili language-learning resources."}, {"name": "Class Materials (Required)", "value": "Swahili: A Foundation for Speaking, Reading, and Writing - Second Edition<br/>Paperback - August 1, 2000<br/>by Thomas J. Hinnebusch (Author), Sarah M. Mirza (Author)<br/>ISBN-13: 978-0761809722 ISBN-10: 0761809724 Edition: 2nd Edition<br/><br/>Swahili Grammar and Workbook Paperback - October 16, 2014<br/>by Fidèle Mpiranya (Author)<br/>ISBN-13: 978-1138808263 ISBN-10: 1138808261 Edition: 1st"}, {"name": "Class Notes", "value": "no P/NP option if the course is being used to satisfy a College or School foreign language proficiency requirement"}], "path": "/class-descriptions/4620/WCAS/SWAHILI/111-3/30862", "instructor": ["Richard Marshall   Lepine"], "class_attributes": "", "id": "30862", "subject": "SWAHILI"}]