[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Parkes Hall 215"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "18874", "title": "WCAS ANTHRO 270-0-20 Anthropology of Social Media", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "18874", "instructors": [{"instructor_phone": "847 4914565", "instructor_name": "Emily N Haynes", "instructor_addr": "1810 Hinman Ave 206"}], "topic": "", "course": "270-0", "descriptions": [{"name": "Overview of class", "value": "In barely a decade, social media has transformed the world around us, the way we learn, the way we communicate, and our relationships. The changes have inspired claims about the ways social media are changing our lives. Yet most of these claims are very general. Taking an anthropological view, this course looks at a variety of forms of social media in very different social contexts, concentrating on content of social media rather than platforms. We will also use social media as a research method for understanding people's lives as they converge in both online and offline spaces. We will see not only how social media has changed people's lives but also how these people have changed social media. Interestingly, this course challenges many of the claims that are made about what social media is by showing the incredible variation in social media that emerges on different continents, among people of different class and religious backgrounds, for people with different gender identities and sexual preferences, for producers, consumers, and students. As we will find, social media can tell us much about the contemporary world at large."}, {"name": "Learning Objectives", "value": "This course will<br/>1. expose students to the study of human diversity and similarity <br/>2. make course content and class discussion relevant to the students' lives in order to develop students' capacity to &quot;make the familiar strange and the strange familiar&quot; <br/>3. teach students how to read texts and author's arguments critically through class discussions <br/>4. inspire students to think comparatively by asking them how the particular behavior, issue or reality they are reading about or discussing in class compares across countries, regions, and time<br/>5. encourage students to participate actively in class and overcome their fears about speaking publicly. <br/>6. make students aware of being different from one another, while simultaneously recognizing the obvious fact of our common humanity - that we are more alike than we are different"}, {"name": "Teaching Method", "value": "DiscussionLectureA combination of lectures, class discussions, and applied projects"}, {"name": "Evaluation Method", "value": "Participation 15%<br/>Research Proposal 15%<br/>Blog Field notes 20%<br/>Midterm Literature Review 20%<br/>Ethnographic Paper 30%"}, {"name": "Class Materials (Required)", "value": "All course materials will be available online or as a course packet"}, {"name": "Class Materials (Suggested)", "value": "suggested materials include books available in the library"}], "lmod": "10/30/16 6:58 PM (CT)", "subject": "ANTHRO"}]