[{"class_mtg_info": [{"meet_t": "We 6:30PM - 9:30PM", "meet_l": "Fisk Hall 311"}], "school": "WCAS", "overview_of_class": "Marketing Management  provides an understanding of the key concepts and methods of marketing principles in both traditional and digital media. The course provides students with a foundation in the development and execution of marketing strategies for any organization. Primary emphasis is placed on consumer insight, branding, market segmentation and positioning, distribution, sales, message strategy, promotion and the execution of marketing through appropriate media technologies. Students will develop an understanding of marketing through readings, lectures, case analysis and discussions and will demonstrate effective decision-making in ambiguous marketing environments, using financial and market analysis, and considering legal and ethical concerns. The course develops students' ability to think analytically and strategically by assessing examples and case studies of marketing problems and opportunities.", "qtr": "Winter 2016", "name": "Marketing Management", "title": "WCAS BUS_INST 239-0-20 Marketing Management", "lmod": "1/9/16 6:44 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Candy   Lee", "instructor_addr": ""}], "topic": "", "course": "239-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Marketing Management provides an understanding of the key concepts and methods of marketing principles in both traditional and digital media. The course provides students with a foundation in the development and execution of marketing strategies for any organization. Primary emphasis is placed on consumer insight, branding, market segmentation and positioning, distribution, sales, message strategy, promotion and the execution of marketing through appropriate media technologies. Students will develop an understanding of marketing through readings, lectures, case analysis and discussions and will demonstrate effective decision-making in ambiguous marketing environments, using financial and market analysis, and considering legal and ethical concerns. The course develops students' ability to think analytically and strategically by assessing examples and case studies of marketing problems and opportunities."}, {"name": "Learning Objectives", "value": "The Students will be able to demonstrate and apply concepts and methods to address marketing and communications challenges in order to analyze how marketing is essential for business growth. At the end of the course students will understand the principles of marketing including areas of consumer orientation, segmentation, business to business, business to consumer, international perspectives, shopper and retail marketing."}], "path": "/class-descriptions/4610/WCAS/BUS_INST/239-0/20440", "instructor": ["Candy   Lee"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "id": "20440", "subject": "BUS_INST"}]