[{"class_mtg_info": [{"meet_t": "Mo 2:00PM - 4:50PM", "meet_l": "Allison Residential Comm 1021"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "33907", "title": "WCAS GNDR_ST 490-0-24 Topics in Gender Studies", "class_attributes": "", "section": "33907", "instructors": [{"instructor_phone": "", "instructor_name": "Jennifer Christine Nash", "instructor_addr": ""}], "topic": "Intersectionality &amp; its Discontents", "course": "490-0", "descriptions": [{"name": "Overview of class", "value": "Intersectionality has become central to how our field defines itself - its methods, politics, pedagogical strategies, and theoretical frameworks. At the same time, intersectionality is increasingly subject to rigorous critiques - it has been condemned as a passé identity politic, bemoaned as too demanding in its imagined call to analyze the simultaneity of complex social structures. Our collective task is to understand how, why, and when intersectionality became the metric of rigorous feminist scholarship, the key program-building intiative in our field, and a synonym of &quot;ethical&quot; feminist work. Over the course of the quarter, we will explore topics including: the institutionalization of intersectionality, the politics of inclusion, the conflation of black feminism(s) and intersectionality, Left critiques of intersectionality, diversity/intersectionality, transnationalism/intersectionality, decoloniality/intersectionality, debates about intersectionality's histories and origins, and scholarly and political attempts to expand intersectionality to capture categories including sexuality, class, and religion. Ultimately, we will spend the quarter following intersectionality around a feminist archive, seeking to understand feminist attachments, anxieties, and ambivalence around the term."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Class Materials (Required)", "value": "Robyn Wiegman, Object Lessons<br/>Jasbir Puar, Terrorist Assemblages<br/>Claire Hemmings, Why Stories Matter<br/>Anna Carastathis, Intersectionality: Origins, Contestations, Horizons<br/>Articles will be made available"}], "lmod": "2/9/17 6:43 PM (CT)", "subject": "GNDR_ST"}]