[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "McMillen Crowe Hall 3-130"}], "school": "WCAS", "overview_of_class": "Participants will read and translate medieval Latin texts ranging from the Vulgate (Latin Bible) to a wide selection of literary, historical, and religious works in verse and prose. Each session will be devoted to a mixture of grammar review, sight-reading, and correction of written translations prepared beforehand.  There may also be some English-to-Latin exercises.  Students taking the course for credit will hand in an assigned translation every week; auditors will prepare translations for oral review, but need not hand them in.  Full-credit students will also work throughout the quarter on individual translations related to their research interests.  The length and difficulty of the texts chosen will depend on the student's prior degree of proficiency in Latin.  Finished translations should be in the range of 5-8 double-spaced pages.  Grades will be based on oral performance in class, weekly written assignments, and the final translation project (33% each).", "qtr": "Winter 2016", "name": "Medieval Latin", "title": "WCAS LATIN 400-0-1 Medieval Latin", "lmod": "1/9/16 6:50 PM (CT)", "section": "1", "instructors": [{"instructor_phone": "847/491-5679", "instructor_name": "Barbara Jane   Newman", "instructor_addr": "University Hall 215"}], "topic": "", "course": "400-0", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "descriptions": [{"name": "Overview of class", "value": "Participants will read and translate medieval Latin texts ranging from the Vulgate (Latin Bible) to a wide selection of literary, historical, and religious works in verse and prose. Each session will be devoted to a mixture of grammar review, sight-reading, and correction of written translations prepared beforehand. There may also be some English-to-Latin exercises. Students taking the course for credit will hand in an assigned translation every week; auditors will prepare translations for oral review, but need not hand them in. Full-credit students will also work throughout the quarter on individual translations related to their research interests. The length and difficulty of the texts chosen will depend on the student's prior degree of proficiency in Latin. Finished translations should be in the range of 5-8 double-spaced pages. Grades will be based on oral performance in class, weekly written assignments, and the final translation project (33% each)."}, {"name": "Registration Requirements", "value": "Prerequisite: At least two years of prior Latin study. Open to advanced undergraduates with permission of instructor. Texts: Charles H. Beeson, A Primer of Medieval Latin: An Anthology of Prose and Poetry; Richard Upsher Smith, Jr., Ecclesiastical, Medieval, and Neo-Latin Sentences. Available via amazon.com."}], "path": "/class-descriptions/4610/WCAS/LATIN/400-0/25312", "instructor": ["Barbara Jane   Newman"], "class_attributes": "", "id": "25312", "subject": "LATIN"}]