[{"school": "WCAS", "overview_of_class": "Why did some communities during the Armenian genocide protect victims of mass persecution while others did not? Why did some but not all Germans decide to actively participate in the killing of Jews during the Holocaust? Why did mass violence break out in Rwanda in the 1990s and not in equally instable Ivory Coast during the 2000s? / / In this course we will examine one of the most destructive, evil and perplexing phenomena haunting society: genocide - i.e. , the on a large scale organized exclusion and killing of populations defined by race, ethnicity, nationality or religion. In the first section of this course students will be introduced to ideational, rational and psychological explanations of genocide. Causes of genocide can be found at different levels of analysis. We will focus on theories at three different levels. First, we will look at how national and international processes such as modernization and political leadership cause genocide (macro level). Second, we will look at why individuals decide to participate in or condone mass killings (micro level). Third, we will look at what role subnational groups such as religious communities play (meso level). In the second part of this course, we will assess the validity of different explanations through the comparative study of three particular cases: the Holocaust, the Armenian Genocide and Rwanda. Students will explore a fourth case on their own. We will end the course with a discussion on foreign intervention. / / Students will improve their analytical skills by drawing connections between social science theory, historical monographs, graphic novels, memoirs of genocide survivors, journalistic accounts, policy documents, and public debates on foreign intervention. Upon completing the course, students will not only be acquainted with the main types of explanations offered for genocide, but they will also be able to evaluate the evidence supporting the various explanations. In turn, this should help students to develop and evaluate proposals to end and prevent mass killing.", "name": "Topics in Sociological Analysis", "section": "20", "location": "University Hall 101", "topic": "Understanding Genocide", "course": "376-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4640/WCAS/SOCIOL/376-0/14415", "instructor": ["Robert   Braun"], "class_attributes": "", "id": "14415", "subject": "SOCIOL"}, {"school": "WCAS", "overview_of_class": "Is scarcity ever natural? Or is it an inevitable by-product of human society? Can technology and political will ever make possible a post-scarcity society? What are the conditions that produce, distribute, and mediate scarcity locally, nationally and globally? How does scarcity interact with abundance? What are the cultural and historical effects of scarcity? When and to whom is scarcity invisible? Which policies work best in confronting scarcity? These are some of the questions that will animate this class as we examine scarcity in the distribution of water, food and healthcare in countries and communities around the world. Topics include: the effects of gender, race, ethnicity on scarcity; what the developed world can learn from the developing world about conservation and distribution; how scarcity is portrayed or ignored in contemporary media.", "name": "Topics in Sociological Analysis", "section": "21", "location": "Locy Hall 214", "topic": "Politics of Scarcity", "course": "376-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4640/WCAS/SOCIOL/376-0/14416", "instructor": ["Wendy N Espeland"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>Only one unit towards major<br/><br/>", "id": "14416", "subject": "SOCIOL"}, {"school": "WCAS", "overview_of_class": "Utopian thought has a long history in Western thought as different writers have attempted to define the ideal community from Plato's Republic through Thomas More ?s first coining of \"Utopia\" (nowhere) as an ideal community in the Sixteenth century. Often Utopias were defined as counter critiques of existing social arrangements and at times people attempted to create and live in communities based on their ideals.. In this course we will explore fictional and real utopian communities in each of three broad historical periods?preindustrial, industrial, and post-industrial. We will use these cases as critical analyses of existing societies highlighting the social problems of their day?issues such as inequalities of wealth and power, individual versus collective priorities, family structure and socialization, sexual relations and gender roles, defining and dealing with deviants, and social control, education, work and leisure, among others. We will explore in detail the founding, the dynamics, and the fates of attempts to live in real utopian communities. We will conclude with a consideration of the role of utopian thought in contemporary society.", "name": "Topics in Sociological Analysis", "section": "22", "location": "University Hall 101", "topic": "Utopian Communities", "course": "376-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4640/WCAS/SOCIOL/376-0/14418", "instructor": ["Albert Dale   Hunter"], "class_attributes": "", "id": "14418", "subject": "SOCIOL"}]