[{"class_mtg_info": [{"meet_t": "Tu 2:00PM - 4:50PM", "meet_l": "University Hall 018 English"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Spring 2017", "name": "33342", "title": "WCAS ENGLISH 461-0-20 Studies in Contemporary Literature", "class_attributes": "", "section": "33342", "instructors": [{"instructor_phone": "", "instructor_name": "Christine   Froula", "instructor_addr": ""}], "topic": "Empire, War, Worldliness", "course": "461-0", "descriptions": [{"name": "Overview of class", "value": "In this seminar we'll pose three broad questions across the long twentieth century: How do signal aesthetic writings imagine, approach, frame, and think about their mutually implicated and evolving conditions of empire and war? In what specifically literary ways do they engage key discourses-of imperialism, colonialism, &quot;semi-colonialism,&quot; postcolonialism, orientalism, &quot;enlightenment orientalism,&quot; &quot;postcolonial enlightenment&quot;?in themselves and through their ongoing receptions? How do critical and creative responses, from initial publication to our own moment, think with, through, and against them? <br/><br/>In the spirit of what Edward Said calls &quot;worldly,&quot; or multicentric, criticism, and with some flexibility depending on seminar members' intellectual goals, we'll study such works as: Kipling, Kim, Conrad, Heart of Darkness, Joyce, Dubliners and Ulysses (selections), Yeats, war poems, Forster, A Passage to India, Woolf, Mrs Dalloway, Pound, Homage to Sextus Propertius, Eliot, The Waste Land, Narayan, The English Teacher, Rhys, Wide Sargasso Sea, Salih, Season of Migration to the North, Rushdie, Midnight's Children (film/screenplay), Hirsi Ali, Infidel, Tricycle Theatre's The Great Game: Afghanistan, alongside relevant intellectual texts to be chosen from Hobsbawm, Kant, Arendt, Said, Pratt, Achebe, Hochschild, Pearse, Orwell, Rushdie, Ngugi wa' Thiongo, Spivak, Franco, Scott, Fischer, Boehmer, Nasta, Chakrabarty, Aravamudan, others."}, {"name": "Evaluation Method", "value": "Weekly comments, questions, and concerns based on the readings for each class, offered for discussion; class presentation on a work's relevant reception history; choice of two shorter essays or one longer essay or project."}, {"name": "Class Notes", "value": "We'll begin with some assigned readings to make the most of our first class, so if you plan to register late, please email me for the assignment."}], "lmod": "2/6/17 6:42 PM (CT)", "subject": "ENGLISH"}]