[{"class_mtg_info": [{"meet_t": "Th 11:00AM - 2:00PM", "meet_l": "University Library Video Theat"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24648", "title": "WCAS RELIGION 371-0-20 Religion and Film", "class_attributes": "Ethics &amp; Values Distro Area<br/><br/>", "section": "24648", "instructors": [{"instructor_phone": "847 4612620", "instructor_name": "J Michelle   Molina", "instructor_addr": "Crowe Hall, 4-142"}], "topic": "", "course": "371-0", "descriptions": [{"name": "Overview of class", "value": "Religion, Existentialism, and Film.<br/><ln/><br/>In the aftermath of the World War I, many artists and filmmakers asked new questions about the relationship between realism and religion. Could one reconcile concrete reality (or realism) with faith in the other-worldly? Many of the artists under discussion in the course drew upon themes that had already been raised by Kierkegaard in the 19th century. What was the relationship between religion and modernity, faith and ethics, reality and the supernatural, observable phenomena and invisible causes? How did one make sense of death in a meaningless universe? Was the universe meaningless? Could meaning be found in realism itself? <br/><br/>Through engagement with films by directors ranging from Robert Bresson, Luis Buñuel, Pier Paolo Pasolini, and Ingmar Bergman, to Woody Allen and Harold Ramis, we will study mid-to-late 20th century films whose common theme is the quest to understand the meaning of life, either actively through taking up religious life, or because the protagonists consider themselves inhabiting a godless and meaningless universe. Class will be discussion-based, with a few short lectures to set up pertinent themes. Our discussions will likely range broadly, but important themes will be realism, existentialism, atheism, and the quest for philosophical truth to be found in filmic portrayals of everyday life. Class readings will include Kierkegaard, Sartre, Merleau-Ponty, among others."}], "lmod": "12/29/16 7:05 PM (CT)", "subject": "RELIGION"}]