[{"class_mtg_info": [{"meet_t": "Th 3:00PM - 5:50PM", "meet_l": "Louis Hall 118"}], "school": "SoC", "enrl_requirement": "", "qtr": "Winter 2017", "name": "27488", "title": "SoC RTVF 378-0-20 Topics in Post-Production", "class_attributes": "Prerequisites apply, see description<br/><br/>", "section": "27488", "instructors": [{"instructor_phone": "", "instructor_name": "James Christian Jensen", "instructor_addr": ""}], "topic": "Documentary Editing", "course": "378-0", "descriptions": [{"name": "Overview of class", "value": "RTVF 378-0 Sec. 20 - Topics in Post Production: Documentary Editing<br/> <br/>Course Description &amp; Learning Objectives:<br/>This course is specifically designed to support and inspire students with pre-shot (or nearly shot) documentary material as they edit that material to completion. It will encompass both seminar and lecture-style elements. On the seminar side, students will be expected to take raw documentary footage through several stages of editing deadlines, screenings, and critique in order to complete a short film. Any students who do not have documentary material of their own (encouraged), will be assigned material to work with.<br/> <br/>On the lecture side, the course will cover major issues in and approaches to editing a documentary film, ranging from the practical to the theoretical. Major topics we may cover include: Foundational editing theory and history, systems for organizing footage within your project file, editing workflows for single-editor indie films and multi-editor series, cutting observational scenes, using sound/texture to further the story, navigating the editor/director relationship, and the dilemma of cutting for narrative 'truth' versus cutting for emotional clarity and drama. This is NOT a technical training course and a working knowledge of AVID, or Premiere Pro is required. We may go over certain functions from time to time, but a baseline of technical knowledge is assumed. Lynda.com (free for Northwestern students) offers excellent tutorials in all major editing systems if needed.<br/> <br/>Evaluation Method:<br/>Editing Exercises and Editing Assignments<br/>Complete Assigned Readings<br/>Participate Fully in Classes and Labs<br/>Written Organizational Assignments<br/> <br/>Text TBA (estimated cost $40)"}], "lmod": "12/29/16 6:46 PM (CT)", "subject": "RTVF"}]