[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "Frances Searle Building 2378"}], "school": "WCAS", "overview_of_class": "Legal_St 101-6-20 \"The U.S. West\", Shana Bernstein, Fall 2017<br/><br/>In this course we will examine the history of the U.S. West as both frontier and region, real and imagined. We will consider topics such as Indian Removal, wars of conquest, law, immigration and migration, race, gender, nationality, class, and environment. Much of our focus will be on the role mythology has played shaping memories and understandings of the region.", "qtr": "Fall 2017", "name": "First-Year Seminar", "title": "WCAS LEGAL_ST 101-6-20 First-Year Seminar", "lmod": "5/4/17 7:31 PM (CT)", "section": "20", "topic": "The U.S. West", "course": "101-6", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "descriptions": [{"name": "Overview of class", "value": "Legal_St 101-6-20 \"The U.S. West\", Shana Bernstein, Fall 2017<br/><br/>In this course we will examine the history of the U.S. West as both frontier and region, real and imagined. We will consider topics such as Indian Removal, wars of conquest, law, immigration and migration, race, gender, nationality, class, and environment. Much of our focus will be on the role mythology has played shaping memories and understandings of the region."}, {"name": "Learning Objectives", "value": "By the end of the quarter, students will be able to read and analyze diverse primary sources carefully and accurately, with attention to the author's perspective, position, and credibility, and to the source's general context; read, evaluate, summarize, and engage with scholarly works by others, and be able to analyze authors' arguments for evidence, context, strength, and credibility; make clearly written and organized arguments that are well supported by primary sources; and understand how to properly cite facts, ideas, and scholarship. Students will also better understand how issues including race, class, gender, nationality, and environment have shaped the West, as well as how the West has often played a disproportionate role in mythologies about the United States. They will also learn to think more critically about political, social, economic, and/or cultural issues related United States history and current society."}, {"name": "Teaching Method", "value": "Seminar/Discussion"}, {"name": "Evaluation Method", "value": "Papers worth 70% of the course grade, Discussion worth 30% of the course grade"}, {"name": "Class Materials (Required)", "value": "Tentative list: Rachel Calof, Rachel Calof's Story; Mary Paik Lee, Quiet Odyssey: A Pioneer Korean Woman in America; Leslie Marmon Silko, Ceremony; Richard White, The Organic Machine; Linda Nash, Inescapable Ecologies"}, {"name": "Class Notes", "value": "Attendance at first class required"}], "instructor": ["Shana B Bernstein"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "12097", "subject": "LEGAL_ST"}]