[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Annenberg Hall G15"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "21239", "title": "WCAS ECON 324-0-20 Western Economic History", "class_attributes": "", "section": "21239", "instructors": [{"instructor_phone": "847/467-2739", "instructor_name": "Joel   Mokyr", "instructor_addr": "Harris Hall Room 315"}], "topic": "", "course": "324-0", "descriptions": [{"name": "Overview of class", "value": "This course will deal with the economic history of Europe in the Twentieth Century, such as growth, economic crises, unification, and the economics of war. The readings will consist of a number of books and essays."}, {"name": "Registration Requirements", "value": "310-1 and 311 are required"}, {"name": "Teaching Method", "value": "There will be two lectures a week. The lecture material and readings should be viewed as largely complementary, since the lectures will explain and often dispute the readings, hence both lecture materials and readings will be necessary to pass the course with a good grade because they are complements, not substitutes.<br/>Note: all powerpoint notes, graphs and tables shown in class will be made available on the Blackboard site for this course following the lectures."}, {"name": "Evaluation Method", "value": "There will one mandatory midterm exam, and an inclusive final examination. The midterm will cover all reading materials and lecture material of weeks 1-4. Students who score in the top 33% in the midterm will have the option of writing a paper in lieu of the exam. The topic and methodology have to be approved by the T.A. for the course, and the paper has to be submitted by the day of the final."}, {"name": "Class Materials (Required)", "value": "<br/>1. The Origins of the Twenty-First Century by Gabriel Tortella, 2009 (ISBN: 978-0415459822)<br/>2. An Economic History of 20th-Century Europe by Ivan Berend, 2006 (ISBN: 978-0521672689)<br/>3. The Cambridge Economic History of Europe, Vol. 2: 1870 to Present, Bradberry and O'Rourke, editors, 2010 (ISBN: 978-0521708395)"}], "lmod": "1/9/16 6:46 PM (CT)", "subject": "ECON"}]