[{"school": "WCAS", "overview_of_class": "This purpose of this course is to present a number of topics that highlight the influence of electronic structure in coordination compounds on determining molecular and solid-state structure, bonding, reactivity, and magnetic behavior. Of particular focus are topics not commonly covered in upper-division undergraduate inorganic courses, especially those relevant to areas of active chemical research. Much of the content and examples will be taken directly from the primary chemistry literature. The first approximately 60% of the course will be comprised of lectures, with the remainder involving short critical literature review student presentations.", "name": "Advanced Inorganic Chemistry", "section": "20", "location": "Technological Institute M177", "topic": "Chemical Structure and Bonding", "course": "435-0", "meeting_time": ["MoWeFr 12:00PM - 12:50PM"], "path": "/class-descriptions/4610/WCAS/CHEM/435-0/24261", "instructor": ["Thomas David Harris"], "class_attributes": "", "id": "24261", "subject": "CHEM"}, {"school": "WCAS", "overview_of_class": "The course will cover fundamental aspects of light-to-electrical energy conversion, light-to-chemical energy conversion, molecular hydrogen as a potentially renewable fuel source, carbon dioxide capture and transformation, and related concepts, chiefly from a chemistry and materials perspective. Emphasis will be placed on promising emerging science and technology, including that associated with organic photovoltaics, solid-state dye cells, and photo-catalytic and electro-catalytic materials for water splitting. Depending on interest, other topics such as thermoelectrics, thermal-solar water splitting, biofuels, or redox flow batteries and other electrical energy storage technologies may be discussed. The course will be taught at the beginning-graduate-student/upper-level-undergraduate-student level.", "name": "Advanced Inorganic Chemistry", "section": "30", "location": "Technological Institute LG76", "topic": "Chemistry of Alternate Energy", "course": "435-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4610/WCAS/CHEM/435-0/24262", "instructor": ["Joseph T Hupp"], "class_attributes": "", "id": "24262", "subject": "CHEM"}]