[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Frances Searle Building 3220"}], "school": "SoC", "overview_of_class": "This course will provide an overview of autism, considering in depth the clinical presentation of autism and its potential causes. We will cover how autism is diagnosed, review assessments commonly employed to characterize autistic features in research, discuss theories of the causes of autism, and consider evidence from studies of behavior, cognition, neuroimaging, and genetics in evaluating these theories. We will also discuss controversial issues such as changing prevalence, and myths about the causes of autism.", "qtr": "Spring 2017", "name": "Autism Spectrum Disorders", "title": "SoC CSD 382-0-20 Autism Spectrum Disorders", "lmod": "2/26/17 6:38 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Molly C Losh", "instructor_addr": ""}], "topic": "", "course": "382-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "This course will provide an overview of autism, considering in depth the clinical presentation of autism and its potential causes. We will cover how autism is diagnosed, review assessments commonly employed to characterize autistic features in research, discuss theories of the causes of autism, and consider evidence from studies of behavior, cognition, neuroimaging, and genetics in evaluating these theories. We will also discuss controversial issues such as changing prevalence, and myths about the causes of autism."}, {"name": "Teaching Method", "value": "This is a lecture-based class, though time will also be devoted regularly to class discussion. For the latter, we will have several in-class assignments where students work in small groups to generate responses to discuss as a full class. This could include activities such as dissecting an assigned reading together and summarizing key points, debating different perspectives on an issue presented in readings or lecture, etc. *Participation in these activities will constitute a major portion of your participation grade."}, {"name": "Evaluation Method", "value": "Attendance: Attend class regularly and participate. Being an active participant will bump up your grade!<br/><br/>Readings: Complete readings before class. Some additional readings will be assigned throughout the course. These will always be posted and announced at least one week ahead of time.<br/><br/>Exams: Two exams will be administered. Exams will consist of short answer and multiple choice and/or true-false questions. The final exam will be cumulative. For that reason, an in-class review session will be held. <br/><br/>Short paper: During the course of the quarter you will write a short paper (5 pages) reviewing the literature on a topic of your choice, as long as it is related to material we have covered in class. For this paper you will be require you to do research beyond the assigned readings. Your write up should be in APA format (following all formatting guidelines) and include references from at least three journal articles beyond in-class readings. Each chapter of your textbook contains an extensive reference list that can be used as a guide here. You should also use PubMed or related databases to identify relevant research articles to include in your paper. Consult with your TAs and Dr. Losh early in the quarter if you are unfamiliar with PubMed or other mechanisms for searching scientific literature. APA formatting guidelines can be referenced in the current APA manual (available in the library) and through on-line tutorials (http://www.apastyle.org/learn/tutorials/basics-tutorial.aspx). Paper topics must be approved and will be due in advance. You will also have an opportunity to turn in a draft of your paper for feedback prior to the due date (see syllabus for dates). There will be no extensions on the paper deadline. <br/><br/>Participation: Several in-class problem sets and discussion activities will be assigned in which you will be asked to work in small groups, as well as with the entire class (see examples under \"course structure\"). You will be asked to evaluate your own and group members' participation in these activities, and will most often have a short written component that will be turned in. Participation in these activities will constitute a major portion of your participation grade."}, {"name": "Class Materials (Required)", "value": "The primary text for this course is listed below, and additional readings will be linked to the class website. The course text is available for purchase from the bookstore or online (e.g., Amazon.com), or you may read online or download chapters from the library website for free. See instructions on Blackboard for this latter option. Note that the reading list is subject to some modification, based on student interest and the direction of discussions, so chapters may be swapped out later in the course. You will always be given at least one week's notice of any changes to reading assignments.<br/><br/>Textbook: Amaral, Dawson, & Geschwind (2011). Autism Spectrum Disorders. New York: Oxford University Press<br/>ISBN-10: 0195371828 | ISBN-13: 978-0195371826<br/><br/>Additional readings: Additional readings will be posted on Blackboard. Based on the direction of discussions and interests of students, additional readings will be added or modified. Any changes will be posted and announced at least a week ahead of time."}], "path": "/class-descriptions/4660/SoC/CSD/382-0/32919", "instructor": ["Molly C Losh"], "class_attributes": "", "id": "32919", "subject": "CSD"}]