[{"school": "MEAS", "overview_of_class": "Fracture mechanics provides a quantitative understanding of the potentially damaging impact of crack-like defects on the performance of engineering structures. Key decisions in life prediction, evaluation of repair-rehabilitation schemes and the development of new material systems rely on a modern view of fracture mechanics. This course introduces the subject from an engineering perspective with an emphasis on the underlying mechanics of linear and nonlinear crack front fields, the application of numerical analysis methods and the evaluation-interpretation of experimentally measured fracture properties of materials. It also covers the recent applications of fracture mechanics to thin films and microelectronics.", "name": "Selected Topics in Mechanical Engg", "section": "21", "topic": "Advanced Fracture Mechanics", "course": "495-0", "meeting_time": ["MoWe 3:00PM - 4:20PM"], "path": "/class-descriptions/4650/MEAS/MECH_ENG/495-0/20862", "instructor": ["Yonggang   Huang"], "id": "20862", "subject": "MECH_ENG"}, {"school": "MEAS", "overview_of_class": "As time permits, in this course the students will learn about historical energy usage; energy conservation vs. energy management; elements of an energy audit; data normalization of energy consumption using product-mix data or degree days etc.; utility rate structures &amp; deregulation; energy economics; energy conservation opportunities in thermal-fluid Systems; combustion systems; steam &amp; condensate Systems; energy recovery systems; industrial insulation; and electrical energy conservation.", "name": "Selected Topics in Mechanical Engg", "section": "22", "topic": "Industrial Energy Management &amp; Utilization", "course": "495-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4650/MEAS/MECH_ENG/495-0/20863", "instructor": ["Manohar Ramchandra Kulkarni"], "id": "20863", "subject": "MECH_ENG"}, {"school": "MEAS", "overview_of_class": "&quot;Haptics&quot; refers to the perceptual system associated with touch. In this course, students will examine what happens when a finger touches and moves relative to a surface, both in terms of the mechanical consequences of that touch and the neural and cognitive processes that result. In addition, students will be introduced to a variety of technologies for haptic interface.", "name": "Selected Topics in Mechanical Engg", "section": "23", "topic": "Haptics", "course": "495-0", "meeting_time": ["MoWe 9:30AM - 10:50AM"], "path": "/class-descriptions/4650/MEAS/MECH_ENG/495-0/20864", "instructor": ["James Edward   Colgate"], "id": "20864", "subject": "MECH_ENG"}]