[{"class_mtg_info": [{"meet_t": "Th 2:00PM - 4:50PM", "meet_l": "University Library 4670"}], "school": "WCAS", "overview_of_class": "In this seminar, we will read in the history of comparative colonialisms from 1492 to the middle of the 20th century. We will privilege the history of Spanish and British trade and territorial expansion in Africa, the Americas, and India.<br/> <br/>The required texts will focus on communication, conversion, cultural conflicts, knowledge systems, the development of ethnic and racialized systems of rule, and nationalist struggles (see below). In addition, we will read essays that attend to trade-networks and economic transformations. <br/> <br/>For students whose research interests pertain to colonialism, empire, globalization, and anti-colonial nationalisms, the seminar will furnish them with a foundation to begin to compare similarities and differences in the history of 450 years of European colonial expansion. Additionally, I will provide (and we will build together) an extensive bibliography that will be useful to those who wish to construct an exam field related colonialism, empire, and globalization.", "qtr": "Spring 2017", "name": "The Letter in Latin America: Writng and Power", "title": "WCAS LATIN_AM 401-0-20 The Letter in Latin America: Writng and Power", "lmod": "2/24/17 6:50 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "847 4612620", "instructor_name": "J Michelle   Molina", "instructor_addr": "Crowe Hall, 4-142"}], "topic": "The Colonial Project: European Expansion and the D", "course": "401-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "In this seminar, we will read in the history of comparative colonialisms from 1492 to the middle of the 20th century. We will privilege the history of Spanish and British trade and territorial expansion in Africa, the Americas, and India.<br/> <br/>The required texts will focus on communication, conversion, cultural conflicts, knowledge systems, the development of ethnic and racialized systems of rule, and nationalist struggles (see below). In addition, we will read essays that attend to trade-networks and economic transformations. <br/> <br/>For students whose research interests pertain to colonialism, empire, globalization, and anti-colonial nationalisms, the seminar will furnish them with a foundation to begin to compare similarities and differences in the history of 450 years of European colonial expansion. Additionally, I will provide (and we will build together) an extensive bibliography that will be useful to those who wish to construct an exam field related colonialism, empire, and globalization."}, {"name": "Class Materials (Required)", "value": "Readings will likely include:<br/>· Shahid Amin, Event, Metaphor, Memory: Chauri Chaura, 1922-1992<br/>· Beth Baron, The Orphan Scandal: Christian Missionaries and the Rise of the Muslim Brotherhood<br/>· Jorge Cañizares-Esguerra, Puritan Conquistadors: Iberianizing the Atlantic, 1550-1700<br/>· Dipesh Chakrabarty, Provincializing Europe: Postcolonial Thought and Historical Difference<br/>· Partha Chatterjee, Nation and Its Fragments: Colonial and Postcolonial Histories<br/>· Inga Clendinnen, Ambivalent Conquests: Maya and Spaniard in Yucatan, 1570-1570<br/>· Bernard Cohn, Colonialism and its Forms of Knowledge: The British in India<br/>· John and Jean Comaroff, Revelation and Revolution: Christianity, Colonialism, and Consciousness in South Africa<br/>· Frederick Cooper, Africa in the World: Capitalism, Empire and Nation-State<br/>· William Hanks, Converting Words: Maya in the Age of the Cross<br/>· María Elena Martínez, Genealogical Fictions: Limpieza de Sangre, Religion, and Gender in Colonial Mexico<br/>· J. Michelle Molina, To Overcome Oneself: The Jesuit Ethic and the Spirit of Global Expansion<br/>· Tim Mitchell, Colonising Egypt<br/>· Joel Robbins, Becoming Sinners: Christianity and Moral Torment in Papua New Guinea<br/>· Ann Stoler, Race and the Education of Desire: Foucault's History of Sexuality and the Colonial Order of Things<br/>· Tvetzan Todorov, Conquest of the Americas: The Question of the Other<br/>· Essays from Selected Subaltern Studies"}], "path": "/class-descriptions/4660/WCAS/LATIN_AM/401-0/36783", "instructor": ["J Michelle   Molina"], "class_attributes": "", "id": "36783", "subject": "LATIN_AM"}]