[{"school": "WCAS", "overview_of_class": "WOMEN AT THE BORDER: THE MARGINALIZATION OF LATINAS IN THE U.S.<br/><br/>Latina immigrants to the U.S. often leave intolerable circumstances and brave life-threatening border crossings in pursuit of the American dream. Yet, those who succeed in crossing the geographic border almost inevitably find that the marginalized existence they hoped to leave behind takes on an equally powerful form in their new world as they confront economic, political, racial, and cultural barriers ?north' of the border. <br/><br/>Immigration has become one of the ?hot' buttons of contemporary social and political dialogue. Through the prism of the Latina experience in the United States, this class will explore causes and consequences of global migration in the 21st century, analyze the marginalization of third-world immigrants in first-world society, and seek to develop an understanding of the evolving ?face' of America. Students will further examine how their own ancestral experiences have helped shape their perceptions of this new world order. <br/><br/>Issues to be explored through literature and film include:<br/>Immigration: global attitudes and experiences in a post 9/11 world <br/>Dangers: physical and psychological dangers risked as Latinas cross both geographic and social borders <br/>Racism: the role race plays in creating barriers for Latinas <br/>Stereotypes: images and misconceptions of Latinas in American film, television, media, etc. <br/>Traditions: how attitudes and practices within the Hispanic community itself impact Latinas <br/>Challenges & Triumphs: women who have successfully ?crossed' the border and what that means <br/>Personal Journey: students will research personal histories (\"How did I get here?\") in order to understand how cultural, social, and ethnic backgrounds impact the formation of attitudes and perspectives.", "name": "First-Year Seminar", "section": "2", "location": "Kresge Centennial Hall 2-435", "topic": "Women at the Border: The Marginalization of Latina", "course": "105-6", "meeting_time": ["MoWeFr 2:00PM - 2:50PM"], "path": "/class-descriptions/4640/WCAS/SPANISH/105-6/14553", "instructor": ["Patricia Ellen Nichols"], "class_attributes": "", "id": "14553", "subject": "SPANISH"}]