[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "Parkes Hall 223"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "27517", "title": "WCAS GNDR_ST 361-0-21 Gender, Sexuality, and Literature", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "27517", "instructors": [{"instructor_phone": "", "instructor_name": "Hosanna Grace Krienke", "instructor_addr": ""}], "topic": "19th Century American Women Writers", "course": "361-0", "descriptions": [{"name": "Overview of class", "value": "Writing in 1855, novelist Nathaniel Hawthorne complained that his own literary work was being overshadowed by &quot;a damned mob of scribbling women.&quot; Some female authors in the nineteenth century indeed produced unprecedented runaway bestsellers; most notably, Harriet Beecher Stowe's Uncle Tom's Cabin became the best-selling novel of the century. However, the act of writing remained a vexed vocation for women in this period. On the one hand, women writers were able to capitalize on the stereotype of feminine virtue to voice strident critiques of the status quo. On the other hand, women's writing was often treated as a niche market assumed to be read exclusively by other women. In this class, we will examine how women writers depict the act of writing and, by extension, the role of women in intervening in public and political discourse. Crucially, we will also examine differences among this cohort of writers, including the racial and class differences that produced divergent visions for the role of women in the public sphere."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Class participationPapers"}, {"name": "Class Materials (Required)", "value": "Harriet Beecher Stowe's Uncle Tom's Cabin (1852), Harriet Jacobs's Incidents in the Life of a Slave Girl (1861), Louisa May Alcott's Hospital Sketches (1863) and Little Women (1868-9), and Nineteenth-Century Women Writers: An Anthology."}], "lmod": "12/25/16 7:00 PM (CT)", "subject": "GNDR_ST"}]