[{"class_mtg_info": [{"meet_t": "MoTuSu 08:30AM - 11:20AM (AST)", "meet_l": "Northwestern Qatar Room 1-212"}], "school": "DOHA", "enrl_requirement": "Enrollment Requirements: NUQ: Journalism majors only, Juniors and above", "qtr": "Spring 2017", "name": "30728", "title": "DOHA JOUR 390-0-70 Special Topics", "class_attributes": "", "section": "30728", "instructors": [{"instructor_phone": "", "instructor_name": "Abraham Naseem Abusharif", "instructor_addr": ""}], "topic": "Exploring the Future of Digital Journalism", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "<p>The relationship between technology and journalism has always attracted a great deal of attention from academics and media professionals, particularly journalists. This is especially true now, as &quot;digital media&quot; evolves and enables a procession of emerging storytelling technologies, such as open-source, online multi-media platforms and well-known apps (Snapchat and Instagram, for example). These platforms present extraordinary opportunities for news organizations and freelancers to distribute content, and they also present challenges, which this class explores. As such, the class discusses and examines what these transformations mean for journalism?the profession and its roles in our world; it parses out the themes of &quot;global&quot; journalism and narratives; and it delves into both the changing and unchanged aspects of storytelling. This necessarily includes content production, fact gathering, narrative making, activism, audience interactivity, and distribution of journalism content. The class will also introduce design concepts and design production in conversation with current journalism forms?whether online or off. This class is meant to be interactive and instructive. We will have guest lecturers joining the class to offer their experience and insights.</p>"}, {"name": "Registration Requirements", "value": "<ul><br/><li>Prerequisites: None</li><br/><li>Open to juniors and above JOUR majors only; for students going on residency.</li> <br/></ul>"}], "lmod": "2/12/17 6:46 PM (CT)", "subject": "JOUR"}]