[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Locy Hall 301"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "32073", "title": "WCAS ASIAN_LC 390-0-22 Advanced Topics in Asian Languages and Cultures", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "32073", "instructors": [{"instructor_phone": "847/491-5288", "instructor_name": "Paola   Zamperini", "instructor_addr": "1800 Sherman, 5th Floor, Suite 5400, Office 5430"}], "topic": "East Asian Masculinities", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "The relatively recent growth of research on men and masculinities is impressive. The majority of the academic works published in the English-speaking world, however, comes from within the Western world and from Western perspectives. At the same time, East Asian men are becoming increasingly visible in mediated forms around the world, in films, print, and online media. This course tries to bridge the lack of academic explorations of East Asian masculinities with the wealth of material available. Together we will explore the construction of masculinities in East Asian cultures, past and present. We will study men and masculinities in pre-modern and contemporary China, Japan, and Korea, respectively, and also in the dynamic interactions between East Asian cultures. We will read and discuss sources that depict fragile scholars, Shaolin monks, ninjas, boys love, and K-pop stars. Our aim will be to enhance our understandings of East Asian identities and cultures as well as Western conceptions of gender and sexuality."}, {"name": "Learning Objectives", "value": "-Acquisition of knowledge about the study of masculinity in the field of gender studies in general and that of East Asian studies in particular. This will mean exposure to primary sources (in English, and for those students able to, in the original) produced by East Asian authors, as well as to related secondary.<br/><br/>-Development of methodological skills in studying, reading, and analyzing the primary and secondary sources related to masculinities.<br/><br/>-Acquisition of an appreciation of the variance of masculinity/male gender expressions in East Asia, at the national, regional, and global levels.<br/><br/>-Understanding the effects of cultural, political, social, and economic forces on local, national, and transnational systems of male sex and masculine gender.<br/><br/>?-Growth as independent researchers and writers in the field of Chinese studies, gender studies, sexuality, and Asian humanities.<br/><br/>-Growth as independent academic thinkers and writers."}, {"name": "Teaching Method", "value": "Lecture and discussion"}, {"name": "Evaluation Method", "value": "Participation: 20% (This includes attendance, thorough preparation and reading of all assigned materials, and active participation in classroom discussion)<br/><br/>Assignments and responses: 25% (these include responses to readings and films, staged assignments in preparation of final projects, and so on)<br/><br/>Presentations: 20%<br/><br/>Final Project: 35% (the final project can be an analytical essay or a creative project)"}, {"name": "Class Materials (Required)", "value": "R. W. Connell, Masculinities, University of California Press, August 2005, ISBN: 9780520246980. PLEASE USE ONLY THIS EDITION<br/><br/>Additional readings and visual material, including movies, will be available on Canvas."}], "lmod": "4/3/16 7:44 PM (CT)", "subject": "ASIAN_LC"}]