[{"school": "WCAS", "overview_of_class": "In recent months?and with especially astonishing force?the complex politics of race, gender, and sexuality in the U.S. have come to the forefront of national attention. Much of the country entered 2017 struggling to understand how a flagrantly race-baiting, xenophobic, and misogynistic billionaire came to assume the executive office. However, many of the issues that marked this presidential campaign?including immigration, crime, sexual assault, and Islamophobia?have been intensifying in popular discourse for the last several years. Since 2013, Black Lives Matter has demanded recognition and redress for the ongoing state violence faced by African Americans. In the same years, high profile Supreme Court rulings established same-sex marriage as the law of the land while eroding women's reproductive rights and rolling back legislative gains of the Civil Rights Movement. Additionally, heightened backlash against transgender issues has thrown new light on the profoundly uneven successes of mainstream LGBT activism.<br/><br/>This course will take up two questions that have grown increasingly urgent in many of our minds: How did we get here? And what do we do now? We will do this by way of historicizing the politics of race, sexuality, and social movements in the U.S. since the post-Civil Rights period. Major topics will include: Black Power, women's, and gay liberation movements of the 1960s - 70s; women of color feminism of the 1970s - 80s; the emergence of the prison industrial complex; AIDS activism; and the cultural politics of neoliberalism. By highlighting traditions of resistance against American racism, sexism, and heteropatriarchy, we will work to better understand and formulate responses to our contemporary political moment.", "name": "Gender, Sexuality and History", "section": "20", "location": "University Hall 122", "topic": "Race, Sexuality, and the Politics of Protest, 1968", "course": "321-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4660/WCAS/GNDR_ST/321-0/33908", "instructor": ["Abram J Lewis"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "33908", "subject": "GNDR_ST"}]