[{"class_mtg_info": [{"meet_t": "MoWe 3:00PM - 4:20PM", "meet_l": "Wirtz Center WALLIS"}], "school": "SoC", "enrl_requirement": "Enrollment Requirements: Reserved for Theatre, Dance, Performance Studies, Music Theatre and Drama Students<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Winter 2016", "name": "24160", "title": "SoC THEATRE 330-0-24 Topics in Theatre", "class_attributes": "No Freshmen<br/><br/>", "section": "24160", "instructors": [{"instructor_phone": "847/491-3147", "instructor_name": "William Lewis   Siegenfeld", "instructor_addr": "10 Arts Circle Drive"}], "topic": "Standing Straight Down", "course": "330-0", "descriptions": [{"name": "Overview of class", "value": "The point of view of this class, Standing Down Straight for Actors, honors and expands on the approach to acting Konstantin Stanislavski counseled in his seminal texts - an approach, of course, that has directly influenced and fueled the acting techniques developed by pioneer teachers like Stella Adler and Sanford Meisner, by their followers, and then by their followers' followers down through the generations, including the acting instructors currently teaching here at Northwestern. In particular, Standing Down Straight for Actors takes inspiration from what Konstantin Stanislavski said in An Actor Prepares: &quot;[T]he organic bases of the laws of nature on which our art is founded will protect you in the future from going down the wrong path.&quot; (AAP 16).&quot; For examples of such nature-driven art, Stanislavski suggests, in the chapter fittingly called &quot;Relaxation,&quot; that we observe what &quot;small children and animals do.&quot; His reasoning: all of their actions come across as - to use the two adjectives that course through his writings - not only &quot;natural&quot; but as &quot;truthful.&quot; Natural, because when small children or animals are hungry or in danger, or exhausted, etc., they use their bodies (specifically, as focused on in this course, the body's primary expressive, goal-getting tools, the hands, eyes, and voice) to take the most direct route to satisfying their appetite. Truthful, because animals and human infants especially don't conceal or lie when in the grips of an appetite. Their behavior unashamedly and directly drives them toward satisfying it."}, {"name": "Class Materials (Required)", "value": "Constantin Stanislavski, AN ACTOR PREPARES; Anne Bogart, A DIRECTOR PREPARES; Pema Chodron, TAKING THE LEAP"}], "lmod": "1/9/16 6:40 PM (CT)", "subject": "THEATRE"}]