[{"class_mtg_info": [{"meet_t": "MoTuWeFr 2:00PM - 2:50PM", "meet_l": "University Library 3670"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "12179", "title": "WCAS ITALIAN 102-1-21 Intermediate Italian", "class_attributes": "Attendance at 1st class mandatory<br/><br/>Prerequisites apply, see description<br/><br/>", "section": "12179", "instructors": [{"instructor_phone": "847/467-1448", "instructor_name": "Daniela   Pozzi Pavan", "instructor_addr": "1860 S. Campus Drive, Crowe Hall #2-145"}], "topic": "", "course": "102-1", "descriptions": [{"name": "Overview of class", "value": "Intermediate Italian continues and completes the two-year sequence in Italian language. At the end of the full 102 sequence (102-1,2,3), students will be able to create with the language, talk about familiar topics, comprehend the main ideas and some supporting details of articles, stories, and other texts dealing with topics of a concrete nature, and write grammatically correct paragraphs. Students will significantly increase their knowledge of Italy's history and culture. Having completed the entire sequence of Italian 102, students will be eligible to study in Italy and will be ready to embark on the minor or major in Italian. The second-year Italian course sequence completes the two-year WCAS language requirement. The classroom is very lively, with lots of conversation, partnering, and small group exercises. Students will be nurtured toward independence, posing and solving language problems on their own and in collaboration with classmates. While speaking and listening continue as the center of class activity, they will focus more intensively on reading and writing Italian."}, {"name": "Class Materials (Required)", "value": "Domani 3, Alma Edizioni (textbook+DVD), ISBN 978-88-6182-240-5,<br/>Gramm.it for English-Speakers, Bonacci, ISBN 978887573430"}, {"name": "Class Notes", "value": "Prerequisite: 101-3 or equivalent.<br/>Students with some background in Italian can take the online placement test"}], "lmod": "10/30/16 7:07 PM (CT)", "subject": "ITALIAN"}]