[{"class_mtg_info": [{"meet_t": "Th 2:00PM - 4:50PM", "meet_l": "Kresge 4354 Art Hist. Sem. Rm."}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Winter 2017", "name": "21637", "title": "WCAS ART_HIST 450-0-1 Studies in 19th Century Art", "class_attributes": "", "section": "21637", "instructors": [{"instructor_phone": "", "instructor_name": "Susan Hollis   Clayson", "instructor_addr": ""}], "topic": "Art and Technology", "course": "450-0", "descriptions": [{"name": "Overview of class", "value": "The seminar will investigate a wide array of visual art practices in the transatlantic world - from the 1830s (birth of Morse Code, telegraphy and photography) through the 1940s (WW2 and its aftermath) - that have imaged or in other ways referenced technology. A central question will be this: does a demonstrably technological or machinic iconography express an opinion on technology? Among the sources of artistic inspiration under scrutiny will be telegraphy, the railway, electricity-powered devices including lighting, construction equipment, the airplane, machines of war, high-tech architecture, and the automobile. The seminar will also investigate intermedial art forms whose production is technologized, e.g. intaglio printmaking. <br/> Image: Francis Picabia, This Thing is Made to Perpetuate my Memory, 1915"}, {"name": "Evaluation Method", "value": "Regular contribution to class discussion, the preparation of a discussion script, and the pursuit of an individual research project, in both written and oral forms, commensurate with the student's interests and abilities."}, {"name": "Class Materials (Required)", "value": "Modernity and Technology, 2003, Thomas J. Misa, Philip Brey &amp; Andrew Feenberg, eds (0262633108)<br/>Mechanization Takes Command, 1948/2013, Siegfried Giedion (0393004899)<br/>Victorians Decoded:Art and Telegraphy, 2016, ebook, Caroline Arscott et al. <br/>Other readings will be posted on CANVAS."}], "lmod": "12/25/16 6:55 PM (CT)", "subject": "ART_HIST"}]