[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Kresge 3354 German Seminar Rm."}], "school": "WCAS", "overview_of_class": "Starting out from the question: \"What is German?\", we shall enquire into changing understandings of national identity in postwar Germany. We shall follow influential socio-historical changes from the influx of so-called guest workers in the 1950s up to the recent series of reforms in citizenship laws acknowledging the changing face of those claiming Germany as their Heimat (homeland). In this context we will examine fiction, autobiography, poetry, and political and theoretical writings by and about \"minority voices\" in Germany in the twentieth and twenty-first centuries. Questions we will explore include: What is the relationship between autobiographical writing and identity? What is a \"minority\" and how might we conceive of \"minority voices\" in terms of ethnicity, religious belief, gender, class, and community? What can our readings teach us about the role of \"minority literature\" in Germany?", "qtr": "Fall 2017", "name": "Minority Voices in Germany", "title": "WCAS GERMAN 335-0-20 Minority Voices in Germany", "lmod": "5/14/17 6:50 PM (CT)", "section": "20", "topic": "", "course": "335-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Starting out from the question: \"What is German?\", we shall enquire into changing understandings of national identity in postwar Germany. We shall follow influential socio-historical changes from the influx of so-called guest workers in the 1950s up to the recent series of reforms in citizenship laws acknowledging the changing face of those claiming Germany as their Heimat (homeland). In this context we will examine fiction, autobiography, poetry, and political and theoretical writings by and about \"minority voices\" in Germany in the twentieth and twenty-first centuries. Questions we will explore include: What is the relationship between autobiographical writing and identity? What is a \"minority\" and how might we conceive of \"minority voices\" in terms of ethnicity, religious belief, gender, class, and community? What can our readings teach us about the role of \"minority literature\" in Germany?"}, {"name": "Registration Requirements", "value": "High Intermediate German language skills in speaking, advanced skills in reading and writing."}, {"name": "Learning Objectives", "value": "? Encounter and interpret literature by a range of authors (often with a migration background) writing in German.<br/>? Analyze and critique representations of the \"foreigner\" (Ausländer/In) in mid-to-late twentieth century and twenty-first century German-language literature and popular representations.<br/>? Evaluate the particular socio-historical conditions and context that gave rise to this body of literature.<br/>? Analyze and interpret a selection of key literary texts and make connections between these texts and the broader German literary tradition the authors draw on and reconfigure. <br/>? Understand the broader reception history of so-called minority literature in Germany.<br/>? Draw connections between contemporary political and literary debates concerning German national identity in the context of globalization.<br/>? Consolidate and extend German oral, writing, and reading skills."}, {"name": "Teaching Method", "value": "Class participationDiscussionGroup workLecture: Occasional in-class lectures<br/>Online workPresentationsReadingsSeminarWriting assignments"}, {"name": "Evaluation Method", "value": "AttendanceClass participation: 20%<br/>Homework: 10% Comments and discussion questions assigned on Canvas<br/>Papers: 10% + 15% = 25%<br/>Presentations: 20%<br/>Research project: Final research paper: prospectus + final paper= 5%+20%=25%<br/>"}, {"name": "Class Materials (Required)", "value": "? Anton Kaes, Deniz Göktürk, David Gramling (eds.), Germany In Transit: Nation and Migration, 1955-2005 (2007) (ISBN 978-0520248946)<br/>? Biller, Maxim, Im Kopf von Bruno Schulz, 2015 (ISBN: 978-3596030620)<br/><br/>Course Reader: including selections drawn from T.W. Adorno, May Ayim, Franco Biondi, Paul Celan, Wladimir Kaminer, Aysel Özakin, Zafer Senocak, Yoko Tawada, Emine Sevgi Özdamar, Feridun Zaimoglu and others."}], "instructor": ["Anna Maree Parkinson"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "11884", "subject": "GERMAN"}]