[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Locy Hall 106"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Students must have taken Religion 250 to take this course.<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Winter 2016", "name": "26883", "title": "WCAS RELIGION 350-0-1 The Qur'an", "class_attributes": "Ethics &amp; Values Distro Area<br/><br/>", "section": "26883", "instructors": [{"instructor_phone": "", "instructor_name": "Brannon Dobbs Ingram", "instructor_addr": ""}], "topic": "", "course": "350-0", "descriptions": [{"name": "Overview of class", "value": "One of the most influential books in world history, the Qur&amp;rsquo;an is believed by Muslims to be the literal speech of God in Arabic. It is recited daily by Muslims throughout the world, transformed into beautiful calligraphy, and venerated as a sacred object. The course explores the text&amp;rsquo;s historical milieu and the life of the Prophet Muhammad, its form and structure, its ethical worldview, its role in the ritual lives of Muslims, how it has been variously interpreted in multiple contexts, as well as critical issues pertaining to the Qur&amp;rsquo;an in the contemporary world. The course proceeds under the premise that understanding the Qur&amp;rsquo;an is an essential aspect of a broad liberal education in the humanities."}, {"name": "Registration Requirements", "value": "Reli 250 (Introduction to Islam) or permission of instructor"}, {"name": "Class Materials (Required)", "value": "Carl Ernst, How to Read the Qur&amp;rsquo;an (Chapel Hill: University of North Carolina, 2011) - 978-0807835166<br/>The Qur'an(Oxford Worlds Classics), trans. by Muhammad Abdel Haleem (Oxford: Oxford University Press, 2004; reprinted 2008) - 978-0199535958<br/>Amina Wadud, Qur&amp;rsquo;an and Woman: Rereading the Sacred Text from a Woman's Perspective (Oxford, New York: Oxford University Press, 1999) - 978-0195128369"}], "lmod": "1/9/16 6:53 PM (CT)", "subject": "RELIGION"}]