[{"class_mtg_info": [{"meet_t": "MoWe 9:30AM - 10:50AM", "meet_l": "Harris Hall L28"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "17648", "title": "WCAS HISTORY 260-1-1 History of Latin America in the Colonial Period 1492-1821", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "17648", "instructors": [{"instructor_phone": "", "instructor_name": "Keith Aaron Van Oosterhout", "instructor_addr": ""}], "topic": "", "course": "260-1", "descriptions": [{"name": "Overview of class", "value": "Aspects of the development of Latin America's socioeconomic, political, cultural, and religious institutions and practices from the pre-Columbian and Iberian backgrounds through the colonial period, c. 1492-1821."}, {"name": "Registration Requirements", "value": "AREA OF CONCENTRATION: Americas"}, {"name": "Teaching Method", "value": "Lecture &amp; mandatory discussion sections"}, {"name": "Evaluation Method", "value": "Two response-type papers based on course content; one research essay of 2,000 words; one exam"}, {"name": "Class Materials (Required)", "value": "TENTATIVE READING LIST:<br/>Andrews, George Reid. Afro-Latin America: Black Lives, 1600-2000. Cambridge: Harvard<br/>University Press, 2016. 9780195152333.<br/>Restall, Matthew. Seven Myths of the Spanish Conquest. New York: Oxford University Press,<br/>2003. 9780195176117.<br/>Schwartz, Stuart, ed. Victors and Vanquished: Spanish and Nahua Views of the Conquest of<br/>Mexico. Boston: Bedford/St. Martin's, 2000. 9780312393557.<br/>Socolow, Susan Migden. The Women of Colonial Latin America, 2nd ed. 9780521476423."}, {"name": "Class Notes", "value": "INSTRUCTOR PROFILE: K. Aaron Van Oosterhout, Ph.D., is a visiting assistant professor at Northwestern University. His research interests include popular religion, the social and political construction of race (particularly for people of African descent in Mexico), and anti-state rebellion. His most recent publication, &quot;Confraternities and Popular Conservatism on the Frontier: Mexico's Sierra del Nayarit in the Nineteenth Century,&quot; appeared in The Americas, one of the leading peer-reviewed journals of Latin American studies, in 2014. Outside academia, Aaron serves as the vice-chair of the International Relations Commission for the City of Holland, Michigan, and conducts freelance research work. He is currently working on a project on over-incarceration for the American Civil Liberties Union of Michigan."}], "lmod": "10/30/16 7:05 PM (CT)", "subject": "HISTORY"}]