[{"class_mtg_info": [{"meet_t": "Th 5:00PM - 7:50PM", "meet_l": "ANTHRO Sem Rm 104 - 1810 Hinmn"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "32247", "title": "WCAS ANTHRO 354-0-20 Gender and Anthropology", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>Jrs, Srs, Grad Students Only<br/><br/>", "section": "32247", "instructors": [{"instructor_phone": "847/491-4821", "instructor_name": "Micaela   di Leonardo", "instructor_addr": "1810 Hinman Ave., Room #210, EV Campus"}], "topic": "", "course": "354-0", "descriptions": [{"name": "Overview of class", "value": "Feminist anthropology is now more than four decades old, and more than ever an essential set of intellectual tools with which to understand the world and to change it. In this course we will consider the ways in which attending to gender alters and enriches anthropological knowledge, with particular emphasis on the domains of gendered labor, sexuality, kinship, and reproduction in the contemporary neoliberal globalizing context. Course readings, lectures, films, and discussions will focus on the history of feminist scholarship on gender, on the embeddedness of gender relations in larger social relations/political economy including race/ethnicity and nationalism-on the embeddedness of anthropology itself in the histories of Western colonialism and capitalist development, and on the ways in which anthropology is troped in the public sphere with what entailments for gender/sexual/race politics? We will also discuss American and global political-economic shifts of the past few decades and their connections to shifts in the ways both scholars and the public construe gender relations. Professor Jane Collins will visit class in the week that we read her book."}, {"name": "Registration Requirements", "value": "An introductory cultural anthropology or GS course<br/><br/>No P/NP option."}, {"name": "Teaching Method", "value": "I will lecture quite a bit in the first few weeks, less so as we proceed. Every session, though, will include seminar discussion. Every student must have done all the assigned readings before each seminar meeting, and be prepared to discuss them in detail at the level of knowing on what page number a point is made-and to compare them with other readings and with lecture material. If words/terms are not familiar to you, please look them up before class. Every student must contribute to discussion at least once every meeting."}, {"name": "Evaluation Method", "value": "Requirements are doing all readings on time and seminar attendance, participation in/co-facilitation of discussions, and take-home midterm and final essay examinations. Grading will be 25% midterm, 30% class participation, and 45% final. These exams will consist of synthetic essay questions based on readings &amp; lectures, and will have strict word limits. They must be cogent, well-organized, well-written and thoroughly proofed. Students with writing problems should go to the Writing Place BEFORE the midterm is handed out so that they have a tutor ready to work with them."}, {"name": "Class Materials (Required)", "value": "Books are available at Norris and on reserve. A course reader is available at Quartet Copies, 847-328-0720. <br/><br/>1. Micaela di Leonardo, ed., Gender at the Crossroads of Knowledge: Feminist Anthropology in the Postmodern Era. California (Xroads) ISBN 0-520-07093-3<br/>2. Roger Lancaster and mdl, eds., The Gender/Sexuality Reader. Routledge (G/S) ISBN 0-415-91005-6<br/>3. Pei-Chia Lan, Global Cinderellas. Duke UP ISBN 0-8223-3742-8<br/>4. Jane Collins, Both Hands Tied: Welfare Reform and the Race to the Bottom in the Low-Wage Labor Market. Chicago. ISBN 978-0-226-11406-4<br/>5. Wayne Ellwood, No-Nonsense Guide to Globalization. Updated 2011 edition. New Internationalist ISBN 978-1-78026-237-6"}], "lmod": "2/6/17 6:40 PM (CT)", "subject": "ANTHRO"}]