[{"school": "SoC", "overview_of_class": "This course introduces advanced topics in audio production, building on the foundation of SAI 501. We will continue to expand our understanding and repertoire of audio processing techniques, using the software package Max to focus on both the generation of new sounds and the extraction of information from streams of audio in order to create more complex systems of dynamic audio control and generation. Emphasis will be placed on the practical aspects of each technique, highlighting the ways it can be deployed in creative media production.", "name": "Topics in Sound Production", "section": "20", "location": "Sound Tank Comp Lab - RTVF FSL", "topic": "Advanced Sound Production", "course": "401-0", "meeting_time": ["Mo 10:00AM - 12:50PM"], "path": "/class-descriptions/4650/SoC/SAI/401-0/27484", "instructor": ["Stephan Michael Moore"], "class_attributes": "Prerequisites apply, see description<br/><br/>", "id": "27484", "subject": "SAI"}, {"school": "SoC", "overview_of_class": "This course emphasizes the importance of sound in moving image art through assignments that put its creation and conception first. Students will look at uses of sound across experimental film, video art, and installation work to gain an understanding of the contemporary landscape. Class time will include case studies of specific artists, an introduction to 5.1 mixing, alternative mic'ing techniques and critiques of student work. By the end of this class students will have a stronger sense of the role of sound in art and experimental films and various new recording and mixing techniques to advance their creative expression.", "name": "Topics in Sound Production", "section": "21", "location": "Sound Tank Comp Lab - RTVF FSL", "topic": "Sound and Vision: Experimental", "course": "401-0", "meeting_time": ["Tu 4:00PM - 6:50PM"], "path": "/class-descriptions/4650/SoC/SAI/401-0/27485", "instructor": ["Calum Michel Walter"], "class_attributes": "", "id": "27485", "subject": "SAI"}, {"school": "SoC", "overview_of_class": "This class is an introduction to using sound to tell true stories. We will dissect several seminal radio documentaries and discuss interviewing techniques, ethics and narrative structure. Students will individually produce a 5-10-minute audio documentary as part of the course. <em>Note: There will be significant time spent gathering audio in the field as part of this course.</em>", "name": "Topics in Sound Production", "section": "22", "location": "Sound Tank Comp Lab - RTVF FSL", "topic": "Radio Documentary", "course": "401-0", "meeting_time": ["We 10:00AM - 12:50PM"], "path": "/class-descriptions/4650/SoC/SAI/401-0/27486", "instructor": ["William R. Healy"], "class_attributes": "", "id": "27486", "subject": "SAI"}, {"school": "SoC", "overview_of_class": "This course is an investigation of the relationship of sound and geography. We will explore the techniques, art, and theory of field recording, soundwalks, audio tours, and augmented reality. Through readings, discussions, and recording projects, students will gain a greater understanding of how sound can be integrated into our physical environment. Additionally, we will cover advanced recording and editing techniques using Pro Tools and new GPS-aware audio tour software called Detour.", "name": "Topics in Sound Production", "section": "23", "location": "Sound Tank Comp Lab - RTVF FSL", "topic": "Sound Walks, Audio Tours, and Augmented Reality", "course": "401-0", "meeting_time": ["We 5:00PM - 7:50PM"], "path": "/class-descriptions/4650/SoC/SAI/401-0/27514", "instructor": ["Alexander Michael Inglizian"], "class_attributes": "", "id": "27514", "subject": "SAI"}]