[{"class_mtg_info": [{"meet_t": "MoWe 9:30AM - 10:50AM", "meet_l": "Loder Hall Lower Level 023"}], "school": "WCAS", "overview_of_class": "The number of refugees, asylum-seekers and internally displaced people worldwide has, for the first time in the post-World War II era, exceeded 50 million people. 16 million of the displaced are refugees. In this course we examine the international and state response to refugee crisis. In order to understand the responsibilities and challenges of responding to refugee crises today, we will look back historically at the creation of the 1951 Refugee Convention regime. We will learn about how the regime was created in response to the plight of refugees in WWII, the failure to take into account the crises of partition in South Asia and the Middle East leading those states to opt out of the Refugee Convention regime and the implications of this history for today's crises. We will consider the challenges of international and regional cooperation. Drawing on case studies we will critically examine different international responses, the constraints of international and regional cooperation in managing a crisis, the politics of camp and urban refugees, why crises become protracted, populations are rendered stateless and the role of human rights in responding to their predicament. Finally, we consider how the new (or not new) ways in which refugee flight takes place (smuggling, migrants at sea, privatization) is a response to the conditions of displacement in camps and urban areas and increasing state securitization.", "qtr": "Spring 2016", "name": "Refugee Crises and Human Rights", "title": "WCAS POLI_SCI 380-0-20 Refugee Crises and Human Rights", "lmod": "4/3/16 8:17 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Galya Benarieh Ruffer", "instructor_addr": ""}], "topic": "", "course": "380-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "The number of refugees, asylum-seekers and internally displaced people worldwide has, for the first time in the post-World War II era, exceeded 50 million people. 16 million of the displaced are refugees. In this course we examine the international and state response to refugee crisis. In order to understand the responsibilities and challenges of responding to refugee crises today, we will look back historically at the creation of the 1951 Refugee Convention regime. We will learn about how the regime was created in response to the plight of refugees in WWII, the failure to take into account the crises of partition in South Asia and the Middle East leading those states to opt out of the Refugee Convention regime and the implications of this history for today's crises. We will consider the challenges of international and regional cooperation. Drawing on case studies we will critically examine different international responses, the constraints of international and regional cooperation in managing a crisis, the politics of camp and urban refugees, why crises become protracted, populations are rendered stateless and the role of human rights in responding to their predicament. Finally, we consider how the new (or not new) ways in which refugee flight takes place (smuggling, migrants at sea, privatization) is a response to the conditions of displacement in camps and urban areas and increasing state securitization."}, {"name": "Learning Objectives", "value": "1. To introduce you to the international framework for the protection of refugees. <br/>2. To learn about and critically assess the implications of the history of the creation of the international regime for addressing refugee crises today. <br/>3. To provide you with case studies and analytical tools to examine and appreciate the responsibilities, challenges and constraints of international cooperation.<br/>4. To learn about and critically assess the organizational structure of human rights protection as a tool for addressing forced migration<br/>5. To help you think through the ethical concerns of responding to refugee crisis.<br/>6. To help you appreciate and critically analyze multiple perspectives on the themes and topics.<br/>7. To encourage you to develop your own understanding on refugee protection, the challenges of protection and promote human rights and social justice.<br/>8. To help you communicate your ideas, both oral and written, clearly"}, {"name": "Teaching Method", "value": "Lecture &amp; Discussion"}, {"name": "Evaluation Method", "value": "20% Participation (includes contributions to class discussion and four (4) reflections)<br/>25% Midterm <br/>20% Country Report Critical Assessment Project <br/>35% Final Exam"}, {"name": "Class Materials (Required)", "value": "Articles and documents available at Quartet and on Canvas<br/>Garcia, Maria Cristina (2006) Seeking Refuge: Central American Migration to Mexico, the United States and Canada (Univ. of California Press)<br/>Michel Agier (2011) Managing the Undesirables: Refugee Camps and Humanitarian Government (Polity Press: Cambridge)<br/>Films: Casablanca, Refugee, Hotel Rwanda, Innocent Voices/Voces Inocentes (El Salvador)"}], "path": "/class-descriptions/4620/WCAS/POLI_SCI/380-0/34275", "instructor": ["Galya Benarieh Ruffer"], "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "id": "34275", "subject": "POLI_SCI"}]