[{"school": "WCAS", "overview_of_class": "This seminar explores global health and development policy ethnographically, from the politics of policy-making to the impacts of policy on global health practice, and on local realities. Going beyond the intentions underlying policy, this course highlights the histories and material, political, and social realities of policy and its application. Drawing on case studies of policy makers, government officials, health care workers, and aid recipients, the course asks: what politics inform which issues become prioritized or codified in global health and development policy, and which do not? How do policies impact global health governance, and to what effect? In what ways are policies adapted, adopted, innovatively engaged, or outright rejected by various global health actors, and what does this mean for the challenges that such policies aim to address? Ultimately, what is the relationship between global health policies and global health disparities?", "name": "Special Topics in Global Health", "section": "20", "topic": "Gbl H from Policy to Practice", "course": "390-0", "meeting_time": ["Th 12:30PM - 3:20PM"], "path": "/class-descriptions/4620/WCAS/GBL_HLTH/390-0/31172", "instructor": ["Noelle   Sullivan"], "id": "31172", "subject": "GBL_HLTH"}, {"school": "WCAS", "overview_of_class": "This course draws on perspectives from anthropology, related social scientific fields, and the humanities to provide a critical introduction to psychological trauma and its increasingly significant place in contemporary global health discourses and agendas. We will explore the history of the concept and its applications in Western literature, science, and medicine; consider the relatively recent construction of Post-Traumatic Stress Disorder (PTSD) as a diagnostic category and the clinical approaches developed to treat it; and examine the politics and effects of applying the concept abroad through humanitarian psychiatry and/or global mental health projects. Key questions of the course will include: how and why has trauma become one of the most important signifiers of our era?and a key criterion of &quot;victimhood?&quot; What politics and debates have shaped the development and application of the PTSD diagnosis in recent decades? And how have notions of trauma and their varied applications transformed politics, suffering, and care in diverse communities around the world?", "name": "Special Topics in Global Health", "section": "21", "topic": "Trauma and its Afterlives", "course": "390-0", "meeting_time": ["Tu 12:30PM - 3:20PM"], "path": "/class-descriptions/4620/WCAS/GBL_HLTH/390-0/31169", "instructor": ["Peter Andrew Locke"], "id": "31169", "subject": "GBL_HLTH"}, {"school": "WCAS", "overview_of_class": "This course is designed for those global health students who are seeking ways to have an impact on global health issues by engaging in local programs and organizations which are addressing these global health challenges. Students taking this course will explore roles and programs of global and local public, private and civil society sectors in addressing specific health issues. Each student will be expected to identify a local organization or program prior to the start of the course, with which they would like to engage.", "name": "Special Topics in Global Health", "section": "22", "topic": "Achieving Global Impact through Local Engagement", "course": "390-0", "meeting_time": ["Tu 6:00PM - 8:50PM"], "path": "/class-descriptions/4620/WCAS/GBL_HLTH/390-0/31173", "instructor": ["Michael W Diamond"], "id": "31173", "subject": "GBL_HLTH"}, {"school": "WCAS", "overview_of_class": "Native Americans experience significant disparities in health and in access to health care. This course introduces students to Native American health by exploring the social, cultural, political, and environmental determinants influencing Native health both historically and today. This course is a reading intensive, discussion-based seminar, drawing upon research and contributions from a variety of disciplines including anthropology, sociology, history, American Indian studies, population and public health, and medicine. Some seminar topics will include Native medicine, infectious diseases and the Columbian Exchange, Federal obligations to Native communities, substance abuse, intergenerational/historic trauma, environmental health, and indigenous health globally.", "name": "Special Topics in Global Health", "section": "23", "topic": "Native American Health", "course": "390-0", "meeting_time": ["Tu 3:00PM - 5:50PM"], "path": "/class-descriptions/4620/WCAS/GBL_HLTH/390-0/31170", "instructor": ["Margaret Ellen Pollak"], "id": "31170", "subject": "GBL_HLTH"}]