[{"class_mtg_info": [{"meet_t": "MoWe 9:30AM - 10:50AM", "meet_l": "University Hall 122"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "11978", "title": "WCAS ENGLISH 365-0-20 Studies in Postcolonial Literature", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "11978", "instructors": [{"instructor_phone": "", "instructor_name": "Evan M Mwangi", "instructor_addr": ""}], "topic": "Postcolonial Ecologies", "course": "365-0", "descriptions": [{"name": "Overview of class", "value": "This course reads a variety of theoretical and literary texts to examine the interface of postcolonialism, posthumanism, and ecological thought. Using work by such scholars as Byron Caminero-Santangelo, Cajetan Iheka, and Laura Wright, we will particularly critique Western theories of the environment (e.g. Lawrence Buell, Bruno Latour, etc) from a postcolonial perspective as well as read postcolonial texts from ecocritical standpoints, including ecofeminism. We will also examine how at the root of perennial postcolonial debates (e.g., the language debate) is the question of nature. Paying attention to the formal properties the texts use to represent nature, our discussions will include the structural and thematic agency the writers give to other-than-human elements of the cosmos while depicting postcolonial societies' struggle against colonial domination and the over-exploitation of the environment at the hands of global capitalism."}, {"name": "Teaching Method", "value": "Interactive lectures, debates, role-play, and small group discussions."}, {"name": "Evaluation Method", "value": "Two 6-page papers, weekly Canvas postings, regular self-evaluation, peer critiques, class participation, pop quizzes (ungraded), 1-minute papers (ungraded); and a take-home final exam."}, {"name": "Class Materials (Suggested)", "value": "Arundhati Roy, The God of Small Things. Publisher: Random House; ISBN-10: 0812979656; ISBN-13: 978-0812979657; <br/>Nuruddin Farah, Secrets. Publisher: Penguin Books; Reissue edition (December 1, 1999). ISBN-10: 0140280456. ISBN-13: 978-0140280456; <br/>Witi Ihimaera, The Whale Rider: Publisher: Graphia; 1-Simul edition (May 1, 2003) ISBN-10: 0152050167; ISBN-13: 978-0152050160; <br/>Helon Habila, Oil on Water. Publisher: W. W. Norton &amp; Company; Reprint edition (May 16, 2011) ISBN-10: 0393339645; ISBN-13: 978-0393339642; <br/>Amitav Ghosh, The Hungry Tide. Publisher: Mariner Books; Reprint edition (June 7, 2006); ISBN-10: 061871166X; ISBN-13: 978-0618711666."}], "lmod": "10/30/16 7:04 PM (CT)", "subject": "ENGLISH"}]