[{"school": "MUSIC", "overview_of_class": "This class is intended for non-music education students who have an interest in integrating music into their teaching practice, and focuses on the philosophy and practice of bringing music into non-music humanities course curricula including social sciences, English language and literature, fine arts, and world languages. It will also address how music teachers can be used as a resource for enhancing learning outside of music. Music can be incorporated into non-music classrooms to illustrate abstract concepts, provide insight into unfamiliar contexts, motivate student engagement, and enhance student learning in general. Curricular areas that will be addressed may vary based upon the teaching areas of enrolled students. Additionally, students will explore integration of music across the curriculum and will develop lessons incorporating music into their own curricular areas. No previous music experiences are expected or required for this course.", "name": "Selected Topics in Applied Music for Non-Majors", "section": "20", "location": "RCMA 1-180", "topic": "Music for the Non-Music Teacher", "course": "176-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4660/MUSIC/GEN_MUS/176-0/36702", "instructor": ["Brian Nikolas Weidner"], "class_attributes": "", "id": "36702", "subject": "GEN_MUS"}, {"school": "MUSIC", "overview_of_class": "With roots dating back to collegiate glee clubs in the 19th century, a cappella exploded in popularity through the 1990s and became a mass-culture phenomenon more recently through shows like Glee and The Sing-Off. The purpose of this course is to help students acquire the skills required to arrange pop songs themselves in a contemporary a cappella style.<br/><br/>Students will analyze existing arrangements, listen to current pop a cappella songs, learn about and write in styles from simple transcriptions to full arrangements, and discuss advanced techniques like mash-ups and reharmonization. While it will be helpful to come to the class with a basic ability to read notated music, no prior experience in arranging is necessary. This course will be fine-tuned to individual student needs and strengths in order to meet students at their current skill level.", "name": "Selected Topics in Applied Music for Non-Majors", "section": "21", "location": "RCMA 1-176", "topic": "Arranging Pop A Cappella", "course": "176-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4660/MUSIC/GEN_MUS/176-0/36703", "instructor": ["Jacob Axel Berglin"], "class_attributes": "", "id": "36703", "subject": "GEN_MUS"}]