[{"class_mtg_info": [{"meet_t": "Mo 6:00PM - 9:00PM", "meet_l": "TBA"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: No freshmen allowed. Pre-registration is for Global Health Studies Minor only. Registration is open to other students after pre-registration.", "qtr": "Spring 2017", "name": "33933", "title": "WCAS GBL_HLTH 390-0-22 Special Topics in Global Health", "class_attributes": "No Freshmen<br/><br/>", "section": "33933", "instructors": [{"instructor_phone": "847/467-1580", "instructor_name": "Michael W Diamond", "instructor_addr": ""}], "topic": "Achieving Global Impact through Local Engagement", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "Reducing chronic diseases and controlling infectious diseases are no longer just the responsibility of national governments, private health care institutions, city departments of public health, or community physicians. Heart disease, strokes, cancer, chronic respiratory diseases, obesity and diabetes, substance abuse such as tobacco and alcohol, and a range of health safety issues are now the major causes of death throughout the world. In addition, especially in low resource countries and communities, people are especially vulnerable to infectious diseases such as HIV and AIDS, malaria, tuberculosis, diarrheal diseases, as well as viruses and parasites. With the understanding that a healthy society is also a more economically productive society, there is an increased emphasis on reducing the burden of disease throughout the world. As a result, there is an enormous increase in the number of organizations and programs that are being implemented by the three sectors of society, public, private and civil society. This course is designed for those global health students who are seeking ways to have an impact on these global health issues by engaging in local programs and organizations which are addressing these global health challenges.<br/> <br/>Students will study global and local mechanisms and patterns of the circulation of disease, and their relation to environmental, cultural, socio-economic and political influences. Students will explore roles and programs of global and local public, private and civil society sectors in addressing specific health issues. ?<br/><br/>Each student will be expected to identify a local organization or program prior to the start of the course, with which they would like to engage. Students will examine the programs and the geographical regions of these organizations and identify the specific opportunities and roles that are available to them as volunteers, and as professionals. Special attention will be given to understanding due diligence, accountability and qualitative and quantitative mechanisms for measuring impact."}, {"name": "Class Materials (Required)", "value": "?Connors, Tracy Daniel (ed). (2011) The Volunteer Management Handbook: Leadership Strategies for Success. John Wiley &amp; Sons ISBN:9780470604533 <br/> <br/>Foege,William H., Nils Daulaire, Robert Black, Clarence Pearson (eds). (2005) Global Health Leadership and Management, John Wiley &amp; Sons,<br/> <br/>Koop, C. Everett, Clarence Pearson, M. Roy Schwarz (eds) (2002) Critical Issues in Global Health Jossey-Bass<br/> <br/>Rosenberg, Mark, Elizabeth Hayes, Margaret McIntyre and Nancy Neill. (2010) Real Collaboration: What It Takes for Global Health to Succeed. California/Milbank Books on Health and the Public."}], "lmod": "2/6/17 6:43 PM (CT)", "subject": "GBL_HLTH"}]