[{"class_mtg_info": [{"meet_t": "TBA", "meet_l": "TBA"}], "school": "SCS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "27527", "title": "SCS ACCOUNT 350-DL-15 Auditing I", "class_attributes": "", "section": "27527", "instructors": [{"instructor_phone": "", "instructor_name": "Jay I Mages", "instructor_addr": ""}], "topic": "", "course": "350-DL", "descriptions": [{"name": "Overview of class", "value": "This course applies the basic audit paradigm or model to balance-sheet audits and related cycles. It features in-depth analysis of the theories of audit evidence, sampling, legal responsibilities, internal control, and audit planning, and how all of these apply to audits and to the profession. The course addresses the function of auditing in the economic and political system, and investigates how economic and political changes affect the auditing profession. The professional standards auditors must meet, as well as underlying ethical principles, are also covered. Case studies, including nonprofits, for-profits, and manufacturing and services companies and organizations, are used so that students can learn from each other's experiences and develop team skills as they apply auditing principles to real situations. Students are encouraged to share articles and their own experiences related to auditing and auditors, and to develop them into short case studies<br/><br/>This course is conducted completely online. A technology fee will be added to tuition."}, {"name": "Registration Requirements", "value": "Prerequisite: ACCOUNT 211"}, {"name": "Learning Objectives", "value": "? Contrast corporate accounting, public accounting, and internal auditing.<br/>? Outline the professional standards and ethical guidelines for public accountants.<br/>? Identify and assess risks when conducting a financial audit.<br/>? Summarize the appropriate methodologies for auditing major areas of the balance sheet and select income statement accounts.<br/>? Apply auditing methodologies in a variety of case studies."}, {"name": "Teaching Method", "value": "Case studies<br/>Class participation via Discussion Boards<br/>Films / videos<br/>Group work<br/>Video Lecture<br/>Online work <br/>Presentations<br/>Problem sets<br/>Readings<br/>Research project"}, {"name": "Evaluation Method", "value": "Homework Problems: Sessions 1-9 10%<br/>Quizzes 1-3 (S3,5,7) 15% (5% for each quiz)<br/>Paper 1 (S1) 10%<br/>Paper 2 (S2) 10%<br/>Sample Journal Entries (S3) 5%<br/>Sample Engagement Letter (S 4) 5%<br/>Sample Risk Assessment Working Paper (S8) 5%<br/>Final Case Study 25%<br/>Discussion Board Participation 15%"}, {"name": "Class Materials (Required)", "value": "Texts may include the following. Visit the campus bookstore or its website to confirm materials for the course.<br/><br/>Whittington, R., &amp; Pany, K. (2016). Principles of auditing &amp; other assurance services (20thed.). Boston: McGraw-Hill/Irwin. [ISBN- 9780077729141 / 0077729145]"}], "lmod": "12/29/16 6:49 PM (CT)", "subject": "ACCOUNT"}]