[{"class_mtg_info": [{"meet_t": "Th 6:15PM - 9:15PM", "meet_l": "Kresge Centennial Hall 2-430"}], "school": "SCS", "overview_of_class": "This course provides foundational training in the analysis of film and other audiovisual media. The course focuses on technical aspects of cinema, its production, and its fundamental interpretation: shot composition, lighting, cinematography, editing, acting styles, sound, and narrative. Secondary topics introduce a broader range of issues central to film history and culture: genre, production and exhibition context, documentary, animation, and experimentation. Close analysis of assigned films is a major component of the course. This introduction to film and media studies should appeal to majors and movie lovers alike. Carries humanities credit.", "qtr": "Fall 2017", "name": "Analyzing Media Texts", "title": "SCS RTVF 220-CN-66 Analyzing Media Texts", "lmod": "9/12/17 6:57 PM (CT)", "section": "66", "topic": "", "course": "220-CN", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "This course provides foundational training in the analysis of film and other audiovisual media. The course focuses on technical aspects of cinema, its production, and its fundamental interpretation: shot composition, lighting, cinematography, editing, acting styles, sound, and narrative. Secondary topics introduce a broader range of issues central to film history and culture: genre, production and exhibition context, documentary, animation, and experimentation. Close analysis of assigned films is a major component of the course. This introduction to film and media studies should appeal to majors and movie lovers alike. Carries humanities credit."}, {"name": "Registration Requirements", "value": "None."}, {"name": "Learning Objectives", "value": "(1) Acquaint students with a vocabulary specific to film and other moving-image media. <br/>(2) Provide students with the critical tools required for analysis of the moving image, relating elements of film production to larger themes and ideas.<br/>(3) Enable students to develop skills in writing and argumentation for humanistic inquiry."}, {"name": "Teaching Method", "value": "Class participation<br/>Lectures <br/>In-class group discussions and analysis of key texts<br/>Readings <br/>Film and Video Screenings<br/>Writing Assignments"}, {"name": "Evaluation Method", "value": "Short Response Papers (1-2 pages) <br/>Class Participation and Attendance <br/>Midterm Exam<br/>Close Analysis Paper<br/>Revised and Expanded Version of Close Analysis Paper"}, {"name": "Class Materials (Required)", "value": "Textbook: Film Art: An Introduction, Eleventh Edition, by David Bordwell and Kristin Thompson<br/><br/>Additional required readings listed on the syllabus are available through Canvas under Files. <br/>Films for the course are also streaming on Canvas, under both Course Reserves and Library Media."}, {"name": "Class Notes", "value": "Several of the films assigned for this class engage with complex and difficult subject matter. If you are a particularly sensitive viewer, or know that you are consistently triggered by certain topics, please familiarize yourself with the films on the syllabus in advance and talk with me about any concerns that you have. Alternative screenings may be arranged if necessary. In general, all Northwestern students should be aware of the mental health and psychological counseling resources available to them on campus, including NU Counseling and Psychological Services (CAPS), NU Listens, and the Northwestern Women's Center."}], "instructor": ["Annie Laurie Sullivan"], "class_attributes": "", "id": "17525", "subject": "RTVF"}]