[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Annenberg Hall G21"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "25400", "title": "WCAS PSYCH 201-0-20 Statistical Methods in Psychology", "class_attributes": "Formal Studies Distro Area<br/><br/>Attendance at 1st class mandatory<br/><br/>Prerequisites apply, see description<br/><br/>", "section": "25400", "instructors": [{"instructor_phone": "", "instructor_name": "Harry David   Smith", "instructor_addr": ""}], "topic": "", "course": "201-0", "descriptions": [{"name": "Overview of class", "value": "This course is designed to introduce students to statistics, including both descriptive statistics (summarizing data obtained from a sample) and inferential statistics (drawing inferences about a population based on data obtained from a sample drawn from that population). The assigned readings have been selected to familiarize students with basic concepts relating to the analysis and interpretation of data. Class activities will focus on how the concepts can be applied. Through completion of the course, students should become more sophisticated and critical consumers of statistical information."}, {"name": "Registration Requirements", "value": "PSYCH 110 and high school algebra"}, {"name": "Learning Objectives", "value": "After completing this course, the student will be able to summarize datasets using a variety of descriptive statistics and draw inferences about populations based on sample data using a variety of inferential statistics. The student will also be able to understand statistical notation and jargon that they may encounter when reading journal articles in other courses and in their own research."}, {"name": "Teaching Method", "value": "Lecture: I do some lecturing but as stated above my primary teaching technique is a team learning system.<br/><br/>Group work: My primary teaching technique is a team learning approach."}, {"name": "Evaluation Method", "value": "Exam, final: 40% of final grade;<br/>Exam, mid-term: 20% of final grade;<br/>Class participation: 5% of final grade;<br/>Group work: 15% of final grade;<br/>Homework: 19.2% of final grade;<br/>Quizzes: 0.8% of final grade"}, {"name": "Class Materials (Required)", "value": "Scientific calculator.<br/><br/>Glenberg, A.&amp; Andrzejewski, M. (2008). Learning From Data: An Introduction to Statistical Reasoning (3rd Edition). Mahwah, NJ: Lawrence Erlbaum. ISBN: 0 -8058-4921-1."}, {"name": "Class Notes", "value": "The team learning system we use in this class makes this class fun for most students (see my past PSYCH 201 CTECs)!"}], "lmod": "12/25/16 7:05 PM (CT)", "subject": "PSYCH"}]