[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "University Library 5722"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores<br/>Add Consent: Department Consent Required<br/>Drop Consent: Department Consent Required<br/>", "qtr": "Fall 2016", "name": "14398", "title": "WCAS SOCIOL 101-6-20 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "14398", "instructors": [{"instructor_phone": "847/491-3495", "instructor_name": "Gary A Fine", "instructor_addr": "1810 Chicago Ave. Rm. 221"}], "topic": "Scandals &amp; Reputations", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "This freshman seminar is designed to expose incoming students to the basic approaches that historians, political scientists, and sociologists use to understanding historical memory. In particular, we examine how reputations are constructed by the public and by historians, and how scandals (including contemporary ones) come to be understood. Our primary focus for this course will be American examples, but the historical range will be broad, covering 1700-present. Given the controversy recently uncovered at Northwestern about the involvement of our founder, John Evans in the Sand Creek Massacre, the most significant genocide of native peoples on United States soil, we will discuss how the university should recall Evans' deeds."}, {"name": "Teaching Method", "value": "This course will be based heavily on group discussion and exercises, with some lecturing for &quot;stage-setting.&quot; As a seminar, students are involved as active participants. The class will involve approximately twenty pages of writing over the course of the quarter."}, {"name": "Class Materials (Required)", "value": "This is a tentative list. You will read close to 100 pages a week.<br/><br/>Selections from the following:<br/><br/><br/>Michael Schudson, Watergate in American Memory.<br/><br/>Patricia Bonomi, The Lord Cornbury Scandal: The Politics of Reputation in British America<br/><br/>Donileen Loseke, Thinking About Social Problems<br/><br/>Ari Kelman, A Misplaced Massacre: Struggling over the Memory of Sand Creek<br/><br/>Daniel Solove, The Future of Reputation<br/><br/>Joel Best, Damn Lies and Statistics <br/><br/><br/>A set of articles will be assigned as well."}], "lmod": "10/30/16 7:10 PM (CT)", "subject": "SOCIOL"}]