[{"class_mtg_info": [{"meet_t": "Tu 6:15PM - 9:15PM", "meet_l": "Wieboldt Hall 417"}], "school": "SCS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "27759", "title": "SCS BIOL_SCI 316-CN-14 Human Structure and Function", "class_attributes": "", "section": "27759", "instructors": [{"instructor_phone": "", "instructor_name": "Brian T Shea", "instructor_addr": ""}], "topic": "", "course": "316-CN", "descriptions": [{"name": "Overview of class", "value": "The primary focus of this course is on the structural, functional and clinical anatomy of the postcranial musculoskeletal system. The regional anatomy of the muscles, bones, and joints in the human body serves as a basis for presentation of more general functional and biomechanical principles of movement. Related discussions include the clinical significance, and growth and development, of these anatomical regions. Lecture presentations are supplemented by online video anatomy dissections, in-class small group special exercises, and informal lab sessions covering surface anatomy and movement exercises, imaging modules, clinical case studies and examination of bones and models."}, {"name": "Registration Requirements", "value": "Biol Sci 313 or other introductory anatomy courses, will serve as helpful background. Check with instructor if you are unsure about your background or course suitability."}, {"name": "Learning Objectives", "value": "This introductory course is designed to provide an integrated understanding of the structure and function of the postcranial musculoskeletal system. Muscles and bones for each subregion are learned in the context of movements at key joints, along with primary biomechanical and loading inputs. Common clinical conditions are reviewed in order to aid the student in understanding related structural issues in each area."}, {"name": "Teaching Method", "value": "Lectures are regularly supplemented by in-class small group work using skeletons and models, completing special exercises (movements, biomechanics, etc.), working through imaging and clinical case study modules, and undertaking surface anatomy examinations. Weekly out-of-class exercises and the viewing of digital dissection anatomy resources are required."}, {"name": "Evaluation Method", "value": "Midterm and Final Examinations; In-class and Out-of-Class Exercises; Paper"}, {"name": "Class Materials (Required)", "value": "Floyd, R.T. (2012 ) Manual of Structural Kinesiology, 18th ed. .<br/><br/>Short readings may accompany text assignments for certain weeks.<br/><br/>On-line and digital resources complement the readings."}], "lmod": "1/9/16 6:41 PM (CT)", "subject": "BIOL_SCI"}]