[{"class_mtg_info": [{"meet_t": "MoWe 5:00PM - 6:20PM", "meet_l": "Locy Hall 106"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "24562", "title": "WCAS POLI_SCI 312-0-21 Statistical Research Methods", "class_attributes": "Formal Studies Distro Area<br/><br/>", "section": "24562", "instructors": [{"instructor_phone": "", "instructor_name": "Salma   Al-Shami", "instructor_addr": ""}], "topic": "", "course": "312-0", "descriptions": [{"name": "Overview of class", "value": "To what extent is the United States becoming more politically polarized? What explains the variation in Western European countries' responses to contemporary refugee crises? Why do autocrats hold elections, and why do voters vote in them when results are predetermined? Does foreign aid help or hinder domestic economic growth of developing nations? Are ethnic and sectarian tensions the cause or outcome of weak governing institutions?<br/><br/>While the studies represented by these questions suggest the diverse range of topics investigated by political science research, all are united in their articulation of a methodology used to generate answers. This course provides an introduction to one such methodology frequently used in the systematic study of political phenomena: statistics.<br/><br/>That statistics can summarize and simplify large amounts of data to various endsdetect patterns, make comparisons, inform policy decisionsis both a methodological advantage and disadvantage. This class equips students with tools to generate and interpret statistics while asking them to consider when, which, and to what extent numbers &quot;speak for themselves.&quot;<br/><br/>With guidance from the instructor, students will carry out a statistical analysis of any political science-related topic and dataset of their choosing for their final paper. Topics covered include descriptive statistics, hypothesis testing, regression analysis, and causal inference. This class fulfills the political science department's methodology requirement."}, {"name": "Learning Objectives", "value": "By the end of the course, students will be expected:<br/>1. To have strengthened their statistical literacy<br/>2. Have a command of the research design process<br/>3. To know how to generate and interpret descriptive statistics, hypothesis tests, and basic linear regression."}, {"name": "Teaching Method", "value": "Lecture based with some in-class discussion"}, {"name": "Evaluation Method", "value": "Weekly Problem Sets, Final Paper, Quiz, and Meeting with Professor"}, {"name": "Class Materials (Required)", "value": "Required Book 1: <br/>Authors: Alan Agresti and Barbara Finlay<br/>Publisher: Pearson Education Limited<br/>Title: Statistical Methods for the Social Sciences<br/>Edition/Year: 2014, Fourth Edition<br/>ISBN-13 #: 978-1292021669<br/>PAPERBACK<br/><br/>Required Book 2:<br/>Author: Charles J. Wheelan<br/>Publisher: W.W. Norton &amp; Company, INC.<br/>Title: Naked Statistics: Stripping the Dread from the Data<br/>Edition/Year: 2013<br/>ISBN #: 978-0-393-34777-7 pbk<br/>PAPERBACK"}], "lmod": "1/9/16 6:52 PM (CT)", "subject": "POLI_SCI"}]