[{"school": "SoC", "overview_of_class": "", "name": "Special Topics in History", "section": "26", "location": "Locy Hall 213", "topic": "Chicago Play By Play", "course": "366-0", "meeting_time": ["TuTh 10:30AM - 11:50AM"], "path": "/class-descriptions/4640/SoC/THEATRE/366-0/14680", "instructor": ["Roxane H Heinze-Bradshaw"], "class_attributes": "", "id": "14680", "subject": "THEATRE"}, {"school": "SoC", "overview_of_class": "", "name": "Special Topics in History", "section": "27", "location": "No Room Needed", "topic": "", "course": "366-0", "meeting_time": ["TBA"], "path": "/class-descriptions/4640/SoC/THEATRE/366-0/14681", "instructor": [""], "class_attributes": "", "id": "14681", "subject": "THEATRE"}, {"school": "SoC", "overview_of_class": "Theatre and Violence:<br/><br/>In what ways can theatre matter to the world? How does social and political life shape theatre and vice versa? How does theatre create a new understanding of and engagement with traumatic pasts? This course explores these questions by examining how theatre engages with histories of human rights violations?genocide, disappearances, sexual slavery, apartheid, and other forms of mass violence?in Asia, Latin America, and Africa. We will also explore the work of artists, activists, and survivors in rituals, songs, protests, truth and reconciliation commissions, and communal courts, as well as the influence of these different sites of performance on theatre. These performances from the stage and everyday life are embodied public events that engage multiple audiences, allowing people material ways to join in negotiating trauma and enacting personal and collective transformation. These acts also expand what constitutes historical knowledge, in light of how embodied knowledge has often been overlooked in the privileging of written forms. We will consider a range of topics such as the politics of memory, historical materialism and knowledge production, the ethics of representing violence, the theatricality of justice, mourning, witnessing, the transmission of trauma, and community formation.<br/><br/>The course is organized into three units focused on six historical case studies: 1) Asia (Japanese military sexual slavery and the Cambodian Genocide), 2) Latin America (the \"Dirty War\" in Argentina and civil violence in Peru), 3) Africa (the Rwandan Genocide and Apartheid in South Africa). The course begins with acts of witnessing and mourning in Korean shamanic rituals and in the lives of survivors of Japanese military sexual slavery; we will also look at memorialization via tourism of and theatrical productions about the Cambodian Genocide. In the second unit, we will consider the relationship between trauma and public mobilization through the activism of the Madres of the Plaza de Mayo and H.I.J.O.S. in Argentina, and the Peruvian truth commission and the theatrical work of Grupo Cultural Yuyachkani. The last unit focuses on sites of transitional justice such as South Africa's Truth and Reconciliation Commission and Gacaca courts in Rwanda, as well as the ethics of representing violence in plays by Erik Ehn and Yael Farber.", "name": "Special Topics in History", "section": "28", "location": "Wirtz 240 Seminar Room 2", "topic": "Theatre & Violence", "course": "366-0", "meeting_time": ["MoWe 11:00AM - 12:20PM"], "path": "/class-descriptions/4640/SoC/THEATRE/366-0/14682", "instructor": ["Elizabeth Won-Kyung Son"], "class_attributes": "", "id": "14682", "subject": "THEATRE"}, {"school": "SoC", "overview_of_class": "", "name": "Special Topics in History", "section": "29", "location": "Locy Hall 110", "topic": "Performance of/in Politics", "course": "366-0", "meeting_time": ["TuTh 1:00PM - 2:50PM"], "path": "/class-descriptions/4640/SoC/THEATRE/366-0/14683", "instructor": ["Peter J Civetta"], "class_attributes": "", "id": "14683", "subject": "THEATRE"}]