[{"school": "WCAS", "overview_of_class": "Faust, Wagering, and History<br/><br/>\"To sell one`s soul,\" \"to strike a bargain with the devil,\" or even \"to beat the devil at his own game\"?these expressions and similar ones continue to enjoy undiminished popularity.  For at least five centuries the legend of Faust has served as means to express the daring and danger of pursuing an individual aspiration at any price. The specter of a \"Faustian bargain\" often appears when stories focus on individuals whose inordinate achievements in amassing knowledge or power would seem to have been purchased at the cost of their ability to live in a shared world.  And through the optic of the Faust legend a culture can be seen to represent in abbreviated form its implicit system of highest and lowest values.<br/><br/>Dr. Faustus has undergone many mutations since he first appeared in the sixteenth century.  This class will be begin with a question at the heart of the Faust legend:  what is a wager in general?  And in particular, what does it mean to wager one`s soul, especially when the meaning of the word \"soul\" becomes less and less self-evident?  The class will continually reflect on what we are doing when we assign a work of art to a particular age or cultural movement, from \"early modern\" to \"post-modern.\"  In addition to listening to musical compositions and reading shorting texts, we will be guided in our inquiry by three majors texts:  an early-modern English play (Christopher Marlow`s Tragical History of Doctor Faustus), a German epic play that was first conceived during the so-called Age of Enlightenment (Johann Wolfgang von Goethe`s Faust I along with selections from Faust II), and a modernist German novel (Thomas Mann`s Dr. Faustus).  In the final weeks of the quarter, we will view two films, each of which could be described as \"post-modern\" re-interpretations of the Faust legend (Taylor Hackford`s The Devil`s Advocate and Sophie Barthes` Cold Souls).", "name": "The Theme of Faust Through the Ages", "section": "20", "location": "Swift Hall 107", "topic": "", "course": "232-0", "meeting_time": ["MoWe 10:00AM - 10:50AM"], "path": "/class-descriptions/4610/WCAS/GERMAN/232-0/23368", "instructor": ["Peter D Fenves"], "class_attributes": "Interdisciplinary Distro - See Rules<br/><br/>Literature &amp; Fine Arts Distro Area<br/><br/>Ethics &amp; Values Distro Area<br/><br/>Registration for discussion section required<br/><br/>Given in English<br/><br/>", "id": "23368", "subject": "GERMAN"}]