[{"class_mtg_info": [{"meet_t": "Tu 2:00PM - 4:50PM", "meet_l": "Kresge 3354 German Seminar Rm."}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: PRE-REG only: Reserved for German majors.", "qtr": "Spring 2017", "name": "30898", "title": "WCAS GERMAN 403-0-20 German Literature, Critical Thought and New Media 1900-1945", "class_attributes": "", "section": "30898", "instructors": [{"instructor_phone": "847/491-8296", "instructor_name": "Samuel   Weber", "instructor_addr": "Kresge Hall, Room 3335"}], "topic": "Kafka and his Critics", "course": "403-0", "descriptions": [{"name": "Overview of class", "value": "The seminar will be evenly divided between readings of certain texts of Kafka and and of some of his more influence critics. Wherever possible, critical readings will be related to specific Kafka texts, even where they are more general in character. The fascination of the authorial name - Kafka - will be juxtaposed to the complexity of the texts themselves, especially the narrative texts, on which the emphasis will be placed. Texts to be read include (the list is not exhaustive): 1. Kafka: Cares of a House Father; 2. The Hunter Gracchus; 3. Josefine, Songstress of the People of Mice; 4. &quot;The Great Theater of Oklahama (sic!),&quot; from The Man Who Disappeared (aka America); 5. Before the Law (and its insertion in The Trial). Critics to be read include: W. Benjamin (in connection with The Theater of Oklahama), Th. Adorno (The Castle), J. Derrida (Before the Law), M. Blanchot, Deleuze-Guattari. Students will be asked to make short presentations of readings, as well as a term paper."}, {"name": "Registration Requirements", "value": "Undergraduates should get a permission number to register."}, {"name": "Learning Objectives", "value": "Reading Kafka's writings and his critics should enable students to reexamine critically the status of the author, and in particular of the authorial name, in relation to the place of narration in the narrative fiction. This in turn raises the question of the different kinds of readings that Kafka's texts not only provoke but also invite, and indeed also diversely stage. The course should enable students to address better the question of whether reading in general and critical writing in particular should be considered to be co-constitutive of the text being read - and, if this is the case, then how the &quot;co-&quot; in &quot;co-constitutive&quot; should be conceived - and practiced?"}, {"name": "Teaching Method", "value": "Class participation: Students will be asked to make short class presentations.<br/>Discussion: Part of each session will be devoted to discussion.<br/>Lecture: Individual meetings will be introduced either by a lecture or a student presentation, intended to st<br/>Presentations: Presentations are to be relatively short ? 15 minutes ? and designed to both focus and stimulate dis<br/>Readings: For each meeting specific readings will be assigned.<br/>Seminar: Part lecture-presentation, part discussion. Always focused on one or more texts.w<br/>Writing assignments: A term paper will be required of all registered students.<br/>"}, {"name": "Evaluation Method", "value": "Attendance: 25%<br/>Class participation: 25%<br/>Paper, final: 50%<br/>"}, {"name": "Class Materials (Required)", "value": "? Franz Kafka: For English please use The Schocken Library new translations, based on most recent textual work. Schocken internet page: http://www.penguinrandomhouse.com/series/SK3/the-schocken-kafka-library.<br/>? For German, Romane und Erzählungen, Fischer Taschenbuch Verlage, ISBN-10: 3596164559 (hardback); ISBN-13: 978-3596164554 (paperback)<br/><br/><br/>Walter Benjamin, &quot;Franz Kafka: On the 10th Anniversary of his Death&quot;; &quot;Beim Bau der chinesischen Mauer&quot;; <br/><br/>Theodor W. Adorno, &quot;Nachzeichnungen zu Kafka,&quot; Prismen; ?Remarks on Kafka,&quot; Prisms; <br/><br/>Jacques Derrida, ?Devant la loi,&quot; in : Derek Attridge, Acts of Literature ; French : « Préjugés : Devant la loi, » in : La faculté de juger, Minuit : 1985, 87-139."}, {"name": "Class Materials (Suggested)", "value": "Giorgio Agamben, « The Messiah and the Sovereign : The Problem of Law in Walter Benjamin,&quot; in: Potentialities, 160-174.<br/><br/>Günter Anders, Kafka Pro &amp; Contra; English: Kafka, Bowes &amp; Bowes, London: 1960.<br/><br/>Maurice Blanchot, De Kafka à Kafka, folio (Gallimard), 1981.<br/><br/>J. M. Coetzee, &quot;Time, Tense and Aspect in Kafka's ?The Burrow'&quot; (http://research.uvu.edu/Albrecht%2DCrane/3090/links_files/Coetzee.pdf)<br/><br/>Stanley Corngold, The Commentator's Despair: The Interpretation of Kafka's Metamorphosis.<br/><br/>Werner Hamacher, &quot;The Gesture in the Name: On Benjamin and Kafka,&quot; in: Premises, 294-336. <br/>? Paul North, The Yield: Kafka's Atheological Reformation, ASIN: B01K0SQ8SY"}], "lmod": "2/14/17 6:45 PM (CT)", "subject": "GERMAN"}]