[{"school": "WCAS", "overview_of_class": "What is cultural history? Why did become prominent in the last twenty years or so, and is there truth to rumors of its decline? How does it relate to other approaches to history, and how does it intersect with other disciplines? What are the rules, if any governing the use of evidence in cultural history? Do cultural-historical approaches lead to the neglect of causality in historical explanation? These are some of the questions we will explore in this version of the 405 seminar. The weekly sessions will include some of the following topics: the debate over historical \"objectivity\" and \"invention\"; the relationship between history and fiction; the influence of postmodernists and of thinkers like Michel Foucault on historical writing; cultural approaches to the history of gender, class, race and nationhood; and recent contributions to the history of material culture.", "name": "Seminar in Historical Analysis", "section": "24", "location": "Harris Hall L40", "topic": "Cultural History", "course": "405-0", "meeting_time": ["Mo 2:00PM - 4:50PM"], "path": "/class-descriptions/4640/WCAS/HISTORY/405-0/12402", "instructor": ["Sarah C Maza"], "class_attributes": "Graduate Students Only<br/><br/>", "id": "12402", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "History depends heavily on textual evidence. Oral history offers not only a different form of historical evidence but an opportunity to explore the characteristics of historical evidence. This course will begin with a brief discussion of historical evidence, orality, and textuality. We will then explore oral history methods, discuss issues of veracity, interpretation, and memory, and consider the works of several major oral historians. The oral history scholarship considered in this course includes both U.S. and European histories, and may include Latin American and Asian histories as well.", "name": "Seminar in Historical Analysis", "section": "26", "location": "Harris Hall L40", "topic": "Oral History", "course": "405-0", "meeting_time": ["Tu 9:30AM - 12:20PM"], "path": "/class-descriptions/4640/WCAS/HISTORY/405-0/12403", "instructor": ["Ji-Yeon   Yuh"], "class_attributes": "", "id": "12403", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "", "name": "Seminar in Historical Analysis", "section": "28", "location": "Harris Hall L40", "topic": "Studies in the History of Religions: Embodiment/M", "course": "405-0", "meeting_time": ["Mo 11:00AM - 1:50PM"], "path": "/class-descriptions/4640/WCAS/HISTORY/405-0/12404", "instructor": ["J Michelle   Molina"], "class_attributes": "", "id": "12404", "subject": "HISTORY"}]