[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "ANTHRO Sem Rm B07 - 1810 Hinmn"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "23185", "title": "WCAS ASIAN_ST 390-3-20 Advanced Topics in Asian Studies", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "23185", "instructors": [{"instructor_phone": "", "instructor_name": "Stefan   Henning", "instructor_addr": ""}], "topic": "Anthropology of China", "course": "390-3", "descriptions": [{"name": "Overview of class", "value": "This course introduces students to the cultural anthropology of China. We will read closely select chapters from six ethnographies and three articles that address themes central to the field: migration from rural China to urban centers, popular culture and the media in the cities, village life and the changes wrought on it by the economic reforms, the hold of the Maoist past on the present, ethnic difference and the Chinese state, and shifting approaches to the body, health, and medicine. Together, these themes will familiarize you with the cataclysmic changes the Chinese, rural and urban alike, have gone through over the past thirty years when the commercialization and commodification of the economic reforms succeeded the planned economy and the totalitarian state of Mao.<br/> <br/>At the same time, we will also consider ethnographic writing and ethnography as a textual form, or genre. What is an ethnography and what are its different forms? Can you deduce from reading the ethnography what specific kinds of fieldwork the author must have conducted to write this book? How to represent the hold of the past on the present in ethnographic writing?<br/> <br/>This class is reading-intensive and will focus on discussion. Preparation for class discussion by keeping up with the readings is crucial and will figure into the grading."}, {"name": "Teaching Method", "value": "Seminar"}], "lmod": "12/25/16 6:55 PM (CT)", "subject": "ASIAN_ST"}]