[{"class_mtg_info": [{"meet_t": "MoWe 12:30PM - 1:50PM", "meet_l": "555 Clark B03"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "10554", "title": "WCAS ART_HIST 350-1-1 19Th Century Art: Late 18Th Century-1848", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "10554", "instructors": [{"instructor_phone": "", "instructor_name": "David T Van Zanten", "instructor_addr": ""}, {"instructor_phone": "", "instructor_name": "Susan Hollis   Clayson", "instructor_addr": ""}, {"instructor_phone": "", "instructor_name": "Stephen F Eisenman", "instructor_addr": ""}], "topic": "", "course": "350-1", "descriptions": [{"name": "Overview of class", "value": "This team-taught course studies the art, architecture and urbanism of &quot;The Age of Revolution&quot; with heavy emphasis upon artistic and political developments in France, but the German states, England and Spain will also be discussed. The key artistic practices studied in the course are those of David, Goya, Ingres, Daumier, Géricault, Delacroix, Blake and Constable. The rise of major metropolises (London and Paris) and their public and private buildings will likewise be important points of focus. Major themes will be the rise of an art for the public, art and revolution, art and empire, the invention of Orientalism and Romanticism, caricature and the press, new image technologies (including photography), and the rise of landscape painting and portraiture. The course subtitle may as well be: Sex, Violence, Politics, Big Cities, and the Land. A unique feature of the class will be its three professors: all renowned experts in the field. They will be teaching together in 2016-17 for the first and last time. The course has already gained a nickname: 19th-c. Art and Architecture from the Three Tenors!"}, {"name": "Teaching Method", "value": "Class participation, one medium-length paper (based upon an art work in the Art Institute of Chicago), one midterm exam, and a final exam. P/NP will not be allowed."}, {"name": "Class Materials (Required)", "value": "A range of readings will be posted as pdfs on CANVAS."}], "lmod": "10/30/16 6:58 PM (CT)", "subject": "ART_HIST"}]