[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Kresge Centennial Hall 2-415"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Environmental Policy and Culture Students Only During Pre-Registration", "qtr": "Spring 2017", "name": "33834", "title": "WCAS ENVR_POL 390-0-23 Special Topics in Environmental Policy and Culture", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "33834", "instructors": [{"instructor_phone": "847/491-7421", "instructor_name": "Lydia   Barnett", "instructor_addr": "Harris Hall - Room 305"}], "topic": "Environmental Disasters: A Global History", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "The term ?natural disaster' conjures images of tsunamis, earthquakes, volcanoes, and other powerful forces of nature that strike without warning, inflicting massive suffering on a powerless and unsuspecting populace. We now have several decades' worth of research from the social sciences and humanities showing that so-called &quot;natural&quot; disasters are not very natural at all. Instead, they are deeply political and profoundly man-made. This course adopts a historical and global approach in order to denaturalize disaster. From famines in British India to earthquakes in post-colonial Peru, from floods in New Orleans to nuclear disaster in Japan, we will see how disasters expose and exacerbate pre-existing inequalities, inflicting suffering disproportionately among those groups already marginalized by race, class, gender, geography, and age. These inequalities shape not only the impact of the disaster but the range of responses to it, including political critique and retrenchment, relief and rebuilding efforts, memorialization, and planning - or failing to plan - for future disasters of a similar kind. The course culminates in a unit on the contemporary challenge of anthropogenic global climate change, the ultimate man-made disaster. We will consider how memories, fears, and fantasies of past disasters are being repurposed to create new visions of what climate change will look like."}, {"name": "Teaching Method", "value": "DiscussionLecture"}, {"name": "Evaluation Method", "value": "Class participationExamsPaper, final"}, {"name": "Class Materials (Required)", "value": "Gillen d'Arcy Wood. Tambora. 9780691168623 Course Reader"}], "lmod": "2/14/17 6:44 PM (CT)", "subject": "ENVR_POL"}]