[{"school": "SoC", "overview_of_class": "", "name": "Topics in Theatre", "section": "22", "location": "Wirtz Center CELLAR", "topic": "Standing Down Straight for Actors", "course": "330-0", "meeting_time": ["TuTh 3:00PM - 4:20PM"], "path": "/class-descriptions/4640/SoC/THEATRE/330-0/14727", "instructor": ["William Lewis   Siegenfeld"], "class_attributes": "Department Majors/Minors Only<br/><br/>No Freshmen<br/><br/>", "id": "14727", "subject": "THEATRE"}, {"school": "SoC", "overview_of_class": "This highly participatory and collaborative class offers students a broad overview of theatre producing and management in America today. Students will experience making choices, decisions and presentations about the processes involved in producing a play or musical. This course will have resonance for any student who has ever produced his/her own show as well as for students who are beginning to think about producing and/or starting their own theatres upon graduating from Northwestern.<br/><br/>The course also offers an overview of artistic leadership and exposes students to artistic leaders working at theatres locally and throughout the country. Students will meet more than a half dozen Chicago theatre arts leaders and hear from these leaders about their artistic impulses and processes, creative ambitions and goals, successes, as well as their dreams for the future. Students will research an arts leader, including his/her artistic leadership styles and strategies, and the impact of these styles on artists' own lives as well as on the work they create and the companies they run. The class also includes a survey of leadership and management theory and its applicability in theatre.", "name": "Topics in Theatre", "section": "23", "location": "Wirtz 235 Seminar Room 1", "topic": "Theatre Mgmt & Artistic Ldrshp", "course": "330-0", "meeting_time": ["Fr 2:00PM - 5:00PM"], "path": "/class-descriptions/4640/SoC/THEATRE/330-0/14728", "instructor": ["Diane Gail Claussen"], "class_attributes": "", "id": "14728", "subject": "THEATRE"}, {"school": "SoC", "overview_of_class": "", "name": "Topics in Theatre", "section": "24", "location": "Wirtz Center BERGEN", "topic": "Partnered Swing Dancing", "course": "330-0", "meeting_time": ["MoWe 4:30PM - 5:50PM"], "path": "/class-descriptions/4640/SoC/THEATRE/330-0/14729", "instructor": ["William Lewis   Siegenfeld"], "class_attributes": "Department Majors/Minors Only<br/><br/>", "id": "14729", "subject": "THEATRE"}, {"school": "SoC", "overview_of_class": "", "name": "Topics in Theatre", "section": "25", "location": "Fisk Hall 115", "topic": "Advanced Directing", "course": "330-0", "meeting_time": ["TuTh 1:00PM - 2:50PM"], "path": "/class-descriptions/4640/SoC/THEATRE/330-0/17565", "instructor": ["Kathryn Boehm Walsh"], "class_attributes": "", "id": "17565", "subject": "THEATRE"}, {"school": "SoC", "overview_of_class": "Theater can foment revolution. Or it can be used to cement power and subject the masses to tyranny. Theater can spread information during famine, health crises, and war. It can throw elections. It has been used for hundreds of years to change society. This course will bring together theater makers and students who will study those artists working at the intersection of theater, politics and social justice. Relevant areas of interest will include workers rights, anti-war protest, civil rights, HIV/AIDS, queer theater, gender-based violence and how theater is used in electoral politics and political movements throughout history. The course will have a special focus on Augusto Boal's Theater of the Oppressed and other contemporary performance work.", "name": "Topics in Theatre", "section": "26", "location": "Wirtz 240 Seminar Room 2", "topic": "Political Theatre", "course": "330-0", "meeting_time": ["Tu 3:00PM - 5:50PM"], "path": "/class-descriptions/4640/SoC/THEATRE/330-0/17750", "instructor": ["Bonnie S Metzgar"], "class_attributes": "", "id": "17750", "subject": "THEATRE"}, {"school": "SoC", "overview_of_class": "Stage Combat: Unarmed - An exploration and practical study of the illusion of hand-to-hand violence that is created for the stage in order to serve the story and its characters. The focus will be on how to create these physically demanding scenes while maintaining a high level of safety for the actors involved. Throughout the semester we will study various unarmed techniques and their adaptations for stage resulting in a complete fight between characters, experiment with developing original choreography, analyze examples of such choreography in media, and lay a foundation of understanding of actor's rights when such scenes appear in the rehearsal process. This class is ultimately an acting class and will be challenging students to push the boundaries of their work in order to present a scene that is believable under these extreme given circumstances.", "name": "Topics in Theatre", "section": "27", "location": "Wirtz Center STRUB", "topic": "Stage Combat", "course": "330-0", "meeting_time": ["Fr 9:00AM - 12:00PM"], "path": "/class-descriptions/4640/SoC/THEATRE/330-0/18655", "instructor": ["Britain James Willcock"], "class_attributes": "", "id": "18655", "subject": "THEATRE"}]