[{"class_mtg_info": [{"meet_t": "MoWe 9:30AM - 10:50AM", "meet_l": "Parkes Hall 212"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "10664", "title": "WCAS ASIAN_LC 290-0-22 Introductory Topics in Asian Languages and Cultures", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "10664", "instructors": [{"instructor_phone": "847/467-4746", "instructor_name": "Laura Rebecca Brueck", "instructor_addr": "1880 Campus Drive, Kresge Hall, Office 4-427"}], "topic": "India on Screen: Bollywood", "course": "290-0", "descriptions": [{"name": "Overview of class", "value": "This course explores the history, music, and narrative conventions of popular Hindi cinema in India, commonly referred to as &quot;Bollywood.&quot; Bollywood movies, readily identified by their song-and-dance sequences and &quot;masala&quot;-style mixing of filmic genres, are among the most avidly watched films in the world. Focusing on films that engage major historical and cultural moments in more than sixty years of modern Indian nationhood, we will explore why Bollywood-style storytelling is so effective as well as examine how these filmic narratives both reflect and shape the culture and society in which they are created."}, {"name": "Learning Objectives", "value": "You will become familiar with some of the most significant (for both critics and popular audiences) films of the post-independence era. You will also use these films as windows into postcolonial Indian culture and society, and through a chronological viewing, get a Bollywood-eye view of modern Indian history. Finally, and perhaps most significantly, you will learn to &quot;read&quot; and interpret these films as cultural and aesthetic texts and think about the ways in which they make meaning through storytelling, music, and spectacle."}, {"name": "Teaching Method", "value": "Lecture and discussion."}, {"name": "Evaluation Method", "value": "2 Take-home exams<br/>Quizzes<br/>Participation"}, {"name": "Class Materials (Required)", "value": "Coursepack."}], "lmod": "10/30/16 6:58 PM (CT)", "subject": "ASIAN_LC"}]