[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "University Hall 101"}], "school": "WCAS", "overview_of_class": "Employers routinely rank \"good communication\" as one of the most important capabilities for career success. How strong are your communication skills? How strategic are you in your use of communication to accomplish business goals? Professional Business Communication is a course that will challenge you to become a better writer, a better presenter, and a more strategic communicator.<br/>Professional Business Communication focuses on how to make effective communication decisions in a range of professional business settings.  The course provides a framework for analyzing the audience, goals, and situation; composing effective content; and delivering that content professionally and confidentlyboth in writing and orally.  Course cases and exercises focus on both informative and persuasive communication. A team-based, client-based project in the last half of the course focuses on social media communication.<br/>Instructor consent is required for registration. The course is most appropriate for juniors and seniorsand for sophomores who have some business or professional communication experience.", "qtr": "Winter 2016", "name": "Advanced Composition", "title": "WCAS ENGLISH 305-0-20 Advanced Composition", "lmod": "1/9/16 6:47 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "847/491-7690", "instructor_name": "Barbara L Shwom", "instructor_addr": "555 Clark St., 247"}], "topic": "Professional Business Comm", "course": "305-0", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "descriptions": [{"name": "Overview of class", "value": "Employers routinely rank &quot;good communication&quot; as one of the most important capabilities for career success. How strong are your communication skills? How strategic are you in your use of communication to accomplish business goals? Professional Business Communication is a course that will challenge you to become a better writer, a better presenter, and a more strategic communicator.<br/>Professional Business Communication focuses on how to make effective communication decisions in a range of professional business settings. The course provides a framework for analyzing the audience, goals, and situation; composing effective content; and delivering that content professionally and confidentlyboth in writing and orally. Course cases and exercises focus on both informative and persuasive communication. A team-based, client-based project in the last half of the course focuses on social media communication.<br/>Instructor consent is required for registration. The course is most appropriate for juniors and seniorsand for sophomores who have some business or professional communication experience."}, {"name": "Registration Requirements", "value": "Instructor Consent"}, {"name": "Class Notes", "value": "Registration for this course is not handled by the English department. Questions about this course should be directed to: The Cook Family Writing Program: writing-program@northwestern.edu"}], "path": "/class-descriptions/4610/WCAS/ENGLISH/305-0/23173", "instructor": ["Barbara L Shwom"], "class_attributes": "", "id": "23173", "subject": "ENGLISH"}]