[{"school": "SoC", "overview_of_class": "This course stages a series of dialogues between US black feminist theory and black queer theory through the discussion of such topics as: the legacy of slavery; activism; work, family and self-esteem; body politics, i.e., sexuality, reproduction, violence, HIV/AIDS, popular culture representations; appropriations and alliances.", "name": "Seminar: Problems in Performance Studies", "section": "20", "topic": "Theorizing Black Genders and Sexualities", "course": "515-0", "meeting_time": ["Th 2:00PM - 4:50PM"], "path": "/class-descriptions/4620/SoC/PERF_ST/515-0/31477", "instructor": ["Elondust   Johnson", "Kai Marshall Green"], "id": "31477", "subject": "PERF_ST"}, {"school": "SoC", "overview_of_class": "Performance Studies has historically privileged liveness, embodiment, and co-presence as objects of analysis, relegating technological mediation to a documentary, peripheral role. The categorical split between performance as live act and technological mediation as a memory of the event prevented a consideration of the generative aspects of technology in the event of performance. Today, digital media's processual workings not only challenge previous definitions of performance but invite attention to the ways in which digital and networked mediations enable embodied, site-specific, and relational performances. This course puts in dialogue theories of performance and digital media theories to understand how concepts that are central to studies of performance such as agency, embodiment, liveness, and spatiality are reconfigured by new media. We will be guided by the following questions: What is performance in digital space? How do digital media change performance? What does a performance studies lens contribute to digital media studies? What concepts manifest the interlocking between body-based performance and digital performativity? In order to engage with these questions, we will discuss critical readings and analyze case studies from sub-fields such as intermediality, tactical media, digital performance, and locative media art. Students are encouraged to complement their theoretical investigations with practical research using digital tools.", "name": "Seminar: Problems in Performance Studies", "section": "21", "topic": "Performance and Digital Media", "course": "515-0", "meeting_time": ["We 2:00PM - 4:50PM"], "path": "/class-descriptions/4620/SoC/PERF_ST/515-0/31478", "instructor": ["Marcela Alejandra Fuentes"], "id": "31478", "subject": "PERF_ST"}]