[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "Technological Institute LG62"}], "school": "WCAS", "overview_of_class": "World War II was clearly the most important single event of the twentieth century. However, the seeds for World War II were laid in World War I, making it necessary to study both wars. We will study both why these wars occurred and why they turned out the way they did. In asking why wars turned out the way they did, we will emphasize the size and performance of the economies involved, and such issues as why the U.S. and Soviet Union produced so much while Germany produced so little. In the last part of the course, students will have a chance to do independent research on any aspect of World War II which interests them, economic, political or military.", "qtr": "Winter 2016", "name": "First-Year Seminar", "title": "WCAS ECON 101-6-20 First-Year Seminar", "lmod": "1/9/16 6:46 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Robert J Gordon", "instructor_addr": ""}], "topic": "Did Economics Win Two World Wars?", "course": "101-6", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "descriptions": [{"name": "Overview of class", "value": "World War II was clearly the most important single event of the twentieth century. However, the seeds for World War II were laid in World War I, making it necessary to study both wars. We will study both why these wars occurred and why they turned out the way they did. In asking why wars turned out the way they did, we will emphasize the size and performance of the economies involved, and such issues as why the U.S. and Soviet Union produced so much while Germany produced so little. In the last part of the course, students will have a chance to do independent research on any aspect of World War II which interests them, economic, political or military."}, {"name": "Registration Requirements", "value": "none."}, {"name": "Teaching Method", "value": "In class discussion of readings. Students will be encouraged to disagree with each other and with the readings as their knowledge of the subject develops. Active class participation is important and counts for 30 percent of the grade."}, {"name": "Evaluation Method", "value": "There are no exams. The class grade will be based primarily on written papers, but 30% of the total grade will be based on the quality and quantity of participation in class discussion. There will be three 5-page papers, and one final paper of up to 15 pages, including at least one original table or graph. Papers will be worth a total of 70% of the final grade."}, {"name": "Class Materials (Required)", "value": "Most of the reading is available online through the library. In addition there is an inexpensive course packet with some of the readings. The one required book for purchase:<br/><i>Why the Allies Won by Overy</i>, 1997 (ISBN: 978-0393316193)"}, {"name": "Class Notes", "value": "I am a senior professor with active ongoing research in macroeconomics, ranging from inflation and unemployment to long-term growth and disputes about macroeconomic theory. I also am writing a book about the history of the American standard of living. Military history is a hobby, as is second-guessing airline management through a private e-mail chat group that I founded more than 15 years ago."}], "path": "/class-descriptions/4610/WCAS/ECON/101-6/21163", "instructor": ["Robert J Gordon"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "21163", "subject": "ECON"}]