[{"class_mtg_info": [{"meet_t": "TuTh 9:00AM - 11:50AM", "meet_l": "Louis Hall 106"}], "school": "SoC", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Winter 2017", "name": "24573", "title": "SoC RTVF 552-0-20 Narrative Techniques", "class_attributes": "", "section": "24573", "instructors": [{"instructor_phone": "", "instructor_name": "Kyle Richard Henry", "instructor_addr": ""}], "topic": "", "course": "552-0", "descriptions": [{"name": "Overview of class", "value": "Kyle Henry<br/>Winter 2017 Classes<br/><br/>RTVF 552 Documentary Media: Narrative Techniques<br/><br/>Overview<br/><br/>This course is designed to introduce students to narrative fiction production and post-production concepts that may be applied to documentary practice. The class will entail lecture/discussion, project assignments, and labs. Students will gain a working knowledge of how many documentary and narrative fiction film directors derive stories from actuality. Techniques covered will include: reenactment (interview illustration); collaborative observation (improvisation with actors) and adaptation (inspiration from archival research). In addition, students will become acquainted with essential communication and group dynamic skills that will enable them to complete highly collaborative thesis projects. Emphasis will be placed on developing your voice as a storyteller and creating works characterized by simple yet effective visual, aural and narrative structural elements.<br/><br/>Evaluation Method<br/><br/>Students will be graded on three individual projects, all produced in small collaborative working groups, plus attendance/participation.<br/><br/>Class Materials<br/><br/>- Mac formatted hard drive (USB 3 and/or Thunderbolt, spindle speed 7200 rpm, suggested at least 2 TB, any brand/vendor). For example: G-Tech G-Drive Gen5, 2TB, USB 3.0/FireWire 800, 0G02529<br/><br/>- RTVF studio lab deposit ($100) + studio key deposit ($50), both refundable at end of quarter or at graduation from program"}], "lmod": "12/29/16 6:47 PM (CT)", "subject": "RTVF"}]