[{"class_mtg_info": [{"meet_t": "MoWe 10:30AM - 11:50AM", "meet_l": "Annie May Swift Hall 219"}], "school": "SoC", "enrl_requirement": "", "qtr": "Spring 2016", "name": "31679", "title": "SoC RTVF 398-0-21 Symposium: Issues in RTVF", "class_attributes": "", "section": "31679", "instructors": [{"instructor_phone": "", "instructor_name": "Neil Kanwar Harish Verma", "instructor_addr": ""}], "topic": "Radio Drama, Classic to Contemporary", "course": "398-0", "descriptions": [{"name": "Overview of class", "value": "This course will introduce students to masterpieces of an art form that's long been forgotten, but is in the midst of a sparkling rebirth: radio drama. In the middle decades of the 20th century, radio plays were among the most popular forms of fiction in many parts of the world. Legends have come down about thrillers of the 1930s, but these remain poorly understood, and are not representative of the broad work of experimental writers in the medium. In this class you will learn how radio dramas were made in three historical periods: classic American (1937-54); mid-century British (1954-1974) and contemporary global traditions. We will explore the cultural and political background of each of these contexts, practice how to &quot;read&quot; a radio play, and even do some dramatic radio writing. Some radio dramatists we will consider include: Samuel Beckett, Neil Gaiman, Dylan Thomas, Langston Hughes, Orson Welles, Lucille Fletcher, Anna Friz, Tom Stoppard, Gregory Whitehead, Ray Bradbury, and Harold Pinter. There are no pre-requisites. Students with a background or interest in media history, podcasts, creative writing, theatre history, performance, voice studies or literature are especially welcome."}, {"name": "Evaluation Method", "value": "Each class requires active class participation. There will be three major assignments, one that takes the form of a review, another that takes the form of a research essay, and one that takes the form of a short script or recording."}, {"name": "Class Materials (Required)", "value": "Sharon Mazzarella ed. 20 Questions About Youth and The Media (Lang 2007)<br/> <br/>Reading Pack (available at Quartet Copies)."}, {"name": "Class Materials (Suggested)", "value": "To be decided. 2/3 of the preparation for this class will take the form of listening."}], "lmod": "4/3/16 7:23 PM (CT)", "subject": "RTVF"}]