[{"school": "WCAS", "overview_of_class": "This course aims at introducing students to the political and social history of the modern Arabian Peninsula, which is an oft-neglected but pivotal region of the Middle East. Saudi Arabia?perhaps the most important country in the Arab world today?will receive particular attention, but the course will also cover Yemen, the Sultanate of Oman and the smaller states of the Persian Gulf (Kuwait, Bahrain, Qatar, and the United Arab Emirates). Moreover, the lectures will address a number of issues that have transnational significance, including: the Saudi conquests since the late 18th century; European colonialism in the Arabian Peninsula; tribalism and state formation; the discovery of oil and its impact; political economy; the \"Arab Cold War;\" civil strife and guerilla movements; the nature of political regimes in the region; religious activism; violence and delinquency, and the prospects for federalism and monetary union.", "name": "New Lectures in History", "section": "22", "location": "University Hall 102", "topic": "The Arabian Peninsula Since the 18th Century", "course": "300-0", "meeting_time": ["MoWeFr 1:00PM - 1:50PM"], "path": "/class-descriptions/4650/WCAS/HISTORY/300-0/25668", "instructor": ["Henri   Lauziere"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "25668", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "This course is an introduction to the history of modern Southeast Asia, from the middle of the eighteenth century to the end of the Second World War. The region comprises eleven modern nation-states: its history can seem like a bewildering parade of princes, plenipotentiaries, presidents, and prime ministers. This course focuses, therefore, on the economic and social changes that have spanned the region in the past two hundred and fifty years. Topics include pre-colonial social structures and their relationship to patterns of economic activity; Southeast Asians' responses to the challenges and opportunities of their region's integration with new markets during the era of \"high colonialism\"; peasant rebellions and the birth of communism; urbanization and religious change; and the social transformations that followed from depression and war in the middle of the twentieth century.", "name": "New Lectures in History", "section": "24", "location": "University Hall 101", "topic": "Modern Southeast Asia", "course": "300-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4650/WCAS/HISTORY/300-0/25669", "instructor": ["Haydon Leslie Cherry"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "25669", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "The course first traces the events and causes which led to the rise of Zionism, the Jewish national movement in Europe. It explores the ideological thought of the founding fathers and summarizes the political platforms of the main currents in the Zionist movement. It then proceeds to discuss the implementations of the Zionist ideology, namely, the immigration to Palestine and the development of a Jewish national community (Yishuv) there. The next part deals with Britain's promises to the Jews and the Arabs and the establishment of the British Mandate in Palestine. It then details the strategies of the Yishuv's nation-building process in the 1920's and the 1930's in the educational, cultural, economic, social and political spheres. Special emphasis is laid on the land question. Concurrently, the course focuses on the origins of the Israeli-Arab conflict since the 1920's, surveying its ideological roots and violent confrontational aspects. The latter part of the course discusses the impact of the Second World War and the Holocaust, the United Nation's attempts to resolve the dispute and the UN 1947 Resolution to partition Palestine.", "name": "New Lectures in History", "section": "26", "location": "Harris Hall L06", "topic": "Historical Background to the est. of Israel", "course": "300-0", "meeting_time": ["MoWe 9:30AM - 10:50AM"], "path": "/class-descriptions/4650/WCAS/HISTORY/300-0/25676", "instructor": ["Elie   Rekhess"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "25676", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "This course examines the historical significance of popular music in the United States from the mid-nineteenth century to the present. No musical training is necessary to enroll in the course, however we will think about how to analyze musical sound as historical \"text.\" We will also focus on the cultural, social, political, and economic dimensions (the \"context\") of genres ranging from Tin Pan Alley to blues, jazz, rhythm and blues, country, folk, soul, rock, disco, hip-hop, and classical. We will explore popular music as an art form, a business, an activity of identity-making, a phenomenon encompassing both conflict and consensus, and a key area in the life of Americans. Students are expected to attend lectures, discussion sections, and complete all reading, listening, and viewing assignments. Writing about popular music history is a key aspect of the class: there will be three essays that ask students to use, respectively, a song, a performer, and a genre to analyze how popular music has shaped the broader cultural history of the US.", "name": "New Lectures in History", "section": "28", "location": "Harris Hall 107", "topic": "U.S. Popular Music History", "course": "300-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4650/WCAS/HISTORY/300-0/25677", "instructor": ["Michael J Kramer"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "25677", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "Examining topics as varied as witchcraft, backwoods preachers, and Tijuana folk saints, we will discuss how local actors worked out the boundaries of religious orthodoxy with state and ecclesiastical authorities in Latin America, ca. 16th century to the present. Along the way, we will also investigate the religious roots of our current conceptions of race and gender. Classes will consist of brief lectures and ample time for (semi-)directed discussions.", "name": "New Lectures in History", "section": "30", "location": "Harris Hall L06", "topic": "Religion and Deviance in Latin America", "course": "300-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4650/WCAS/HISTORY/300-0/25684", "instructor": ["Keith Aaron Van Oosterhout"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "25684", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "Police shootings, protest, and violence have caused arguments on both sides of the political aisle and African Americans are at the heart of this discourse. This course seeks to put this debate over policing, law and order, and black lives into historical perspective. Beginning in the 1930s, students will examine the development of heroin in American cities and lynch laws in the segregated south before moving into the postwar era, when federal housing policies reinforced segregation in America's industrial core. Moving through the 1960s and 1970s, students will analyze the politics of \"law and order,\" exploring the ways in which the \"war on drugs\" and the mass media shaped episodes like the Attica Prison Riot, urban rebellions, and the anti-gang policing crackdown that escalated in the 1980s. It will end in the present era, a time when over 500,000 people remain incarcerated for non-violent drug offenses, and two-thirds of these are African American or Latino. By the end of the course, students will understand how incarceration, stop and frisk, and violent law enforcement encounters shape modern debates about prisons and have fueled a growing movement for African American racial justice. The course will draw on historical analyses, primary documents, documentaries, and popular television shows to trace African Americans' complex relationship to policing, crime, and the criminal justice system.", "name": "New Lectures in History", "section": "32", "location": "Harris Hall L06", "topic": "African Americans, Police, and Prisons in the 20th", "course": "300-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4650/WCAS/HISTORY/300-0/25673", "instructor": ["Ashley Campbell Johnson"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "25673", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "This course will explore the ways that soccer was shaped by and has helped shape global political, social, and cultural history since 1850. Emerging at that time in the private schools of upper class England, soccer quickly spread across the globe following patterns of trade, colonization, and war. As soon as it appeared, the game became enmeshed in debates about race, class, ethnicity, gender, and political and social economy. This entrenchment carries through to today and provides a rich field for historical inquiry.", "name": "New Lectures in History", "section": "34", "location": "Locy Hall 111", "topic": "Soccer as Global History", "course": "300-0", "meeting_time": ["MoWe 9:30AM - 10:50AM"], "path": "/class-descriptions/4650/WCAS/HISTORY/300-0/25674", "instructor": ["Keith Allen Rathbone"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "25674", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "This course deals with the important but often misunderstood relationship between Jews and Muslims in the milieu of the Islamic Middle Ages. Focus will be on cross-cultural and political relations. Among the subjects discussed: The formation of Muslim attitudes towards the Jews and Judaism; the social and political condition of minorities in medieval Islamic lands; the cultural symbiosis that characterized Jewish-Muslim relations at the time; and the manner in which Jewish creativity in that milieu affected the development of modern Judaism.", "name": "New Lectures in History", "section": "36", "location": "Harris Hall L28", "topic": "Jews & Muslims in the Islamic Middle Age", "course": "300-0", "meeting_time": ["We 4:00PM - 6:50PM"], "path": "/class-descriptions/4650/WCAS/HISTORY/300-0/25902", "instructor": ["Jacob   Lassner"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "25902", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "This course examines the recent history of U.S.-Latin American relations through the lens of<br/>dance, starting with the 1898 U.S. intervention in the Cuban war of independence against Spain<br/>and moving through present day. This history has been filled with intimacy, fascination, and<br/>integration, on the one hand, and estrangement, exploitation, and misunderstanding, on the other.<br/>Dancing bodies both reflected and shaped the complex relationship between the United States<br/>and Latin America. Weekly readings include primary documents, secondary sources, and<br/>audiovisual materials featuring famous professionals in grand theatres and in films, social<br/>dancers in clubs, ethnographers moving between and among dancing faithful, frolicking Disney<br/>cartoons, and Latin American dancers in Chicago.<br/><br/>We examine the dancing relationship between the United States and Latin America in three<br/>units. Part I considers the cross border lives of famous dancers that united the Americas as a<br/>singular, transnational stage. We ask how their performances destabilized asymmetries of power<br/>within the region. For Part II, we analyze emerging definitions of modernism that fuelled<br/>choreographic and ethnographic activities in the hemisphere. We interrogate how shared interests<br/>and imaginings of the \"modern\" simultaneously challenged and reinscribed hierarchies within<br/>and between societies. Finally, in Part III, we focus on Cuban concert dance, as a telling example<br/>of the bonds and divides that resulted from a fraught relationship with the U.S.?forged by<br/>neocolonialism, Cold War clashes, and most recently, reconciliation. We close the unit by<br/>sharing oral history projects about Latin American dancers in Chicago and seeing a Cuban<br/>modern dance company perform to understand the dynamics of dance dialogues between the<br/>U.S. and Latin America in the present.", "name": "New Lectures in History", "section": "38", "location": "University Library Video Theat", "topic": "Hemispheric Moves: Dancing US-Latin American Relat", "course": "300-0", "meeting_time": ["MoWe 9:30AM - 10:50AM"], "path": "/class-descriptions/4650/WCAS/HISTORY/300-0/27618", "instructor": ["Elizabeth Bowlsby Schwall"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "27618", "subject": "HISTORY"}]