[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "University Hall 101"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "11976", "title": "WCAS ENGLISH 359-0-20 Studies in Victorian Literature", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "11976", "instructors": [{"instructor_phone": "847/491-7475", "instructor_name": "Christopher   Lane", "instructor_addr": "University Hall Room 206"}], "topic": "Thomas Hardy: Distance &amp; Desire", "course": "359-0", "descriptions": [{"name": "Overview of class", "value": "This course examines the major works of an exceptional nineteenth-century novelist and poet. One of the first English writers to experiment with impressionist ideas and techniques, and a key contributor to naturalism, Hardy helped to fashion a distinctly &quot;modern&quot; narrative while advocating progressive social reform. We will study how his fiction challenged the limits of Victorian culture, voicing tensions that brought his novels to the brink of censorship. We will also pair those works with remarkable poems by him that make powerful claims about time, repetition, intimacy, doubt, and belief. In this way, we'll follow how his fiction tried to educate late-Victorian readers in new ways of perceiving and thinking about themselves, their environment, their shared history, and the world."}, {"name": "Teaching Method", "value": "Seminar-style discussion."}, {"name": "Evaluation Method", "value": "Canvas posts, one short analytical paper, a final essay, and in-class participation."}, {"name": "Class Materials (Required)", "value": "Thomas Hardy, The Mayor of Casterbridge (ISBN 0141439785); The Woodlanders (ISBN 0140435476); Tess of the d'Urbervilles (ISBN 0141439599); Jude the Obscure (ISBN 0140435387); and Selected Poems (ISBN 0460874586). Copies will be available at the Norris Center Bookstore; please acquire new or used copies of the above editions."}], "lmod": "10/30/16 7:04 PM (CT)", "subject": "ENGLISH"}]