[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Fisk Hall 217"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "23969", "title": "WCAS SOCIOL 211-0-20 Food &amp; Society: An Introduction", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "23969", "instructors": [{"instructor_phone": "", "instructor_name": "Susan L Thistle", "instructor_addr": ""}], "topic": "", "course": "211-0", "descriptions": [{"name": "Overview of class", "value": "This course provides an introduction to thinking about food from a sociological perspective. We will gain an initial understanding of how different social forces have shaped and continue to shape the way we grow, distribute and consume food, both in the United States and elsewhere around the world. We will look at the role played by culture and politics, as well as economics, in shaping our past and present food system. At the same time we will gain an initial understanding of concepts central to sociology, such as the social construction of seemingly natural choices involving the food we eat, or how social inequality affects such choices. Through looking at the issue of food, we will also become acquainted with different areas in sociology, such as the sociology of health and medicine, and development and globalization."}, {"name": "Registration Requirements", "value": "During preregistration this course is only open to Sociology Majors &amp; Minors. <br/>This course is open to all students during regular registration starting November 16, 2015."}, {"name": "Class Materials (Required)", "value": "Tentative reading list: Course readings will consist of a reader containing selections from such books as Pollan, &quot;Omnivore's Dilemma&quot;; Guptill, Copelton and Lucal, &quot;Food and Society&quot;; Robbins, Hintz and Moore, &quot;Environment and Society&quot;; and Bittman, &quot;Food Matters.&quot;"}], "lmod": "1/9/16 6:53 PM (CT)", "subject": "SOCIOL"}]