[{"class_mtg_info": [{"meet_t": "Mo 6:00PM - 9:00PM", "meet_l": "University Hall 102"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "21940", "title": "WCAS GBL_HLTH 390-0-21 Special Topics in Global Health", "class_attributes": "No Freshmen<br/><br/>", "section": "21940", "instructors": [{"instructor_phone": "847/467-1580", "instructor_name": "Michael W Diamond", "instructor_addr": ""}], "topic": "Managing Global Health Challenges", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "Disease knows no borders. Both pathogens and lifestyles move around the world and the people of every country share the risks. The responsibility for ensuring the public health rests with governments at local, national and international levels. Public health interventions require cooperation and partnerships at each level and with civil society organizations, corporations, businesses and individuals. Advances in technology can significantly reduce the burden of disease and improve the quality of health and life. To effectively address global health challenges, technology must be integrated into health systems in ways that are both appropriate and sustainable. These interventions are affected by public policies, availability of resources and theories of public health and disease. Existing health organizations are increasingly challenged by the scope and magnitude of the current and future threats to public health such as the AIDS pandemic; the emergence of new and more virulent infectious diseases; the threats of bio-terrorism; growing resistance to antibiotics; lack of basic infrastructure of water, sanitation and inadequate access to drugs in developing countries; and overabundance of foods and complications from affluence, leading to health problems such as diabetes in higher income countries. <br/>This course will examine the global epidemiology of these diseases and threats to the populations of the world, and the current technological and organizational strategies that have been established to respond. A series of diseases and geographical regions will be analyzed to consider how the international community uses technology and organizes its response to current problems in global public health. Special attention will be given to examples of effective technologies and intervention strategies."}, {"name": "Registration Requirements", "value": "No freshmen allowed. Pre-registration for Global Health Studies Minors only. Registration open to other students after pre-registration."}, {"name": "Class Notes", "value": "No freshmen allowed. Pre-registration for Global Health Studies Minors only. Registration open to other students after pre-registration."}], "lmod": "12/24/16 6:58 PM (CT)", "subject": "GBL_HLTH"}]