[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Annenberg Hall G29"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "34132", "title": "WCAS POLI_SCI 390-0-22 Special Topics in Political Science", "class_attributes": "", "section": "34132", "instructors": [{"instructor_phone": "847/467-1148", "instructor_name": "Jason W Seawright", "instructor_addr": ""}], "topic": "Inequality &amp; Representation", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "Prof.Seawright, &quot;Inequality and Representation&quot; Spring 2016<br/>Political debate is filled with vital demands about inequality. We hear about the political and economic advantages of the one percent, about police brutality and indifference toward African Americans, about proposals to ban Muslim immigrants, and more. These concerns are at the center of political life, and are vital to contemporary political science.<br/><br/>In this seminar, we will analyze inequality inequality as a global phenomenon. We will look at the kinds of explanations that people give for the existence of inequality and the ways those explanations shape politics. We will study the ways that unequal resources lead to unequal political voice, and the ways in which unequal voice can reinforce societal inequality. In all of this, we will consider cross-national comparisons as a way of understanding which patterns of inequality are hard to change, and also which strategies have been most successful in creating equality."}, {"name": "Learning Objectives", "value": "By the end of the course, students will be able to explain the dynamics by which social inequality produces political inequality; the political consequences of popular explanations of inequality; and the existing examples of how to overcome inequality. They will be able to explain the ways in which inequality is unusual in America and the ways in which American inequality fits broad global patterns."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Short papers throughout the term."}, {"name": "Class Materials (Required)", "value": "Larry M. Bartels, Princeton University Press, Unequal Democracy: The Political Economy of the New Gilded Age, 2010, 978-0691146232.<br/><br/>Paul Frymer, Princeton University Press, Uneasy Alliances: Race and Party Competition in America, 1999, 978-0691148014.<br/><br/>Javier Auyero and María Fernanda Berti, Princeton University Press, In Harm's Way: The Dynamics of Urban Violence, 2015, 978-0691164779.<br/><br/>Evelyne Huber and John D. Stephens, University of Chicago Press, Democracy and the Left: Social Policy and Inequality in Latin America, 2012, 978-0226356532."}], "lmod": "4/3/16 8:17 PM (CT)", "subject": "POLI_SCI"}]