[{"class_mtg_info": [{"meet_t": "TuTh 4:00PM - 5:20PM", "meet_l": "Annenberg Hall 101"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Winter 2017", "name": "20571", "title": "WCAS LING 380-0-22 Spoken English for Non-Native Speakers", "class_attributes": "", "section": "20571", "instructors": [{"instructor_phone": "", "instructor_name": "Julia Margaret Moore", "instructor_addr": ""}, {"instructor_phone": "847/467-7092", "instructor_name": "Erin M. Leddon", "instructor_addr": "2016 Sheridan Rd, Rm. 305"}], "topic": "Integrated Academic Skills", "course": "380-0", "descriptions": [{"name": "Overview of class", "value": "This course is focused on fluency and comprehensibility in conversation in both informal and academic settings. It is designed to help students develop and refine their English conversation, discussion, and discourse skills. While some attention will be given to American English intonation, word stress, and pronunciation, the primary purpose of this class is to explore functions of American English important for fluency in conversational speech. This will help improve your performance on tasks and activities involving spoken English, such as oral proficiency exams, presentations, teaching, and day-to-day social interactions. Active participation and evidence of progress towards proficiency must be demonstrated in order to achieve a satisfactory grade in the course."}, {"name": "Registration Requirements", "value": "Instructor consent required"}, {"name": "Learning Objectives", "value": "By the end of this course, students will be able to: <br/><br/>1. Identify personal strengths and weaknesses in their communicative competence in American English (i.e., e.g., linguistic competence, sociolinguistic competence, discourse competence, functional competence, and strategic competence) from the use of data from self-assessments and instructor feedback.<br/>2. Communicate effectively in a variety of settings and situations, including casual and formal conversations; academic talks; persuasive speeches; group discussions; and discussions about controversial issues. <br/>3. Utilize various linguistic and functional skills required for clear and effective communication across these modalities, e.g., conversational turn-taking skills; appropriate use of focus and emphasis in discourse; strategies for responding to questions.<br/>4. Identify and employ different strategies needed for successful communication in different situations, e.g., understanding differences between formal and casual register and terms of address; appropriate use of colloquialisms, euphemisms, and idioms depending on the audience.<br/>5. Express themselves in American English more comfortably and confidently.<br/>6. Show demonstrable progress toward proficiency in using English for conversational purposes."}, {"name": "Teaching Method", "value": "Lecture, discussion, small group activities, peer feedback, and homework"}, {"name": "Evaluation Method", "value": "You are expected to complete regular readings and assignments each week. The concepts introduced in these readings and assignments will form the basis for classroom work, so it is important that you complete them in advance of the class for which they are assigned. You will also be assessed on attendance and participation."}, {"name": "Class Materials (Required)", "value": "Class materials will be available online."}, {"name": "Class Notes", "value": "Class notes (what else you would like the student to know about this class)<br/>Students must complete an online form from English Language Programs in order to be eligible for the class and obtain a permission number. Contact elp@northwestern.edu for specific registration instructions."}], "lmod": "12/24/16 7:03 PM (CT)", "subject": "LING"}]