[{"class_mtg_info": [{"meet_t": "Th 01:30PM - 04:20PM (AST)", "meet_l": "Qatar Studio Building 012"}], "school": "DOHA", "enrl_requirement": "Enrollment Requirements: Registration is reserved for NU Qatar Juniors and Seniors Only<br/>Add Consent: Instructor Consent Required<br/>Drop Consent: Department Consent Required<br/>", "qtr": "Spring 2016", "name": "30535", "title": "DOHA MIT 398-0-72 Undergraduate Seminar", "class_attributes": "", "section": "30535", "instructors": [{"instructor_phone": "", "instructor_name": "Joseph F Khalil", "instructor_addr": ""}], "topic": "TV Role Models for Arab Youth", "course": "398-0", "descriptions": [{"name": "Overview of class", "value": "<p>Communication research and practice is an ideal discipline where an immersive-learning/teaching model can be implemented using real world applications. The primary goal of this course is for students to work collaboratively to investigate the development of children and youth role models on Arab television. Students will acquire an understanding of children and youth television production contexts and then act as a research/production team developing, planning, producing and disseminating their work. As a &quot;capstone&quot; course, students are expected to put into practice their conceptual, research and production skills. After conducting research with television practitioners, students are expected to collaborate on academic paper(s) and produce documentary &quot;vignettes.&quot; The course will comprise: discussions, workshops, and field productions.</p>"}, {"name": "Registration Requirements", "value": "<ul><br/><li>Prerequisites: None</li><br/><li>Juniors and above</li><br/><li>Open for cross-registration</li><br/><li>Knowledge of Arabic at an intermediate level is required</li><br/><li>All course participants must be CITI certified to conduct social and behavioral research prior to the first day of class</li><br/><li>Consent of instructor required</li><br/><li>Satisfies Middle Eastern Studies Certificate</li><br/></ul>"}], "lmod": "4/3/16 7:15 PM (CT)", "subject": "MIT"}]