[{"school": "WCAS", "overview_of_class": "Among the common and recurring associations with Latin America is the violence that underlies all phases of its history, particularly the history of its cities. We will investigate manifestations of this connection from different moments in Latin American history, with a focus on the present moment. We will also examine the border city as the site of complex symbolic and literal crossings. Through a corpus that includes fictional and theoretical texts, films, videos, music, cartoons, and the visual arts, we will reflect on the variations, components, and implications of this urban, violent projection.", "name": "Topics in Latin American, Latina and Latino, and/or Iberian Cultures", "section": "1", "topic": "Citizenship and Urban Violence in Latin America", "course": "395-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4610/WCAS/SPANISH/395-0/24035", "instructor": ["Nathalie   Bouzaglou"], "id": "24035", "subject": "SPANISH"}, {"school": "WCAS", "overview_of_class": "This course offers an introduction to science fiction literature and film produced in Latin America and by Latina/o writers in the United States.  Beginning with a critical definition of the genre (and the ways in which it differs from &quot;magical realism&quot; and the fantastic), we will examine some early examples of science fiction in Spanish language literature, read some now-classic texts that can be considered science fiction, trace the shift from science fiction to cyberpunk, and end by looking at the ways in which recent Latin American and Latina/o writers and directors have expanded on and experimented with the genre.  As we read, we will explore how science fiction navigates the divide between &quot;popular&quot; and &quot;elite&quot; literature, its function as a form of social criticism, and the ways in which writers have used science fiction to interrogate social categories such as race, class, and gender. Readings will include the work of authors such as Eduardo Holmberg, Eduardo Urzaiz, Adolfo Bioy Casares, Jorge Luis Borges, Juan José Arreola, Angélica Gorodischer, Pedro Cabiya, and Sesshu Foster.", "name": "Topics in Latin American, Latina and Latino, and/or Iberian Cultures", "section": "2", "topic": "Latin American and Latina/o Science Fiction", "course": "395-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4610/WCAS/SPANISH/395-0/24036", "instructor": ["Emily A Maguire"], "id": "24036", "subject": "SPANISH"}]