[{"class_mtg_info": [{"meet_t": "Tu 9:30AM - 12:30PM", "meet_l": "Harris Hall L40"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Graduate Students.", "qtr": "Winter 2017", "name": "22110", "title": "WCAS HISTORY 492-0-22 Topics in History", "class_attributes": "Graduate Students Only<br/><br/>", "section": "22110", "instructors": [{"instructor_phone": "847/467-3979", "instructor_name": "Michael J. Allen", "instructor_addr": "Harris Hall - Room 342"}], "topic": "New Political History of the U.S.", "course": "492-0", "descriptions": [{"name": "Overview of class", "value": "After a generation of relative neglect, political history has enjoyed a renaissance in recent decades, profitably combining elements of the social and cultural history that once pushed it aside with its more customary concerns with state power and policy to forge a new political history. Such work looks beyond the formal political process and traditional political class to expand our notion of what politics is and how and where it happens. This course will introduce graduate students to some of the best new political history of the United States to chart the field's evolution, insights, and parameters, and seek its future directions. The course seeks chronological, topical, and theoretical diversity, but focuses on twentieth-century history to provide depth and texture."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Class participationPapers"}, {"name": "Class Materials (Required)", "value": "***Tentative until posted to Norris website***<br/>Martha Biondi. To Stand and Fight: The Struggle for Civil Rights in Postwar New York City. 9780674019829. <br/>Margot Canaday. The Straight State: Sexuality and Citizenship in Twentieth-Century America. 9780691149936. <br/>Eric Foner. Free Soil, Free Labor, Free Men: The Ideology of the Republican Party Before the Civil War. 9780195094978. <br/>Gary Gerstle. Liberty and Coercion: The Paradox of American Government from the Founding to the Present. 9780691162942.<br/>Meg Jacobs. Pocketbook Politics: Economic Citizenship in Twentieth-Century America. 9780691130415.<br/>Ira Katznelson. Fear Itself: The New Deal and the Origin of Our Time. 9780871407382.<br/>Nancy MacLean. Behind the Mask of Chivalry: The Making of the Second Ku Klux Klan. 9780195098365.<br/>Robert Self. All In The Family: The Realignment of American Democracy Since the 1960s. 9780809095025. <br/>James Sparrow. William Novak, and Stephen Sawyer, Boundaries of the State in US History. 9780226277646."}, {"name": "Class Notes", "value": "AREA OF CONCENTRATION: Americas"}], "lmod": "12/24/16 7:02 PM (CT)", "subject": "HISTORY"}]