[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "Harris Hall L28"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "32526", "title": "WCAS ASIAN_LC 390-0-22 Advanced Topics in Asian Languages and Cultures", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "32526", "instructors": [{"instructor_phone": "", "instructor_name": "Anne Elizabeth Rebull", "instructor_addr": "Kresge Hall, 1880 Campus Drive, 4-520"}], "topic": "Vernacular Practice in Modern China", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "Socialist zombies. Underground literature. Queer porn. Dancing grannies. The vernacular is so much more than ?the common language.' But what does it do to invoke the vernacular as a mode of practice? If the ?vernacular' invokes the everyday, the common and the low, it also is an avenue to the edges of standardization, places that are commonly suppressed, overlooked, or marginalized?places that offer the potential for resistance. But resistance to what exactly? And how does a resistant vernacular practice keep from becoming another voice in cosmopolitan mainstream? What exactly is meant when the vernacular is politicized, moralized, or intellectualized? This course will consider how and to what extent the vernacular offers new perspectives and possibilities to our understanding of everyday systems of power through its modes as language, aesthetic, and literary, cultural and political practice. In addition to the topics above, we will examine vernacular practices throughout the twentieth century to the present day, from the vernacular literature movement in the beginning of the Republican era, to cabaret culture, to street theater, to independent film, to craftivism, to internet literature today."}, {"name": "Learning Objectives", "value": "? Engage with the emerging field of studies of the vernacular by considering a variety of practices chosen for their identification with different definitions of the ?vernacular' <br/>? Establish a network of ideas around the vernacular in relation to systems of power<br/>? Become familiar with a wide-ranging variety of activities, art forms, and literature throughout the modern to contemporary periods, and how they might be politicized<br/>? Develop the research skills necessary to the composition of a longer research paper"}, {"name": "Teaching Method", "value": "discussion-based seminar"}, {"name": "Evaluation Method", "value": "Final paper 40%<br/>Midterm Paper 25%<br/>Weekly Responses 10%<br/>Presentation 10%<br/>Participation 15%"}, {"name": "Class Materials (Required)", "value": "1. Lijia Zhang, &quot;Socialism is Great!&quot;: A Worker's Memoir of the New China. New York: Atlas and Co., 2008.<br/>2. Ou Ning, San Yuan Li (2008) - available to stream through amazon.com"}, {"name": "Class Materials (Suggested)", "value": "Bei Tong, Scott Myers (trans.), Beijing Comrades. New York: The Feminist Press, 2016."}], "lmod": "2/20/17 6:43 PM (CT)", "subject": "ASIAN_LC"}]