[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "Technological Institute L158"}], "school": "MEAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "30582", "title": "MEAS BMD_ENG 475-0-20 Cardiovascular Biology &amp; Engineering", "class_attributes": "", "section": "30582", "instructors": [{"instructor_phone": "", "instructor_name": "Shu Qian   Liu", "instructor_addr": ""}], "topic": "", "course": "475-0", "descriptions": [{"name": "Overview of class", "value": "Molecular basis of cardiovascular development, performance, and pathogenesis; engineering analysis of cardiovascular functions; and fundamentals of cardiovascular engineering and regeneration.<br/><br/>This course addresses the molecular basis of cardiovascular development and pathogenesis, engineering analysis of cardiovascular function, and fundamentals of cardiovascular regeneration and engineering.<br/><br/>This course is designed for graduate students."}, {"name": "Learning Objectives", "value": "Part I: Introduction to the cardiovascular system<br/><br/> Cardiac physiology and pathophysiology<br/> Vascular cell function<br/><br/>Part II: Cardiovascular development<br/><br/> Cardiovascular stem cells and morphogenesis<br/> Myocardial regeneration<br/><br/>Part III: Regulatory mechanisms of cell regeneration<br/><br/> General mechanisms of cell signaling<br/> Cytokine biology<br/> Receptor and Non-receptor protein tyrosine kinase-mediated cell signaling<br/> Protein phosphatase-mediated cell signaling<br/> G-protein receptor-mediated cell signaling<br/> Cytokine-JAK-STAT-mediated cell signaling<br/> NF?B-mediated cell signaling<br/> Cell proliferation and differentiation<br/> Cell apoptosis<br/><br/>Part IV: Mechanical aspects of cardiovascular adaptation and pathogenesis<br/><br/> Solid stress and strain analysis in the vascular system<br/> Fluid shear stress and strain rate analysis in the vascular system<br/> Hypertension and the role of mechanical stretch in regulating cardiovascular adaptation and pathogenesis<br/> Atherogenesis and the role of blood shear stress in regulating vascular adaptation and pathogenesis<br/><br/>Part V: Labs and design project<br/><br/> Lab 1: Detection of smooth muscle actin filaments<br/> Lab 2: Cell proliferation<br/> Lab 3: Cell apoptosis<br/> Design project presentation"}, {"name": "Class Materials (Required)", "value": "Shu Q. Liu, Cardiovascular Regenerative Engineering, World Scientific Publishing, in preparation."}], "lmod": "2/6/17 8:32 AM (CT)", "subject": "BMD_ENG"}]