[{"school": "WCAS", "overview_of_class": "The Russian avant-garde has long been regarded as the most radical of the twentieth-century avant-gardes, because its \"art into life\" ambitions were developed and partially realized in a revolutionary context where all aspects of life, including relations of labor, gender, sexuality and ethnicity were subject to transformation. In the year of the 100th anniversary of the Bolshevik Revolution of 1917, this seminar will re-examine the Russian avant-garde art movements that anticipated, articulated, invented and protested some of the transformative ideas of the revolution, for better or for worse. How has the Russian revolutionary avant-garde put pressure on the very concept of the avant-garde? How has scholarship on, and the exhibition of, the Russian avant-garde evolved, with the fall of the Soviet Union and the rise of Putin's Russia? We will concentrate on Suprematism and Constructivism, as they developed before 1917 and evolved through the 1920s, often in relation to other forms of cultural production such as film, literature, theater and mass communication. All required texts will be in English; students from other disciplines are welcome.", "name": "Studies in 20Th Century Art", "section": "1", "location": "Kresge 4354 Art Hist. Sem. Rm.", "topic": "The Russian Avant-Garde", "course": "460-0", "meeting_time": ["Tu 2:00PM - 4:50PM"], "path": "/class-descriptions/4660/WCAS/ART_HIST/460-0/32454", "instructor": ["Christina Hilleboe Kiaer"], "class_attributes": "", "id": "32454", "subject": "ART_HIST"}, {"school": "WCAS", "overview_of_class": "In an era now all too often referred to as post-truth, this seminar turns to speculation and the speculative, not as modes of deception or \"falsehood,\" but as positive opportunities to think about the constructions and layers of truth: historical, scientific, temporal, informational, aesthetic, scholarly and political. We aim to focus specifically on how speculation in artistic practice and art historical writing might yield new ideas about what is unknown or unarchived. Our interest takes root in the etymological roots of speculate: from the Latin specere, 'to look,' which evolved to specula, a watchtower and so came to mean a kind of looking organized from a specific vantage point, which is where the 16th century sense of the word congealed, gaining later connotations as it travelled into the modern and contemporary moment.  If looking is thereby attached to the kind of unknown guessing that is also at the heart of the speculative, what histories and art forms might a newly configured approach to speculation as practice and method render visible, legible or obscure? What kinds of temporalities, what sorts of possibilities, and what models of truth? What is risked, gained and lost, through using speculation or fiction as art historical methodology? Our approach exceeds recent investments in \"fact\" or \"fiction\" to consider multiple ways of knowing and seeing. Readings will draw from multiple disciplines and forms, and will address a wide range of practices across the 20th and 21st centuries, multiple geographic locations, and give special attention to how speculation might offer new insight into post-and decolonial, feminist, diasporic, queer, or 'global' art histories.", "name": "Studies in 20Th Century Art", "section": "2", "location": "Kresge 4354 Art Hist. Sem. Rm.", "topic": "Speculation and the Speculative", "course": "460-0", "meeting_time": ["We 2:00PM - 4:50PM"], "path": "/class-descriptions/4660/WCAS/ART_HIST/460-0/32455", "instructor": ["Hannah J Feldman", "Krista Angelique Thompson"], "class_attributes": "", "id": "32455", "subject": "ART_HIST"}, {"school": "WCAS", "overview_of_class": "In this graduate seminar, we will explore how black masculinities have been framed, visualized, and constrained in American art from the 1950s to the present. To do so, we will first aim to understand and theorize the historical, social, and cultural conditions that have produced black male bodies as charged sites of violence and visualization in the U.S. public sphere. With this framework in place, we will proceed to home in on particular exhibitions, objects, and practices that help illuminate the ongoing logics that structure the appearance of black masculinity as well as the ways cultural practitioners have variously contested them. Artists considered will include David Hammons, Titus Kaphar, Kerry James Marshall, Jacolby Satterwhite, and Sun Ra.", "name": "Studies in 20Th Century Art", "section": "3", "location": "Kresge 4354 Art Hist. Sem. Rm.", "topic": "Black Masculinities in Contemporary American Art", "course": "460-0", "meeting_time": ["Mo 2:00PM - 4:50PM"], "path": "/class-descriptions/4660/WCAS/ART_HIST/460-0/32456", "instructor": ["Huey Gene Copeland II"], "class_attributes": "", "id": "32456", "subject": "ART_HIST"}]