[{"school": "WCAS", "overview_of_class": "The seminar will grapple with the way in which Soviet citizens tried to make sense of what went on around them during the 1930s, a decade in which several million peasants died after their farms were collectivized, millions of innocent people were sentenced to forced labor in the Gulag prison camps, and another million or so were executed for political crimes they had not committed. We will read documents, diaries, and memoirs written during the 1930s but not published until much later.", "name": "First-Year Seminar-European History", "section": "20", "topic": "Stalinism", "course": "101-6", "meeting_time": ["TuTh 9:30AM - 10:50AM"], "path": "/class-descriptions/4650/WCAS/HISTORY/101-6/21947", "instructor": ["John Starkes   Bushnell"], "id": "21947", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "STEM fields in the 21st century are striving for greater diversity and inclusivity. But the problem of implicit bias - of certain people being perceived as less authoritative, knowledgeable, or capable based on their gender, race, or other bodily marker of difference - is pervasive in and beyond STEM. It also has deep historical roots. This first-year seminar explores the gendering of science since the Middle Ages in order to shed light on this contemporary problem. Through a series of case studies drawn from European and U.S. history, we will explore the many ways in which cultural norms about sex/gender have shaped scientific thought and practice. Topics to be covered include: the science of sex and race; gendered hierarchies in the lab, field, and other sites of science; the invisible work of women as assistants, wives and daughters, and scientific test subjects; and the way that changing cultural assumptions about sex/gender and race have influenced the shifting demographics of STEM fields over time.", "name": "First-Year Seminar-European History", "section": "21", "topic": "Gender and Science from the Middle Ages to Present", "course": "101-6", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4650/WCAS/HISTORY/101-6/21948", "instructor": ["Lydia   Barnett"], "id": "21948", "subject": "HISTORY"}]