[{"school": "WCAS", "overview_of_class": "Professor Julie Lee Merseth, Winter 2016 \"Gender, Politics & Power\"<br/>This course examines the role of women and gender in American politics with a focus on women's participation as activists, voters, and candidates. Topics include historical and contemporary women's movements, issues concerning the political representation of women, barriers to women seeking office, and the role of gender stereotypes in campaigns and elections. Throughout the course we attend to the intersections of gender with other identities such as race, ethnicity, class, sexuality, and nativity and highlight, in particular, the participation and contributions of women of color. In addition, while this course concentrates on women as political actors in the United States, we briefly examine women's participation and representation in comparative perspective.", "name": "First-Year Seminar", "section": "21", "location": "Locy Hall 305", "topic": "Gender, Politics & Power", "course": "101-6", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4610/WCAS/POLI_SCI/101-6/24356", "instructor": ["Julianne Lee Merseth Cook"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "24356", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "Prof. Druckman \"Sports, Politics, and Public Opinion\" Winter 2016 First-year Seminar<br/><br/>Sports and politics have become increasingly intertwined over the last 40 years. Local, state, and federal governments as well as other governing bodies (e.g., the NCAA) regulate who can participate (e.g., eligibility, equality) and what standards players must meet (e.g., drug testing, academic performance). These organizations also oversee economic (e.g., stadiums) and symbolic (e.g., mascots) issues. Ideally, governing policies would be responsive to the wishes of their constituents (e.g. players, owners, voters). But are they? How would we know? How do we gauge their opinions? Alternatively, how do sports affect public opinion? Do citizens prefer politicians who engage in sports? Do media portrayals of sport affect what citizens think about race and/or gender? These are examples of the questions we will consider in this class. This involves learning the science of public opinion polling and then applying this knowledge to study opinions about public policies relevant to sports.", "name": "First-Year Seminar", "section": "22", "location": "Scott Hall 319 ExperimentalLab", "topic": "Sports, Politics, and Public Opinion", "course": "101-6", "meeting_time": ["Tu 3:30PM - 6:20PM"], "path": "/class-descriptions/4610/WCAS/POLI_SCI/101-6/24357", "instructor": ["James N Druckman"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "24357", "subject": "POLI_SCI"}]