[{"school": "MEAS", "overview_of_class": "", "name": "Special Topics in Engineering Design", "section": "27", "location": "Ford Eng Design Cntr G-201", "topic": "Communication Design", "course": "495-0", "meeting_time": ["Fr 9:30AM - 12:30PM"], "path": "/class-descriptions/4610/MEAS/DSGN/495-0/26560", "instructor": ["Elizabeth M Gerber"], "class_attributes": "", "id": "26560", "subject": "DSGN"}, {"school": "MEAS", "overview_of_class": "", "name": "Special Topics in Engineering Design", "section": "36", "location": "Technological Institute M120", "topic": "Nuvention Impact", "course": "495-0", "meeting_time": ["We 3:00PM - 6:00PM"], "path": "/class-descriptions/4610/MEAS/DSGN/495-0/26568", "instructor": [""], "class_attributes": "", "id": "26568", "subject": "DSGN"}, {"school": "MEAS", "overview_of_class": "Communication design is the intentional design of information to motivate a response. Communication design relies on a combination of the senses (hearing, sight, touch, sound, and taste) to attract attention. This studio course will introduce you to the fundamentals of communication design.<br/><br/>Through design exercises and critique, you will develop your knowledge, understanding, skills, and competencies in communication design while fostering the use of communication design in problem solving.", "name": "Special Topics in Engineering Design", "section": "37", "location": "Meets in Non-General PurposeRm", "topic": "Communication Design", "course": "495-0", "meeting_time": ["Fr 10:00AM - 1:00PM"], "path": "/class-descriptions/4610/MEAS/DSGN/495-0/26569", "instructor": ["Elizabeth M Gerber"], "class_attributes": "", "id": "26569", "subject": "DSGN"}, {"school": "MEAS", "overview_of_class": "", "name": "Special Topics in Engineering Design", "section": "38", "location": "Technological Institute L170", "topic": "", "course": "495-0", "meeting_time": ["Th 9:00AM - 10:00AM"], "path": "/class-descriptions/4610/MEAS/DSGN/495-0/26570", "instructor": ["Walter B Herbst"], "class_attributes": "", "id": "26570", "subject": "DSGN"}, {"school": "MEAS", "overview_of_class": "This course explores a broad definition of \"story\" and introduces techniques for crafting, visualizing, and sharing in both analog and digital forms. Using the building blocks of story as a foundation, the course will cover the art of graphic facilitation, illustrated journey maps, storyboarding, animatics, and narrative video. Deliverables for the first 5 weeks will be completed by hand, the last 5 weeks will use computers to achieve the desired end result. This course will balance rote practice (muscle-building for rapid visualization), a personal inventory of visual elements and shorthand, and the craft of time-based mediums and narrative framing.", "name": "Special Topics in Engineering Design", "section": "39", "location": "Ford Eng Design Cntr G-205", "topic": "Visual Storytelling", "course": "495-0", "meeting_time": ["Tu 6:30PM - 9:30PM"], "path": "/class-descriptions/4610/MEAS/DSGN/495-0/26571", "instructor": ["Anthony Michael Garcia, JR"], "class_attributes": "", "id": "26571", "subject": "DSGN"}, {"school": "MEAS", "overview_of_class": "This experiential course lives at the intersection of transformative product innovation, design thinking, and business model innovation. The learning experience will be both rich and realistic! Student teams will work under NDA on five real-world upstream product innovation projects sponsored by Procter & Gamble, experiencing and helping to advance the way in which big innovation works in highly scaled businesses like P&G, as well as comparing innovation at different business scales including startup and licensing. Each multi-disciplined student team will develop both the consumer and business value proposition of their project through hands-on exercises, prototyping, testing and weekly coaching by sponsor mentors on-site and via video conference.  Unique characteristics of this class include physical and virtual product prototyping, business model development at three different scales (startup, licensee, globalCPG), pitch development and testing, and robust primary consumer research among the target audience for each project, applying a range of state of the art consumer research methods including ethnography and behavioral psychology.  Physical & social science, engineering, business, communication, design plus both physical and digital prototyping skills and interests will all be highly valuable to the teams, and brought together in pursuit of a common innovation goal.", "name": "Special Topics in Engineering Design", "section": "40", "location": "Meets in Non-General PurposeRm", "topic": "", "course": "495-0", "meeting_time": ["Tu 2:00PM - 5:00PM", "We 2:00PM - 3:00PM"], "path": "/class-descriptions/4610/MEAS/DSGN/495-0/27916", "instructor": ["Craig F Sampson", "Robb Eric Olsen"], "class_attributes": "", "id": "27916", "subject": "DSGN"}]