[{"class_mtg_info": [{"meet_t": "Mo 6:15PM - 9:15PM", "meet_l": "Kresge Centennial Hall 3-410"}], "school": "SCS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "38105", "title": "SCS CHINESE 111-C-62 Chinese I", "class_attributes": "", "section": "38105", "instructors": [{"instructor_phone": "8474918130", "instructor_name": "Chyi   Chung", "instructor_addr": "CROWE 1860 Campus Dr 1-159 EV2161"}], "topic": "", "course": "111-C", "descriptions": [{"name": "Overview of class", "value": "This course is the third in a three-course sequence. The course aims to help students develop their communicative competence in the four basic skills: listening, speaking, reading and writing. It continues the study of Pinyin system, written characters, compound words and grammar of Mandarin Chinese with greater emphasis on development of fluency and accuracy. Students are encouraged to continue studying second-year Chinese."}, {"name": "Registration Requirements", "value": "Chinese 111-A and Chinese 111-B, or equivalent."}, {"name": "Learning Objectives", "value": "The content of the course begins with individual, family, and school activities, and then gradually expends to include wider social occasions and societal contact. The course goal aims to develop students' Chinese proficiency in the context of daily life activities that require not only adequate language skills but also adequate awareness of socio-cultural customs."}, {"name": "Class Materials (Required)", "value": "Texts may include the following. Visit the campus bookstore or its website to confirm materials for the course. Modern Chinese 1A 1st ed, Better Chinese LLC. ISBN: 978-1-60603-481-1."}, {"name": "Class Notes", "value": "For each lesson, students will study the new vocabulary items, grammar notes and sentence patterns, and will learn to use them in different life-like situations. Students will be actively engaged in the learning process through various kinds of in-class exercises, which include vocabulary dictations, pattern drills, listening comprehension exercises, reading practice, situational dialogue, role-play, and language games, etc."}], "lmod": "2/19/17 6:43 PM (CT)", "subject": "CHINESE"}]