[{"class_mtg_info": [{"meet_t": "Tu 6:00PM - 8:50PM", "meet_l": "Louis Hall 118"}], "school": "SoC", "overview_of_class": "This class will continue in your development as a visual artist in moving images by focusing on advanced ideas of coverage, craft, and lighting.  You will focus your personal style and develop it, as well as increase your body of knowledge and skill set in cinematography: lighting, lenses, cameras, and techniques. This class will continue work in Super 16mm cinematography begun in RTVF 380, and will also incorporate DSLR cinematography with the Canon 5D Mark III, as well as the potential for other cameras. We will work with advanced lighting techniques and equipment, coverage concepts, and problem solving.<br/> <br/>We will also watch and dissect films, both short and feature-length, and you will read essays, articles, handouts, and assigned readings from the texts.  You are expected to complete the readings; there will be quizzes to encourage you.  Discussion of the films is a key part of exploring the craft.", "qtr": "Winter 2016", "name": "Advanced Cinematography", "title": "SoC RTVF 476-0-20 Advanced Cinematography", "lmod": "1/9/16 6:39 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Jeff Clayton Brown", "instructor_addr": ""}], "topic": "", "course": "476-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "This class will continue in your development as a visual artist in moving images by focusing on advanced ideas of coverage, craft, and lighting. You will focus your personal style and develop it, as well as increase your body of knowledge and skill set in cinematography: lighting, lenses, cameras, and techniques. This class will continue work in Super 16mm cinematography begun in RTVF 380, and will also incorporate DSLR cinematography with the Canon 5D Mark III, as well as the potential for other cameras. We will work with advanced lighting techniques and equipment, coverage concepts, and problem solving.<br/> <br/>We will also watch and dissect films, both short and feature-length, and you will read essays, articles, handouts, and assigned readings from the texts. You are expected to complete the readings; there will be quizzes to encourage you. Discussion of the films is a key part of exploring the craft."}, {"name": "Class Materials (Required)", "value": "Required Text: The Filmmaker's Eye: Learning (and Breaking) the Rules of Cinematic Composition - Mercado"}], "path": "/class-descriptions/4610/SoC/RTVF/476-0/22334", "instructor": ["Jeff Clayton Brown"], "class_attributes": "", "id": "22334", "subject": "RTVF"}]