[{"school": "MUSIC", "overview_of_class": "Music is all around us. Today, whether we are at a concert or in an elevator, music is an integral part of our experiences. Why do we like the music that we like? What about the music that we don't like? Primarily using examples from Western art (Classical) music, this class will consider both universal and culturally specific attributes of musical traditions. Class members will become engaged and critical listeners, consider the backgrounds of music, and develop the concepts necessary to discuss what they hear. This class requires no prior musical training; all students are welcome regardless of past musical experience. Students are expected to complete reading and listening assignments ahead of class meetings, engage with class lectures, participate in discussions, attend concerts (discounted and sometimes free admissions are available for Northwestern University students both on campus and around the Chicago area), submit written assignments, and prepare for quizzes or exams.", "name": "Introduction to Music", "section": "20", "location": "RCMA 1-164", "topic": "", "course": "170-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4640/MUSIC/GEN_MUS/170-0/14898", "instructor": ["Dane Christian Philipsen"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "14898", "subject": "GEN_MUS"}, {"school": "MUSIC", "overview_of_class": "This class will introduce non-music majors to various aspects of the Western musical tradition. Paying special attention to classical music, the course aims to give students the fundamental necessary tools to approach musical phenomena: What are the elements of music? How can we get the most out of a listening experience? Class discussion will take into consideration the specific historical, social, and aesthetic contexts surrounding each of several musical case studies. Students are expected to prepare reading and listening assignments for each session, to share their thoughts with the rest of the class in discussion, and to attend a variety of concerts.", "name": "Introduction to Music", "section": "21", "location": "RCMA 1-164", "topic": "", "course": "170-0", "meeting_time": ["TuTh 9:30AM - 10:50AM"], "path": "/class-descriptions/4640/MUSIC/GEN_MUS/170-0/14899", "instructor": ["Jose Miguel Arellano"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "14899", "subject": "GEN_MUS"}]