[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "Wirtz Center Ballroom"}], "school": "SoC", "enrl_requirement": "", "qtr": "Winter 2017", "name": "21919", "title": "SoC DANCE 270-0-20 Ballet II", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "21919", "instructors": [{"instructor_phone": "", "instructor_name": "Vanessa   Valecillos", "instructor_addr": ""}], "topic": "", "course": "270-0", "descriptions": [{"name": "Overview of class", "value": "This course is designed to provide students with an opportunity to continue their pursuit of the classical ballet technique with an emphasis on technical development, extended and more intricate movement combinations, including the integration of vocabulary, concepts of dynamics, attack, musicality, body alignment, lines, use of space and artistry challenging the students physically and intellectually.<br/><br/>Students must have taken Ballet I and/or have had previous Ballet Training, and/or have instructor's permission."}, {"name": "Learning Objectives", "value": "Broaden the students's classical Ballet vocabulary, body positions and musicality within the combination given. Increased center stability, flexibility, coordination, confidence and clarity while executing the combinations given. Have a better understanding of how to shift the weight from one position to the next without unnecessary effort by using the right muscles."}, {"name": "Evaluation Method", "value": "Participation 30%<br/>Mid-term paper 20%<br/>Final paper 20%<br/>Final in class evaluation 30%<br/>100% = A+"}, {"name": "Class Materials (Required)", "value": "Students are required to have ballet slippers.<br/>Women: Tights and leotard, Hair pulled back and out of the face<br/>Men: Tights, dance belt and a fitted t-shirt"}, {"name": "Class Materials (Suggested)", "value": "Recommended reading. Technical Manual and Dictionary of Classical Ballet by Gail Grant.<br/>Anatomy of movement by Blandine Calais-Germain<br/>Both sides of the mirror by Anna Paskevska. The Science and art of Ballet."}], "lmod": "12/25/16 6:47 PM (CT)", "subject": "DANCE"}]