[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "Fisk Hall 114"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "21745", "title": "WCAS AF_AM_ST 212-2-1 Introduction to African American History: Emancipation to Civil Rights Movement", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "21745", "instructors": [{"instructor_phone": "", "instructor_name": "Melanie Lee Chambliss", "instructor_addr": ""}], "topic": "", "course": "212-2", "descriptions": [{"name": "Overview of class", "value": "This course introduces students to a broad overview of African American history from Emancipation to the present. In this class, we will examine African Americans' pursuit of freedom and justice as defined in different eras and their attempts at forging a cultural identity within the United States and across the African diaspora. Key themes for this course will include the impact of national and international politics on black communities, the role of intersecting identity categories in complicating the notion of a single &quot;black experience,&quot; and the efficacy of different tools and tactics for political and personal expression. By the end of this quarter, students will understand some of the important concepts and movements that shaped the last 150 years of African American history."}, {"name": "Teaching Method", "value": "Lecture/ Discussion"}, {"name": "Evaluation Method", "value": "Group assignment: 10% of final grade<br/>(2) Three-page papers: 20% each<br/>Midterm exam: 25%<br/>Final exam: 25%"}, {"name": "Class Materials (Required)", "value": "The required texts for the course are: <br/>W.E.B. Du Bois, The Souls of Black Folk<br/>James Baldwin, The Fire Next Time <br/>Audre Lorde, Sister Outsider: Essays and Speeches <br/>Ta-nehisi Coates, Between the World and Me"}, {"name": "Class Materials (Suggested)", "value": "We will also be reading excerpts from the following:<br/>Hannah Rosen, Terror in the Heart of Freedom: Citizenship, Sexual Violence, and the Meaning of Race in the Post-emancipation South<br/>Brent Hayes Edwards, The Practice of Diaspora: Literature, Translation, and the Rise of Black Internationalism<br/>Christopher Reed, The Depression Comes to South Side: Protest and Politics in the Black Metropolis, 1930-1933<br/>Bill V. Mullen, Popular Fronts: Chicago and African-American Cultural Products, 1935-1946<br/>Penny M. Von Eschen, Race Against Empire: Black Americans and Anticolonialism, 1937-1957<br/>Charles M. Payne, I've Got the Light of Freedom: The Organizing Tradition and the Mississippi Freedom Struggle<br/>John D'Emilio, Lost Prophet: The Life and Times of Bayard Rustin<br/>Barbara Ransby, Ella Baker and the Black Freedom Movement: A Radical Democratic Vision<br/>Joseph Peniel, Waiting ?Til the Midnight Hour: A Narrative History of Black Power in America<br/>Thomas Sugrue, Origins of the Urban Crisis: Race and Inequality in Postwar Detroit<br/>Michelle Alexander, The New Jim Crow: Mass Incarceration in the Age of Colorblindness"}], "lmod": "12/29/16 6:53 PM (CT)", "subject": "AF_AM_ST"}]