[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Leverone Auditorium Owen Coon"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "35274", "title": "WCAS ECON 202-0-20 Introduction to Microeconomics", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "35274", "instructors": [{"instructor_phone": "", "instructor_name": "Sara   Hernandez", "instructor_addr": ""}], "associated_classes": [{"component": "DIS", "room": "Locy Hall 214", "meeting_time": "Fr 3:00PM - 3:50PM"}, {"component": "DIS", "room": "Locy Hall 214", "meeting_time": "Fr 4:00PM - 4:50PM"}, {"component": "DIS", "room": "University Hall 102", "meeting_time": "Fr 3:00PM - 3:50PM"}, {"component": "DIS", "room": "University Hall 102", "meeting_time": "Fr 4:00PM - 4:50PM"}, {"component": "DIS", "room": "University Hall 121", "meeting_time": "Fr 3:00PM - 3:50PM"}, {"component": "DIS", "room": "University Hall 121", "meeting_time": "Fr 4:00PM - 4:50PM"}, {"component": "DIS", "room": "University Hall 101", "meeting_time": "Fr 3:00PM - 3:50PM"}, {"component": "DIS", "room": "University Hall 101", "meeting_time": "Fr 4:00PM - 4:50PM"}], "topic": "", "course": "202-0", "descriptions": [{"name": "Overview of class", "value": "This is an introductory course that covers the fundamentals of microeconomics. We will study the behaviour of individuals and firms in a world of limited resources, and the interactions between the two in many different markets. With an emphasis on economic principles, students will be introduced to core terminology and modes of analysis for studying the production and distribution of goods and services in the economy. An overarching goal is to gain insight into how, when, and why markets fail or succeed. Specific topics include supply and demand, market equilibrium, elasticity, costs of production, different degrees of competition (including perfect competition and monopoly), and government interventions (price controls, taxes).<br/><br/>You will get started thinking about the three fundamental questions in economics: (i) what goods and services should be produced?,?(ii) how do we produce those goods and services?, and (iii) who gets those goods and services?<br/><br/>This course is aimed at potential economics majors and students who are curious about having a better understanding of the popular press, or analyzing and comparing different government policies."}, {"name": "Registration Requirements", "value": "You should be well acquainted with and have confidence applying high-school algebra tools (graphs, equations, inequalities, roots and exponents)."}, {"name": "Learning Objectives", "value": "The goal of this course is to give the students an introduction into the tools and skills that economists use, as well as an understanding of economic concepts related to:<br/>? Consumer behavior<br/>? Firm behavior<br/>? Government interventions"}, {"name": "Teaching Method", "value": "Lectures, discussion sections, assignments, exams"}, {"name": "Evaluation Method", "value": "Three examinations (85 percent), the best five out of six problem set grades (10 percent), quizzes (5 percent). Percentages and number of examinations are subject to change."}, {"name": "Class Materials (Required)", "value": "Microeconomics by Daron Acemoglu, David Laibson, and John List, 1st edition, ISBN: 978-0321391575."}], "lmod": "2/19/17 6:47 PM (CT)", "subject": "ECON"}]