[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "Harris Hall L28"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "33930", "title": "WCAS GBL_HLTH 301-0-21 Introduction to International Public Health", "class_attributes": "", "section": "33930", "instructors": [{"instructor_phone": "", "instructor_name": "Beatriz Oralia Reyes", "instructor_addr": ""}], "topic": "", "course": "301-0", "descriptions": [{"name": "Overview of class", "value": "This course introduces students to pressing disease and health care problems worldwide and examines efforts currently underway to address them. Taking an interdisciplinary approach, the course identifies the main actors, institutions, practices and forms of knowledge production characteristic of what we call &quot;global health&quot; today, and explores the environmental, social, political and economic factors that shape patterns and experiences of illness and healthcare across societies. We will scrutinize the value systems that underpin specific paradigms in the policy and science of global health and place present-day developments in historical perspective. Key topics will include: policies and approaches to global health governance and interventions, global economies and their impacts on public health, medical humanitarianism, global mental health, maternal and child health, pandemics (HIV/AIDS, Ebola, H1N1, Swine Flu), malaria, food insecurity, health and human rights, and global health ethics."}, {"name": "Registration Requirements", "value": "No freshmen allowed. Pre-registration for Global Health Studies Minors only. Registration open to other students after pre-registration."}, {"name": "Class Materials (Required)", "value": "Course pack from Quartet"}, {"name": "Class Notes", "value": "No freshmen allowed. Pre-registration for Global Health Studies Minors only. Registration open to other students after pre-registration."}], "lmod": "2/16/17 6:46 PM (CT)", "subject": "GBL_HLTH"}]