[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "University Library 4670"}], "school": "WCAS", "overview_of_class": "The course will explore the world of dreams in pre-modern, modern, and, if time allows it, contemporary Chinese literature and culture. Beginning with Daoist and Buddhist sources, and proceeding in a chronological fashion, we will navigate the dreamscapes mapped by traditional oneiromancy, philosophy, poetry, drama, fiction, all the way to contemporary theatrical and cinematic discourse. <br/>What do dreams mean? How does their language intersect with the language of faith, desire, gender, politics, power and fear? How similar and how different are our dreaming brains today from those of Chinese philosophers that lived three thousand years ago? Do cultural differences make us dream different dreams? These are just some of the questions that we will try to answer together during the course of the quarter.<br/>In order to do so, we will look at the semantic, religious and aesthetic function of dreams in the changing world of Chinese culture, connecting our findings to recent discoveries in the fields of contemporary psychology, psychoanalysis and neuroscience. Where possible, we will also engage in comparison with dream-related practices and traditions in other Asian contexts, such as those of India and Tibet.", "qtr": "Fall 2017", "name": "First-Year Seminar", "title": "WCAS ASIAN_LC 110-6-20 First-Year Seminar", "lmod": "5/11/17 7:17 PM (CT)", "section": "20", "topic": "Dreamlands: The Universe of Dreams in Chinese Lite", "course": "110-6", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores<br/>Add Consent: Department Consent Required<br/>", "descriptions": [{"name": "Overview of class", "value": "The course will explore the world of dreams in pre-modern, modern, and, if time allows it, contemporary Chinese literature and culture. Beginning with Daoist and Buddhist sources, and proceeding in a chronological fashion, we will navigate the dreamscapes mapped by traditional oneiromancy, philosophy, poetry, drama, fiction, all the way to contemporary theatrical and cinematic discourse. <br/>What do dreams mean? How does their language intersect with the language of faith, desire, gender, politics, power and fear? How similar and how different are our dreaming brains today from those of Chinese philosophers that lived three thousand years ago? Do cultural differences make us dream different dreams? These are just some of the questions that we will try to answer together during the course of the quarter.<br/>In order to do so, we will look at the semantic, religious and aesthetic function of dreams in the changing world of Chinese culture, connecting our findings to recent discoveries in the fields of contemporary psychology, psychoanalysis and neuroscience. Where possible, we will also engage in comparison with dream-related practices and traditions in other Asian contexts, such as those of India and Tibet."}, {"name": "Learning Objectives", "value": "-Acquisition of knowledge about the study of dreams and dream culture in the field of Chinese studies in particular and that of Asian studies and dream science in general. This will mean exposure to primary sources (in English, and for those students able to, in the original) produced by Chinese and other Asian authors, as well as to related secondary sources.<br/><br/>-Development of university level methodological skills in studying, reading, and analyzing the primary and secondary sources related to the course subject matter.<br/><br/>-Acquisition of an appreciation of the variance of expressions of dream culture and literature past and present, in China and beyond, at the national, regional, and global levels.<br/>-Understanding the effects of cultural, political, social, and economic forces on dream culture, its representation and evolution in any given culture, past and present. <br/><br/>-Growth as independent researchers and writers in the field of Chinese studies, Asian humanities, and interdisciplinary research and scholarship.<br/><br/>-Growth as independent academic thinkers and writers."}, {"name": "Teaching Method", "value": "Lecture and discussion"}, {"name": "Evaluation Method", "value": "Participation: 20% (This includes attendance, thorough preparation and reading of all assigned materials, and active participation in classroom discussion)<br/><br/>Assignments and responses: 25% (these include responses to readings and films, staged assignments in preparation of final projects, and so on)<br/><br/>Presentations: 20%<br/><br/>Final Project: 35% (the final project can be an analytical essay or a creative project)"}, {"name": "Class Materials (Required)", "value": "REQUIRED BOOKS:<br/>Choegyal Namkhai Norbu, Dream Yoga and the Practice of Natural Light, revised, SNOW LION 978-1559391610<br/><br/>Hobson      Dreaming. A Very Short Introduction     OXFORD    978-0192802156<br/><br/>Lockley and Foster, Sleep. A Very Short introduction OXFORD 978-0199587858<br/><br/>Strassberg      Wandering Spirits : Chen Shiyuan's Encyclopedia of Dreams     UCAL     978-0520252943<br/><br/>Tang Xianzu The Peony Pavilion: Mudan ting, Second Edition 978-0253215277<br/><br/>Tung      Tower of Myriad Mirrors : A Supplement to Journey to the West     PERSEUS     978-0892641420<br/><br/><br/>Additional readings and movies will be available through Canvas"}], "instructor": ["Paola   Zamperini"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "10730", "subject": "ASIAN_LC"}]