[{"class_mtg_info": [{"meet_t": "Th 5:00PM - 7:50PM", "meet_l": "ANTHRO Sem Rm 104 - 1810 Hinmn"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "33897", "title": "WCAS GNDR_ST 390-0-20 Topics in Gender and Sexuality Studies", "class_attributes": "", "section": "33897", "instructors": [{"instructor_phone": "847/491-4821", "instructor_name": "Micaela   di Leonardo", "instructor_addr": "1810 Hinman Ave., Room #210, EV Campus"}], "topic": "Anthropology of Gender", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "Feminist anthropology is now more than four decades old, and more than ever an essential set of intellectual tools with which to understand the world and to change it . In this course we will consider the ways in which attending to gender alters and enriches anthropological knowledge, with particular emphasis on the domains of gendered labor, sexuality, kinship, and reproduction in the contemporary neoliberal globalizing context. Course readings, lectures, films, and discussions will focus on the history of feminist scholarship on gender, on the embeddedness of gender relations in larger social relations/political economy including race/ethnicity and nationalism-on the embeddedness of anthropology itself in the histories of Western colonialism and capitalist development, and on the ways in which anthropology is troped in the public sphere with what entailments for gender/sexual/race politics? We will also discuss American and global political-economic shifts of the past few decades and their connections to shifts in the ways both scholars and the public construe gender relations. Professor Jane Collins will visit class in the week that we read her book."}, {"name": "Teaching Method", "value": "LectureSeminar"}, {"name": "Evaluation Method", "value": "Class participationExam, finalExam, mid-term"}, {"name": "Class Materials (Required)", "value": "Micaela di Leonardo, ed., Gender at the Crossroads of Knowledge: Feminist Anthropology in the Postmodern Era. California (Xroads) ISBN 0-520-07093-3<br/>Roger Lancaster and mdl, eds., The Gender/Sexuality Reader. Routledge (G/S) ISBN 0-415-91005-6<br/>Pei-Chia Lan, Global Cinderellas. California ISBN 0-8223-3742-8<br/>Jane Collins, Both Hands Tied: Welfare Reform and the Race to the Bottom in the Low-Wage Labor Market. Chicago. 13: 978-0-226-11406-4<br/>Wayne Ellwood, Globalization: buying and selling the world. New Internationalist ISBN 978-1-78026-237-6<br/>And a coursepack, Quartet Copies"}], "lmod": "2/21/17 6:47 PM (CT)", "subject": "GNDR_ST"}]