[{"class_mtg_info": [{"meet_t": "We 6:00PM - 9:00PM", "meet_l": "Harris Hall L28"}], "school": "WCAS", "overview_of_class": "This seminar illuminates decolonial horizons - visions of, ideas about, and plans for social existence that escape the stranglehold of mono-epistemic and/or Eurocentric (white, [settler]colonial, heteropatriarchal, imperialist, capitalist, ?) articulations of the political, progress, and reform (the cartography of power in this modern and global political economy).  We'll begin with a brief genealogy of western modernity and of modern nation states like the U.S., an effort to excavate their racial/colonial architecture and thus expose their systemic and routine affects and effects (slavery, genocide, hyper-carceralism, alienation, and etc).  Thereafter, most of our time will be spent mapping and debating decolonial theories and methods, focusing on; native resistance, fugitivity or maroonage, border/hybrid knowledge, racial power movements (Black, Chican@...), the undercommons, and emergent intellectual collectives (critical ethnic studies; afro-pessimism; crunk feminist, Palestinian, settler colonial?)", "qtr": "Winter 2016", "name": "Graduate Topics in African American Studies", "title": "WCAS AF_AM_ST 480-0-20 Graduate Topics in African American Studies", "lmod": "1/9/16 6:42 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "847 491 5122", "instructor_name": "John David Marquez", "instructor_addr": "1860 Campus Dr Crowe 5-135"}], "topic": "Decolonial Theory & Strategy", "course": "480-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "This seminar illuminates decolonial horizons - visions of, ideas about, and plans for social existence that escape the stranglehold of mono-epistemic and/or Eurocentric (white, [settler]colonial, heteropatriarchal, imperialist, capitalist, ?) articulations of the political, progress, and reform (the cartography of power in this modern and global political economy). We'll begin with a brief genealogy of western modernity and of modern nation states like the U.S., an effort to excavate their racial/colonial architecture and thus expose their systemic and routine affects and effects (slavery, genocide, hyper-carceralism, alienation, and etc). Thereafter, most of our time will be spent mapping and debating decolonial theories and methods, focusing on; native resistance, fugitivity or maroonage, border/hybrid knowledge, racial power movements (Black, Chican@...), the undercommons, and emergent intellectual collectives (critical ethnic studies; afro-pessimism; crunk feminist, Palestinian, settler colonial?)"}, {"name": "Teaching Method", "value": "DiscussionLecture"}], "path": "/class-descriptions/4610/WCAS/AF_AM_ST/480-0/26509", "instructor": ["John David Marquez"], "class_attributes": "", "id": "26509", "subject": "AF_AM_ST"}, {"class_mtg_info": [{"meet_t": "Th 2:00PM - 5:00PM", "meet_l": "2122 Sheridan Rd Classroom 231"}], "school": "WCAS", "overview_of_class": "This course will look at the relationship between Blackness and different concepts of life to highlight how Black life functions as a constitutive ontological limit for the workings of modern humanity. To that end, we will study texts from such recent fields as new materialism, animal studies, disability studies, and affect theory in tandem with writings from a variety a Black Studies approaches in order ascertain how they might fruitfully speak to each other. We will pay particular attention to the complex ways gender and sexuality function in the barring of Black flesh from the category of the human-as-Man, while also as providing the conditions of possibility for alternate ways of inhabiting the world.", "qtr": "Winter 2016", "name": "Graduate Topics in African American Studies", "title": "WCAS AF_AM_ST 480-0-21 Graduate Topics in African American Studies", "lmod": "1/9/16 6:42 PM (CT)", "section": "21", "instructors": [{"instructor_phone": "", "instructor_name": "Alexander G Weheliye", "instructor_addr": ""}], "topic": "Black Life", "course": "480-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "This course will look at the relationship between Blackness and different concepts of life to highlight how Black life functions as a constitutive ontological limit for the workings of modern humanity. To that end, we will study texts from such recent fields as new materialism, animal studies, disability studies, and affect theory in tandem with writings from a variety a Black Studies approaches in order ascertain how they might fruitfully speak to each other. We will pay particular attention to the complex ways gender and sexuality function in the barring of Black flesh from the category of the human-as-Man, while also as providing the conditions of possibility for alternate ways of inhabiting the world."}, {"name": "Teaching Method", "value": "DiscussionLecture"}, {"name": "Class Materials (Suggested)", "value": "Readings might include selections from the following works: <br/>Vincent Woodard, Delectable Negro: Human Consumption and Homoeroticism within US Slave Culture; New Materialisms: Ontology, Agency, and Politics, eds. Diana Coole and Samantha Frost; Amber Musser, Sensational Flesh, Race, Power, and Masochism; Denise Ferreira da Silva, Toward A Global Idea of Race; Jared Sexton, Amalgamation Schemes: Antiblackness and the Critique of Multiracialism; Saidiya Hartman, Lose Your Mother: A Journey Along the Atlantic Slave Route; J. Kameron Carter, &quot;Paratheological Blackness&quot;; Katherine McKittrick, &quot;Mathematics Black Life&quot;; Nahum Chandler, X?The Problem of the Negro as a Problem for Thought; C. Riley Snorton, Nobody Is Supposed to Know: Black Sexuality on the Down Low; M. Jacqui Alexander, Pedagogies of Crossing; Queer Inhumanisms, Eds. Mel Y. Chen and Dana Luciano; Donna Jones, Racial Discourses of Life Philosophy: Négritude, Vitalism, and Modernity; Zakiyyah Iman Jackson, &quot;Animal: New Directions in the Theorization of Race and Posthumanism&quot;; Simone Browne, Dark Matters: On the Surveillance of Blackness; Ronald Judy, &quot;On the Question of Nigga Authenticity&quot;; Beth E. Richie, Arrested Justice: Black Women, Violence, and America's Prison Nation; Darieck Scott, Extravagant Abjection: Blackness, Power, and Sexuality in the African American Literary Imagination; Sara Ahmed, The Cultural Politics of Emotion; Dionne Brand, A Map to the Door of No Return: Notes to Belonging; Sharon Holland, The Erotic Life of Racism; Calvin Warren, &quot;Onticide: Toward an Afro-pessimistic Queer Theory&quot;; Edouard Glissant, Poetics of Relation; Karen Barad, Meeting the Universe Halfway: Quantum Physics and the Entanglement of Matter and Meaning; Jane Bennett, Vibrant Matter: A Political Ecology of Things??; Nirmala Erevelles, Disability and Difference in Global Contexts: Enabling a Transformative Body Politic; Melissa Gregg, Gregory J. Seigworth, eds., The Affect Theory Reader; Matt Richardson, The Queer Limit of Black Memory: Black Lesbian Literature and Irresolution; Kara Keeling, &quot;LOOKING FOR M?Queer Temporality, Black Political Possibility, and Poetry from the Future.&quot; We might also consider literary works by Octavia Butler, Jackie Kay, Nuruddin Farah, and June Jordan"}], "path": "/class-descriptions/4610/WCAS/AF_AM_ST/480-0/26510", "instructor": ["Alexander G Weheliye"], "class_attributes": "", "id": "26510", "subject": "AF_AM_ST"}]