[{"school": "WCAS", "overview_of_class": "This seminar illuminates decolonial horizons - visions of, ideas about, and plans for social existence that escape the stranglehold of mono-epistemic and/or Eurocentric (white, [settler]colonial, heteropatriarchal, imperialist, capitalist, ?) articulations of the political, progress, and reform (the cartography of power in this modern and global political economy).  We'll begin with a brief genealogy of western modernity and of modern nation states like the U.S., an effort to excavate their racial/colonial architecture and thus expose their systemic and routine affects and effects (slavery, genocide, hyper-carceralism, alienation, and etc).  Thereafter, most of our time will be spent mapping and debating decolonial theories and methods, focusing on; native resistance, fugitivity or maroonage, border/hybrid knowledge, racial power movements (Black, Chican@...), the undercommons, and emergent intellectual collectives (critical ethnic studies; afro-pessimism; crunk feminist, Palestinian, settler colonial?)", "name": "Graduate Topics in African American Studies", "section": "20", "topic": "Decolonial Theory &amp; Strategy", "course": "480-0", "meeting_time": ["We 6:00PM - 9:00PM"], "path": "/class-descriptions/4610/WCAS/AF_AM_ST/480-0/26509", "instructor": ["John David Marquez"], "id": "26509", "subject": "AF_AM_ST"}, {"school": "WCAS", "overview_of_class": "This course will look at the relationship between Blackness and different concepts of life to highlight how Black life functions as a constitutive ontological limit for the workings of modern humanity. To that end, we will study texts from such recent fields as new materialism, animal studies, disability studies, and affect theory in tandem with writings from a variety a Black Studies approaches in order ascertain how they might fruitfully speak to each other. We will pay particular attention to the complex ways gender and sexuality function in the barring of Black flesh from the category of the human-as-Man, while also as providing the conditions of possibility for alternate ways of inhabiting the world.", "name": "Graduate Topics in African American Studies", "section": "21", "topic": "Black Life", "course": "480-0", "meeting_time": ["Th 2:00PM - 5:00PM"], "path": "/class-descriptions/4610/WCAS/AF_AM_ST/480-0/26510", "instructor": ["Alexander G Weheliye"], "id": "26510", "subject": "AF_AM_ST"}]