[{"class_mtg_info": [{"meet_t": "MoWeFr 3:00PM - 3:50PM", "meet_l": "University Library 5746"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24105", "title": "WCAS FRENCH 271-0-20 Introducing the Novel", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "24105", "instructors": [{"instructor_phone": "847/497-3930", "instructor_name": "Dominique Mary Licops", "instructor_addr": "1860 S. Campus Drive, Crowe Hall #2-175"}], "topic": "", "course": "271-0", "descriptions": [{"name": "Overview of class", "value": "This course will cover novels from the 18th to the 20th century through the study of five novels and novellas. In our discussion of these texts, we will focus on the representations of otherness (through the figure of the stranger or the outsider) and the role of difference, especially in terms of race/ethnicity, class and gender, in shaping the French imaginaire and literary canon. In so doing, we will study examples of several major literary developments in the history of French-language literature, from the philosophical and epistolary novel in the 18th century, to Romanticism, Realism, and the Fantastic in the 19th century, and the roman beur and migrant Québécois literature in the 20th century. We will discuss the differences between these texts, and study how these differences relate to the relation between narrative and changing historical and cultural contexts, as well as to differences in narrative techniques and other literary structures. The course will privilege the analysis of style, form, language, and theme. We will also develop the techniques of close reading and detailed critical analysis through class discussion and presentations, the creative/reflective assignment, the analytical essay, and the final examination."}, {"name": "Registration Requirements", "value": "French 210, French 211, or consent of the instructor"}, {"name": "Teaching Method", "value": "Class discussion, oral reports, short lectures, writing assignments. Conducted entirely in French."}, {"name": "Evaluation Method", "value": "Class participation, Oral report, Creative / Reflexive assignment, Analytical essay, Oral and written exam"}, {"name": "Class Materials (Required)", "value": "Mme de Graffigny, Lettres d'une Péruvienne (1747)<br/>Claire de Duras, Ourika (1824)<br/>Guy de Maupassant, Le Horla (1887)<br/>Azouz Begag, Béni ou le paradis privé (1989)<br/>Yin Chen, Lettres chinoises (1993)"}], "lmod": "12/25/16 6:59 PM (CT)", "subject": "FRENCH"}]