[{"class_mtg_info": [{"meet_t": "MoWe 9:30AM - 10:50AM", "meet_l": "Frances Searle Building 3220"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "12418", "title": "WCAS HISTORY 300-0-28 New Lectures in History", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "12418", "instructors": [{"instructor_phone": "847/467-6538", "instructor_name": "Ji-Yeon   Yuh", "instructor_addr": "Harris Hall, Room 306, 1881 Sheridan Road, Evanston 60208"}], "topic": "Korean Diaspora", "course": "300-0", "descriptions": [{"name": "Overview of class", "value": "The 20th century has been marked by upheaval and consequent migration for the people of the Korean peninsula. As a result of these migrations, substantial communities of ethnic Koreans exist in Central Asia, China, Japan, the United States and Canada, South America and Europe. How and why did Koreans go to these places? What kinds of communities and identities did they construct? How do these Koreans fit into the history of Korea, particularly in the context of a country divided into two opposing states? How do they fit into the history of their host countries? By examining the histories of ethnic Koreans outside the Korean peninsula, we will examine issues of migration, diaspora, race relations, and colonialism. We will also take a fresh look at modern Korean history by examining how these &quot;overseas Koreans&quot; view and relate to the history and ongoing politics of their divided homeland."}, {"name": "Registration Requirements", "value": "GRADING BASIS: ANC"}, {"name": "Teaching Method", "value": "Lecture"}, {"name": "Evaluation Method", "value": "EVALUATION METHOD: Class participation, short papers, final project"}, {"name": "Class Materials (Required)", "value": "***Tentative until order posted to Norris website<br/>Peter Hyun, In the New World. 9780824816483.<br/>Sonia Shinn Sunoo, Korean Picture Brides. 9780738860565.<br/>John Lie, Zainichi: Diasporic Nationalism and Postcolonial Identity. 9780520258204.<br/>Fang Gao, Becoming a Model Minority: Schooling Experiences of Ethnic Koreans in China. 9780739136836.<br/>Jane Jeong Trenka, Fugitive Visions: An Adoptee's Return to Korea. 9781555975296.<br/>Required articles and films available on Canvas or in the course pack available from Quartet Copies."}], "lmod": "10/30/16 7:06 PM (CT)", "subject": "HISTORY"}]