[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "Annenberg Hall G15"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24753", "title": "WCAS SOCIOL 276-0-20 Introductory Topics in Sociology", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "24753", "instructors": [{"instructor_phone": "", "instructor_name": "Robert   Braun", "instructor_addr": ""}], "topic": "Politics, Violence, &amp; Society", "course": "276-0", "descriptions": [{"name": "Overview of class", "value": "Why do political opponents sometimes kill each other? This class introduces students to social scientific explanations of political violence. The first part of this course will focus on theories of social action that explain A) How large societal forces and elite behavior create the outbreak of different episodes of political violence such as suicide terrorism, insurgency, revolution and riots B) the processes that drive individual participation in these events and C) how the two combine. The second part of the course applies these theoretical lenses to a wide range of violent events such as the French revolution, race riots in the United States, suicide bombing in the Middle East, ethnic cleansing in Kosovo and insurgency in El Salvador."}, {"name": "Learning Objectives", "value": "Students will improve their analytical skills by drawing connections between social science theory, historical monographs, and journalistic accounts. Upon completing the course, students will not only be acquainted with the main types of explanations offered for violence, but they will also be able to evaluate the evidence supporting the various explanations."}, {"name": "Teaching Method", "value": "Lecture"}, {"name": "Evaluation Method", "value": "Class participation, response papers, midterm and final exam.<br/>Midterm (25)<br/>Presentation (25)<br/>Final (40)<br/>Attendance and participation (10)"}, {"name": "Class Materials (Required)", "value": "Judah, Tim. Kosovo: What Everyone Needs to Know. Oxford University Press ISBN: 0195373456<br/><br/>Elster, Jon. Explaining Social Behavior: More Nuts and Bolts for the Social Sciences. ISBN: 0521777445 <br/><br/>Rudwick, Elliot Race Riot at East St. Louis, July 2, 1917. University of Illinois Press, 1982. ISBN: 0252009517"}], "lmod": "12/25/16 7:07 PM (CT)", "subject": "SOCIOL"}]