[{"class_mtg_info": [{"meet_t": "Tu 2:00PM - 4:50PM", "meet_l": "Scott Hall 201 Ripton Room"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "34133", "title": "WCAS POLI_SCI 390-0-23 Special Topics in Political Science", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "34133", "instructors": [{"instructor_phone": "847 491 2632", "instructor_name": "Michael M Loriaux", "instructor_addr": "601 University Place, Scott Hall #325"}], "topic": "Introduction to Interpretive Methods in Political", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "Prof. Loriaux, &quot;Knowledge and Interpretation in Political Science&quot; Spring 2016<br/>Political science research relies on concepts (?country,' ?democracy,' ?voting,' ?power,' ?market') that are human constructions. Their meaning, power, and relevance depend on how they are used and understood. Knowing how they are used and understood, in turn, requires interpretation. This course introduces students to methodological issues raised by interpretation. It is not limited to interpretive work alone, but addresses problems of interpretation as they crop up generally in political science scholarship. The goals of such scholarship vary from predicting to explaining to understanding to destabilizing and contesting dominant discourses. But in all cases there is interpretation. The gathering of events or people into &quot;kinds&quot; of events or &quot;kinds&quot; of people so as to manipulate them as variables in small-n or large-n analyses, for example, is an interpretive undertaking. For this reason this course seeks not only to introduce the student to interpretive methods narrowly conceived, but to place such methods against the backdrop of broader questions regarding what knowledge is, how we acquire it, and how interpretation contributes to that effort. In so doing, this course seeks to give students a strong foundation that will allow them to read Political Science literature critically, and to conceptualize their subsequent research projects credibly. <br/>Recommended for Honors thesis writers.<br/>This course counts toward the Critical Theory minor.<br/>With written permission from the Director of Undergraduate Studies, this course counts toward the Political Science methods requirement."}, {"name": "Learning Objectives", "value": "- the diversity of research methods in the field of Political Science<br/>- the diversity and application of distinctly interpretive or historical methods<br/>- the existence of critical as opposed to nomothetic research methods"}, {"name": "Teaching Method", "value": "Lecture and seminar discussion"}, {"name": "Evaluation Method", "value": "course participation: 25%<br/>final research paper: 75%"}, {"name": "Class Materials (Required)", "value": "Peregrine Schwartz-Shea, Dvora Yanow, Interpretive Research Design, Routledge, 2011, 978-0415878081<br/><br/>A packet of course readings available through Quartet Copies."}, {"name": "Class Notes", "value": "Electronic devices are discouraged."}], "lmod": "4/3/16 8:17 PM (CT)", "subject": "POLI_SCI"}]