[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "Kresge Centennial Hall 2-343"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "34267", "title": "WCAS HISTORY 392-0-34 Topics In History", "class_attributes": "", "section": "34267", "instructors": [{"instructor_phone": "", "instructor_name": "Alexandra Simone Lindgren-Gibson", "instructor_addr": ""}], "topic": "", "course": "392-0", "descriptions": [{"name": "Overview of class", "value": "This course explores the role of gender and sexuality in creating, sustaining, and undermining empires in the eighteenth, nineteenth, and twentieth centuries. We will ask how and why controlling the intimate lives of colonizers and colonized became such a fundamental part of the imperial project. How did colonizing and colonized notions of gender and sexuality come into contact and conflict? How did ideas about sexuality shape racial thinking in the eighteenth and nineteenth centuries and what was the fallout of this way of thought in the twentieth? How did independence movements harness and alter imperial ideas about gender and sexuality to overthrow colonial powers? Drawing on primary texts as well as historical monographs and the scholarship of gender and sexuality, we will investigate how empires were built around interlocking ideas about sexuality, gender, class, and race."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Discussion (20%), Two Quizzes (10% each), &amp; Three Source Analysis Papers (20% each)"}, {"name": "Class Materials (Required)", "value": "Anne McClintock. Imperial Leather: Race, Gender, and Sexuality in the Colonial Contest.<br/>9780415908900.<br/>Ann Laura Stoler. Carnal Knowledge and Imperial Power: Race and the Intimate in Colonial Rule.<br/>9780520262461.Nancy Rose Hunt. A Colonial Lexicon: Of Birth Ritual, Medicalization, and Mobility in the Congo.<br/>9780822323662."}], "lmod": "2/20/17 6:47 PM (CT)", "subject": "HISTORY"}]