[{"class_mtg_info": [{"meet_t": "TuTh 3:00PM - 4:50PM", "meet_l": "Louis Hall 118"}], "school": "SoC", "enrl_requirement": "Enrollment Requirements: Registration is reserved for Radio/TV/Film majors who have taken RTVF 190-0 and are of sophomore, junior, or senior standing.", "qtr": "Spring 2017", "name": "34708", "title": "SoC RTVF 376-0-21 Topics in Interactive Media", "class_attributes": "Prerequisites apply, see description<br/><br/>", "section": "34708", "instructors": [{"instructor_phone": "", "instructor_name": "Charles Stephen Evans", "instructor_addr": ""}], "topic": "Introductory Game Studio", "course": "376-0", "descriptions": [{"name": "Overview of class", "value": "Topics in Film/Video/Audio Production:<br/>Introductory Game Studio<br/> <br/>This course is a workshop for understanding the cultural context of video games through practical use of introductory game creation tools. The course aims to distinguish between how video games extend traditions of artistic exchange and how they offer novel and unexplored modes of communication unique to the medium. The course is designed to engender an active and critical perspective on what games are and how they relate to other cultural texts through analysis, discussion, production, and play. Students will have the opportunity to conceptualize their own game projects and select from a menu of approaches in order to resolve them. Students will be evaluated through active participation, individual exercises, reading responses, presentations, and unit projects in group critique. The course is designed for students with no prior game making experience, although students with experience are welcome to enroll.<br/> <br/>LEARNING OUTCOMES<br/>By the end of the quarter students should have a strong understanding of contemporary developments in game production. Students should also have a working understanding of different tools for game creation as well as how to choose an effective and meaningful tool for a particular concept.<br/> <br/>MATERIALS<br/>Readings will be provided as pdf or web documents."}], "lmod": "2/19/17 6:41 PM (CT)", "subject": "RTVF"}]