[{"school": "WCAS", "overview_of_class": "Someone wrote a whole book on Celine Dion's \"My Heart Will Go On.\" We'll read it. We'll also read a series of essays on Internet cats, all to investigate how our obsessions intersect with issues of taste (what we think of as \"good\" or \"bad\"). People can be obsessed with websites (like Facebook), celebrities, TV shows, hobbies, foods, pets, a boyfriend or girlfriend, a place?any number of things. In this seminar, we'll look at the ways in which individual obsessions sometimes intersect with broader social or cultural concerns, and we'll read excerpts from the writings of notorious and talented obsessives. We'll also examine what obsessions can (or maybe cannot) tell us about other people and about ourselves: who we are, what we want, what we're afraid of, what we're drawn to, where we've been, where we're going.", "name": "First-Year Seminar", "section": "20", "location": "Harris Hall L04", "topic": "Obsessed: Taste & Pop Culture", "course": "101-6", "meeting_time": ["MoWe 9:30AM - 10:50AM"], "path": "/class-descriptions/4660/WCAS/ENGLISH/101-6/33260", "instructor": ["Juan M Martinez"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "33260", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "For HP Lovecraft, the well-known writer of horror fiction, \"the oldest and strongest emotion of mankind is fear, and the oldest and strongest kind of fear is fear of the unknown.\" In this seminar, we will explore the Gothic fascination with things unseen and unknown: ghosts, ghouls, and demons who lurk in crumbling castles, haunt overgrown forests, slink beneath suburban beds and hide in damp basements or under creaky stairwells. Occupying the threshold between life and death, ghosts and other gothic creatures threaten to overturn our cherished assumptions about the world; they undo the notion that the dead should stay dead; they upend the boundaries between sanity and madness, the holy and the demonic, the familiar and the uncanny. The fear generated by Gothic texts stems from the realization that what once seemed safe, such as the domestic sphere or church sanctuary, is actually dangerously unstable, while what was once thought to be real, may instead be a figment of the imagination.<br/><br/>In looking beneath the surface of these spooky texts, we will discover that Gothic literature often conjures individual and collective anxieties about race, class, national identity, sexuality and desire. Readers and protagonists confront not only diabolical villains and vengeful spirits, but also the dark and repressed corners of their own psyches, and the ways in which past traumas haunt the historical present. Over the course of the quarter, we will consider classic examples of Gothic fiction by Edgar Allen Poe, Nathanial Hawthorne, Edith Wharton, Horace Walpole, and Flannery O'Connor, as well as critical studies on Gothic literature and the psychology of horror. Because the Gothic has never been solely a literary phenomenon, we will also examine gothic sensibilities in contemporary film, television series, music, fashion, architecture, and visual art, as well as the development of a gothic subculture from the late 1970s to the present day.", "name": "First-Year Seminar", "section": "21", "location": "Harris Hall L05", "topic": "Giving up the Ghost", "course": "101-6", "meeting_time": ["MoWe 11:00AM - 12:20PM"], "path": "/class-descriptions/4660/WCAS/ENGLISH/101-6/33261", "instructor": ["Sarah Elizabeth Wilson"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "33261", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "What are our debts to the dead? What responsibilities arise from living in a particular place? What ongoing psychological, social, and physical effects does the past have on the present? What is the role of literature in responding to historical wounds? These questions will guide our study of the relationships between the Sand Creek Massacre and Northwestern. The massacre took place on November 29 1864, in when US soldiers killed about 150 peaceful Cheyenne and Arapaho men, women, and children who had placed themselves under US protection. At the time, the territorial governor and superintendent of Indian affairs for Colorado was John Evans, also one of Northwestern's founders. Although Congressional review committees and soldiers who had been at Sand Creek subsequently agreed that a massacre took place, Evans never acknowledged the massacre as such or acknowledged his own culpability. Meanwhile, Cheyenne and Arapaho descendants of survivors of the massacre continue to experience the effects of historical trauma. After years of silence, the University has recently begun to take a new approach to Sand Creek and its own history by accounting for its founder's role in the massacre and establishing dialogue with the Cheyenne and Arapaho. This course will take up these connections between the massacre and the university to explore relations between colonialism and education; historical trauma and \"reconciliation.\" We will read firsthand accounts of the massacre alongside Native American literatures that represent historical trauma and healing; the university's official report on Evan's involvement; and readings on historical trauma; healing; and reconciliation.", "name": "First-Year Seminar", "section": "22", "location": "Harris Hall L05", "topic": "The Sand Creek Massacre & Northwestern University", "course": "101-6", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4660/WCAS/ENGLISH/101-6/33262", "instructor": ["Kelly E Wisecup"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "33262", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "This course will examine ideas of justice in western cultural and literary traditions. Biblical prophecy, the trial of Jesus, Plato, and tragedy in Shakespeare will be included. Our exploration will be done in the context of theories of justice. But the literature offers elaborations of theories of justice, both within legal frameworks and beyond, as they shape communities and the private lives of people. We will ask how religious ideas of justice inform and depart from secular ideas of justice, how retributive and distributive ideas of justice are imagined and critiqued, and how the relation between justice and law has been conceived.", "name": "First-Year Seminar", "section": "23", "location": "Harris Hall L04", "topic": "Ideas of Justice", "course": "101-6", "meeting_time": ["TuTh 9:30AM - 10:50AM"], "path": "/class-descriptions/4660/WCAS/ENGLISH/101-6/33263", "instructor": ["Regina M Schwartz"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "33263", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "Debt is powerful topic in the history of literature, from the Greeks to contemporary fiction. In this course, we will think through issues of money, morality, control, and slavery, all knotted together in the term, \"debt,\" across key texts by William Shakespeare, Charles Dickens, and William Faulkner. We will also critically engage with the popular films \"The Big Short\" and \"Hell or High Water\" to think about our contemporary \"scene\" of debt. As we consider these texts and films through the lens of debt as monetary, moral, racial, gendered, and historical idea, we will be reflecting constantly how they throw light on our own assumptions about debt in our everyday lives. We will read short pieces by scholars, newspaper reporters, and debt activists to help contextualize our readings along the way. As we progress, you will be developing your critical thinking about debt via in-class discussion and a series of progressively developed writing assignments. We will also have the opportunity to attend two debt-related events on campus as part of the Kaplan Institute for the Humanities Debt Dialogue Series.", "name": "First-Year Seminar", "section": "24", "location": "Harris Hall L04", "topic": "The Bonds of Debt", "course": "101-6", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4660/WCAS/ENGLISH/101-6/33264", "instructor": ["William Casey Caldwell"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "33264", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "This class will critically read and explore the role of animation cartoons as a socializing and teaching tool for children in the 20th century. In particular, we will look at the role and function of cartoons in teaching the performance of race. In this class we will trace the development of animation from its roots in blackface minstrelsy at the turn of the 19th century to the decline of the \"Saturday Morning Cartoon Line up\" at the end of the 1990s. Using cartoons as our object, the aim of this course is to develop our skills as a readers, writers, and observers. Through a series of writing exercises we will think about how \"uncritical\" or popular objects such as animation cartoons hold important critical content for understanding race, childhood, and life.", "name": "First-Year Seminar", "section": "25", "location": "Harris Hall L04", "topic": "The Race of Cartoons", "course": "101-6", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4660/WCAS/ENGLISH/101-6/33265", "instructor": ["Chad Benito   Infante"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "33265", "subject": "ENGLISH"}]