[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Harris Hall L28"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "31146", "title": "WCAS GERMAN 238-0-20 Turn-of-the-Century Vienna", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "31146", "instructors": [{"instructor_phone": "847/467-1849", "instructor_name": "Erica Suzanne Weitzman", "instructor_addr": "1800 Sherman, Suite 106, Room 107"}], "topic": "Analyzing Freud", "course": "238-0", "descriptions": [{"name": "Overview of class", "value": "Turn-of-the-Century Vienna: Analyzing Freud<br/><br/>This class will take a look at the life and work of the groundbreaking Viennese psychologist Sigmund Freud from a comparative and interdisciplinary angle. Almost 80 years after his death, Freud`s legacy continues to be controversial: some claim that his theories are no longer relevant in the light of new research, whereas others defend his theories and/or expand upon the implications and influence of his ideas, in the realm not only of psychology, medicine, and neuroscience, but also in the fields of sociology, cultural studies, philosophy, literary studies, criminal justice, queer studies, women`s studies, communications, and many more. What is certain, however, is that, one way or another, Freud`s theories and ideas have marked the world for all time. This class will read fundamental texts from Freud`s body of work in dialogue with texts by Freud's near and distant predecessors and followers, both to situate Freud in his historical and cultural context, and to think through the many different kinds of questions that Freud`s work addresses."}, {"name": "Registration Requirements", "value": "None."}, {"name": "Learning Objectives", "value": "? To become familiar with the basics of Freud`s theories and body of work<br/>? To understand Freud`s work in its historical context and cultural milieu, and to analyze its impact on a variety of fields, disciplines, and aspects of life<br/>? To deepen understanding of interdisciplinary analysis and influence and to think with and across disciplinary boundaries<br/>? To enhance critical thinking and analytic skills in relation to scientific and literary works"}, {"name": "Teaching Method", "value": "Class participationDiscussionLecturePresentationsReadingsSeminarWriting assignments"}, {"name": "Evaluation Method", "value": "Class participationExam, finalPapersPresentationsReadings"}, {"name": "Class Materials (Required)", "value": "? Freud, Introductory Lectures on Psychoanalysis ISBN-13: 978-0871401182<br/>? Freud, The Freud Reader, ISBN-13: 978-0393314038<br/>? Course reader<br/>? Other texts TBA"}], "lmod": "4/3/16 8:02 PM (CT)", "subject": "GERMAN"}]