[{"school": "WCAS", "overview_of_class": "Psychology has traditionally focused on understanding mental illness, rather than the factors that lead to optimal mental well-being. This seminar will instead focus upon the questions asked within the growing science of positive psychology. Does money make us happy, and if so, when and why? How do our relationships contribute to a feeling of meaning in life? What types of situations encourage cognitive mastery and creativity? Can happiness be learned, or is our happiness \"setpoint\" mostly determined by genetics? How do we, as a society, encourage generosity and altruism? In this seminar, students will read a mix of recent scientific journal articles and book chapters, will write opinion papers about the scientific findings, and will journal about their own experiences in trying to apply these findings to their own lives. Students can expect to wrestle with some of the \"big questions\" about what makes a good life and a strong society in discussions with their classmates.", "name": "Special Topics in Psychology", "section": "20", "location": "Technological Institute LG52", "topic": "Positive Psychology- The Science of Well-Being", "course": "314-0", "meeting_time": ["Mo 3:00PM - 5:50PM"], "path": "/class-descriptions/4640/WCAS/PSYCH/314-0/10195", "instructor": ["Wendi L Gardner"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "id": "10195", "subject": "PSYCH"}, {"school": "WCAS", "overview_of_class": "Clinical psychology is the application of theoretical perspectives to an individual, couple or group for the purpose of psychological healing. This course will investigate, within a biological-psychological-social framework, the major theoretical perspectives and their views on normal, abnormal development and their therapeutic interventions. Special focus will be given to competing and controversial perspectives both between and within paradigms. The emphasis will be on Psychodynamic, Cognitive-Behavioral, Dialectical (DBT), Humanistic, and Psychopharmacological approaches with some background discussion on recent developments in Neuroscience.", "name": "Special Topics in Psychology", "section": "21", "location": "Loder Hall Lower Level 023", "topic": "Intro to Schools of Psychotherapy", "course": "314-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4640/WCAS/PSYCH/314-0/10196", "instructor": ["Carol M Donnelly"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "id": "10196", "subject": "PSYCH"}]