[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Harris Hall L05"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "23335", "title": "WCAS GNDR_ST 397-0-1 Feminist Theory", "class_attributes": "", "section": "23335", "instructors": [{"instructor_phone": "", "instructor_name": "Mary Golden Dietz", "instructor_addr": ""}], "topic": "Feminist Theory", "course": "397-0", "descriptions": [{"name": "Overview of class", "value": "Ever since Simone de Beauvoir declared &quot;One is not born a woman but becomes one&quot; (The Second Sex, 1949) feminist theory has been a political and scholarly endeavor in tension with its key concepts (e.g. female, gender, sex, sexuality, slavery, woman, women, lesbian, queer, feminine/masculine, patriarchy, embodiment, &quot;feminism&quot;), and even in struggle with the identity of its very own subject. Imagine &quot;woman&quot;: Is this a shared, coherent, and stable category born of female bodies marked as inferior and subordinate to men ? Or is it a fictitious unity that disintegrates once confronted with the manifold diversities of race, ethnicity, (trans)nationality, age, and class? Perhaps not all women have the same gender. Consider &quot;sex&quot;: does the binary notion of sexual difference (male/female; man/woman) paradoxically undercut feminist goals by reaffirming the very heterosexual matrix they otherwise seeks to disrupt? If so, and &quot;woman&quot; has meaning only in heterosexual systems of thought, then should we conclude that when it comes to female sexuality lesbians are not women? Let's say they're not: Does that mean that all lesbians therefore have the same sexuality, passions, and modes of desire? If so, how &quot;queer&quot; is that? And what about &quot;gender&quot;? Is it the cultural construction of a foundational already &quot;sexed&quot; body? Or are sex and the sexed body only the props of an artificially &quot;natural&quot; duality (m/f) that legitimates the subjugation of female to male and women to men? In that case, if &quot;gender&quot; is only a harsh imposition that robs many persons (called &quot;women&quot;) of what belongs to them by right, then must gender be destroyed? Or might we think &quot;gender&quot; not as a fixed relation of subordination but as the creation of &quot;performative possibilities&quot; that potentially subvert the representations and restrictions of compulsory heterosexuality? Yet if feminism risks &quot;gender&quot; as purely performative and up for grabs, what happens to the identity of the feminist subject? Imagine there's no such thing as &quot;women&quot;. Is there anything left for feminism to liberate (or dominate)? If not, then what's the point of feminist politics? These are some of the theoretical, conceptual, and political questions with which feminist theories and theorists contend (in mighty turbulence!) after Beauvoir. The aim of this course is to clarify and assess these contestations through the reading and interpretation of a wide array of feminist thinkers and texts from the 1970s to the present. Without striving for any final settlements or total resolutions to these questions (much less &quot;right answers&quot;) we'll make an effort to draw from each of our thinkers and texts insights, perspectives, and points of view that challenge, or at least encourage us to consider more deeply, our own assumptions, presuppositions, and worldviews (feminist and otherwise)."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Mid-quarter text interpretive paper (5-6 pp); Final text interpretive paper (7-9 pp); four 1 page single spaced &quot;topoi&quot; due every other week on a specific term/word/concept in one of the readings; class attendance and active participation in discussion"}, {"name": "Class Materials (Required)", "value": "Required Texts: Gender Trouble: Feminism and the Subversion of Identity. Judith Butler. [Routledge Press, 1999]: The Second Wave: A Reader in Feminist Theory. Linda Nicholson, ed. [Routledge Press, 1997]; The Straight Mind and Other Essays. Monique Wittig. [Beacon Press, 1992], also a Course Packet and selected essays, chapters, and articles made available on course website."}], "lmod": "1/9/16 6:48 PM (CT)", "subject": "GNDR_ST"}]