[{"class_mtg_info": [{"meet_t": "We 6:15PM - 9:15PM", "meet_l": "Wieboldt Hall 714"}], "school": "SCS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "18467", "title": "SCS PSYCH 384-CN-15 Close Relationships", "class_attributes": "", "section": "18467", "instructors": [{"instructor_phone": "", "instructor_name": "Grace   Larson", "instructor_addr": ""}], "topic": "", "course": "384-CN", "descriptions": [{"name": "Overview of class", "value": "Having meaningful, rewarding relationships is one of the biggest determinants of whether we are happy and healthy: good relationships don't only influence our emotional wellbeing, but also our physical vitality and even how long we live. In this course, we will explore why relationships and belonging are so profoundly important to humans. We will then turn our focus to how relationships begin, and how we decide who exactly we want to be closer with. We will discuss how we can best maintain fulfilling, healthy relationships once we've found them, and how relationships can shape, change, and motivate us. Finally, we'll explore the consequences of rejection and of losing a valued relationship. <br/><br/>This course will give you research-based tools to understand and navigate relationships in your own life. To accomplish this, we will analyze primary research within class discussions and writing assignments. We will focus on integrating ideas from the wide range of scientific perspectives on relationships, and on thoughtfully applying findings from relationship psychology to real-world situations."}, {"name": "Registration Requirements", "value": "PSYCH 110 or equivalent."}, {"name": "Learning Objectives", "value": "Through participating in this course, students will be able to:<br/><br/>1. Articulate how close relationships shape humans' lives, wellbeing, and identities.<br/><br/>2. Apply the principles of relationship science to real-world examples, in particular examining how research findings could be used to improve relationships.<br/><br/>3. Evaluate the methods and findings from original research studies, assessing whether study findings are generalizable to the &quot;real world&quot; and to different kinds of relationships.<br/><br/>4. Integrate ideas from different theories and perspectives in relationship psychology, identifying broad themes that appear across distinct theories and research topics."}, {"name": "Teaching Method", "value": "Class participation and discussion<br/>Lecture<br/>Group work<br/>Films / videos<br/>Readings<br/>Writing assignments"}, {"name": "Evaluation Method", "value": "Class participation<br/>Quizzes<br/>Paper"}, {"name": "Class Materials (Required)", "value": "Texts or materials may include the following (subject to change):<br/><br/>Bradbury, T. N., &amp; Karney, B. R. (2010). Intimate Relationships. New York: W.W. Norton &amp; Co. (ISBN-13: 978-0393920239), available at NU bookstore<br/><br/>Short original research articles, available on Canvas"}], "lmod": "10/30/16 6:57 PM (CT)", "subject": "PSYCH"}]