[{"class_mtg_info": [{"meet_t": "MoWe 9:30AM - 10:50AM", "meet_l": "Swift Hall 210"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Winter 2017", "name": "25549", "title": "WCAS PSYCH 496-1-20 Contemporary Psychotherapy", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "25549", "instructors": [{"instructor_phone": "X7  2290", "instructor_name": "Richard E Zinbarg", "instructor_addr": "302 Swift Hall"}], "topic": "", "course": "496-1", "descriptions": [{"name": "Overview of class", "value": "The purpose of this course is to give graduate students a survey of theory, research, and practice in psychological interventions, with major emphasis on empirically supported approaches and research methods for studying psychotherapy."}, {"name": "Registration Requirements", "value": "Permission of instructor"}, {"name": "Learning Objectives", "value": "The student will be expected to know the major schools of thought about psychotherapy, major findings in the field and research methods for studying psychotherapy."}, {"name": "Teaching Method", "value": "Class participation; Films / videos; Lecture; Presentations; Readings; Seminar; Writing assignments"}, {"name": "Evaluation Method", "value": "Class participation; Paper, final; Papers; Presentations; Readings"}, {"name": "Class Materials (Required)", "value": "Assorted journal articles and chapters."}, {"name": "Class Notes", "value": "Richard E. Zinbarg, Ph.D., received his PhD from Northwestern University in 1989, completed his internship at the Medical College of Pennsylvania with Dr. Edna Foa and spent three years as a post-doctoral fellow with Dr. David Barlow (at the time at The State University of New York at Albany). He has published over 90 articles and chapters in the areas of anxiety disorders, clinical research methodology and measurement theory. Currently, he is Professor and Director of Clinical Training in the Psychology Department of Northwestern University. He is also the Patricia M. Nielsen Research Chair and Director of the Anxiety and Panic Treatment Program of The Family Institute at Northwestern University. He served as the director of the Oregon Program for Anxiety Study and Treatment, project director for the DSM-IV Mixed Anxiety Depression field trial, a member of the DSM-IV Text Revision Mixed Anxiety Depression Subcommittee and is currently serving as an advisor to the DSM-V Task Force. He was an Associate Editor for the British Journal of Clinical Psychology and an Associate Editor for the Journal of Abnormal Psychology. His research interests focus on understanding the structure of anxiety and depression, risk factors for the development of anxiety and depressive disorders, clinical research methodology, developing more effective treatments for the anxiety disorders with a particular focus on generalized anxiety disorder and basic measurement theory and techniques. Dr. Zinbarg's theoretical orientation is primarily cognitive-behavioral though his clinical work has also been influenced by Motivational Interviewing and related work on common factors of psychotherapy. Most recently, through his collaboration with colleagues at The Family Institute, Dr. Zinbarg has also begun to incorporate systemic approaches to the understanding and treatment of anxiety disorders."}], "lmod": "12/25/16 7:06 PM (CT)", "subject": "PSYCH"}]