[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Parkes Hall 224"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "22842", "title": "WCAS ASIAN_LC 390-0-20 Advanced Topics in Asian Languages and Cultures", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "22842", "instructors": [{"instructor_phone": "847/467-3314", "instructor_name": "Corey   Byrnes", "instructor_addr": "1800 Sherman, 5th Floor, Suite 5400, Office 5406"}], "topic": "Landscapes of Desolation", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "Landscapes of Desolation in the Age of the Chinese Economic Miracle : In the eyes of many, China's post-Mao economic ?miracle' has transformed the nation from communist hinterland into a menacing capitalist juggernaut that aspires to global political and economic hegemony. Increasingly, however, the power of this narrative lies as much in visions of scorched earth and fetid waterways as it does in nightmares of a new world order. This course explores how artists, filmmakers and writers, from China and elsewhere, have responded to actual and imagined environmental degradation in China and how they have come to produce a new mode of ?Chinese landscape,' the landscape of desolation."}, {"name": "Learning Objectives", "value": "This course is designed to introduce students to humanistic approaches to understanding and representing environmental problems. It will also help students hone their close reading, listening, viewing and writing skills."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Participation: 25% (This includes attendance, thorough preparation of all assigned materials and active participation in classroom discussion)<br/>Short Essays: 30% (3 3-page essays at 10% each)<br/>Discussion Posts: 15%<br/>Final Project: 30%"}, {"name": "Class Materials (Required)", "value": "A bound course reader will be available for purchase. Supplementary readings, sound recordings and visual resources will be uploaded to the class Canvas website. The novel The Man with the Compound Eyes, by Wu Ming-yi is also required."}], "lmod": "1/9/16 6:43 PM (CT)", "subject": "ASIAN_LC"}]