[{"class_mtg_info": [{"meet_t": "MoWeFr 11:00AM - 11:50AM", "meet_l": "University Hall 418"}], "school": "WCAS", "overview_of_class": "In this course we examine the work of some of the most original film directors in Spain from the neorrealista movement of the 1950's and 1960's to contemporary filmmakers such as Alejandro Amenábar, Cesc Gay,  and Isabel Coixet. We will pay special attention to the surrealist films of Luis Buñuel, the melodrama comedies and dramas by Pedro Almodóvar, and the magical imagination of Julio Medem, among others. We will also discuss some of the films made by the new generation of directoras (such as Icíar Bollaín, Mar Coll) and young film makers (Jaume Balagueró, Juan Antonio Bayona. We will analyze the narrative and visual structure of the films, as well as their relation to main political and cultural issues in Catalan and Spanish societies.", "qtr": "Winter 2016", "name": "Topics in Film: The Silver Screen in Latin America and/or Spain", "title": "WCAS SPANISH 380-0-1 Topics in Film: The Silver Screen in Latin America and/or Spain", "lmod": "1/9/16 6:54 PM (CT)", "section": "1", "instructors": [{"instructor_phone": "847/491-5063", "instructor_name": "Elisa   Marti-Lopez", "instructor_addr": "2-145 Crowe"}], "topic": "Introduction to Spanish and Catalan Films", "course": "380-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "In this course we examine the work of some of the most original film directors in Spain from the neorrealista movement of the 1950's and 1960's to contemporary filmmakers such as Alejandro Amenábar, Cesc Gay, and Isabel Coixet. We will pay special attention to the surrealist films of Luis Buñuel, the melodrama comedies and dramas by Pedro Almodóvar, and the magical imagination of Julio Medem, among others. We will also discuss some of the films made by the new generation of directoras (such as Icíar Bollaín, Mar Coll) and young film makers (Jaume Balagueró, Juan Antonio Bayona. We will analyze the narrative and visual structure of the films, as well as their relation to main political and cultural issues in Catalan and Spanish societies."}, {"name": "Registration Requirements", "value": "Prerequisites: 201 or 202; 203 or 207; 204; and 1 other 200-level literature or culture course."}], "path": "/class-descriptions/4610/WCAS/SPANISH/380-0/24034", "instructor": ["Elisa   Marti-Lopez"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "24034", "subject": "SPANISH"}]