[{"class_mtg_info": [{"meet_t": "Sa 9:00AM - 4:00PM", "meet_l": "Wieboldt Hall 516"}], "school": "SCS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "27567", "title": "SCS ENGLISH 111-CN-17 Writing Seminar II", "class_attributes": "", "section": "27567", "instructors": [{"instructor_phone": "", "instructor_name": "Michelle W. Greenberg", "instructor_addr": ""}], "topic": "Movies, Culture, and Society", "course": "111-CN", "descriptions": [{"name": "Overview of class", "value": "There is no question that movies influence every aspect of our culture, from ideas on lifestyle and morality to race relations and international politics. But what exactly is the relationship between the movies and the way we think and behave? What are the cinematic themes that have touched the American public from the early days of movies to the present, embodied in the work of great directors such as Frank Capra, Alfred Hitchcock, Martin Scorsese, Spike Lee and Oliver Stone? These questions are explored in an intensive five-week workshop and seminar in which students develop the skills needed to write thoughtful college research papers. Because of the rigorous and fast-paced nature of the class, students should have completed English 110 or an equivalent class in writing fundamentals. Presented in a five-week format, this course meets for five Saturdays from 9:00 am to 4:00 pm: 1/9, 1/16, 1/23, 1/30 and 2/6. First class attendance is mandatory."}, {"name": "Registration Requirements", "value": "ENGLISH 110 or equivalent. Before taking this course, students should have a basic understanding of English grammar and mechanics, and should be able to write clear, competent sentences using standard English. Students who need more basic writing instruction should enroll in ENGLISH 110."}, {"name": "Learning Objectives", "value": "Will understand through research and writing, the impact of movies on culture, politics, and our lives Will develop the analytical and research skills needed to write effective college research papers. Will develop a process for drafting and editing, and critiquing your work."}, {"name": "Teaching Method", "value": "Seminar<br/>Field trips<br/>Readings<br/>Group work<br/>Class participation<br/>Research project<br/>Writing assignments<br/>Discussion"}, {"name": "Evaluation Method", "value": "Field trips<br/>Attendance: required; more than one absence or very late arrival may prevent passing the class<br/>Class participation<br/>Group work<br/>Papers<br/>Homework<br/>Peer assessment<br/>Readings<br/>Research project<br/>Writing assignments"}, {"name": "Class Materials (Required)", "value": "Quart and Auster, American Film and Society since 1945 Edition:4TH 11 Publisher:ABC CLIO ISBN: 9781440800795"}, {"name": "Class Notes", "value": "The theme is an enjoyable one. The whole idea is that you regularly watch movies and would enjoy writing about them. Our focus is American movies and their impact on society. In that way, it is really an American Studies class as well as a writing class. It is not a &quot;film&quot; class-we don't watch movies as a group; so if you have little or no familiarity with American movies, it would be more beneficial for you to choose a different theme-base writing class."}], "lmod": "12/29/16 6:49 PM (CT)", "subject": "ENGLISH"}]