[{"class_mtg_info": [{"meet_t": "Mo 6:15PM - 9:15PM", "meet_l": "University Hall 121"}], "school": "SCS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "27575", "title": "SCS FINANCE 360-CN-62 Corporate Finance", "class_attributes": "", "section": "27575", "instructors": [{"instructor_phone": "", "instructor_name": "David D Walker", "instructor_addr": ""}], "topic": "", "course": "360-CN", "descriptions": [{"name": "Overview of class", "value": "Corporate Finance 360 will give the student a good overview of the world of capital markets, including the role of the corporation in society, the concept and definition of risk and reward, size and valuation of the fixed income and equity markets, the definition of derivatives and some trading strategies, balance sheet analysis, project finance, corporate valuation, the investment banking process and corporate bankruptcies and trading of distressed debt. The following topics are covered:<br/><br/>? Definition and significance of capital markets<br/>? Definition of risk and reward and quantification of risk<br/>? Overview of the fixed income market and specific valuation methods<br/>? Various ways to classify equities as well as valuation techniques<br/>? Corporate valuation and project finance methodologies<br/>? The role of an investment banker and banking process as well and bankruptcies"}, {"name": "Registration Requirements", "value": "FINANCE 202 or equivalent."}, {"name": "Learning Objectives", "value": "Students will have a good working understanding of the above mentioned topics in financial markets and be able to articulate them if needed in a job interview and implement them in a subsequent entry level position with an investment bank, hedge fund, etc. They will also be able to implement the principles of finance into their daily lives."}, {"name": "Teaching Method", "value": "Class participation<br/>Discussion<br/>Guest speakers<br/>Lecture<br/>Problem sets<br/>Readings"}, {"name": "Evaluation Method", "value": "Class attendance 15% <br/>Class participation 15%<br/>Mid Term Exam 30%<br/>Final Exam 40%"}, {"name": "Class Materials (Required)", "value": "Textbook is Intermediate Financial Management by Brigham &amp; Daves 9th Edition<br/>Either a laptop with spreadsheet capabilities or a working financial calculator"}, {"name": "Class Notes", "value": "This class is useful for students considering getting an MBA from a top business school, as many former students have gone on to attend top MBA programs. Also, students wanting to make a career change into finance, an entrepreneur looking to increase their financial knowledge or someone just looking to acquire knowledge in the field of finance will find this course useful."}], "lmod": "12/24/16 6:50 PM (CT)", "subject": "FINANCE"}]