[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "Locy Hall 111"}], "school": "WCAS", "overview_of_class": "Overview<br/><br/>This course will consider the use of formal statistical methods to analyze data from baseball, football, basketball, soccer, and other sports and to use such analyses to address sports-based questions. Statistical methods that are particularly useful in analyzing sports data will be presented, including random-effects and mixed-effects models, methods of dimension reduction such as principal components analysis, and tree-based methods. Students will be expected to formulate their own sports-related research questions and to conduct the appropriate statistical analyses to answer them.", "qtr": "Spring 2016", "name": "Undergraduate Seminar", "title": "WCAS STAT 398-0-20 Undergraduate Seminar", "lmod": "4/3/16 8:24 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "847.467.1254", "instructor_name": "Thomas A Severini", "instructor_addr": "2006 Sheridan Road/Room 305/Department of Statistics"}], "topic": "Analysis of Sports Data", "course": "398-0", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "descriptions": [{"name": "Overview of class", "value": "Overview<br/><br/>This course will consider the use of formal statistical methods to analyze data from baseball, football, basketball, soccer, and other sports and to use such analyses to address sports-based questions. Statistical methods that are particularly useful in analyzing sports data will be presented, including random-effects and mixed-effects models, methods of dimension reduction such as principal components analysis, and tree-based methods. Students will be expected to formulate their own sports-related research questions and to conduct the appropriate statistical analyses to answer them."}, {"name": "Registration Requirements", "value": "Registration<br/><br/>Permission of instructor: severini@northwestern.edu <br/><br/>The ideal preparation for the course is a background in statistics equivalent to one of STAT 350, ECON 381-1, or IEMS 304 as well as interest in and detailed knowledge of one or more sports for which performance data is routinely collected (e.g., baseball, football, soccer, etc.). Students with a limited background in statistics, but a strong interest in sports, may be granted permission to register for the course; such students will need to do additional reading on statistical methods."}, {"name": "Learning Objectives", "value": "1. Formulate sports-related questions that can be answered using statistical methods<br/><br/>2. Develop and interpret statistics models used to answer these questions<br/><br/>3. Use statistical software to analyze data and to draw appropriate conclusions<br/><br/>4. Understand the role of assumptions in a statistical analysis and evaluate their impact on the conclusions of the study"}, {"name": "Teaching Method", "value": "The course will use a combination of lectures and a more discussion-based &quot;seminar style&quot;. Statistical methods useful for analyzing sports data will be presented by the instructor; applications of these methods, including the results from homework assignments, will be discussed in class. Students will present a proposal for a research project and will present the results of their analysis; other students will contribute to the discussion of the proposal and the results."}, {"name": "Evaluation Method", "value": "Evaluation<br/><br/>Grades will be based on a course project, homework assignments and class participation. The course projects will be conducted individually or in a group of 2 or 3 students. Each individual/group will be required to present a project proposal (10%), to submit a progress report (5%), to submit a final paper (25%), and to present their work to the class (20%).<br/><br/>There will be two or three homework assignments involving data collection and analysis (20%) and students will be expected to contribute to class discussions (20%)."}, {"name": "Class Materials (Suggested)", "value": "Analytic Methods in Sports: Using Mathematics and Statistics to Understand Data from Baseball, Football, Basketball, and Other Sports by T. A. Severini, published by CRC Press. http://www.amazon.com/Analytic-Methods-Sports-Mathematics-Statistics/dp/1482237016"}, {"name": "Class Notes", "value": "Attendance at the first class is required."}], "path": "/class-descriptions/4620/WCAS/STAT/398-0/36753", "instructor": ["Thomas A Severini"], "class_attributes": "", "id": "36753", "subject": "STAT"}]