[{"school": "WCAS", "overview_of_class": "Frantz Fanon has famously written that the conditions of modernity have rendered blackness increasingly illegible, fraught with contradictions that push it outside the realm of facile comprehension and explicability. Taking Fanon's polemic as a cue, this graduate seminar will look at a number of late twentieth-century textual and performance sites with radical instances of experimentation where articulations of blackness move into the interstitial space between meaning and non-meaning, coming into being precisely at the moment when the compositional logic of their anticipated forms are ruptured. <br/> <br/>The course will focus on three primary sites where black artists engage what might be called the poetics of dissolution to examine and critique the processes of racial formation: poetry (where the form of the line or stanza dissolves); music (where sonic interpolations puts additional, if not different, claims on the lyrical content); and visual culture (where the moves toward graphic mimesis are refused delineation).", "name": "Studies in American Literature", "section": "20", "location": "University Hall 018", "topic": "Fade to Black: Cultural Production & Poetics of Di", "course": "471-0", "meeting_time": ["Tu 2:00PM - 4:50PM"], "path": "/class-descriptions/4620/WCAS/ENGLISH/471-0/34974", "instructor": ["Ivy G Wilson Jr"], "class_attributes": "", "id": "34974", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "It was a truism in eighteenth- and nineteenth-century America that writing was a western invention, a technology that Native American peoples lacked, as allegedly indicated by their inability to tell their own ancient histories. It was on this basis, among others, that Euro-Americans claimed the right to \"civilize,\" remove, and exterminate Native peoples. But a closer look shows that such claims were far from true: Native American and Indigenous peoples in the Americas and throughout the globe not only possessed their own textual systems but also, after colonialism, engaged with and adapted alphabetic writing and print to claim sovereignty over their communications, land, and histories.<br/><br/>This seminar will explore the textualities and practices that compose Native American and Indigenous Cultures of Print. Native and Indigenous peoples' engagement with print began as early as colonial encounters and was a capacious, creative practice that writers employed to argue for and articulate various forms of sovereignty. While their encounters with print often occurred in coercive contexts such as treaty negotiations, religious education, and literacy instruction, Native and Indigenous people seized the tools of print, turning them to their own purposes. We will explore the non-alphabetic textual practices that provided a foundation for adaptations to alphabetic writing and to print, before examining the cultures of print that flourished in Native and Indigenous communities, with a particular focus on the circulation of tribal histories and on political activism. Finally, we will put this literary history into conversation with recent scholarship in the field of Native American and Indigenous studies, in order to consider and complicate key terms such as sovereignty, recognition, and settler colonialism, among others. Course readings will consist of eighteenth- and nineteenth-century Native and Indigenous literatures from throughout the Americas and the world as well as recent scholarship in the history of the book and Native American and Indigenous Studies.", "name": "Studies in American Literature", "section": "21", "location": "University Hall 018", "topic": "Native American and Indigenous Cultures of Print", "course": "471-0", "meeting_time": ["Th 2:00PM - 4:50PM"], "path": "/class-descriptions/4620/WCAS/ENGLISH/471-0/34975", "instructor": ["Kelly E Wisecup"], "class_attributes": "", "id": "34975", "subject": "ENGLISH"}]