[{"school": "WCAS", "overview_of_class": "The aim of this course is encourage students to discuss the postcolonial meaning of African American Studies by understanding African American identities, histories, cultures and politics in terms that encompass black populations in Latin America and the Caribbean as well as black populations in the United States. In short, this means understanding formations of Blackness as a multiplicity of Black historical experiences across the Americas not just within the United States. The importance of history cannot be overstated. It is important to recall that up until the mid-point of the 20th century, the majority of Black populations of African descent on the planet across Africa, the Americas and Europe lived under formalized colonial and racial regimes based on institutionalized western white supremacy. Despite the fact that Black populations in Latin America and the United states were citizens of independent countries while those in Africa and the Caribbean largely remained colonized subjects, Black populations throughout this African Diaspora, were overwhelmingly subjects of racial subordination, racial segregation and racial violation. Throughout the 20th century the colonial question of race, its rule over Black populations lives, and diverse Black resistances to race, deeply influenced the cultural and political orientations and solidarities of the Africa diaspora to overcome western colonialism and racial segregation. In this context, the idea of the postcolonial is indicative of American societies that combine liberalism and colonialism, capitalism and race, democracy and whiteness, nationalism and multiculturalism, despite the historical evidence that European empires are phenomena of the past. The question this course asks is: What can we gain from understanding the US Black experience as part of the Black experience of the Americas within a postcolonial framework?", "name": "Post Colonial African American Studies", "section": "20", "topic": "", "course": "375-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4620/WCAS/AF_AM_ST/375-0/31936", "instructor": ["Herman Barnor Hesse"], "id": "31936", "subject": "AF_AM_ST"}]