[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "University Hall 121"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "38000", "title": "WCAS ASIAN_ST 390-4-1 Adv Topics in Asian Studies", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "38000", "instructors": [{"instructor_phone": "847/491-3418", "instructor_name": "Melissa A Macauley", "instructor_addr": "Harris Hall - Room 344"}], "associated_classes": [{"component": "DIS", "room": "Harris Hall L06", "meeting_time": "We 1:00PM - 1:50PM"}, {"component": "DIS", "room": "University Hall 312", "meeting_time": "We 2:00PM - 2:50PM"}, {"component": "DIS", "room": "University Hall 418", "meeting_time": "We 4:00PM - 4:50PM"}], "topic": "Sino-American Relations in the Modern World", "course": "390-4", "descriptions": [{"name": "Overview of class", "value": "There are few international relationships more important than the one forged between the United States and China over the course of two centuries. Sino-American relations have oscillated dramatically between profound hostility and warm friendship. This course will explore the historical evolution of that relationship from the rise of the American opium trade off the China coast in the nineteenth century, through the fraught relationship of the two allies during both World Wars, through the Cold War era of rivalry and rapprochement, to the present-day tensions roiling the South China Sea region. We will consider the bilateral Sino-American relationship in its larger global context and in connection to the issues of war, diplomacy, race, gender, religion, and material and popular culture. We also will pay particular attention to the ways that the international arena became integral to the domestic politics of both countries."}, {"name": "Registration Requirements", "value": "None; but is it presumed that most students would have a basic background in American History but no knowledge of Chinese History is presumed."}, {"name": "Teaching Method", "value": "Lecture &amp; Discussion"}, {"name": "Evaluation Method", "value": "Participation, One Short Paper, &amp; Exams"}, {"name": "Class Materials (Required)", "value": "R. David Arkush &amp; Leo O. Lee. Land Without Ghosts: Chinese Impressions of America from the Mid- Nineteenth Century to the Present. Eva Jane Price. China Journal, 1889-1900: An American Missionary Family during the Boxer Rebellion. Joyce Mao. Asia First: China and the Making of Modern American Conservatism. Course Packet We will also view several films, including &quot;The Sand Pebbles&quot; and &quot;55 Days in Peking.&quot;"}], "lmod": "2/21/17 6:44 PM (CT)", "subject": "ASIAN_ST"}]