[{"school": "WCAS", "overview_of_class": "This course explores the overlap between the domains we call \"religion\" and \"politics.\" We will look at the ways in which religions have served and serve as political resources primarily by examining the general role of ideology and ritual within politics. Throughout our analysis, we will ask how the religious/political binary both helps and hinders our understanding of the function of different ideologies and rituals in the pursuit of political goals. Ultimately, we want to scrutinize the concept of \"religious authority\" itself. Does religion provide access to unique political resources such that we might theorize the existence of \"religious authority\" as a specific kind of political power? Does religion play a specific role within political contest such that we can theorize a general relationship between religion and politics at all? We will find that such questions cannot be addressed without examining the history of secularism itself and contemporary debates about the relationship between religion in politics.", "name": "Topics in Comparative Religion", "section": "20", "location": "Locy Hall 106", "topic": "Religion, Politics and Power", "course": "379-0", "meeting_time": ["Mo 3:00PM - 5:50PM"], "path": "/class-descriptions/4620/WCAS/RELIGION/379-0/34728", "instructor": ["Mark Richard McClish"], "class_attributes": "", "id": "34728", "subject": "RELIGION"}, {"school": "WCAS", "overview_of_class": "Of all human phenomena, it is hard to think of one more universal, more all-encompassing, and more confounding than death. We are all advancing constantly toward our own death, and almost all of us, at one point or another, are confronted with the death of a loved one. Nevertheless, death is a remarkably silenced topic in our culture, mostly hidden from the public eye and barely receiving serious consideration in contemporary culture. This has not always been the case, and is not the case everywhere: in the ancient world \"learning how to die\" was perhaps the most important aspect of one's life goals, and in various societies processes of burial, accompaniment of the dead, and mourning still constitute a fundamental part of one's social and communal life. The purpose of this class is threefold: first, to get acquainted with some of the most interesting and influential ideas in the history of human civilization, by using the theme of death as a guiding compass. Second, to understand and appreciate the incredible diversity of human experiences and approaches across times and places, and thereby develop greater cultural sensitivity. And third, to acquire a kit of intellectual and conceptual tools to help us better understand our own death and the death of others as an inescapable part of life, and to utilize this understanding toward the development of deeper compassion and greater ethical consciousness.", "name": "Topics in Comparative Religion", "section": "22", "location": "Allison Residential Comm 1021", "topic": "Confronting Death: Past and Present", "course": "379-0", "meeting_time": ["Tu 4:00PM - 6:30PM"], "path": "/class-descriptions/4620/WCAS/RELIGION/379-0/34727", "instructor": ["Mira   Balberg"], "class_attributes": "", "id": "34727", "subject": "RELIGION"}]