[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Technological Institute AUD"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "27672", "title": "WCAS ENVR_POL 340-0-1 Global Environments and World History", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "27672", "instructors": [{"instructor_phone": "847/467-3397", "instructor_name": "Helen Louise Tilley", "instructor_addr": "Harris Hall - Room 312"}], "topic": "", "course": "340-0", "descriptions": [{"name": "Overview of class", "value": "Environmental problems have today become part and parcel of popular consciousness: resources are being depleted at a record pace, human population levels just crossed the seven billion threshold, extreme poverty defines the majority of people's daily lives, toxic contaminants affect all ecosystems, increasing numbers of species face extinction, consumerism and the commodification of nature show no signs of abating, and weapons and energy systems continue to proliferate that risk the planet's viability. This introductory lecture course is designed to help students understand the relatively recent origins of many of these problems, focusing especially on the last one hundred and fifty years. Students will have an opportunity to learn about the environmental effects of urbanization, industrialization, population growth, market economies, empire-building, intercontinental warfare, energy extraction, and new technologies. They will also explore different environmental philosophies and analytic frameworks that help us make sense of historical change, including political ecology, environmental history, science studies, and world history. Finally, the course will examine a range of transnational organizations, social movements, and state policies that have attempted to address and resolve environmental problems."}, {"name": "Teaching Method", "value": "DiscussionLecture"}, {"name": "Evaluation Method", "value": "Exam-final: (take-home)<br/>Papers: (3 essays, 4 pgs. each)"}, {"name": "Class Materials (Required)", "value": "***Tentative until posted to Norris website*** Course Packet - Sample titles include, John McNeill, Something New Under the Sun: An Environmental History of the Twentieth Century; Richard Tucker, Insatiable Appetite: the United States and the Ecological Degradation of the Tropical World; Mike Davis, Planet of Slums; and David Egerton, The Shock of the Old: Technology and Global History since 1900."}, {"name": "Class Notes", "value": "Areas of Concentration: Global"}], "lmod": "12/29/16 6:58 PM (CT)", "subject": "ENVR_POL"}]