[{"school": "WCAS", "overview_of_class": "The focus of this course is an overview of research and theory related to children's cognitive development with a primary focus on infancy and childhood. Among the topics we will cover are: processes of conceptual change, abstract concepts, linguistic structure, social and moral cognition. Through discussion and readings on these topics we will gain information critical to understanding cognition in general.", "name": "Special Topics in Cognition", "section": "20", "location": "Annenberg Hall G32", "topic": "Cognitive Development", "course": "460-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4660/WCAS/PSYCH/460-0/35685", "instructor": ["Susan J Hespos"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "id": "35685", "subject": "PSYCH"}, {"school": "WCAS", "overview_of_class": "Questions concerning the link between language and cognition, central to the cognitive sciences, are especially compelling when considered from a developmental perspective. This course will be devoted to examining language development, cognitive development, and the relation between them in infancy and early childhood. The very best work in this area draws upon strong theoretical traditions in psychology and linguistics to discover new insights into existing evidence and to forge new programs of research that are well-informed by each of the intellectual traditions. In this course, we will consider both traditions. We will take advantage of recent reviews and primary source materials. The seminar will be focused on fundamental psychological issues. We explore current evidence on word-learning and its relation to conceptual development. All along the way, we will consider the ways in which cross-species, cross-linguistic, and cross-cultural developmental research can inform these issues. <br/><br/>This is a very advanced, writing-intensive and participation-intensive seminar. There is no text and the reading will consist largely of scholarly reviews and primary source materials. All students (undergraduates and graduate students alike) will be expected to summarize and critique seminar readings. There will be weekly ?reaction papers', a midterm paper, and a final research paper.", "name": "Special Topics in Cognition", "section": "21", "location": "Annenberg Hall G32", "topic": "Early Conceptual Language and Development", "course": "460-0", "meeting_time": ["Th 10:00AM - 12:50PM"], "path": "/class-descriptions/4660/WCAS/PSYCH/460-0/35686", "instructor": ["Sandra R Waxman"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "id": "35686", "subject": "PSYCH"}]