[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "Harris Hall 107"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-registration - Reserved for English students.", "qtr": "Spring 2017", "name": "33427", "title": "WCAS ENGLISH 214-0-01 Introduction to Film and Its Literatures", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "33427", "instructors": [{"instructor_phone": "847/491-3433", "instructor_name": "Nicholas K Davis", "instructor_addr": "1897 Sheridan, Uh 215, Evanston, IL 60208"}], "associated_classes": [{"component": "DIS", "room": "Parkes Hall 223", "meeting_time": "Th 4:00PM - 4:50PM"}, {"component": "DIS", "room": "University Library 4770", "meeting_time": "Th 4:00PM - 4:50PM"}, {"component": "DIS", "room": "Harris Hall L05", "meeting_time": "Th 5:00PM - 5:50PM"}, {"component": "DIS", "room": "Harris Hall L04", "meeting_time": "Th 5:00PM - 5:50PM"}, {"component": "DIS", "room": "University Hall 018 English", "meeting_time": "Fr 11:00AM - 11:50AM"}, {"component": "DIS", "room": "University Hall 118", "meeting_time": "Fr 11:00AM - 11:50AM"}, {"component": "DIS", "room": "Parkes Hall 213", "meeting_time": "Fr 11:00AM - 11:50AM"}, {"component": "DIS", "room": "University Hall 018 English", "meeting_time": "Fr 12:00PM - 12:50PM"}, {"component": "DIS", "room": "Parkes Hall 213", "meeting_time": "Fr 12:00PM - 12:50PM"}, {"component": "DIS", "room": "Harris Hall L05", "meeting_time": "Fr 12:00PM - 12:50PM"}, {"component": "DIS", "room": "Locy Hall 314", "meeting_time": "Fr 10:00AM - 10:50AM"}, {"component": "DIS", "room": "Locy Hall 305", "meeting_time": "Fr 10:00AM - 10:50AM"}], "topic": "", "course": "214-0", "descriptions": [{"name": "Overview of class", "value": "This course harbors two primary objectives: 1) to acquaint students with vocabularies and frameworks of argument required to analyze a film sequence in terms specific to that medium; and 2) to familiarize students with a broad range of written texts crucial to the study of cinema, enabling them to render persuasive interpretations and arguments about those texts, as well. The first half of the course will emphasize recent case studies of literature adapted into popular movies, tracking how not just the plots and characters but the perspectives, voices, structures, prose styles, and associated politics of written work get preserved but also transformed on screen, in blatant and subtle ways. In the second half, we will reverse course to examine plays, essays, and other literary works inspired by the movies. We will also explore some classic texts of popular film journalism and scholarly film theory, treating these as two literary and intellectual canons in their own right. Cultivating techniques of close analysis, whether breaking down a film sequence, parsing a scholar's arguments, or negotiating between two versions of the &quot;same&quot; story, will be the paramount skill developed in the course, hopefully leading to deeper appreciations of several kinds of texts. Moreover, students will gain a valuable fluency in how to watch, dissect, and debate movies at a time when they still retain enormous cultural sway, both as entertainment vehicles and as venues for sustaining or contesting cultural and political narratives.<br/><br/>Lectures, discussion sections, and assignments will presume no prior coursework in film studies but they will require quick, studious absorption of terms and concepts that might be new. Moreover, the course requires a willingness to put movies and other assigned materials under close analytical pressure, while hopefully retaining the joy of watching, reading, and evaluating them. The syllabus has been streamlined somewhat from previous offerings and skews more heavily (though not exclusively) toward contemporary material, but the expectations of your writing, thinking, and conversation remain high. Movies are many things, but not a vacation!"}, {"name": "Teaching Method", "value": "Lectures three times per week, plus one weekly discussion section."}, {"name": "Evaluation Method", "value": "Two thesis-driven papers; shorter writing exercises; regular quizzes on course content."}, {"name": "Class Materials (Required)", "value": "Assigned films are likely to include Birdman (2014), Brokeback Mountain (2005), Jindabyne (2006), Now Voyager (1942), Precious (2009), Pulp Fiction (1994), and two recent releases, Arrival (2016) and Julieta (2016). Written texts include short stories by Raymond Carver, Ted Chiang, Alice Munro, and Annie Proulx, a novel by Sapphire, plays by Annie Baker and Adrienne Kennedy, and essays by James Baldwin, bell hooks, Laura Mulvey, and Andrew Sarris."}, {"name": "Class Notes", "value": "All films will stream for free over the course website. All readings will be available on the Canvas site and/or in a course packet available at Quartet Copies."}], "lmod": "2/14/17 6:44 PM (CT)", "subject": "ENGLISH"}]