[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Kresge 5531 Comp Lit. Sem. Rm."}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "22282", "title": "WCAS AMER_ST 310-0-20 Studies in American Culture", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "22282", "instructors": [{"instructor_phone": "847/491-3468", "instructor_name": "Lawrence L Stuelpnagel", "instructor_addr": "McCormick Foundation Building/4-135"}], "topic": "Bad News", "course": "310-0", "descriptions": [{"name": "Overview of class", "value": "Bad News. That is what Americans are experiencing as a result of the corporate media mergers that took place in the closing years of the last century. Today there are six major companies that control much of what people read, hear and see. Those firms are AOL-Time Warner, General Electric, Walt Disney, News Corporation, Viacom/CBS, and Bertelsman. <br/><br/>As the firms passed from largely family owned to publicly traded companies, the pressure for profit from Wall Street has led to cutbacks in the size of the firm's news divisions and a change in news story values that have &quot;softened&quot; the types of news that people see on television. <br/><br/>This course will begin with an examination of the monetary forces that are driving the industry away from its primary mission of information. Critics, of whom the professor is one, contend that the drive for increasing profits is coming at the expense of both the quality and quantity of news that appear on television and radio, newspapers and magazines, and the Internet. The ever-diminishing number of news providers is also threatening democracy by limiting the number of voices that can be heard in our society.<br/><br/>We will examine the impact of these mergers on several areas of news coverage and public discussion:<br/>1. Privacy and scandal, particularly the stories about President Bill Clinton. <br/>2. The transformation of how the press has covered wars from Vietnam to the second Iraq war and the war in Afghanistan. Has the media gone from watchdog to lapdog? <br/>3. Race. Former U.S. Senator Bill Bradley has said, &quot;America is a nation obsessed with the interplay between African Americans and White Americans.&quot; We will examine how the press has covered the issue of race in America and how the press deals with the issue in its own newsrooms. <br/>4. Politics. Reporting of scandals and personality has replaced critical evaluations of policy. The &quot;horse race&quot; with its poll-driven coverage is now the norm. We will examine the phenomenon through the lens of the 2000 and 2004 presidential races."}], "lmod": "12/29/16 6:53 PM (CT)", "subject": "AMER_ST"}]