[{"class_mtg_info": [{"meet_t": "MoWe 9:30AM - 10:50AM", "meet_l": "Fisk Hall 114"}], "school": "SoC", "enrl_requirement": "Enrollment Requirements: Reserved for Sophomores, Juniors, and Seniors from every undergraduate school only.", "qtr": "Spring 2017", "name": "33074", "title": "SoC COMM_ST 351-0-20 Technology &amp; Human Interaction", "class_attributes": "No Freshmen<br/><br/>Undergraduate Students Only<br/><br/>", "section": "33074", "instructors": [{"instructor_phone": "", "instructor_name": "Darren Robert Gergle", "instructor_addr": ""}], "topic": "", "course": "351-0", "descriptions": [{"name": "Overview of class", "value": "We are surrounded by technologies that support our everyday social interactions. Facebook and Twitter provide persistent services for exchanging personal information, Yik Yak provides a geographically bounded interaction space, ubiquitous computing environments allow objects to adapt to our everyday experiences, and new collaboration technologies enable people to work together on projects when they are thousands of miles apart. The design of such systems, however, is not simply a technical question. In order to successfully create these systems, we need to understand how people work, play, and communicate with one another in a wide variety of situations. This course illustrates the practice of understanding human interactions that take place both with and through technology; and it explores the design, creation and evaluation of technologies to support such interactions. Course topics include: design processes, prototype construction and evaluation techniques. Specialized topics cover technologies for special populations, social software and collaborative systems, and entertainment technologies. No programming experience is necessary. There will be occasional labs to explain technical content. Course requirements include short hands-on exercises, two exams, and a group project."}, {"name": "Class Materials (Required)", "value": "No textbook"}], "lmod": "2/20/17 6:37 PM (CT)", "subject": "COMM_ST"}]