[{"school": "SoC", "overview_of_class": "This course will provide a general overview of health communication as situated in the &quot;era of precision medicine.&quot; Students will learn about the shift toward precision medicine (providing health care according to individual variation in environment, lifestyle, and genes) and the associated challenges. Using traditional health communication theories and practices, we will examine the ways in which communication can facilitate the implementation of precision medicine, and alternatively, how theories and practices of health communication may need to be reconsidered.", "name": "Topics in Communication Studies", "section": "20", "topic": "Health Comm. and Precision Med", "course": "395-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4650/SoC/COMM_ST/395-0/23463", "instructor": ["Courtney Elizabeth Lynam Scherr"], "id": "23463", "subject": "COMM_ST"}, {"school": "SoC", "overview_of_class": "This course will familiarize students with the major topics, concepts, theories, and research studies that comprise the integrated body of literature on health and interpersonal communication. Major topics will include (a) experiencing illness, (b) social support from family, friends, and peers, (c) the influence of technology on interpersonal health communication, and (d) provider-patient communication. This course emphasizes students' active engagement and practical application of health communication theory in interpersonal contexts.", "name": "Topics in Communication Studies", "section": "21", "topic": "Interpersonal Health Communication", "course": "395-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4650/SoC/COMM_ST/395-0/23464", "instructor": ["Kimberly Brook Pusateri"], "id": "23464", "subject": "COMM_ST"}, {"school": "SoC", "overview_of_class": "Big data is currency, to those initiated in the nuts and bolts of data science. This hands-on data literacy course introduces cutting edge research on cultural markets. Students will learn how to plot and interpret graphs that measure performance in a cultural market; use Internet search data, Google's Ngram Viewer, and Twitter conversations to forecast trends; build, visualize, and explore networks; and use Amazon's Mechanical Turk for crowdsourcing. Accept an open mind, there are no prerequisites for the class. While formal thinking is encouraged, the course focuses on providing conceptual foundations and tools that apply across a variety of creative sectors.", "name": "Topics in Communication Studies", "section": "22", "topic": "Cultural Analytics", "course": "395-0", "meeting_time": ["We 1:00PM - 3:50PM"], "path": "/class-descriptions/4650/SoC/COMM_ST/395-0/23465", "instructor": ["Emoke-Agnes   Horvat"], "id": "23465", "subject": "COMM_ST"}, {"school": "SoC", "overview_of_class": "How do sexuality, race, gender, and class shape new media? This course explores the role of intersectional identity in technological transformations in media, focusing on the transition from analog to digital. Students will read historical case studies and theoretical essays on such topics as how social media affect how queer users interact and self-identify, how race influences cable TV distribution, and how gender shaped early radio. The course is organized into three key areas of inquiry - culture, organization, and technology - with the goal of understanding the complex ways they interrelate.", "name": "Topics in Communication Studies", "section": "23", "topic": "Queer New Media", "course": "395-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4650/SoC/COMM_ST/395-0/23466", "instructor": ["Aymar Christian Jean"], "id": "23466", "subject": "COMM_ST"}]