[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "Harris Hall L05"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "33267", "title": "WCAS ENGLISH 206-0-21 Reading &amp; Writing Poetry", "class_attributes": "Attendance at 1st class mandatory<br/><br/>No Seniors<br/><br/>", "section": "33267", "instructors": [{"instructor_phone": "", "instructor_name": "Averill A Curdy", "instructor_addr": ""}], "topic": "", "course": "206-0", "descriptions": [{"name": "Overview of class", "value": "An introduction to the major forms of poetry in English from the dual perspective of the poet-critic. Creative work will be assigned in the form of poems and revisions; analytic writing will be assigned in the form of critiques of other members' poems. A scansion exercise will be given early on. All of these exercises, creative and expository, as well as the required readings from the anthology, are designed to help students increase their understanding of poetry rapidly and profoundly; the more wholehearted students' participation, the more they will learn from the course."}, {"name": "Registration Requirements", "value": "No prerequisites. No P/N registration. Attendance of first class is mandatory. Freshmen are NOT permitted to enroll until their winter quarter. Seniors require department permission. Course especially recommended for prospective Writing Majors. Literature Majors are also welcome."}, {"name": "Teaching Method", "value": "Discussion; one-half to two-thirds of the classes will be devoted to discussion of readings and principles, the other classes to discussion of student poems."}, {"name": "Evaluation Method", "value": "Evidence given in written work and class participation of students' understanding of poetry; improvement will count for a great deal in estimating achievement."}, {"name": "Class Materials (Required)", "value": "An anthology, a critical guide, 206 Reader prepared by the instructor, and the work of the other students."}, {"name": "Class Notes", "value": "This course may also be counted toward the English Literature major."}], "lmod": "2/8/17 6:42 PM (CT)", "subject": "ENGLISH"}]