[{"class_mtg_info": [{"meet_t": "MoWe 12:30PM - 1:50PM", "meet_l": "University Library 4670"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Prerequisite: At least one quarter of English 210 or 270.", "qtr": "Spring 2016", "name": "34912", "title": "WCAS ENGLISH 298-0-21 Introductory Seminar in Reading &amp; Interpretation", "class_attributes": "", "section": "34912", "instructors": [{"instructor_phone": "", "instructor_name": "Maha Zehra Jafri", "instructor_addr": ""}], "topic": "Mysteries, Detectives, Clues", "course": "298-0", "descriptions": [{"name": "Overview of class", "value": "Unexplained disappearances, stolen treasures, shocking murders: to solve such mysteries, detectives must interpret the clues. In this course on detective fiction and literary interpretation, we'll follow various fictional sleuths as they encounter secret letters and broken locks, inscrutable puzzles and explosive twists, devious criminals and revelations about themselves. We'll see that detective work echoes literary criticism in many ways: detectives identify relevant details, track signs and patterns, scrutinize character, and look closely as well as broadly to determine the implications of their evidence?just as we do when analyzing the images, metaphors, and narrative structures that supply proof for our scholarly claims. How do fictional detectives model the art of interpretation, and what are the limits of their methods? We will read classics drawn from the American, Victorian, and contemporary traditions, as well as secondary scholarship on the history and formal trademarks of detective fiction. We'll trace the 19th-century origins of the genre in short works by Arthur Conan Doyle and Edgar Allan Poe, study the relationship between detection and narration in Wilkie Collins' The Moonstone, and examine how postmodernism transforms the quest for truth in Thomas Pynchon's The Crying of Lot 49. How do these texts play on our ideas about knowledge, criminality, and narrative form? What makes a mystery solvable? How does detective fiction comment on cultural questions of gender, class, race, and nationality? To fully explore such questions and expand students' methodological repertoires, this course will also include readings drawn from several schools of literary theory, including psychoanalysis, post-structuralism, Marxism, feminism, and postcolonial studies."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Essays, Canvas posts, participation."}, {"name": "Class Materials (Required)", "value": "A Study in Scarlet, &quot;A Scandal in Bohemia&quot; (Arthur Conan Doyle);<br/>&quot;The Murders in the Rue Morgue,&quot; &quot;The Purloined Letter,&quot; &quot;The Fall of the House of Usher,&quot; &quot;William Wilson&quot; (Edgar Allan Poe);<br/>The Moonstone (Wilkie Collins); The Crying of Lot 49 (Thomas Pynchon);<br/>additional theoretical and scholarly readings."}, {"name": "Class Notes", "value": "Prerequisites: One quarter of 210 or 270 or permission of DUS.<br/><br/>Notes: English 298 is an English Literature major and minor requirement. First class mandatory. No P/N registration. This course does NOT fulfill the WCAS Area VI distribution requirement."}], "lmod": "4/3/16 7:58 PM (CT)", "subject": "ENGLISH"}]