[{"class_mtg_info": [{"meet_t": "MoWeFr 10:00AM - 10:50AM", "meet_l": "Technological Institute M128"}], "school": "MEAS", "overview_of_class": "COURSE DESCRIPTION / Fundamental properties and behavior of soils as engineering materials. Origin of soils through the properties of soil components, to the strength, permeability, and deformation of soil masses.", "qtr": "Fall 2017", "name": "Introductory Soil Mechanics", "title": "MEAS CIV_ENV 250-0-01 Introductory Soil Mechanics", "lmod": "5/9/17 6:46 PM (CT)", "section": "01", "associated_classes": [{"component": "LAB", "room": "TBA", "meeting_time": "We 6:00PM - 8:50PM"}], "topic": "", "course": "250-0", "enrl_requirement": "Enrollment Requirements: REASON: Pre-registration is not allowed for this class. Please try again during regular registration.<br/><br/>Pre-req: Students must have completed CIV_ENV 216 to register for this course.", "descriptions": [{"name": "Overview of class", "value": "COURSE DESCRIPTION / Fundamental properties and behavior of soils as engineering materials. Origin of soils through the properties of soil components, to the strength, permeability, and deformation of soil masses."}, {"name": "Registration Requirements", "value": "CIV_ENV 216-0, Mechanics of Materials"}, {"name": "Learning Objectives", "value": "By the end of the course, students should be able to: <br/>1) Understand soil as a three-phase material and the definitions used to relate the phases; <br/>2) Determine the classification of soils through testing and visual observations; <br/>3) Relate water flow concepts from Fluid Mechanics to flow through soil and understand how water affects effective stress; <br/>4) Understand the compaction process and its specification as it applies to use of soil as a construction material; <br/>5) Calculate the magnitude and time rate of consolidation induced settlement resulting from changes in effective stress; <br/>6) Relate the two dimensional stress state in soil under load to shearing strength; <br/>7) Provide experimental laboratory exercises to verify objectives 2-6."}, {"name": "Teaching Method", "value": "This is arguably the first \"real\" engineering course that many students will take in the sense that problems encountered are more \"open-ended\" with a range of \"right answers\" in many instances, and they draw upon synthesizing concepts from preceding courses punctuated by an occasional need for engineering judgement. HOMEWORK / Solution of approximately 60 homework problems and preparation of six laboratory reports is required."}, {"name": "Class Materials (Required)", "value": "Being ordered for purchase at Norris Bookstore:<br/>Intro to Geotechnical Engineering / Holtz / ISBN 978-0132496346 / 2010 / 2nd / Prentice Hall"}], "instructor": ["Giuseppe   Buscarnera"], "class_attributes": "", "id": "11554", "subject": "CIV_ENV"}]