[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Locy Hall 303"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "25070", "title": "WCAS HISTORY 393-0-43 Approaches to History", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "25070", "instructors": [{"instructor_phone": "847/467-1241", "instructor_name": "Rajeev Kumar Kinra", "instructor_addr": "Harris Hall Room 307"}], "topic": "Indiana Jones in Historical Context: Heroic Schol", "course": "393-0", "descriptions": [{"name": "Overview of class", "value": "This course will examine the Indiana Jones films from the perspective of three key historical frames of reference. First, the context of European colonial expansion in Asia and Africa during the 19th and early 20th centuries ? a formative stage for the emergence of a modern scholarly idiom about places like Egypt, India, and &quot;The Orient&quot; generally, much of which would have been inherited by an archaeologist (even a fictional one) like Jones. Secondly the 1930s, the timeframe of the films themselves, when British and French colonial power was on the wane, Nazi Germany and the USSR were on the rise, and America was on the cusp of its own emergence as a global &quot;superpower.&quot; As with the heyday of European colonial expansion in the 19th century, the nexus between geopolitical power and scholarly knowledge loomed large in this latter contest for global supremacy, too, both in real life and in the Jones films. But the films' idealization of Jones and the 1930s actually emerges from a nostalgic, late Cold War vantage point. Thus our third historical frame of reference ? basically, from the 1980s to the present ? will force us to examine the earlier legacies of Western power and knowledge from our own perspective, as they are refracted in the films, and as they have been re-imagined and redeployed in the present-day American political and cultural imagination."}, {"name": "Teaching Method", "value": "DiscussionLectureSome lecture, mostly discussion"}, {"name": "Evaluation Method", "value": "PapersResponse papers; Final review essay"}, {"name": "Class Materials (Required)", "value": "Selections from:<br/>* Edward Said, Orientalism; Culture and Imperialism; ISBN 978-0679750543<br/><br/>* Bernard S. Cohn, Colonialism and its Forms of Knowledge; ISBN 9780691000435<br/><br/>* Thomas Metcalf, Ideologies of the Raj; ISBN 978-0521589376<br/><br/>* Rashid Khalidi, Resurrecting Empire: Western Footprints and America's Perilous Path in the Middle East; ISBN 978-0807002353<br/><br/>* Priya Satia, Spies in Arabia; ISBN 9780195331417<br/><br/>As well as selected essays and other book excerpts."}, {"name": "Class Notes", "value": "Attendance at first class is mandatory; occasional film screenings outside of class.<br/><br/>HISTORY AREA OF CONCENTRATION: Americas, Asia/Middle East, Europe"}], "lmod": "1/9/16 6:48 PM (CT)", "subject": "HISTORY"}]