[{"class_mtg_info": [{"meet_t": "MoWeFr 11:00AM - 12:30PM", "meet_l": "TBA"}], "school": "WCAS", "overview_of_class": "This class serves as an introductory exposure to select topics in biochemistry, covering the structure and function of macromolecules, biological transport and signaling, chemical logic of metabolic reactions, and select cellular pathways. The course strongly emphasizes conceptual understanding and aims to develop and integrated understanding that allows students to apply their knowledge to solve complex problems.", "qtr": "Summer 2017", "name": "Biochemistry", "title": "WCAS BIOL_SCI 308-0-20 Biochemistry", "lmod": "4/20/17 6:31 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "847/467-0210", "instructor_name": "Jason H Brickner", "instructor_addr": "Pancoe Pavilion, Room 3-105"}], "topic": "", "course": "308-0", "enrl_requirement": "Enrollment Requirements: Students must have taken BIOL_SCI 217 &amp; 219, and CHEM (210-2 or 212-2) in order to register for this course. BMD_ENG 301, 302, or 303 can substitute for BIOL_SCI 217. Registration for BIOL_SCI 308 is not allowed if students previously took BIOL_SCI 301", "descriptions": [{"name": "Overview of class", "value": "This class serves as an introductory exposure to select topics in biochemistry, covering the structure and function of macromolecules, biological transport and signaling, chemical logic of metabolic reactions, and select cellular pathways. The course strongly emphasizes conceptual understanding and aims to develop and integrated understanding that allows students to apply their knowledge to solve complex problems."}, {"name": "Registration Requirements", "value": "Biol_Sci 217, 219; and Chem 210-2 OR Chem 212-2"}, {"name": "Teaching Method", "value": "Highly interactive lectures and discussion sections. Enrollment for lecture sections is limited to 35 students per section, discussion sections are capped at 15 students/section. Although registration for discussions is required upon enrollment, participation is voluntary. From week 2 onwards, discussion groups will serve<br/>(1) to introduce studying techniques that facilitate conceptual understanding & how to connect seemingly unrelated topics, (2) to introduce problem solving approaches & practice critical reasoning skills, and (3) to develop strategies how to exploit organic chemistry knowledge to understand metabolic processes. <br/>Complementing class and discussion groups, office hours will be held twice a week, and additional 1:1 meetings can be arranged with the instructor if needed."}, {"name": "Evaluation Method", "value": "One group assignment, 3 quizzes (in class; 45 min. each), 1 midterm (in class, 50 min.), and 1 final exam. Students should not expect to see multiple choice type questions. Content of quizzes/exams will be cumulative throughout, testing proficiency through a combination of open questions in three categories: <br/>common knowledge base, conceptual understanding, and complex problem solving skills. <br/><br/>Grading is on an absolute scale that evaluates proficiency, not class rank (grading metric will be provided to enrolled students).<br/>NOTE: There will be a special Common Final on June 6th, 7-9pm"}, {"name": "Class Materials (Suggested)", "value": "Lehninger Principles of Biochemistry, 5th Edition, David L Nelson and Michael M. Fox, W. H. Freeman and Co., NY 2008 ISBN# 978-0-7167-7108-1<br/><br/>(A copy will be made available to registered students)"}, {"name": "Class Notes", "value": "Partial notes for each week of lectures will be posted by Friday of the preceding week. Full lecture notes will be available after the completion of each lecture."}], "path": "/class-descriptions/4670/WCAS/BIOL_SCI/308-0/40286", "instructor": ["Jason H Brickner"], "class_attributes": "Natural Sciences Distro Area<br/><br/>", "id": "40286", "subject": "BIOL_SCI"}]