[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Harris Hall L07"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "35336", "title": "WCAS ECON 370-0-20 Environmental &amp; Natural Resource Economics", "class_attributes": "", "section": "35336", "instructors": [{"instructor_phone": "", "instructor_name": "Laura Lynne Kiesling", "instructor_addr": ""}], "topic": "", "course": "370-0", "descriptions": [{"name": "Overview of class", "value": "The environment and our natural resources are scarce yet their values are quite hard to determine. Furthermore, there are a variety of problems with the incentives to use them well. This course will define and examine &quot;environmental problems&quot; in terms of economic efficiency. We will also discuss the methods (and shortcomings of these methods) used by economists and policy-makers to place dollar values on environmental amenities (since such valuations will determine what policy options are deemed &quot;efficient&quot;), such as benefit-cost analysis. Then we will apply these tools to look at a particular set of environmental problems - common-pool resource allocation problems. The common-pool resource problems and polices we'll analyze in detail are air pollution and climate change. The course will focus specifically on environmental and economic regulation in the electric power industry, and will develop the models and tools of environmental policy analysis through an exploration of the role of the electric power industry in the economy, its environmental impacts (including renewable sources), and how the environmental and economic regulation of the industry interact."}, {"name": "Registration Requirements", "value": "Stats 210, Econ 281, 310-1 required; 310-2 encouraged"}, {"name": "Teaching Method", "value": "Two 80-minute lectures with lots of discussion and some in-class small-group work"}, {"name": "Evaluation Method", "value": "Midterm exam, exam on last day of class, paper due finals week"}, {"name": "Class Materials (Required)", "value": "Readings available on Canvas"}], "lmod": "2/19/17 6:47 PM (CT)", "subject": "ECON"}]