[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "Block Print Study Center 2-31"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "10555", "title": "WCAS ART_HIST 390-0-2 Undergraduate Seminar", "class_attributes": "Juniors/Seniors Only<br/><br/>", "section": "10555", "instructors": [{"instructor_phone": "", "instructor_name": "Marc Sebastian Walton", "instructor_addr": ""}], "topic": "", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "In this course we will address the role of scientific examination in investigating production and use of art across time and space. The basics of art production out of ceramic, stone, metal, glass, pigments and their binding media will be detailed with the general aim of providing insights into the process of making art; charting the chaîne opératoire from the procurement and processing of raw materials, their trade, and finally how they are formed into a finished object. We will see how this material-based approach can be used to provide new insights into the economic, political, and social context for art making and address questions about the aesthetic choices made by the artist. The analytical tools currently being used by scientists and conservators to visualize and interrogate the structure of art will also be covered with an emphasis on how the scientific data derived from these instruments can address new questions about artworks ranging from archaeological ceramics through early modernist paintings. During this course, the students will experience first-hand what it is like to examine a work of art and to collect meaningful scientific data to aid in their art historical inquiries."}, {"name": "Teaching Method", "value": "Seminar participation (30%), short writing assignments (30%), and capstone presentation (40%)."}, {"name": "Class Materials (Required)", "value": "Readings will be made available on Canvas"}], "lmod": "10/30/16 6:58 PM (CT)", "subject": "ART_HIST"}]