[{"school": "WCAS", "overview_of_class": "POLI SCI 390-0-20 Spring 2017 \"Governing Fractured Nations: Africa & the Post-Imperial World\" Prof. Richard Joseph \"We are living through a period in which the speed of change exceeds the capacity of governmental institutions, and of political leaders, to manage it. The term \"fractured\" is frequently used today to refer to the splintering of societies, nations, and the \"global community\". We will examine these phenomena and the challenges posed to systems of governance.<br/><br/>This era is foreshadowed in the work of particular scholars, such as Crawford Young, The Rise of Cultural Pluralism (1993), and Robert Cooper, The Breaking of Nations (2003). In the foreword to a 2001 book, The Self-Determination of Peoples, the following prescient words can be read: \"Unrest in one part of the world can bring bombs, terror, and refugees to another, where public sentiment may lead to intervention in the conflict one way or the other; thus local conflicts are globalized.\"<br/><br/>Intense conflicts take place across several axes: ethnic nationalism, religious sectarianism vs. secularism, \"ordinary people\" vs. elites, rural and small towns vs. cities, and migrants vs citizens. Ideologies that seemed triumphant after the Cold War, such as constitutional democracy and economic liberalism, are vigorously contested. New constructions are given to once familiar concepts such as sovereignty, privilege, and populism. Election contests in Britain, the United States, and several other western democracies deepen societal divisions and enhance uncertainty.<br/><br/>Some authors have grappled with the governance dimension of these challenges. They include Francis Fukuyama in several works, Daron Acemoglu and James Robinson in Why Nations Fail? (2012) and Jonathan Tepperman, in The Fix (2016). Contributing to the sense of global disarray are persistent wars and increasing reliance on shadow forms of warfare: drones, cyber-attacks, and Special Forces. The fracturing of nations is vividly conveyed by waves of refugees fleeing violence and distress in Africa and the Middle East. So also is the \"disintegrating of Europe\", as discussed in a January 2017 essay by Timothy Garton Ash, chronicler of the post-1989 democratic transitions in Eastern Europe.<br/><br/>This course will devote special attention to the African experience. Most African countries contend with multiple lines of division: ethnic, linguistic, religious, regional, and class. How, it will be asked, have highly diverse nations maintained nationhood? How are they coping with the current fraying of the global order and economic upheavals? The experiences of Nigeria, Africa's most populous country, will be closely examined.", "name": "Special Topics in Political Science", "section": "20", "location": "Annenberg Hall G21", "topic": "Governing Fractured Nations: Africa & the Post-Imp", "course": "390-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4660/WCAS/POLI_SCI/390-0/35412", "instructor": ["Richard A Joseph"], "class_attributes": "", "id": "35412", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "POLI SCI 390-0-21 Spring 2017 \"Variations in Regional Order\" Prof. Hendrik Spruyt<br/>The seminar will examine various forms of international order. It will take both a historical and a contemporary look at how states and non-state actors have constructed \"rules of the game\" to facilitate trade, foster peace, and engage in cultural interaction. We will primarily look at Western centered orders but to some extent also at non-Eurocentric systems. The historical analyses will reveal a variety of modes of how such stable orders might be created. The contemporary focus will turn to examining the international order as it emerged after 1945 in a variety of issue areas, such as trade, security, and international norms. Finally, we will examine whether changes might occur given the rise of new states and relative shifts in power, particularly with regards to China", "name": "Special Topics in Political Science", "section": "21", "location": "Harris Hall L04", "topic": "Variations in International Order", "course": "390-0", "meeting_time": ["Fr 9:00AM - 11:50AM"], "path": "/class-descriptions/4660/WCAS/POLI_SCI/390-0/35413", "instructor": ["Hendrik   Spruyt"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "id": "35413", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "POLI SCI 390-0-22 Spring 2017 \"Diversity in American Cities\" Prof. Jaime Dominguez<br/>U.S. cities have traditionally been centers of diversity, in terms of race, ethnicity, religion, nationality, socioeconomic status, and lifestyle choices. In the last thirty years, major cities have undergone profound demographic changes. With these changes has come a new pattern of population diversity. Traditionally, the study of urban context has been placed in a black-white paradigm. But, it is this diversity that challenges political scientists and other scholars to rethink the future of urban politics. The course will focus on the changing political terrain, institutional context and leadership in urban spaces.", "name": "Special Topics in Political Science", "section": "22", "location": "555 Clark 230", "topic": "Diversity in American Cities", "course": "390-0", "meeting_time": ["TuTh 9:30AM - 10:50AM"], "path": "/class-descriptions/4660/WCAS/POLI_SCI/390-0/35414", "instructor": ["Jaime   Dominguez"], "class_attributes": "", "id": "35414", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "POLI SCI 390-0-23 Spring 2017 \"The Press & Presidential Elections\" Prof. Lawrence Stuelpnagel<br/>Presidential elections are hard fought and can be controversial. In 2016 two unpopular candidates, former Secretary of State Hillary Clinton and reality show host and real estate mogul, Donald Trump, waged bitter campaigns. In 2000 George W. Bush and Al Gore fought in an election that was decided by the Supreme Court. In 2008 American elected its first African American President, Barack Obama and reelected him in 2012. <br/> This class will examine presidential races primarily using the 2000, 2008 and 2016 races and the press coverage of the controversies that surrounded them as its central point. We will also explore the coverage of previous races and challenge some of the myths about elections and their outcomes", "name": "Special Topics in Political Science", "section": "23", "location": "Annenberg Hall G32", "topic": "The Press & Presidential Elections", "course": "390-0", "meeting_time": ["MoWe 11:00AM - 12:20PM"], "path": "/class-descriptions/4660/WCAS/POLI_SCI/390-0/35415", "instructor": ["Lawrence L Stuelpnagel"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "id": "35415", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "POLI SCI 390-0-24 Spring 2017 \"Constitutional Challenges in Comparative Perspective\" Prof. Galya Ruffer<br/>On Nov. 17, 2016 shortly after the U.S. national elections, Indiana Judge Sarah Evans Barker delivered remarks to the 68 new citizens during a naturalization ceremony about the turbulent, ugly and divisive events of the weeks leading up to the elections. She told these new citizens that they would now be called up to do their part in helping to build and maintain our country's best values and highest principles and historic traditions. She spoke about our qualities as a country such as fairness, tolerance, compassion, equality, civility and freedom and values of diversity, tolerance, brotherhood, equality, goodwill, fairness and the rule of law. Where do our national values come from? In what way does our Constitution bind us to these values if at all? In Europe, values are directly inscribed in the European Charter and the Copenhagen criteria set out the rules that define whether a country has sufficient intent in its democratic and human rights values to join the European Union. In this course we will be thinking about how and whether constitutions shape national values and offer a framework for legitimacy and governance to hold together diverse societies and resolve deeply rooted social tensions and ethnic divisions. We will consider the constitutional responses of countries such as the U.S., Canada, France, Germany, Great Britain, Hungary, Kenya, South Africa and Australia to the challenges of terrorist bombings, the rise of populism, hate crimes, legitimacy of public authority, and refugee crisis and examine the birth of constitutionalism that is currently underway in Africa where the peaceful exchange of power, a value that we have taken for granted, is still an aspiration for countries such as Rwanda and the Democratic Republic of Congo. In learning about the varying traditions of written and unwritten constitutions, civil and common law and the foundations and structures of separation of powers and judicial review of the constitutionality of laws in these countries, students will learn to think critically about the U.S. Constitution and the different ways in which constitutional democracies provide for public order, counter-majoritarian governance, equality and protection of the rights of minorities through rule of law and question whether constitutional solutions can address the kinds of social and political problems we have today.", "name": "Special Topics in Political Science", "section": "24", "location": "Parkes Hall 222", "topic": "Comparative Constitutionalism", "course": "390-0", "meeting_time": ["MoWe 9:30AM - 10:50AM"], "path": "/class-descriptions/4660/WCAS/POLI_SCI/390-0/35416", "instructor": ["Galya Benarieh Ruffer"], "class_attributes": "No Freshmen<br/><br/>", "id": "35416", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "390-0-25 Spring 2017 \"Land Rights and Conflict in a Global Perspective\" Prof. Kathleen Klaus<br/>This class explores how struggles over land and territory shape different forms of conflict and violence: between squatters and state officials, different ethnic communities, rebel groups and the state, or community members and corporations. The course examines questions of land and conflict such as: What does land, property, and territory mean to different groups of people? What are the institutions that shape land access and security? How can land explain different conflict dynamics? And what policy implications emerge from a close study of land rights around issues of economic development, peacebuilding, or environmental conversation? We apply these questions to different regional contexts and country-specific case studies including Kenya, China, Indonesia, Colombia, and Afghanistan. The course is interdisciplinary in its approach, drawing from political science, economics, and anthropology. It should appeal to students interested in peace and conflict issues, environmental politics, international development, and human rights.", "name": "Special Topics in Political Science", "section": "25", "location": "Garrett-Evangelic Seminary 107", "topic": "Land Rights & Conflict in a Global Perspective", "course": "390-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4660/WCAS/POLI_SCI/390-0/35417", "instructor": ["Kathleen Fitzpatrick Klaus"], "class_attributes": "", "id": "35417", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "POLI SCI 390-0-26 Spring 2017 \"Environmental Politics and Policy\" Prof. Kimberly R. Marion Suiseeya<br/>This course considers the political, economic, ethical, legal, and institutional issues involved in environmental decision-making. Drawing from both domestic and international cases, with an emphasis on the US, we will consider the formation and implementation of different environmental policies across a range of topics, which may include natural resources, coastal and marine resources, endangered species, air and water pollution, energy, climate change, sustainable development, hazardous waste, toxics, and environmental justice. The course is designed to give students an understanding of important conceptual issues in environmental policy-making, as well as an overview of core policies related to the US and internationally. <br/><br/>Requirements include active class participation, short assignments and quizzes, and midterm and final examinations.", "name": "Special Topics in Political Science", "section": "26", "location": "TBA", "topic": "Environmental Politics and Policy", "course": "390-0", "meeting_time": ["TBA"], "path": "/class-descriptions/4660/WCAS/POLI_SCI/390-0/35418", "instructor": ["Kimberly Ruggles Marion Suiseeya"], "class_attributes": "", "id": "35418", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "POLI SCI 390-0-27 Spring 2017 \"War and Peace in Islam\", Prof. Makram ABBES<br/>Often tinged with essentialism, approaching the theme of war in Islam conveys the image of an arbitrary activity subjected only to religion and worried about scrupulously applying commands. By placing us in a perspective which tries to question concepts and locate various forms of rationalities (legal, governmental, economic, etc.) which determined approaches to war, this course aims at deconstructing the notion of \"jihâd\" to show that its technical sense of military combat followed, according to the texts, authors and historic situations by very complex semantic trajectories, and that this notion could be defined by abstract and contradictory inflections. The study of the plasticity of this notion - which can indicate holy war, just war, terrorism or war led by the partisan (whether he is territorialized or not territorialized) - could greatly contribute to the de-essentialization of the debate on war in Islam, at the same time as it would restore to this theme the place which it deserves within the field of political philosophy by connecting it to the central questions of this discipline, such as the theory of sovereignty, the art of government or the theologico-political problem. Based mainly on legal texts and those of the Mirrors for princes, this course will pay particular attention to the forms of rationalization and the humanization of warrior activity at the classic age of Islam, whether it is through the study of the strategies of peaceful resolution of conflicts (cunning, diplomacy) or from the presence, in these texts, of the fundamental distinction between combatants and noncombatants, which is at the origin of contemporary humanitarian law.", "name": "Special Topics in Political Science", "section": "27", "location": "Locy Hall 106", "topic": "War & Peace in Islam", "course": "390-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4660/WCAS/POLI_SCI/390-0/35419", "instructor": ["Makram   Abbes"], "class_attributes": "", "id": "35419", "subject": "POLI_SCI"}]