[{"school": "WCAS", "overview_of_class": "The course is divided in two parts. In part I we will focus on explaining the causes of war, and reflect on current security problems. In part II we turn to how we have moved from traditional inter-state relations to a globalized environment in which states, non-state actors, and international organizations interact.<br/><br/>More specifically the emphasis in part I will be on achieving a theoretical understanding of how one might explain the occurrence of war or peace. This course is not a discussion of current events, although they might be introduced to clarify particular perspectives. In other words, the emphasis is on developing a \"toolkit\" which you can use to understand international relations in general. The emphasis is not on memorizing details and empirical data, although of course you will need to understand key concepts and definitions. Instead you should ask yourself what caused war in this instance but not others? What are the underlying causes behind these observations?<br/><br/>Explanations of conflict occur at the individual level; at the state level; and at the level of the international system. We will use these different levels of analysis, or different images, to explain the outbreak of WW I. Analyzing this conflict will demonstrate the various approaches to understanding complex, macrohistorical phenomena in general. We will then apply some of these methodological insights to understand the absence of super power conflict during the Cold War, and the U.S. invasion of Iraq.<br/><br/>In Part II we turn to global issues in the areas of international economic management (particularly trade). How did the post-war international economic order differ from the 1930s? How will the rise of economic powers such as China possibly affect this international order? We then touch on global problems that go beyond traditional inter-state relations: trans-boundary environmental problems and the global energy \"problematique.\" Is there an international oil regime? What explains the emergence of international agreements on CFCs and conversely the failure of the Kyoto protocol?", "name": "Introduction to International Relations", "section": "20", "location": "Tech Institute Lecture Room 3", "topic": "", "course": "240-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4640/WCAS/POLI_SCI/240-0/12719", "instructor": ["Hendrik   Spruyt"], "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "id": "12719", "subject": "POLI_SCI"}]