[{"school": "SoC", "overview_of_class": "379-20 Making the Romantic Comedy,. Thurs 10-12:50, Louis 118<br/>Professor Laura Kipnis<br/><br/>What's so funny about two people trying to have (or trying and failing to have) a relationship? We'll be doing weekly screenings (outside of class) of both classics of the genre and more modern examples. Students will read popular romantic advice books from which you'll also derive potential comedic premises; we'll discuss both the genre and romantic love generally, and then you'll put everything you've learned about love and its mishaps into a final project.<br/><br/>The final project is a short video (7-10 min) from original or adapted material in which you explore romantic comedy. You can work independently or in pairs. <br/><br/>Note: all students will be shooting their final projects in this class.<br/><br/>No late adds and you must be at the first class to hold your spot!", "name": "Topics in Film/Video/Audio Production", "section": "20", "location": "Louis Hall 118", "topic": "Romantic Comedy", "course": "379-0", "meeting_time": ["Th 10:00AM - 12:50PM"], "path": "/class-descriptions/4640/SoC/RTVF/379-0/17650", "instructor": ["Laura   Kipnis"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>Prerequisites apply, see description<br/><br/>", "id": "17650", "subject": "RTVF"}, {"school": "SoC", "overview_of_class": "379-21 Rebels, Losers, and Misfits, Professor Kipnis. Thurs 3-5:50, Louis 118<br/>Professor Laura Kipnis<br/><br/>Notice how many great films there are about unlikable, damaged or criminal protagonists, and how may great directors have adopted this theme? We'll have weekly screenings (outside class) and in-class analysis of a variety of such films. We'll be following news stories that might form source material to be adapted or stolen for your film projects. Among the questions we'll be asking about the films we screen: is the misfit or problematic character redeemed, does he/she transform, or remain an outcast? Whose point of view are we seeing things from, who do we identify with? Are characters sentimentalized, incorporated into society, killed off? Is the origin of the problem psychological, theological (evil, a bad seed), a rebel, or?? Is the outcast the voice of truth or a threat to society? Students will explore, form and present to the class psychological or sociological theories about the origins of their rebel/misfit/loser protagonists to add depth to their characters and situations. <br/><br/>The final project is a short video (7-10 min) from original or adapted material in which you explore such a character. You can work independently or in pairs. <br/><br/>Note: all students will be shooting their final projects in this class.<br/><br/>No late adds and you must be at the first class to hold your spot!", "name": "Topics in Film/Video/Audio Production", "section": "21", "location": "Louis Hall 118", "topic": "Rebels. Losers & Misfits", "course": "379-0", "meeting_time": ["Th 3:00PM - 5:50PM"], "path": "/class-descriptions/4640/SoC/RTVF/379-0/17649", "instructor": ["Laura   Kipnis"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>Prerequisites apply, see description<br/><br/>", "id": "17649", "subject": "RTVF"}, {"school": "SoC", "overview_of_class": "", "name": "Topics in Film/Video/Audio Production", "section": "22", "location": "Louis Hall 118", "topic": "Making the Micro-budget Supernatural Film", "course": "379-0", "meeting_time": ["We 12:00PM - 2:50PM"], "path": "/class-descriptions/4640/SoC/RTVF/379-0/14267", "instructor": ["Eric Adrian Patrick"], "class_attributes": "Prerequisites apply, see description<br/><br/>", "id": "14267", "subject": "RTVF"}]