[{"school": "SoC", "overview_of_class": "This course will explore the history of the recording industry from the invention of the phonograph in 1877 to recent developments in digital audio. We will examine the social, cultural, and technological factors that have shaped the development of the recording industry, and consider musical genres such as jazz, blues, rock, swing, muzak, dub, techno and rap. We will consider the production, distribution, and reception of recordings, tracking the changing ways in which people have listened to music, from phonograph parlors to jukeboxes to hi-fi home stereos to iPods. The industry in recorded music will be our primary focus, but we will explore synergies with the film industry, radio, gaming, and other emergent digital forms. Some of the key themes in the course will be the intersection of sound industries; the tension between independent and major labels; questions of copyright and creativity in popular music; the relationship between technology and innovation in sound art; and the increasing mobility and cultural ubiquity of recorded sound. Looking back across the \"century of sound\" allows us to gain a deeper appreciation of our current immersion in recorded sound, and to understand the central debates and dynamics that have shaped the recording industry.", "name": "Topics in Sound Studies", "section": "20", "location": "Helmerich Auditorium", "topic": "History of Recording Industry", "course": "400-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4660/SoC/SAI/400-0/34800", "instructor": ["Jacob Arnaud Smith"], "class_attributes": "", "id": "34800", "subject": "SAI"}, {"school": "SoC", "overview_of_class": "", "name": "Topics in Sound Studies", "section": "21", "location": "Annie May Swift Hall 110", "topic": "Sound Ethnography", "course": "400-0", "meeting_time": ["Mo 2:00PM - 4:50PM"], "path": "/class-descriptions/4660/SoC/SAI/400-0/34801", "instructor": ["Shayna Mei Silverstein"], "class_attributes": "", "id": "34801", "subject": "SAI"}]