[{"school": "SoC", "overview_of_class": "RTVF 312-1<br/>History of Film 1<br/> <br/>This course offers an introductory survey of world film history from the 1890s to the outbreak of World War II. We will examine a wide range of films?feature-length narratives as well as animated, experimental, and early shorts?and place them in their historical and cultural context. The goals of the course are to acquaint students with the contours of film history, to introduce students to some of the approaches to studying film in historical terms, and to provide a deeper context from which to understand and appreciate the more familiar terrain of contemporary American media culture.<br/> <br/>The course will cover such topics as: early cinema in Europe and the United States; race, gender, and stardom in early American cinema; various national cinemas of the 1920s, including Germany, France, and the Soviet Union; the introduction of sound to motion pictures; the spaces of film exhibition; the Hollywood studio system of the 1920s and 1930s; regimes of film censorship; the film industries in Japan and India; and French Poetic Realism. We will be viewing a variety of genres and styles, including slapstick, horror, German Expressionism, French Impressionism, revolutionary cinema and screwball comedy.<br/> <br/> <br/>By the end of the course students should be able to:<br/> <br/>? identify and critically analyze key developments in the history of film to 1939<br/>? demonstrate the ability to assess and apply various approaches to writing film history<br/>? mobilize primary and secondary materials in the development of an original historical argument<br/> <br/>Assessment:<br/> <br/>There will be quizzes held during class that cover course readings and lectures, as well as a final exam held during finals week. The exam will be split between objective questions pertaining to the historical information covered in course readings and lectures, and short essays that ask you to think critically about approaches to film history. 50% of your grade will be comprised of a Research Portfolio comprised of four 1-2 page research reports and a final 4-6 page research paper on a topic of your choosing related to film culture before 1939.<br/> <br/> <br/>The required texts:<br/> Norris Center Bookstore<br/> Film History: An Introduction, (3rd ed.), by Kristin Thompson and David Bordwell<br/> <br/> Quartet Copies, 818 Clark Street, 328-0720<br/> 312-1 Reader", "name": "History of Film I", "section": "20", "location": "Helmerich Auditorium", "topic": "", "course": "312-1", "meeting_time": ["MoWe 1:00PM - 2:50PM"], "path": "/class-descriptions/4650/SoC/RTVF/312-1/24480", "instructor": ["Jacob Arnaud Smith"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "24480", "subject": "RTVF"}]