[{"school": "WCAS", "overview_of_class": "How do we come to understand ourselves as Americans? How do some visions of American lives deny full citizenship to other Americans? What is the connection between that denial and both enduring domestic political, economic, and social inequalities, and the history and contemporary realities of US foreign policy? <br/> <br/>This seminar will focus on shifts in the US public sphere over the last half-century, and in particular on its variegated role in the present, and on a range of lively minority counterpublics. In an anthropological rather than journalistic vein, we will read the foundational theorizations of the public sphere and counterpublics; investigate the material and ideological effects of neoliberal globalization and widening inequalities globally on American self-understandings of their lives within a world of nations; the roles of corporations and wealthy individuals in the construction of publicly recognized \"common sense\" understandings; the devastating financial effect on investigative journalism of the rise of the online world; and recent upsurges of misogyny/homophobia, racism, and xenophobia. What roles do various kinds of media play in these processes? What is the history of \"fake news\"? How have individuals and groups attempted to counter it?<br/> <br/>We will devote the first half of the quarter to readings and discussions. During the second half, students will embark on individual mini-research projects arising from seminar concerns with the American public sphere and counterpublics. These projects should include an interviewing/ethnographic component. Students will present their findings in the last two seminar meetings, and turn in papers describing that research and those findings at the end of the quarter. Grading will be based on seminar participation (45%), research presentation (15%) and final papers (40%).", "name": "Topics In Anthropology", "section": "21", "location": "ANTHRO Sem Rm 104 - 1810 Hinmn", "topic": "American Inequalities, the Public Sphere, Counterp", "course": "390-0", "meeting_time": ["Tu 5:00PM - 7:50PM"], "path": "/class-descriptions/4660/WCAS/ANTHRO/390-0/32248", "instructor": ["Micaela   di Leonardo"], "class_attributes": "Jrs, Srs, Grad Students Only<br/><br/>", "id": "32248", "subject": "ANTHRO"}, {"school": "WCAS", "overview_of_class": "What counts as food? Recent debates over the social and environmental consequences of Genetically Modified Organisms (sometimes called ?Frankenfoods'), media buzz over alternative proteins like crickets, and the mainstream popularity of veganism have provoked a critical return to questions of edibility, the agency of our food, and ecological responsibility - all of which challenge normative, Western orientations towards consumption practices. This course examines cultural constructions of appetite and nourishment by asking: What are the processes through which humans have come to view plants and animals as food? How is edibility either celebrated or refused across time, space, and bodies? And most importantly, how are specific worldviews mobilized in understanding human encounters with the things that we eat? Taking Donna Haraway's landmark work \"A Cyborg Manifesto\" as a point of departure, cultural constructions of edibility will be explored by theorizing the food system as a vital and material force.", "name": "Topics In Anthropology", "section": "22", "location": "Locy Hall 301", "topic": "Intro to Critical Food Studies", "course": "390-0", "meeting_time": ["TuTh 9:30AM - 10:50AM"], "path": "/class-descriptions/4660/WCAS/ANTHRO/390-0/32249", "instructor": ["Hiilei Julia Hobart"], "class_attributes": "", "id": "32249", "subject": "ANTHRO"}, {"school": "WCAS", "overview_of_class": "Humans display great variation in many aspects of their biology, particularly in terms of physical growth and development, nutrition, and disease patterns. These differences are produced by both current ecological and environmental factors as well as underlying genetic differences shaped by our evolutionary past. It appears that many diseases of modern society, such as obesity, diabetes, cardiovascular disease, and various cancers, have resulted from change to a lifestyle that is quite different from that of our ancestors. These diseases thus reflect an imbalance between modern life conditions and those which shaped most of our evolutionary history. This course will explore the evolutionary dimensions of variation in health and disease pattern among humans. We will first review key concepts in evolutionary biology, and their application to human evolution. We will then examine bio-cultural and evolutionary models for explaining variation in specific human diseases.", "name": "Topics In Anthropology", "section": "23", "location": "Locy Hall 318", "topic": "Evolutionary Medicine", "course": "390-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4660/WCAS/ANTHRO/390-0/32250", "instructor": ["Christopher W Kuzawa"], "class_attributes": "", "id": "32250", "subject": "ANTHRO"}, {"school": "WCAS", "overview_of_class": "This upper-division seminar will introduce students to the anthropological study of science and the production of scientific knowledge. Drawing from ethnographies of laboratories and the facts and artifacts they produce we will study science as culture and a site of cultural production. The first half of the class will present several fundamental texts in the anthropology of science, while in the second half of the class, we will apply our conceptual tools to pertinent case studies of the present like: the scientific production of the concept of race and racialized behavior; biomedical research and technologies that alter and remake what counts as life, gender/sex, and the human; the production of evidence, facts, doubt, and alternative facts in the new Trump presidency. For their final assignment, students may conduct a \"lab ethnography\" or propose a detailed study on the production of a scientific fact.", "name": "Topics In Anthropology", "section": "24", "location": "ANTHRO Sem Rm B07 - 1810 Hinmn", "topic": "Anthropology of Science", "course": "390-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4660/WCAS/ANTHRO/390-0/32251", "instructor": ["Stefanie Toney Graeter"], "class_attributes": "", "id": "32251", "subject": "ANTHRO"}, {"school": "WCAS", "overview_of_class": "Native Americans experience significant disparities in health and in access to health care. This course introduces students to Native American health by exploring the social, cultural, political, and environmental determinants influencing Native health both historically and today. This course is designed as a reading intensive, discussion-based seminar, drawing upon research and contributions from a variety of disciplines including American Indian studies, anthropology, history, psychology, public health, and medicine.", "name": "Topics In Anthropology", "section": "25", "location": "Parkes Hall 215", "topic": "Native American Health", "course": "390-0", "meeting_time": ["Tu 9:00AM - 11:50AM"], "path": "/class-descriptions/4660/WCAS/ANTHRO/390-0/32252", "instructor": ["Margaret Ellen Pollak"], "class_attributes": "", "id": "32252", "subject": "ANTHRO"}, {"school": "WCAS", "overview_of_class": "This course critically analyzes the power dynamics of migration in the 21st century. Class texts will explore \"risk\" through case studies of militarization refugees, and smuggling; child trafficking and forced migration; the politics of commercial surrogacy; and international development and labor exploitation. Drawing on readings from the anthropology of development, international studies, and feminist technoscience studies, students will discuss and question discourses of \"globalization\" that imagine a world of easy connections and flows, digitally and physically. We engage with multiple media forms, from academic texts, to films like Children of Men and the poetry of Warsan Shire, to explore how migration stories are gendered and racialized, with particular agencies and vulnerabilities, perils and pleasures. By understanding the techniques and technologies of bureaucracy, through examples like airport facial recognition software, so-called \"smart walls,\" and US counter-terrorism initiatives, students will also assess expert cultures dictating migration and development futures.", "name": "Topics In Anthropology", "section": "26", "location": "University Hall 122", "topic": "Risky Borders: Sex, Race, and Techniques of Border", "course": "390-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4660/WCAS/ANTHRO/390-0/32253", "instructor": ["Mitali   Thakor"], "class_attributes": "", "id": "32253", "subject": "ANTHRO"}, {"school": "WCAS", "overview_of_class": "What is territory? Is it simply the physical space (land, air or sea) over which a state exercises sovereignty? How does this presumed alignment of territory and sovereignty come about and get maintained in modern nation-states and internationally? Is territory a given and static contract or the terrain of constant contestation or negotiation in global and international affairs? This course examines these questions by proposing that territories are as much products of mobile social actors, contraband commodities and fluctuating values as they are of state policies aimed at managing these movements. Through reading anthropological and historical monographs as well as theoretical essays drawn from geography and social theory more broadly, in this course we explore the spatial production of social worlds and trace how this process has come to unfold at local, national and regional scales. By the end of the course students are expected to be well-versed in diverse theories of space and able to articulate what an attention to space and the relations of power inscribed in particular processes of territorial production can contribute to ethnographic and historical inquiry across the MENA region.", "name": "Topics In Anthropology", "section": "27", "location": "Kresge 4531 MENA Seminar Rm", "topic": "Producing Territory: People, Commodities and Value", "course": "390-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4660/WCAS/ANTHRO/390-0/32254", "instructor": ["Emrah   Yildiz"], "class_attributes": "", "id": "32254", "subject": "ANTHRO"}, {"school": "WCAS", "overview_of_class": "Youth are both a major force and a social problem, but the category of \"youth\" itself isn't any older than the twentieth century. In the class, we'll draw on a variety of materials - film, fiction, music, ethnography, history, advertising, and new media - to examine how young people make lives, money, and politics around the world. Along the way, we'll question the social and economic conditions that make one \"young\" or \"old\" in the first place to find out that youth is much more than biological category - it is a site of social change.", "name": "Topics In Anthropology", "section": "28", "location": "ANTHRO Sem Rm B07 - 1810 Hinmn", "topic": "Global Youth", "course": "390-0", "meeting_time": ["We 2:00PM - 4:50PM"], "path": "/class-descriptions/4660/WCAS/ANTHRO/390-0/32255", "instructor": ["Erin Virginia Moore"], "class_attributes": "", "id": "32255", "subject": "ANTHRO"}, {"school": "WCAS", "overview_of_class": "Sexuality may variously be conceived of in terms of desire, practice, or identity. In each of these ways of understanding sexuality, both cultural context and language plays a key role. Linguistic anthropology offers important ways of understanding the concept of sexuality as related to phenomena such as globalization, politics, normativity, violence, intersectionality, and even the ways we think of sexuality in our everyday lives. Using ethnographic examples from the United States, Latin America, Africa, Oceana, and Asia, related to homosexuality, heterosexuality, and other various understandings of sexual identities, practices, and desires, this course uses methods of analysis from linguistic anthropology to understand the variation and meanings of sexuality in a comparative context. Students are evaluated through class participation, presentations, reaction papers, and a final project.", "name": "Topics In Anthropology", "section": "29", "location": "ANTHRO Lab A56 - 1810 Hinmn", "topic": "Language & Sexuality", "course": "390-0", "meeting_time": ["We 2:00PM - 4:50PM"], "path": "/class-descriptions/4660/WCAS/ANTHRO/390-0/32256", "instructor": ["Emily N Haynes"], "class_attributes": "", "id": "32256", "subject": "ANTHRO"}, {"school": "WCAS", "overview_of_class": "In this class we will unpack links between musical practice and social action in a few of the many musical cultures in Sub-Saharan Africa. In our approach we will first examine a few general facts and principles of African history, culture, music, and dance; then explore several specific music cultures from the four major regions of Sub-Saharan Africa. We will study both rural village and urban popular contexts. It is my hope that the students will appreciate the richness and diversity of musical expression in Africa and better understand how music informs and reflects lived reality for its practitioners, merchants, and consumers. This will point to the roles music plays in the culture, history, politics, social relations, rituals, and religious practices of African peoples", "name": "Topics In Anthropology", "section": "30", "location": "ANTHRO Sem Rm 104 - 1810 Hinmn", "topic": "Music of Africa", "course": "390-0", "meeting_time": ["TuTh 9:30AM - 10:50AM"], "path": "/class-descriptions/4660/WCAS/ANTHRO/390-0/32257", "instructor": ["Stephen C Hill"], "class_attributes": "", "id": "32257", "subject": "ANTHRO"}, {"school": "WCAS", "overview_of_class": "This class introduces you to a wide variety of ethnographies on Muslim communities in Asia, both in the range of regions and states - Iran, Pakistan, India, Malaysia, Indonesia, and China - as well as in terms of themes - how Muslims engage secularizing states, coexist with hegemonic non-Muslim majorities, survive as refugees on the battleground of rival nation states, and, with native languages other than Arabic, make the Qur'an collectively meaningful.<br/><br/>At the same time, you will sharpen your ability to read and evaluate difficult books. We will analyze the ethnographies as texts to understand how the authors combined different kinds of texts to achieve the effect of a unified ethnographic whole, which different fieldwork activities yielded specific forms of data or emprirical materials, which writing techniques authors used to give voice to different groups of informants, and how authors attempted to represent the hold of the past on the \"now\" of fieldwork.<br/><br/>This class is reading-intensive and will focus on discussion. You will take turns leading discussions. This class works only if you participate actively in discussion. Preparation for class discussion by keeping up with the readings is crucial and will figure into the grading.", "name": "Topics In Anthropology", "section": "31", "location": "ANTHRO Sem Rm B07 - 1810 Hinmn", "topic": "Islam in Asia", "course": "390-0", "meeting_time": ["TuTh 9:30AM - 10:50AM"], "path": "/class-descriptions/4660/WCAS/ANTHRO/390-0/32258", "instructor": ["Stefan   Henning"], "class_attributes": "", "id": "32258", "subject": "ANTHRO"}, {"school": "WCAS", "overview_of_class": "Are some laws meant to be broken? Are those who break them all criminals? Where does the boundary between the legal and the criminal, the legitimate and the illicit, lie? Who gets to draw, manage and enforce that boundary that produces categories of crime out of illicit, illegal and illegitimate practices? Rather than seeing such activities as antithetical to the state, or as symptoms of the decline of the nation-state in the era of globalization, in this course we focus on when and how such relations may reinforce, work through and/or transform state power. We ask: How do licit and illicit networks and activities intersect to form different constellations of power and ideas of legitimacy, formality and legality in a given community at a given time? How do ideas and regimes of legality inform our ideas of what is morally right, criminal, and valuable? Drawing on political anthropology and cultural history, in this course we study many careers of the illicit in the MENA region to answer these questions. In so doing we trace the politics of legal and discursive constructions of crime and illicit action, and study how these practices interrelate with processes of law, governance, cross-border commerce and regimes of morality. At the end of the course we aim to reveal categories of crime and many careers of the illicit as historical and political constructs rather than as pre-existent and static categories of social action and analysis.", "name": "Topics In Anthropology", "section": "32", "location": "Kresge 4531 MENA Seminar Rm", "topic": "Breaking the Law in the Middle East:  Many Careers", "course": "390-0", "meeting_time": ["TuTh 5:00PM - 6:20PM"], "path": "/class-descriptions/4660/WCAS/ANTHRO/390-0/37920", "instructor": ["Emrah   Yildiz"], "class_attributes": "", "id": "37920", "subject": "ANTHRO"}, {"school": "WCAS", "overview_of_class": "", "name": "Topics In Anthropology", "section": "33", "location": "Kresge Centennial Hall 2-440", "topic": "Globalizing India", "course": "390-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4660/WCAS/ANTHRO/390-0/38012", "instructor": ["Meredith L McGuire"], "class_attributes": "", "id": "38012", "subject": "ANTHRO"}, {"school": "WCAS", "overview_of_class": "This class is an introduction to the growing field of Ethnobiology which is the scientific study of dynamic relationships among peoples, biota, and environments. As a multidisciplinary field, ethnobiology integrates anthropology, geography, systematics, population biology, ecology, mathematical biology, pharmacology, conservation, and sustainable development. This class will cover the origins and evolution of ethnobiology theory and practice ranging from folk science, polymaths, taxonomic and colonial practices, the rise of Indigenous science methods, and the contemporary focus on creating networks among researchers of various disciplines to face the challenges of rapid ecological change and shifting political economies.", "name": "Topics In Anthropology", "section": "34", "location": "Locy Hall 109", "topic": "Introduction to Ethnobiology Theory and Practice", "course": "390-0", "meeting_time": ["MoWe 12:30PM - 1:50PM"], "path": "/class-descriptions/4660/WCAS/ANTHRO/390-0/38013", "instructor": ["Eli S Suzukovich III"], "class_attributes": "", "id": "38013", "subject": "ANTHRO"}]