[{"class_mtg_info": [{"meet_t": "MoWe 9:30AM - 10:50AM", "meet_l": "Pancoe Building Abbott Aud"}], "school": "MEAS", "enrl_requirement": "Enrollment Requirements: Pre-Registration is reserved for CE/CS majors who have taken EECS 214-0 and EECS 351-0.", "qtr": "Spring 2017", "name": "31760", "title": "MEAS EECS 395-0-21 Special Topics in Electrical Engineering and Computer Science", "class_attributes": "", "section": "31760", "instructors": [{"instructor_phone": "847 4672129", "instructor_name": "John E Tumblin", "instructor_addr": "3.320 Ford Design Center, Room 3.341 2133 Sheridan Road Evanston, IL 60208"}], "topic": "Intermediate Computer Graphics", "course": "395-0", "descriptions": [{"name": "Overview of class", "value": "Description<br/><br/>(to become CS351-2) Second in a 3-course series on the methods and theory of computer graphics, this project-oriented course explores how to describe shapes, movement, and lighting effects beyond the abilities of the standard OpenGL rendering pipeline. It includes interactive particle systems, simple rigid-body dynamics, explicit and implicit dynamics solvers (suitable for smoke, simple fluids and cloth) and an introduction to ray tracing (chrome, glass, and diffraction) with a few basic ideas for global illumination.<br/><br/> This course satisfies the CS Depth Interfaces &amp; the project requirement.<br/><br/>DETAILED COURSE TOPICS: The course has just two topics, but they are very broad: A. Particles and Movement: 1) Abandon all polygons to make 'shapeless' shapes (fireworks, swarms of bees, rain, snow, grass, etc.) from clouds of particles. How close can we get to modeling each particle in a cloud of steam? 2) Moving particles coupled together can simulate many interesting materials (rope, water, smoke, cloth, etc.). We'll explore both 'explicit' and 'implicit' solvers that make soft things move and behave realistically. B. Light Done Right: we'll learn ray tracing, BRDFs and light units, extended light sources (soft shadows), and some basic global illumination ideas. You will make pictures that look much more like photographs than OpenGL, with shadows, chrome reflections, transparency, and complex surfaces."}, {"name": "Registration Requirements", "value": "Prerequisites<br/>EECS 214 &amp; EECS 351"}, {"name": "Learning Objectives", "value": "COURSE GOALS: Comfort and ease creating visually accurate interactive non-polygonal objects such as smoke, fire, cloth, sand, ropes, with multi-bounce computed light transport."}, {"name": "Evaluation Method", "value": "Project, final: 2 progressively-graded projects with written project reports.<br/>Quizzes: 4 ?reading? quizzes,<br/>No midterm exam, no final exam."}, {"name": "Class Materials (Required)", "value": "COMPUTER USAGE: Yes, required; openGL, freeGLUT, GLEW, GLM, etc<br/><br/>REQUIRED TEXTBOOK:<br/>Required: &quot;Game Physics-Engine Development&quot; 2nd Ed.(2010), Ian Millington, CRC Press (Yes, Finally! A GOOD book we can count on!)<br/>Reccomended:<br/>-OpenGL SuperBible, 5th Edition, by Richard S. Wright et al., (c)2011 Addison-Wesley, 988 pp.<br/>-OpenGL Reference Manual, (&quot;Blue Book&quot;), OpenGL Programming Guide (&quot;Red Book&quot;); free<br/>online 1st edition: http://www.opengl.org/documentation/blue_book_1.0/ or ?/red_book_1.0;<br/>-OpenGL.org website; full of goodies!"}, {"name": "Class Materials (Suggested)", "value": "REFERENCE TEXTBOOKS:<br/>Handouts;<br/>SIGGRAPH/Pixar Short Course Notes &quot;Particle Dynamics&quot; by Witkin, Baraff.<br/>&quot;Fluid Simulation for Computer Graphics&quot; by Robert Bridson (c)2008 AK Peters.<br/>&quot;Game Physics Pearls&quot; Gino van den Bergen, Dirk Gregorius (Eds.) (c)2010 AK Peters.<br/>HOMEWORK ASSIGNMENTS: ungraded ?practice' problem sets and exercises; readings."}, {"name": "Class Notes", "value": "LABORATORY PROJECTS: CS352 is a project-oriented course: lectures and reading are important, but for a deep and genuine understanding of computer graphics methods you really need to write some code and make some pictures of your own. Step-by-step, week-by-week, you will build two large programming projects that make astonishing pictures.<br/><br/>MY NEW SYLLABUS PROMISE: In response to the recent Searle Small Group analysis of EECS 351-1 on 2/19/2013, I promise to have a complete syllabus with all topics, reading assignments, page numbers and dates for every class event ready for you on the first day of class. (I had not realized how important that is to so many students?)<br/><br/>(Beginning 2013, we teach Intermediate Graphics EVERY year instead of alternate years)."}], "lmod": "2/13/17 6:35 PM (CT)", "subject": "EECS"}]