[{"school": "WCAS", "overview_of_class": "Prof. Mahoney's 490 Spring 2016 &quot;Historical institutionalism&quot;<br/><br/>Historical institutionalism is a broad approach (or set of approaches) to research at the intersection of two literatures. The first is institutional analysis, which focuses on the emergence, operation, reproduction, change, and consequences of institutions. Historical institutionalism is often identified with macro institutional approaches that call attention to the role of power, collective actors, and conflict. The second literature focuses on temporal processes and modes of historical analysis. Historical institutionalism is associated with works that emphasize critical junctures, path dependence, and the temporal sequencing of macro processes.", "name": "Special Topics in Political Science", "section": "20", "topic": "Historical Institutionalism", "course": "490-0", "meeting_time": ["Fr 9:00AM - 11:50AM"], "path": "/class-descriptions/4620/WCAS/POLI_SCI/490-0/34193", "instructor": ["James L Mahoney"], "id": "34193", "subject": "POLI_SCI"}, {"school": "WCAS", "overview_of_class": "&quot;Satire and Political Theory: Aristophanes.&quot; How does satire contribute to political discourse? How far do we find substantial contributions to theorizing about politics in that format (as opposed to just clever and provocative expressions of strongly held political opinions)? This course considers these questions by way of extended engagement with the work of Aristophanes, blistering satirical depictions of democratic life and politics in during the long Peloponnesian War and into the fourth century BC and some of the most exciting and difficult texts in Greek political theory. The course will start out observing the proliferation of satire in 21st century political discourse and then turn to examine the plays. We will read all 11 surviving plays in translation but focus on close study in historical context of two, Clouds and Lysistrata. We will also attend to the reception history of these two plays, that is, how have they been used and reimagined in contemporary times. The course should benefit students interested in ancient political theory, classical studies broadly, democratic politics and interpretative methods.", "name": "Special Topics in Political Science", "section": "21", "topic": "Satire &amp; Political Theory", "course": "490-0", "meeting_time": ["Mo 3:00PM - 5:50PM"], "path": "/class-descriptions/4620/WCAS/POLI_SCI/490-0/34194", "instructor": ["Susan Sara   Monoson-Berns"], "id": "34194", "subject": "POLI_SCI"}]