[{"school": "WCAS", "overview_of_class": "An introduction to economics with an emphasis on macroeconomics. The first three weeks cover aspects of general economics that everyone should know, including how the market system works, how prices are determined, why shortages and surpluses occur, and, most interestingly, why some people earn high incomes and others earn low incomes, and what are the advantages and disadvantages of different careers. Topics include: supply and demand, competition versus monopoly, inflation, unemployment, recessions, booms, fiscal and monetary policy, and budget deficits.", "name": "Introduction to Macroeconomics", "section": "20", "location": "Tech Institute Lecture Room 3", "topic": "", "course": "201-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4640/WCAS/ECON/201-0/11273", "instructor": ["Robert J Gordon"], "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "id": "11273", "subject": "ECON"}, {"school": "WCAS", "overview_of_class": "An introduction to economics with an emphasis on macroeconomics (business cycles, inflation, unemployment, economic growth). The first three weeks cover aspects of general microeconomics that everyone should know, including how the market system works, how prices are determined, why shortages and surpluses occur, and basic industrial competition. Topics include: supply and demand, competition versus monopoly, comparative advantage in trade, taxation, and market failures. The last two-thirds of the class build on these tools to study the behavior of the economy as a whole, particularly in an international context. Topics include: inflation, unemployment, recessions, booms, fiscal and monetary policy, budget deficits, economic development of nations, international trade, and exchange rates.", "name": "Introduction to Macroeconomics", "section": "40", "location": "Tech Institute Lecture Room 2", "topic": "", "course": "201-0", "meeting_time": ["MoWeFr 1:00PM - 1:50PM"], "path": "/class-descriptions/4640/WCAS/ECON/201-0/11274", "instructor": ["Mark P Witte"], "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "id": "11274", "subject": "ECON"}]