[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "Locy Hall 318"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "24962", "title": "WCAS HISTORY 392-0-20 Topics In History", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "24962", "instructors": [{"instructor_phone": "", "instructor_name": "Matthew Ross June", "instructor_addr": ""}], "topic": "Drugs ,Trade In Amer. History", "course": "392-0", "descriptions": [{"name": "Overview of class", "value": "Perhaps the ultimate sign of the promises and perils of modernity, drugs (broadly defined to include tobacco, alcohol, caffeine, marijuana, heroin, cocaine, LSD, amphetamines, this list could go on forever) have a complex history that spans far more than even the three centuries covered in this course. We will explore the history of drugs in America from John Rolfe's first attempts to make English tobacco compete with Spanish gold through the paradoxical war on illegal drugs and boom of pharmaceuticals in our current culture. This complex history of substances will be used to highlight general trends in U.S. history and to explore the complex intersections of legality and illegality, medicine, trade, and law. Revealing the importance of changes in economic patterns for the history of the United States and the inextricable relationship between drugs and trade, the course will also explore the general complexities, contingencies, and continuities of history; for example, a panic about university students using amphetamines as a study aid? in 1938."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "AttendanceClass participationPaper, finalPresentationsResearch project- Research Project: 50%<br/>-Final Paper: 20%<br/>-Annotated Bibliography: 15%<br/>-Annotated Primary Sources: 15%<br/>- Presentation of Research Findings: 15%<br/>- Completion of Primary Source Assignments: 15%<br/>- Attendance and Participation: 20%"}, {"name": "Class Materials (Required)", "value": "Courtwright, David. Forces of Habit: Drugs and the Making of the Modern World (Cambridge: Harvard University Press, 2001)<br/><br/><br/>Reiss, Suzanna. We Sell Drugs: The Alchemy of US Empire (Berkeley: University of California Press, 2014)<br/><br/><br/>Tracy, Sarah and Acker, Caroline, eds., Altering American Consciousness: The History of Alcohol and Drug Use in the United States, 1800-2000 (Amherst: University of Massachusetts Press, 2004)<br/><br/><br/>Canvas readings"}, {"name": "Class Notes", "value": "Attendance at first class is mandatory<br/><br/>HISTORY AREA OF CONCENTRATION: Americas"}], "lmod": "1/9/16 6:48 PM (CT)", "subject": "HISTORY"}]