[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "University Hall 101"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "37879", "title": "WCAS AFST 390-0-24 Topics in African Studies", "class_attributes": "", "section": "37879", "instructors": [{"instructor_phone": "847/467-2689", "instructor_name": "Kathleen Fitzpatrick Klaus", "instructor_addr": "620 Library Lane, #202"}], "topic": "Land Rights &amp; Conflict in Global Perspective", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "AFST 390-0-24, &quot;Land Rights and Conflict in a Global Perspective&quot;, Prof. Kathleen Klaus, Spring 2016 (Combined with Poli_Sci 390-0-24, INTL ST 390-0-23) <br/><br/>For much of the world's population, land sustains livelihoods, shapes identities, and provides a source of investment and security. Yet the centrality of land in everyday life also means that it can become a source of contentious politics and violence. This class explores how struggles over access and rights to land shape different forms of conflict and violence: between squatters and state officials, different ethnic groups, or armed groups and the state. The course explores questions of land and conflict in several parts. We begin by examining the question of land meanings: what does land, property, and territory mean to different groups of people? How does this help us understand why people organize or fight around issues of land? Second, the course takes an historical and comparative view of the rules and institutions that shape people's rights and access to land. The third part of the class explores theories that link land to conflict and violence. We then apply these theories to explore a set of case studies of land-related conflict: from the recent armed uprising in Oregon to civil war in Colombia. The last part of the class moves toward policy considerations. How, for example, can a focus on land rights improve post-conflict resolution? The course is interdisciplinary in its approach, drawing heavily on political science and political geography. It should appeal to students interested in peace and conflict issues, environmental politics, international development, and human rights."}, {"name": "Registration Requirements", "value": "No Freshmen"}, {"name": "Evaluation Method", "value": "Course Requirements ? Seminar Participation (30%) ? Critical Review Papers (2 x 10%) ? Final Research Paper (40%) ? Presentation of Research Paper (10%) 1. Participation Students are expected to participate actively in each class and engage with the comments of their classmates. Bi-Weekly questions: As part of the student's participation grade, I will ask students to send two questions that they want to discuss before each seminar. Students should send these questions to the class list no later than 8 am the morning that the class meets. 2. Critical Review Papers Over the course of the semester, students will write two review papers based on the theme of a particular week. In the first paper, the student will analyze the theories and concepts from a set of readings, looking for assumptions or gaps in the literature (Concept paper). In the second paper, students will examine and critique a methodological approach and/or research design from a set of readings (Methods paper). Papers should be well argued and concise (avoiding summary of readings). Critical Review papers should be 5-6 pages (double-spaced). 3. Research Paper Students will work on developing their research papers over the course of the semester. Papers should present a clear and well-motived research question that addresses themes or debates that we have covered in the class. The paper should also present a clear set of hypotheses and should draw on original data to support hypotheses. They should be 15-20 pages, due the final day of class. 4. Final Presentation of Research Each student will give a 10-minute presentation based on their research paper during the last week of class. Details TBA."}, {"name": "Class Materials (Required)", "value": "Cotula, Lorenzo. The great African land grab - Agricultural investments and the global food system. London, UK: Zed Books, 2013 http://www.zedbooks.co.uk/paperback/the-great-african-land-grab <br/><br/> *course packet for all other readings"}, {"name": "Class Notes", "value": "No P/N option for this section"}], "lmod": "4/3/16 7:42 PM (CT)", "subject": "AFST"}]