[{"school": "WCAS", "overview_of_class": "The Cold War was arguably the longest conflict between competing nations and ideologies. Much of the combat was communicated through media and related speculation about life on the other side. While the U.S. established a new post-war economy based on consumerism and consumption, the U.S.S.R. attempted to recover from the devastating losses of the war by ramping up production. On both sides of the wall, texts, images, and other modes of performance constituted modes of action that contributed to these nations' disparate public cultures. This course will introduce the terms of &quot;public culture&quot; as a means to investigate the communicative practices that both divided and linked the U.S. and the U.S.S.R. during the early part of the cold war period. Close attention will be paid to the forms of engagement between the nations?visual, textual, diplomatic?in order to better understand the relationships between power as a state sponsored discursive force and the alternative forms, however fleeting, of a resistant public agency.", "name": "Topics in Gender Studies", "section": "20", "topic": "Cold War &amp; Public Cultures", "course": "490-0", "meeting_time": ["We 2:00PM - 4:50PM"], "path": "/class-descriptions/4650/WCAS/GNDR_ST/490-0/24146", "instructor": ["Kate A Baldwin"], "id": "24146", "subject": "GNDR_ST"}, {"school": "WCAS", "overview_of_class": "This course introduces students to foundational and current writing in queer theory. It is organized around three themes: affects, aesthetics, and methods. We will situate queer thinking in both a broader intellectual landscape of the human sciences, particularly music and sound studies. Each week we will focus our discussions of selected texts on particular musical/sonic objects to explore the potentials of queer theory and analysis.", "name": "Topics in Gender Studies", "section": "21", "topic": "Queer Theory", "course": "490-0", "meeting_time": ["We 2:00PM - 4:50PM"], "path": "/class-descriptions/4650/WCAS/GNDR_ST/490-0/24147", "instructor": ["Ryan Wayne Dohoney"], "id": "24147", "subject": "GNDR_ST"}, {"school": "WCAS", "overview_of_class": "This course asks the question, &quot;What is sex?&quot; - from a feminist and queer perspective. We will use ethnography as the tool to look for answers. Turning away from recent preoccupations with sexuality as an identity or an orientation, our focus will be on sex itself - the sexed body and sex acts. The course is about &quot;Sex and?&quot;, where the ?and' includes &quot;and race&quot;, &quot;and class&quot;, &quot;and disability&quot;, &quot;and money&quot;, &quot;and violence&quot;?.. It is also about &quot;Sex in?&quot;, where the ?in' includes ?in Brazil', ?in Cuba', ?in Silicon Valley', ?in Peru'? (Most case studies are from the Americas, including the U.S., Canada, Latin America and the Caribbean). Our readings and discussions will be framed around four general themes: sexed bodies; sex work; sexual violence; sexual reproduction.", "name": "Topics in Gender Studies", "section": "22", "topic": "Queering Reproduction", "course": "490-0", "meeting_time": ["Mo 6:00PM - 8:50PM"], "path": "/class-descriptions/4650/WCAS/GNDR_ST/490-0/24148", "instructor": ["Mary J Weismantel"], "id": "24148", "subject": "GNDR_ST"}, {"school": "WCAS", "overview_of_class": "The seminar pertains to theories and empirical research concerning differences and similarities in the social behavior, traits, and abilities of women and men. Readings will consider theories of ultimate causes and proximal causes of sex differences. The seminar will study sociocultural and interactional processes, developmental processes, and the organizational and activational effects of hormones.", "name": "Topics in Gender Studies", "section": "23", "topic": "Social Psych of Gender", "course": "490-0", "meeting_time": ["Tu 4:00PM - 6:50PM"], "path": "/class-descriptions/4650/WCAS/GNDR_ST/490-0/27481", "instructor": ["Alice H Eagly"], "id": "27481", "subject": "GNDR_ST"}]