[{"school": "WCAS", "overview_of_class": "This discussion-based course focuses on the connection between conceptions of the self and goal-oriented motivation, with particular attention devoted to the influence of social, structural, and cultural forces. The first segment of the term will cover classic theoretical work concerning the self and identity. Next, we will consider the relevance of a variety of social influences on identity and motivation. Finally, the course will close with a survey of contemporary identity-based intervention research and practical applications relating to trends in social inequalities, including education and health.", "name": "Advanced Seminar in Personality, Clinical, or Social Psychology", "section": "21", "topic": "Identity &amp; Motivation", "course": "357-0", "meeting_time": ["MoWe 10:00AM - 11:20AM"], "path": "/class-descriptions/4610/WCAS/PSYCH/357-0/21026", "instructor": ["Mesmin Patrick Destin"], "id": "21026", "subject": "PSYCH"}, {"school": "WCAS", "overview_of_class": "This course will provide an overview of the neurobiology of emotion and emotional disorders such as depression, bipolar disorder and anxiety. The course will include discussion of contemporary theories of emotion, 21st century methods for examining the emotional brain (e.g., MRI, EEG), the circuits in the brain underlying our experience of emotion, the biological mechanisms underlying emotional disorders, the mechanisms underlying the treatment of emotional disorders, and future directions in the study of the emotional brain.  The course is introductory in nature and it is not expected that students have previous courses in either neurobiology or mood disorders.", "name": "Advanced Seminar in Personality, Clinical, or Social Psychology", "section": "22", "topic": "The Emotional Brain", "course": "357-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4610/WCAS/PSYCH/357-0/21027", "instructor": ["Robin   Nusslock"], "id": "21027", "subject": "PSYCH"}]