[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "University Hall 122"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "23924", "title": "WCAS ENGLISH 311-0-20 Studies in Poetry", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "23924", "instructors": [{"instructor_phone": "", "instructor_name": "Daniel Scott Snelson", "instructor_addr": ""}], "topic": "Print On Demand Poetry", "course": "311-0", "descriptions": [{"name": "Overview of class", "value": "The alphabet rendered poetry obsolete, once and for all. Since the written word overtook the Homeric epic poem as a kind of communal Wikipedia, poetry has been less about communicating information and more about lyric expression. Recently, digital technologies have been seen to present this same challenge to the book. Like poetry, we might say that the book isn't dead, it has simply lost its claim as the primary source of information. Over the last two decades, some of the most interesting works of art and poetry have turned to the book in both form and content, as both inspiration and fallen idol. It has never been easier for writers to publish, not just on Twitter and Facebook, but across a range of Print on Demand (POD) platforms for the printed book. This course examines recent works of poetry alongside new developments in print technologies. From Seth Siegelaub's The Xerox Book (1968) to new works of POD poetry published throughout the quarter (TBA, 2017), we will study the emergence of innovative forms of writing the book under the influence of digital networks. Additionally, we will conduct our own experiments using print on demand in a series of collaborative and independent scholarly projects. No previous experience with either poetry or publishing is required. All students will publish books about poetry made on the internet."}, {"name": "Teaching Method", "value": "Seminar conversations, online threads, individual and collective publication workshops."}, {"name": "Evaluation Method", "value": "Collaboration, participation, short publication experiments, and a final essay delivered as a print on demand book."}, {"name": "Class Materials (Required)", "value": "All theoretical and critical readings will be made available online, including works by Lisa Gitelman, Hannes Bajohr, Metahaven, Paul Soulellis, Lisa Nakamura, Tan Lin, Amaranth Borsuk, Silvio Lorusso, Johanna Drucker, Friedrich Kittler, Lori Emerson, Randall McLeod, Dexter Sinister, and others. Selected works of art and poetry will be purchased through Print on Demand services, as hosted or featured on Library of the Printed Web, Gauss PDF, Information as Material, Poetry will be made by all!, Orworse Press, Post-Digital Publishing Archive, Troll Thread, Hysterically Real, and elsewhere."}, {"name": "Class Notes", "value": "Note: The above course is combined with Humanities. If the English side of the course is full, you may register for the course under the co-listed department and receive the same credit toward your English major."}], "lmod": "12/25/16 6:58 PM (CT)", "subject": "ENGLISH"}]