[{"class_mtg_info": [{"meet_t": "Fr 12:00PM - 2:50PM", "meet_l": "Annie May Swift Hall 103"}], "school": "SoC", "enrl_requirement": "Enrollment Requirements: Reserved for Performance Studies Students.<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Spring 2017", "name": "37474", "title": "SoC PERF_ST 318-1-20 Shakespeare's English Histories", "class_attributes": "", "section": "37474", "instructors": [{"instructor_phone": "847/491-3171", "instructor_name": "Paul C Edwards", "instructor_addr": "Annie May Swift Hall, Room G03"}], "topic": "", "course": "318-1", "descriptions": [{"name": "Overview of class", "value": "COURSE DESCRIPTION. Some of Shakespeare's earliest plays: the pious but inept reign of Henry VI; populist rebellions; the bloody Wars of the Roses; the unhappy life of Queen Margaret; and the brief rise and fall of &quot;crookback&quot; Richard III. At the beginning of the course, students will read and discuss the so-called first tetralogy of of Shakespeare's English history plays. <br/><br/>SPECIAL TOPIC AND PERFORMANCE, SPRING 2017. Students will rehearse and perform an original script by SoC senior Matthew Bentley, which adapts Shakespeare's Henry VI and Richard III into a single-evening performance. the new script will receive a workshop performance, directed by Bentley, to be presented in the Annie May Swift &quot;Krause&quot; Studio during early June 2017. PLEASE NOTE: The course will require flexibility scheduled outside of class rehearsal in April and May (schedule tba). <br/><br/>THEATRE CREDIT. This course satisfies one unit of the &quot;History, Literature, and Criticism&quot; requirement in the Theatre Department."}, {"name": "Registration Requirements", "value": "Permission of instructor. AVAILABLE DURING SOC PRE-REGISTRATION WEEK. E-mail Paul Edwards at edwdoyle@northwestern.edu or edwdoyle1@gmail.com. Students from departments outside of Communication are welcome."}, {"name": "Evaluation Method", "value": "Participation in a final group performance, to take place in the final week of classes at the end of fall quarter. Response papers documenting development of the script. Attendance is mandatory."}, {"name": "Class Materials (Required)", "value": "Shakespeare, HENRY VI, Parts 1-3<br/>Shakespeare, RICHARD III<br/>Selected corollary readings and viewings."}], "lmod": "2/14/17 6:39 PM (CT)", "subject": "PERF_ST"}]