[{"class_mtg_info": [{"meet_t": "MoWeFr 10:00AM - 10:50AM", "meet_l": "Kresge Centennial Hall 3-410"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for French Majors &amp; Minors.", "qtr": "Spring 2017", "name": "33889", "title": "WCAS FRENCH 316-0-20 The Contemporary French Speaking World", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "33889", "instructors": [{"instructor_phone": "847/491-8263", "instructor_name": "Nasrin   Qader", "instructor_addr": "1860 S. Campus Drive, Crowe Hall #2-101"}], "topic": "Literary Border Crossings", "course": "316-0", "descriptions": [{"name": "Overview of class", "value": "The Contemporary French Speaking World: Border Crossings in Francophone African Fiction<br/><br/>One of the most pressing political and ethical issues of our time is the question of borders, in particular geographical and political borders. At the heart of this question today lie the problems of migrants whose border crossings are too often taking place under difficult and deadly conditions. Yet border crossing as concept and act is not limited to our contemporary era. Movement, migration, departure and return have constituted human history as well as language. Translation and multilingualism are border crossings. Writing owes its existence to this dynamic as words emerge onto a page or computer screen; where the pen leaves its marks and departs; where worlds cross the border of the imagination and become realities we enter and navigate through reading. Speaking is also border crossing as the voice traverses the body, emerging in its impulse to reach an elsewhere and an other. Transgression as border crossing is the stuff of our everyday life and the hallmark of our existence. <br/><br/>This course is dedicated to the exploration of the multifaceted dimensions of border crossing in literature. At the core of our questioning will be what a border is; what are its qualities; how it comes into being and what allows it to be crossable. Students will be invited to read carefully, ask precise questions of the texts they read, and expose the concept of &quot;border crossing&quot; to its many possibilities and implications."}, {"name": "Registration Requirements", "value": "Pre-requisite: 271, 272, 273 or consent of instructor"}, {"name": "Learning Objectives", "value": "To expose students to some of the world's most vibrant literary traditions in French from different regions of the African continent; to help students become nuanced readers of literature and enhance their ability to think critically and creatively about notions that may at first seem obvious, ordinary and too familiar to be questioned; to improve students' reading, writing and speaking skills in French."}, {"name": "Teaching Method", "value": "Discussion with lectures when appropriate."}, {"name": "Evaluation Method", "value": "Midterm and final papers; oral class presentations, presentation paper, class participation."}, {"name": "Class Materials (Required)", "value": "Mohammad Dib, &quot;Déviation&quot; <br/>Ghita el-Khayat &quot;La vie brève,&quot; &quot;Le présent,&quot; &quot;La voix&quot; <br/>Ananda Devi Pagli<br/>Fawzia Zouari Ce pays dont je meurs <br/>Alain Mabanckou Bleu Blanc Rouge <br/>Cheikh Hamidou Kane L'aventure ambigue <br/>Yasmina Khadra Les Hirondelles de Kaboul <br/>Véronique Tadjo Reine Pokou <br/>Boubacar Boris Diop Murambi, le livre des ossements"}], "lmod": "2/12/17 6:53 PM (CT)", "subject": "FRENCH"}]