[{"class_mtg_info": [{"meet_t": "Th 4:00PM - 6:50PM", "meet_l": "2315 Campus Dr Clinic 1630"}], "school": "SoC", "enrl_requirement": "", "qtr": "Spring 2017", "name": "32774", "title": "SoC CSD 467-0-1 Seminar: Advanced Topics in Management of Hearing Impairment", "class_attributes": "", "section": "32774", "instructors": [{"instructor_phone": "847/491-2433", "instructor_name": "Pamela Elizabeth Souza", "instructor_addr": "2240 Campus Drive"}], "topic": "", "course": "467-0", "descriptions": [{"name": "Overview of class", "value": "Overview of class: CSD 467 is a seminar devoted to management of hearing impairment. As audiological practice continues to advance and generate new treatments, the demands on audiologists to evaluate new information and use that information to make patient decisions are greater than ever before. The course is designed to provide current knowledge relevant to management of hearing impairment in older adults, to develop critical thinking skills, and to make patient decisions. Guest lecturers and the instructor will introduce various patient issues. We will also read and discuss scientific literature relevant to professional practice. This course satisfies the following ASHA KASAs: <br/>B2. Patient characteristics (specifically, age and cognitive status) <br/>B3. Educational, vocational, and social and psychological effects of hearing impairment and their impact on the development of a treatment program<br/>E7. Perform hearing aid, assistive listening device, and sensory aid assessment.<br/>E8. Recommend, dispense, and service prosthetic and assistive devices.<br/>E9. Provide hearing aid, assistive listening device, and sensory aid orientation."}, {"name": "Teaching Method", "value": "Guest lecturers and the instructor will introduce various patient issues. We will also read and discuss scientific literature relevant to professional practice."}, {"name": "Class Materials (Required)", "value": "Selected articles."}], "lmod": "2/20/17 6:38 PM (CT)", "subject": "CSD"}]