[{"school": "WCAS", "overview_of_class": "This course will offer a balanced approach to the growth and change in literature devoted to the subject of the environment, touching briefly on 19th century foundations (specifically Thoreau) and moving quickly to the explosion of what may be a subgenre of creative writing. We will consider and write works in poetry, drama, fiction, and nonfiction, documentary, advocacy journalism, and polemic. We will read and compose works in science and philosophy, art and religion, history and politics, exploring the way they come to this huge and pressing subject of the environment.", "name": "Advanced Creative Writing", "section": "20", "topic": "Reading and Writing Nature", "course": "307-0", "meeting_time": ["MoWe 12:30PM - 1:50PM"], "path": "/class-descriptions/4640/WCAS/ENGLISH/307-0/11968", "instructor": ["Brian D Bouldrey"], "id": "11968", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "A creative writing course for any undergraduate who has completed ENG 206 and at least one of the subsequent prose courses (ENG 207 or ENG 208), and who would like to explore new schemes for subverting and enriching the obvious in literature. You will study and imitate some of the fruitful compressions and distortions liberated for your use by Jorge Luis Borges (Labyrinths), Gabriel Garcia Marquez (Chronicle of a Death Foretold), and W. G. Sebald (The Emigrants), as well as by the foremost member of the Oulipo group in France, Georges Perec (Things), by the English painter Tom Phillips (A Humument) , and by the Canadian classical scholar, poet, and painter Anne Carson (Nox). The course begins with the making of an origami box crosshatched with phrases chosen from your recent writing and enclosing one or two locally and recently &quot;found objects&quot;; and it ends with the making of a physical book with a three-dimensional, pull-out, or painted feature. Your book will also respond to and re-imagine another work of art, as Christoph Ransmayr does to Ovid's Metamorphoses in The Last World. Weekly exercises, imitations, and abbreviated &quot;takes&quot; may join into this 20-page final project. May count as the non-core course in the creative writing Cross-Genre Minor. Texts at Beck's Books; course reader at Quartet.", "name": "Advanced Creative Writing", "section": "21", "topic": "Cross Genre Experiments", "course": "307-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4640/WCAS/ENGLISH/307-0/11969", "instructor": ["Mary   Kinzie"], "id": "11969", "subject": "ENGLISH"}]