[{"class_mtg_info": [{"meet_t": "We 2:00PM - 4:50PM", "meet_l": "RCMA Lower Level 113"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24147", "title": "WCAS GNDR_ST 490-0-21 Topics in Gender Studies", "class_attributes": "", "section": "24147", "instructors": [{"instructor_phone": "", "instructor_name": "Ryan Wayne Dohoney", "instructor_addr": "ryan.dohoney@northwestern.edu"}], "topic": "Queer Theory", "course": "490-0", "descriptions": [{"name": "Overview of class", "value": "This course introduces students to foundational and current writing in queer theory. It is organized around three themes: affects, aesthetics, and methods. We will situate queer thinking in both a broader intellectual landscape of the human sciences, particularly music and sound studies. Each week we will focus our discussions of selected texts on particular musical/sonic objects to explore the potentials of queer theory and analysis."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Class participationProject, final"}, {"name": "Class Materials (Required)", "value": "Possible texts include: Johnson, &quot;Quare&quot; Studies, Chen, &quot;Queer Animation&quot; Butler, &quot;Critically Queer, &quot;de Lauretis, &quot;Queer Theory: Lesbian and Gay Sexualities: An Introduction,&quot; Drew Daniel, &quot;All Sound is Queer,&quot; Deleuze/Guattari, Anti-Oedipus, Hocqueghem, Homosexual Desire, Foucault, History of Sexuality, Grace, &quot;Faux Amis,&quot; Rubin, &quot;Thinking Sex,&quot; Lorde, &quot;The Uses of the Erotic,&quot; Wittig, The Lesbian Body, Cusick, &quot;On a Lesbian Relationship with Music,&quot; Bataille, Eroticism, Death, and Sensuality, Warner &amp; Berlant, &quot;Sex in Public,&quot; Roach, Friendship as a Way of Life, Mockus, Sounding Out, Lawrence, &quot;I want to see all my friends at once,&quot; Newton, Mother Camp, Sontag, &quot;Notes on Camp,&quot; Britton, &quot;For Interpretation: Notes Against Camp,&quot; Halperin, How to be Gay, Derrick Scott, Extravagant Abjection, Halperin, What do Gay Men Want? Kristeva, Powers of Horror, Sedgwick, &quot;Shame in the Cybernetic Fold,&quot;Bersani, &quot;Is the Rectum a Grave,&quot; Getsy, Abstract Bodies &amp; &quot;Queer Formalism,&quot;Maus, &quot;The Disciplined Subject of Music Analysis&quot; &amp; &quot;Sexual and Musial Categories,&quot; Love, Feeling Backward, Ngai, &quot;Visceral Abstraction,&quot; Merleau-Ponty, Phenomenology of Perception, Butler, Bodies that Matter, Gender Trouble, Fausto-Sterling, Sexing the Body, Halperin, How to do the History of Homosexuality, Freccero, Queer/Early/Modern, Traub, &quot;The New Unhistoricism,&quot; Harris, Handel as Orpheus, Thomas, &quot;Was George Fredric Handel Gay?&quot; Canguilhem, &quot;Normality and Normativity,&quot; Love, &quot;Doing Being Deviant,&quot; Goffman, Stigma, Ferguson, Aberrations in Black, Warner, Fear of a Queer Planet"}], "lmod": "12/24/16 6:59 PM (CT)", "subject": "GNDR_ST"}]