[{"school": "MUSIC", "overview_of_class": "What constitutes \"music\"? When we listen to it, what are we really hearing, and what makes us feel what we feel? This course will explore the components of music and the ways that they work together to create meaning. While its primary focus will be the music of the Western classical tradition, the course will encompass a broad variety of genres and equip students with an enhanced capacity to understand and appreciate music of all kinds. Students will be expected to prepare readings and listening assignments for each class meeting and to discuss them using the vocabulary acquired throughout the course, as well as to complete written assignments, attend concerts, and prepare for quizzes and exams.", "name": "Introduction to Music", "section": "20", "location": "RCMA 1-160", "topic": "", "course": "170-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4620/MUSIC/GEN_MUS/170-0/35746", "instructor": ["Liza Jane White"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "35746", "subject": "GEN_MUS"}, {"school": "MUSIC", "overview_of_class": "This course introduces undergraduate non-music majors to diverse musical cultures, soundscapes, and environments through an issue-oriented approach and a three-part listening model?sound, setting, and significance. Students will learn fundamental music concepts, develop listening skills, and engage critically with folk, popular, and classical traditions from Europe, the Americas, Asia, and the Middle East. Our discussions will examine musical diversity but also attend to the commonalities that cross regional and cultural boundaries and communities.", "name": "Introduction to Music", "section": "21", "location": "RCMA 1-160", "topic": "", "course": "170-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4620/MUSIC/GEN_MUS/170-0/35747", "instructor": ["Amanda Claire Stein"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "35747", "subject": "GEN_MUS"}]