[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "University Hall 118"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "34261", "title": "WCAS HISTORY 392-0-22 Topics In History", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "34261", "instructors": [{"instructor_phone": "847 4672692", "instructor_name": "Fredrik   Meiton", "instructor_addr": "Harris Hall 231"}], "topic": "Oil and Water in the Middle East During the 20th C", "course": "392-0", "descriptions": [{"name": "Overview of class", "value": "Is there such a thing as a resource curse? More than any other part of the world, the Middle East is closely associated with both extreme abundance (oil) and extreme scarcity (water), and with the politics to which competition over these two resources has given rise. Scholars of the Middle East have recently begun to reckon with how the interconnections between people, environment, and natural resources have shaped the region politically, economically, and socially. In this course, we will survey the modern history of the Middle East and consider such things as water management in the late Ottoman period, and the construction of irrigation systems and national water carriers in the 20th century. The course also considers the emergence of the oil industry, and the construction of national, regional, and international systems for resource extraction, refinement, and transport. We will see that the histories of oil and water are intertwined, and figure in all important issues of Middle Eastern society and politics, from labor organizing, gender relations, and forms of rule to geopolitics and the Arab-Israeli conflict"}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Participation, Response Papers, &amp; Final Paper"}, {"name": "Class Materials (Suggested)", "value": "Timothy Mitchell. Carbon Democracy: Political Power in the Age of Oil. 9781781681169.Toby Craig Jones. Desert Kingdom: How Oil and Water Forged Modern Saudi Arabia. 9780674049857. Robert Vitalis. America's Kingdom: Mythmaking on the Saudi Oil Frontier. 9781844673131."}], "lmod": "2/9/17 6:43 PM (CT)", "subject": "HISTORY"}]