[{"school": "WCAS", "overview_of_class": "\"How to Do Things with Political Theory\", Professor Stevens, Winter 2016<br/>Material increases in the capacity to store and distribute information in the last 25 years create new possibilities and challenges for scholarly research.  These changes raise several questions specific to political theorists.  1)  How do we anticipate these changes in forms of knowledge will change our geo-political-economic terrains, spaces, places, and relations?  2)  What substantive knowledge should political theorists endeavor to master? Is it sufficient to read just those texts and conversations in political or critical theory?  What does the increasing interdependence of different regimes and the  globalization of the university require of an individual scholar?  How do we discover and negotiate limits of mindfulness and reflection in responding to these changes?  3) What new skills and techniques consistent with our current understandings of political theory might be expected of new generations of scholars?  For instance, should political theorists be expected to learn basic html coding to develop digital platforms for holding workshops, conferences, or classes? 4) Should political theorists ignore, resist, or fight the use of new information technologies elsewhere? If so, what form would this (non)engagement take?  What might be the uses and disadvantages of these different (non)responses?  The readings for this course will emphasize reflections on other epochs in which intellectuals were engaged with similar or related questions.  <br/>For the first five weeks we will read primary texts to orient us.  These will include, in conversation with readings by Jacques Derrida: Plato (Gorgias, Protagoras, Republic, Phaedrus); Eric Havelock (Mimesis); Selections from Edward Coke (on assembling the judicial opinions that instantiated common law as case law); Miguel de Cervantes, The Amazing Gentleman Don Quixote of Hidalgo, through Book I, chapter 3 (Wordsworth Classics has a very good and inexpensive translation-you are invited to read more!); G.W.F. Hegel (selections from The Phenomenology of Spirit and The Philosophy of Right); Friedrich Nietzsche; and Sigmund Freud (\"Mystic Writing Pad,\" and \"Moses and Monotheism\"). For each week we will read older texts in conversation with books and chapters by Derrida and possibly other 20th and 21st century authors. <br/>In week four we will choose as a class the texts from contemporary political theory that we think will be most helpful for our emerging inquiries and conversations and read those for the last half of the course.", "name": "Special Topics in Knowledge & Politics", "section": "20", "location": "Scott Hall 201 Ripton Room", "topic": "", "course": "469-0", "meeting_time": ["Tu 3:00PM - 5:50PM"], "path": "/class-descriptions/4610/WCAS/POLI_SCI/469-0/24560", "instructor": ["Jacqueline   Stevens"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "id": "24560", "subject": "POLI_SCI"}]