[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "Kresge Centennial Hall 2-410"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "34029", "title": "WCAS LATINO 392-0-23 Topics in Latina and Latino Social and Political Issues", "class_attributes": "Interdisciplinary Distro - See Rules<br/><br/>Social &amp; Behavioral Sciences Distro Area<br/><br/>Ethics &amp; Values Distro Area<br/><br/>", "section": "34029", "instructors": [{"instructor_phone": "847/491-8916", "instructor_name": "Myrna   Garcia", "instructor_addr": "1908 Sheridan"}], "topic": "", "course": "392-0", "descriptions": [{"name": "Overview of class", "value": "Attentive to the role of U.S. imperialism, this course will examine how, and under what circumstances, Latinas/os/xs have migrated to the United States. We will study how the immigration regime is a race-making institution, and examine its impact on Latina/o/x communities. We will also explore the historical, political, and cultural constructs (re)shaping Latina/o/x immigration discourse. Specifically, we will complicate and problematize the circulation of the &quot;nation of immigrants&quot; narrative in the popular imagination. Throughout our study, we will consider the following questions: How do dominant perceptions of citizenship, race/ethnicity, trans/national belonging influence each other as well as the mainstream outlook on Latina/o/x immigration? What are the theoretical tools and methods that Latinas/os/xs have used to fight for immigrant rights and human dignity? How do we move beyond political frameworks that privilege juridical citizenship as the means of (full) belonging in the nation? What is sanctuary, for whom, and under what circumstances? We will also study the counter-narratives produced by Latinas/os/xs to challenge the stereotypes and dominant misunderstandings of Latina/o/x immigration."}, {"name": "Learning Objectives", "value": "By the end of the course students will be able to:<br/>1. Articulate how, and under what circumstances, Latinas/os/xs have migrated to the United States; <br/>2. Understand and analyze academic and political debates surrounding the topic of Latina/o/x immigration; <br/>3. Identify how Latinas/os/xs have fought, and continue to fight, for immigrant rights and human digity;<br/>4. Theorize the possibilities and limitations for immigration reform and sanctuary; and <br/>5. Produce creative projects that offer counter narratives about Latina/o/x immigration"}, {"name": "Teaching Method", "value": "Class participationDiscussionGroup workPresentationsReadingsResearch projectSeminarWriting assignments"}, {"name": "Evaluation Method", "value": "Class participationPaper, finalPaper, mid-termProject, final"}, {"name": "Class Materials (Required)", "value": "Molina, Natalia M. How Race is Made in America: Immigration, Citizenship, and the Historical Power of Racial Scripts. Berkeley: University of California Press, 2014. ISBN: 9780520280083 $27.95 <br/><br/>Escobar, Martha D. Captivity Beyond Prisons: Criminalization Experiences of Latina (Im)migrants. Austin: University of Texas Press, 2016. ISBN: 9781477309018 $27.95<br/><br/>Gonzales, Roberto G. Lives in Limbo: Undocumented and Coming of Age in America. Oakland: University of California Press, 2015. ISBN: 9780520287266 $29.95"}], "lmod": "2/8/17 6:44 PM (CT)", "subject": "LATINO"}]