[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "University Hall 101"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "14418", "title": "WCAS SOCIOL 376-0-22 Topics in Sociological Analysis", "class_attributes": "", "section": "14418", "instructors": [{"instructor_phone": "", "instructor_name": "Albert Dale   Hunter", "instructor_addr": ""}], "topic": "Utopian Communities", "course": "376-0", "descriptions": [{"name": "Overview of class", "value": "Utopian thought has a long history in Western thought as different writers have attempted to define the ideal community from Plato's Republic through Thomas More ?s first coining of &quot;Utopia&quot; (nowhere) as an ideal community in the Sixteenth century. Often Utopias were defined as counter critiques of existing social arrangements and at times people attempted to create and live in communities based on their ideals.. In this course we will explore fictional and real utopian communities in each of three broad historical periods?preindustrial, industrial, and post-industrial. We will use these cases as critical analyses of existing societies highlighting the social problems of their day?issues such as inequalities of wealth and power, individual versus collective priorities, family structure and socialization, sexual relations and gender roles, defining and dealing with deviants, and social control, education, work and leisure, among others. We will explore in detail the founding, the dynamics, and the fates of attempts to live in real utopian communities. We will conclude with a consideration of the role of utopian thought in contemporary society."}, {"name": "Teaching Method", "value": "Classes will consist of brief lectures framing the topic of the day along with discussion of readings and presentations."}, {"name": "Evaluation Method", "value": "Grades will be based on reading responses, 3 short quizzes, a class presentation on an outside reading, and a final paper."}, {"name": "Class Materials (Required)", "value": "TBA"}], "lmod": "10/30/16 7:10 PM (CT)", "subject": "SOCIOL"}]