[{"school": "WCAS", "overview_of_class": "In this course, we will try to survey the various ideologies, movements, and communities that make up what is called ?Chinese America.' We will do this through some texts that I have chosen that I think represent the field of Chinese American studies. Some of these texts are fictional, others are historiographical, and still others are sociological. By reading these texts, we might gain a sense of how internally diverse, if not divisive, ?Chinese America' is and yet how this term ?Chinese America' is still used as a coherent term of political mobilization. Throughout the class, students will write weekly reflections; there will also be a short midterm paper and a longer final essay.", "name": "Topics in History", "section": "1", "location": "University Hall 102", "topic": "The Chinese American Experience", "course": "220-0", "meeting_time": ["MoWe 12:30PM - 1:50PM"], "path": "/class-descriptions/4660/WCAS/ASIAN_AM/220-0/32487", "instructor": ["Justin K Tse"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "32487", "subject": "ASIAN_AM"}, {"school": "WCAS", "overview_of_class": "Oftentimes, ?Asian America' is taken as a demographic category to describe everyone in America of ?Asian descent.' However, in this course, we will begin with the premise that what we know about ?Asian America' is founded and sustained by what might be called ?social movements,' mobilizations of people who have become conscious of an issue or issues that affect them and make them want to do something collectively about it. While reading some texts that I have assigned that give examples of Asian Americans engaging in the work of social movements, I propose that our task should be to evaluate whether these movements have been effective. To do that, we will also spend some time reading Gary Okihiro's Third World Studies in relation to the Brazilian educator Paulo Freire's Pedagogy of the Oppressed as a text that will help us to think about the actual operation of Asian American social movements. Weekly reflections will be required, as will a short midterm paper and a longer final essay.", "name": "Topics in History", "section": "2", "location": "University Hall 102", "topic": "Asian American Social Movements", "course": "220-0", "meeting_time": ["MoWe 9:30AM - 10:50AM"], "path": "/class-descriptions/4660/WCAS/ASIAN_AM/220-0/32488", "instructor": ["Justin K Tse"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "32488", "subject": "ASIAN_AM"}, {"school": "WCAS", "overview_of_class": "Twice since 9/11 politicians have referred to the World War II imprisonment of Japanese Americans as a possible precedent for policies toward Muslims. Yet many Americans remain ignorant about this important and understudied episode in U.S. history. This course examines events leading up to the mass imprisonment of a group of people based on race, the role played by wartime emergency language, the experiences of Japanese Americans, and the consequences of this wartime policy. It focuses on the intersections between race, gender, nation, and law. Readings include secondary and primary sources, including related court cases, executive orders, documentary films, memoirs, and fiction.", "name": "Topics in History", "section": "3", "location": "University Hall 102", "topic": "Japanese American 'Internment'", "course": "220-0", "meeting_time": ["TuTh 9:30AM - 10:50AM"], "path": "/class-descriptions/4660/WCAS/ASIAN_AM/220-0/32489", "instructor": ["Shana B Bernstein"], "class_attributes": "Historical Studies Distro Area<br/><br/>", "id": "32489", "subject": "ASIAN_AM"}]