[{"class_mtg_info": [{"meet_t": "Mo 6:00PM - 8:50PM", "meet_l": "303 E. Wacker Dr. 1609A"}], "school": "JOUR", "enrl_requirement": "Enrollment Requirements: Only students in the MSJ program may enroll in these classes", "qtr": "Fall 2016", "name": "11886", "title": "JOUR JOUR 490-0-20 Special Topics", "class_attributes": "", "section": "11886", "instructors": [{"instructor_phone": "", "instructor_name": "Peter D Slevin", "instructor_addr": ""}], "topic": "Politics, Partisanship and Foreign Policy in the 2", "course": "490-0", "descriptions": [{"name": "Overview of class", "value": "Politics in America is many things - a contest, a drama, a potent and perilous and always imperfect exercise. Just as politics represents the inner workings of democracy, the best political reporting exposes and explains those workings and, on a good day, rescues the republic from folly. Heading toward November 2016 and the election of the next commander in chief, the stakes could hardly be higher. Essential domestic and national security policies are on the table, from Obamacare, guns and voting rights to Middle Eastern conflict, terrorism and the nuclear treaty with Iran. This seminar will draw on Campaign 2016 in real time to explore the connections between the machinery of politics, a polarized electorate and a fast-changing media landscape. Students can choose their own focus at various points in the course, including foreign, domestic, national security, campaign personality, media roles, public opinion, voting rights and electioneering. To make sense of the rolling carnival of fact, fiction and shifting narrative, the class will study film documentaries and candidate profiles; campaign speeches and opinion polls; Web advertising and political commentary from all sides. An essential part of our effort will be focused on understanding not just how journalists see the political world, but how campaign operatives see and use the media. Campaigns race to establish narratives, mindful that various voices in the media will reinforce or challenge those narratives during a hard-fought race. Candidates and political strategists are constantly seeking advantage, using every tool they can muster; that's their job. Journalists must be professionally skeptical, rigorous, smart and fair; that's their job. The audience? Voters. The stakes? The direction of the country. The course encompasses an array of media platforms, aiming to pierce the spin and identify what is true and meaningful, and to whom."}], "lmod": "10/30/16 6:47 PM (CT)", "subject": "JOUR"}]