[{"class_mtg_info": [{"meet_t": "Tu 6:15PM - 9:15PM", "meet_l": "Parkes Hall 214"}], "school": "SCS", "overview_of_class": "The epic corpus of ancient Greece, with its enduring and endearing songs and stories, is woven together from the colorful threads of centuries of oral tradition combined with exquisite literary art. This course will inquire into the mythic and historical origins of these stories, as well as the processes involved in their composition, transmission, and confirmation as woven texts. Readings will include selections from Hesiod's Works and Days, Homer's Iliad and Odyssey, the Homeric hymns, and extant fragments of the Epic Cycle.", "qtr": "Fall 2016", "name": "Homer and the Traditions of Epic", "title": "SCS CLASSICS 340-CN-64 Homer and the Traditions of Epic", "lmod": "10/30/16 6:54 PM (CT)", "section": "64", "instructors": [{"instructor_phone": "", "instructor_name": "Edith Pennoyer Livermore", "instructor_addr": ""}], "topic": "", "course": "340-CN", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "The epic corpus of ancient Greece, with its enduring and endearing songs and stories, is woven together from the colorful threads of centuries of oral tradition combined with exquisite literary art. This course will inquire into the mythic and historical origins of these stories, as well as the processes involved in their composition, transmission, and confirmation as woven texts. Readings will include selections from Hesiod's Works and Days, Homer's Iliad and Odyssey, the Homeric hymns, and extant fragments of the Epic Cycle."}, {"name": "Registration Requirements", "value": "None."}, {"name": "Teaching Method", "value": "This class will be conducted as a Colloquium: explanations and illuminations of the background and details of the Epics will be woven into a shared close reading of significant and enduring passages."}, {"name": "Evaluation Method", "value": "For each of the three works read in this course, there will be an &quot;Inventory&quot; <br/>consisting of the Identification of terms and characters studied and short explications of salient citations from the works themselves.<br/><br/>At the end of the course, there will be a scholarly paper / project of 5-6 pages on a specific topic, of the student's own choosing, related to the character and relevance of the timeless &quot;winged words&quot; of ancient epic."}, {"name": "Class Materials (Required)", "value": "Texts may include the following. Visit the campus bookstore or its website to confirm materials for the course.<br/><br/>The Iliad of Homer, Loeb Edition, Greek and English, translated by William Wyatt and A.T. Murray. Two Volumes, published by Harvard University Press, [various printings].<br/><br/>A Companion to The Iliad, by Malcolm B. Willcock. Chicago : The University of Chicago Press, 1976.<br/> <br/>The Odyssey of Homer, Loeb Edition, Greek and English, translated by A. T. Murray. Two Volumes, published by Harvard University Press, [various printings]<br/> <br/>A Companion to Homer's 'Odyssey' by James Morrison. London: Greenwood Press, 2003.<br/> <br/>Virgil's &quot;Aeneid&quot; , Loeb Edition, Latin and English, Translator H. Rushton Fairclough. Revised by G. P. Goold. Two Volumes, published by Harvard University Press [various printings].<br/> <br/>The Cambridge Companion to Virgil , edited by Charles Martindale. Cambridge University Press, 1997."}], "path": "/class-descriptions/4640/SCS/CLASSICS/340-CN/18423", "instructor": ["Edith Pennoyer Livermore"], "class_attributes": "", "id": "18423", "subject": "CLASSICS"}]