[{"class_mtg_info": [{"meet_t": "Mo 3:00PM - 5:50PM", "meet_l": "University Library 3622"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "20541", "title": "WCAS GERMAN 403-0-20 German Literature, Critical Thought and New Media 1900-1945", "class_attributes": "", "section": "20541", "instructors": [{"instructor_phone": "847/491-5788", "instructor_name": "Jorg   Kreienbrock", "instructor_addr": "Kresge Hall, Rm 3323, 1880 Campus Drive"}], "topic": "", "course": "403-0", "descriptions": [{"name": "Overview of class", "value": "Between 1911 and 1918 German Romanticism underwent a tumultuous reappraisal marked by the publications of Georg Lukacs` Soul and Form, Walter Benjamin`s The Concept of Art in German Romanticism, and Carl Schmitt`s Political Romanticism turning Romanticism into what Arthur Lovejoy in 1923 called &quot;the scandal of literary history and criticism.&quot; The challenge of early German Romanticism to traditional ideas of literature, language, and representation has not diminished since then and made it spectral reappearance in such diverse disciplines as deconstruction, psychoanalysis, and political theory. This course offers a historical-intellectual survey of German Romanticism and its reception in the 20th century. To this purpose we will read some of the most influential poetical and theoretical texts of early to late Romanticism. Authors such as Friedrich Schlegel, Novalis, and Ludwig Tieck, will be juxtaposed with the reception, translation, and transformation of their thought in literature, philosophy, and critical theory. Our readings will trace the persistence of Romantic ideas and tropes like irony, reflection, criticism, and the fantastic in critics such as Maurice Blanchot, Paul de Man, and Jean-Luc Nancy/ Philippe Lacoue-Labarthe."}, {"name": "Learning Objectives", "value": "Knowledge of European Romanticism and its reception in the 20th century."}, {"name": "Teaching Method", "value": "DiscussionLecturePresentationsReadingsSeminar"}, {"name": "Evaluation Method", "value": "Paper, final"}, {"name": "Class Materials (Required)", "value": "All materials will be made available on Canvas."}], "lmod": "12/25/16 6:59 PM (CT)", "subject": "GERMAN"}]