[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "Meets in Non-General PurposeRm"}], "school": "WCAS", "overview_of_class": "The purpose of this course is to expose students to the somewhat lost musicals and the greatest hits of music theatre in the era commonly referred to as the Golden Age of musicals. Through class discussion, lecture, listening exams, and screenings, the students will leave learning over 100 songs and the history of some of the most important musicals of the 20th century and how those musicals forever shaped the art of music theatre.", "qtr": "Spring 2016", "name": "Residence-Linked Seminar - VI (Literature and Fine Arts)", "title": "WCAS GEN_LA 280-6-26 Residence-Linked Seminar - VI (Literature and Fine Arts)", "lmod": "4/3/16 8:01 PM (CT)", "section": "26", "instructors": [{"instructor_phone": "", "instructor_name": "John M Haas", "instructor_addr": ""}], "topic": "Musical Theatre Reportoire: The Golden Age, 1940-1", "course": "280-6", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "descriptions": [{"name": "Overview of class", "value": "The purpose of this course is to expose students to the somewhat lost musicals and the greatest hits of music theatre in the era commonly referred to as the Golden Age of musicals. Through class discussion, lecture, listening exams, and screenings, the students will leave learning over 100 songs and the history of some of the most important musicals of the 20th century and how those musicals forever shaped the art of music theatre."}, {"name": "Learning Objectives", "value": "<ul><br/><li> Students will be able to identify approximately 100 songs from musicals from The Golden Age when provided the music, lyrics, or both together. This has a benefit of not only enhancing a performer's repertoire, but expanding the knowledge of musical structure for non-performers. </li><br/><li> Students will develop a working knowledge of the structure of significant musicals in The Golden Age so that they can identify common and distinctive features in plot, story themes, and cultural evolution.</li><br/><li> Students will learn about the history and writing process of the composers of these musicals, including the most important collaborations, so they can trace the influences and styles within and across musicals<br/></li><br/><ul>"}, {"name": "Evaluation Method", "value": "4 - 25 SONG LISTENING QUIZZES; 3 - 2 PAGE PERFORMANCE COMPARISON PAPERS; 1 - GROUP PRESENTATION ON A GOLDEN AGE SHOW"}], "path": "/class-descriptions/4620/WCAS/GEN_LA/280-6/37796", "instructor": ["John M Haas"], "class_attributes": "Permission of Instructor<br/><br/>", "id": "37796", "subject": "GEN_LA"}, {"class_mtg_info": [{"meet_t": "We 6:00PM - 9:00PM", "meet_l": "Meets in Non-General PurposeRm"}], "school": "WCAS", "overview_of_class": "To introduce students to the analysis of great movies through the lens of Taoism, Buddhism and Zen. In particular, assigned readings and critical viewing of film classics will illustrate how principles of these three ancient wisdom traditions can be applied to construct a unique theoretical framework for the study of great movies. This analysis will help students to understand how ethical and moral problems arise, the extent to which related decisions are a matter of choice, and the consequences that evolve from interaction of values and choices of individuals, societies and cultures.", "qtr": "Spring 2016", "name": "Residence-Linked Seminar - VI (Literature and Fine Arts)", "title": "WCAS GEN_LA 280-6-27 Residence-Linked Seminar - VI (Literature and Fine Arts)", "lmod": "4/3/16 8:01 PM (CT)", "section": "27", "instructors": [{"instructor_phone": "", "instructor_name": "William Grant Bleich", "instructor_addr": ""}], "topic": "Popcorn Buddhism: How to Watch Great Movies and At", "course": "280-6", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "descriptions": [{"name": "Overview of class", "value": "To introduce students to the analysis of great movies through the lens of Taoism, Buddhism and Zen. In particular, assigned readings and critical viewing of film classics will illustrate how principles of these three ancient wisdom traditions can be applied to construct a unique theoretical framework for the study of great movies. This analysis will help students to understand how ethical and moral problems arise, the extent to which related decisions are a matter of choice, and the consequences that evolve from interaction of values and choices of individuals, societies and cultures."}, {"name": "Learning Objectives", "value": "After taking this course, students should be able to show they can:<br/><ul><br/><li> Define the tenets of the ancient wisdom traditions of Taoism, Buddhism and Zen.</li><br/><li> Define the key elements of movie narrative: Character, Plot, Structure, Tone, Theme and Scenework. Understand and be able to communicate how the elements of narrative enter the text of a movie with specific emphasis on character and theme.</li><br/><li> Critically evaluate what makes a movie &quot;great&quot; within the context of course content. Compare and contrast these great movies with each other and with ordinary movies.</li><br/><li> Identify and analyze how the tenets of ancient wisdom traditions are expressed in the narrative of great movies. </li><br/><li> Design a theoretical practice to aid and develop a personal system of ethical decision making based on ancient wisdom traditions and great movies. </li><br/><ul>"}, {"name": "Teaching Method", "value": "The teaching method will include lecture, guided in-class discussions, reading assignments, viewing of movie clips and contemplative exercises in the wisdom traditions. Homework will include viewing and assessing streamed films made available through Canvas Library Media and posting on Canvas discussion and assignment boards. <br/><br/>Guided in-class discussion of films and course material will play a key role in teaching and evaluation. Students will work in small group panels and/or two-person teams throughout the quarter. Teams will periodically lead discussions of the assigned reading material and/or the assigned films. Active class participation in these group activities is paramount to student success and there will be written self and peer evaluation of that participation. Above all else, the classroom environment will be a supportive one and students will be encouraged to participate in a community marked by an atmosphere of collaboration."}, {"name": "Evaluation Method", "value": "Students will complete a mid-term paper with essay prompts and a final paper on an approved topic of their choice."}], "path": "/class-descriptions/4620/WCAS/GEN_LA/280-6/37797", "instructor": ["William Grant Bleich"], "class_attributes": "Permission of Instructor<br/><br/>", "id": "37797", "subject": "GEN_LA"}, {"class_mtg_info": [{"meet_t": "Th 6:00PM - 8:50PM", "meet_l": "Elder Hall 030 Seminar Room"}], "school": "WCAS", "overview_of_class": "In this course we will study and practice multiple forms of food writing, including food memoir, critical restaurant reviews, recipe essays, and analyses of family and cultural foodways. Course will also include a hands-on culinary component and will utilize the kitchen in Elder R.C. for a cooking demonstration with a chef and for students to test recipes for the recipe essay assignment.", "qtr": "Spring 2016", "name": "Residence-Linked Seminar - VI (Literature and Fine Arts)", "title": "WCAS GEN_LA 280-6-30 Residence-Linked Seminar - VI (Literature and Fine Arts)", "lmod": "4/3/16 8:01 PM (CT)", "section": "30", "instructors": [{"instructor_phone": "", "instructor_name": "Freda Love Smith", "instructor_addr": ""}], "topic": "Table to Page: The Art and Culture of Food Writing", "course": "280-6", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "descriptions": [{"name": "Overview of class", "value": "In this course we will study and practice multiple forms of food writing, including food memoir, critical restaurant reviews, recipe essays, and analyses of family and cultural foodways. Course will also include a hands-on culinary component and will utilize the kitchen in Elder R.C. for a cooking demonstration with a chef and for students to test recipes for the recipe essay assignment."}, {"name": "Learning Objectives", "value": "After taking this course, students should be able to show they can:<br/><ul><br/><li> Understand and appreciate food writing in historical, literary, social, and cultural context. </li><br/><li> Apply this understanding and appreciation to the production of multiple and varied pieces of food writing.</li><br/><li> Explore and analyze the cultural function of family foodways. </li><br/><li> Understand how the rising prestige of critical food writing contributed to major changes in American food habits.</li><br/><li> Understand the ways in which television, new media, and especially social media have transformed food writing. </li><br/><li> Analyze the recent explosion in popular food-based media.</li><br/><ul>"}, {"name": "Teaching Method", "value": "This course will be divided into four units: Family Foodways; Critical Reviews; The Recipe Essay; Food Memoir. Weekly reading assignments and bi-weekly film screenings will be assigned."}, {"name": "Evaluation Method", "value": "Each unit is organized around the production of a polished piece of writing. These four writing assignments will together comprise half the graded work for the course. Student engagement with readings and films will be assessed through a blend of short quizzes, response papers, and substantial in-class discussion."}], "path": "/class-descriptions/4620/WCAS/GEN_LA/280-6/37799", "instructor": ["Freda Love Smith"], "class_attributes": "Permission of Instructor<br/><br/>", "id": "37799", "subject": "GEN_LA"}]