[{"school": "WCAS", "overview_of_class": "Students will develop a rich understanding of African politics from the pre-colonial period to the present, and will be able to analyze and discuss contemporary African politics in light of historical forces. Specifically, students will be able to analyze and discuss: local experiences of democracy and governance; the challenges of economic development; and national as well as international policy responses. The topics will be considered in light of: varied colonial experiences; nationalist and independence movements; international political economy; and informal sources of political power.", "name": "Special Topics in International Studies", "section": "20", "location": "555 Clark 230", "topic": "Contemporary African Politics", "course": "390-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4660/WCAS/INTL_ST/390-0/36769", "instructor": ["Martha Anne Wilfahrt"], "class_attributes": "", "id": "36769", "subject": "INTL_ST"}, {"school": "WCAS", "overview_of_class": "It isn't easy being a superpower. For the past 50 years, U.S. policymakers have struggled to define America's role in an ever more complex world where threats multiply and challenges morph and endure. The period beginning with the Vietnam War traces an arc that reaches from Soviet nuclear arsenals to Islamic suicide bombers, from a fear of falling dominoes in Southeast Asia to hopes for a wave of democracy in the Middle East. And now the rise of right-wing populists in Europe, a newly activist Russia and the presidency of Donald Trump. This course uses an engaging set of examples and materials to chart one of the most intriguing stretches of international engagement in U.S. history. We will work collaboratively to understand why decisions were made, how policies were implemented and sold, and what it all may mean in the end. Assessing sources from presidential speeches and critics' rejoinders to film documentaries and media accounts, we will study goals and motivations, ends and means, in an array of case studies. As the course progresses, we will pay particular attention to the foreign policy choices of President Trump and the domestic debate about those choices.", "name": "Special Topics in International Studies", "section": "21", "location": "Fisk Hall 311", "topic": "Dilemmas of Am. Power", "course": "390-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4660/WCAS/INTL_ST/390-0/36770", "instructor": ["Peter D Slevin"], "class_attributes": "", "id": "36770", "subject": "INTL_ST"}, {"school": "WCAS", "overview_of_class": "At the moment when the number of refugees, asylum-seekers and internally displaced people worldwide has, for the first time in the post-World War II era, exceeded 50 million people, countries are closing their borders. In the United States the new Trump Administration has issued Executive Orders suspending refugee admission for four months, banning entry of Syrian refugee entirely until further notice and reducing the country's total refugee admissions for the fiscal year 2017 by more than half. Across Europe the situation for refugees is just as bleak. Through this course you will better understand the legality of these responses, the obligations of signatory states to the Refugee Convention, the role of refugee hosting states, the ways in which the humanitarian system of refugee protection contributes to global cooperation and its shortcomings. More broadly, we will consider the differences in the kinds of refugee situations we have today and learn about what it means to be a refugee.", "name": "Special Topics in International Studies", "section": "22", "location": "Technological Institute LG76", "topic": "Refugee Crises & Human Rights", "course": "390-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4660/WCAS/INTL_ST/390-0/36771", "instructor": ["Galya Benarieh Ruffer"], "class_attributes": "", "id": "36771", "subject": "INTL_ST"}, {"school": "WCAS", "overview_of_class": "Culture, Media, and Politics in Post-Revolutionary Iran<br/><br/>This course will explore the cultural policies of the Islamic Republic in Iran since 1979. We will focus on media (TV and Radio, Internet, music, cinema, cartoons, satire, video games,and the press) to analyze the dynamic of state and societal relations in today's Iran. The central questions that we will answer during this course are: Why and How has the political regime used the media to propagate its ideology, control the society, and shape the \"ideal citizen\"? To what extent has the state been successful in their efforts? How have the people used the media, especially social media, to ignore, undermine, and challenge the state authority?", "name": "Special Topics in International Studies", "section": "23", "location": "Kresge 4531 MENA Seminar Rm", "topic": "", "course": "390-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4660/WCAS/INTL_ST/390-0/36772", "instructor": ["Saeid   Golkar"], "class_attributes": "", "id": "36772", "subject": "INTL_ST"}, {"school": "WCAS", "overview_of_class": "This class explores how struggles over land and territory shape different forms of conflict and violence between, for example, squatters and state officials, different ethnic or religious communities, or rebel groups and the state. The course examines questions of land and conflict such as: What does land, property, and territory mean to different groups of people? What are the institutions that shape land access and security? How can land explain different conflict dynamics? And what policy implications emerge from a close study of land rights around issues of economic development, food security, peacebuilding, or environmental conversation? We apply these questions to different regional contexts and country-specific case studies including Kenya, China, Indonesia, Colombia, and Afghanistan. The course is interdisciplinary in its approach, drawing from political science, as well as economics and anthropology. It should appeal to students interested in peace and conflict issues, environmental politics, international development, and human rights.", "name": "Special Topics in International Studies", "section": "24", "location": "Garrett-Evangelic Seminary 107", "topic": "Land Rights&Conflict in Glbl Perspective", "course": "390-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4660/WCAS/INTL_ST/390-0/36773", "instructor": ["Kathleen Fitzpatrick Klaus"], "class_attributes": "", "id": "36773", "subject": "INTL_ST"}, {"school": "WCAS", "overview_of_class": "We are living through a period in which the speed of change exceeds the capacity of governmental institutions, and of political leaders, to manage it. The term \"fractured\" is frequently used today to refer to the splintering of societies, nations, and the \"global community\". We will examine these phenomena and the challenges posed to systems of governance.<br/><br/>This era is foreshadowed in the work of particular scholars, such as Crawford Young, The Rise of Cultural Pluralism (1993), and Robert Cooper, The Breaking of Nations (2003). In the foreword to a 2001 book, The Self-Determination of Peoples, the following prescient words can be read: \"Unrest in one part of the world can bring bombs, terror, and refugees to another, where public sentiment may lead to intervention in the conflict one way or the other; thus local conflicts are globalized.\"<br/><br/>Intense conflicts take place across several axes: ethnic nationalism, religious sectarianism vs. secularism, \"ordinary people\" vs. elites, rural and small towns vs. cities, and migrants vs citizens. Ideologies that seemed triumphant after the Cold War, such as constitutional democracy and economic liberalism, are vigorously contested. New constructions are given to once familiar concepts such as sovereignty, privilege, and populism. Election contests in Britain, the United States, and several other western democracies deepen societal divisions and enhance uncertainty.<br/><br/>Some authors have grappled with the governance dimension of these challenges. They include Francis Fukuyama in several works, Daron Acemoglu and James Robinson in Why Nations Fail? (2012) and Jonathan Tepperman, in The Fix (2016). Contributing to the sense of global disarray are persistent wars and increasing reliance on shadow forms of warfare: drones, cyber-attacks, and Special Forces. The fracturing of nations is vividly conveyed by waves of refugees fleeing violence and distress in Africa and the Middle East. So also is the \"disintegrating of Europe\", as discussed in a January 2017 essay by Timothy Garton Ash, chronicler of the post-1989 democratic transitions in Eastern Europe.<br/><br/>This course will devote special attention to the African experience. Most African countries contend with multiple lines of division: ethnic, linguistic, religious, regional, and class. How, it will be asked, have highly diverse nations maintained nationhood? How are they coping with the current fraying of the global order and economic upheavals? The experiences of Nigeria, Africa's most populous country, will be closely examined.", "name": "Special Topics in International Studies", "section": "25", "location": "Annenberg Hall G21", "topic": "Governing Fractured Nations: Africa & the Post-Imp", "course": "390-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4660/WCAS/INTL_ST/390-0/36774", "instructor": ["Richard A Joseph"], "class_attributes": "", "id": "36774", "subject": "INTL_ST"}, {"school": "WCAS", "overview_of_class": "Community-­?based research partnerships can produce innovative solutions to community challenges and create a dynamic learning experience. Such research can take on many forms, incorporating explicit action and policy goals or documenting narratives that diverge from the dominant discourse. Critically, community-­?based research partnerships give non-­?academic partners an active role in the setting the research agenda. This course will introduce you to approaches, methods, and ethical concerns related to conducting community-­?based research. <br/><br/>The course is designed for students interested in conducting community-­?based participatory research (CBPR) with either an established international development organization or a marginalized group within the U.S. We will explore issues of power, privilege, knowledge production, activism, and community engagement through the lens of research, and interrogate the protection of human subjects. Throughout the quarter, we will return to the ways power and trust shape relationships and thus influence research findings. You will also be required to reflect on your own interest in international development and CBPR. <br/><br/>As part of your coursework, you will learn how traditional research methods are adapted for work with communities, and become oriented to an asset-­?based approach. You are also required to interact with a local community to gain experience using CBPR methods and experience some of the realities and uncertainties you are likely to encounter in the field. The course will prepare you to weave community stakeholder perspectives into research design and produce actionable, accessible findings that can improve the lives of individuals and communities.", "name": "Special Topics in International Studies", "section": "26", "location": "University Hall 112", "topic": "Community-based Partnership Research in Internatio", "course": "390-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4660/WCAS/INTL_ST/390-0/36775", "instructor": ["Kimberlee Saer Guenther"], "class_attributes": "", "id": "36775", "subject": "INTL_ST"}, {"school": "WCAS", "overview_of_class": "This course explores historical formation of cities and citizens in the Middle East and the US since the 19th century by focusing on urban changes in Istanbul, Cairo and Chicago. We focus these global metropolitans to examine how urban space has reconfigured through histories of natural and man-made disasters, politics and economy. Urbanization, informality, gendered places, consumption, urban regeneration, local politics, crime and branding the city are some of the themes of our discussion. We study these themes in relation to two main questions: How do spatial changes engender new social practices and redefine cultural difference and vice versa?; How do power struggles at the intersection of local and global interests shape urban change? We try to answer these questions by drawing on readings in history, anthropology and sociology disciplines. The course will be of interest for history, sociology, anthropology, political science and urban studies majors, who are interested in learning about the politics, society and economy in Turkey and Egypt in comparison to urban trends in the US.", "name": "Special Topics in International Studies", "section": "27", "location": "Annenberg Hall 101", "topic": "Cities and Citizens in the Middle East", "course": "390-0", "meeting_time": ["Fr 12:00PM - 2:50PM"], "path": "/class-descriptions/4660/WCAS/INTL_ST/390-0/36776", "instructor": ["Ayca   Alemdaroglu"], "class_attributes": "", "id": "36776", "subject": "INTL_ST"}, {"school": "WCAS", "overview_of_class": "", "name": "Special Topics in International Studies", "section": "28", "location": "University Hall 121", "topic": "Environment, Politics, and Society", "course": "390-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4660/WCAS/INTL_ST/390-0/38028", "instructor": ["Maria   Akchurin"], "class_attributes": "", "id": "38028", "subject": "INTL_ST"}]