[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:50PM", "meet_l": "Helmerich Auditorium"}], "school": "SoC", "overview_of_class": "This class explores contemporary film adapted from literature and popular fiction, primarily from African American literary sources, but also including examples of mainstream literature adapted as film targeted towards African American audiences. Students will examine and analyze the problems and possibilities of literary to film adaptation in the light of the historical politics of visibility, identity, audience, and representation that surround the Black presence in American film. Students will also consider the intertextual connections between the traditions of African American literature and film, in terms of content, themes, and style. The course may include such diverse films and texts as Beloved (1987 novel, Toni Morrison; 1998 film, Jonathan Demme), The Color Purple (1982 novel, Alice Walker; 1985 film, Steven Spielberg), The Wiz (1900 novel - The Wonderful Wizard of Oz by L. Frank Baum, 1978 film, Sidney Lumet), Malcolm X (1965 autobiography by Malcolm X and Alex Haley, 1992 film  by Spike Lee) and Devil in a Blue Dress (1990 novel, Walter Mosley, 1995 film, Carl Franklin).The class will also explore the impact of race on the industry trend of adapting non fiction \"self-help\" books directed primarily at women, through reading and watching the recent best-seller/box-office hit Think Like A Man (2009 book, Steve Harvey; 2012 film, Tim Story).<br/><br/>In addition to relevant source materials, course readings may include:<br/>Robert Stam, Literature and Film: A Guide to the Theory and Practice of Film Adaptation<br/>Barbara Lupack, Literary Adaptations in Black American Cinema: From Micheaux to Morrison", "qtr": "Winter 2016", "name": "Symposium: Issues in RTVF", "title": "SoC RTVF 398-0-20 Symposium: Issues in RTVF", "lmod": "1/9/16 6:39 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Miriam Joanna Petty", "instructor_addr": ""}], "topic": "Adaptation", "course": "398-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "This class explores contemporary film adapted from literature and popular fiction, primarily from African American literary sources, but also including examples of mainstream literature adapted as film targeted towards African American audiences. Students will examine and analyze the problems and possibilities of literary to film adaptation in the light of the historical politics of visibility, identity, audience, and representation that surround the Black presence in American film. Students will also consider the intertextual connections between the traditions of African American literature and film, in terms of content, themes, and style. The course may include such diverse films and texts as Beloved (1987 novel, Toni Morrison; 1998 film, Jonathan Demme), The Color Purple (1982 novel, Alice Walker; 1985 film, Steven Spielberg), The Wiz (1900 novel - The Wonderful Wizard of Oz by L. Frank Baum, 1978 film, Sidney Lumet), Malcolm X (1965 autobiography by Malcolm X and Alex Haley, 1992 film by Spike Lee) and Devil in a Blue Dress (1990 novel, Walter Mosley, 1995 film, Carl Franklin).The class will also explore the impact of race on the industry trend of adapting non fiction &quot;self-help&quot; books directed primarily at women, through reading and watching the recent best-seller/box-office hit Think Like A Man (2009 book, Steve Harvey; 2012 film, Tim Story).<br/><br/>In addition to relevant source materials, course readings may include:<br/>Robert Stam, Literature and Film: A Guide to the Theory and Practice of Film Adaptation<br/>Barbara Lupack, Literary Adaptations in Black American Cinema: From Micheaux to Morrison"}], "path": "/class-descriptions/4610/SoC/RTVF/398-0/22302", "instructor": ["Miriam Joanna Petty"], "class_attributes": "", "id": "22302", "subject": "RTVF"}, {"class_mtg_info": [{"meet_t": "TuTh 10:00AM - 11:20AM", "meet_l": "Locy Hall 109"}], "school": "SoC", "overview_of_class": "This class explores the meaning making potential of printed and digital comics. Participants will refine their understanding about the conventions and storytelling methods of the comics medium. We will read one graphic novel every week and discuss these texts under the light of additional readings such as representation of race and gender in comics, language and grammar of comics, representation of disability, affordances and conventions of the comics medium, impact of digital media on comics and humor, films remediating comics, comics remediating film. Participants who complete this course will learn to apply meaning making strategies of comics to other mediums such as film, interactive narrative, and computer games. Even though this is a theory-rhetoric-criticism course there will be a few hands on experimentations to stimulate the ideas for a lively discussion. No drawing skills are required. Students will make the readings, participate in class activities, participate discussions, make a group presentation, write compelling questions about theory readings, and will write a 5 pages paper.?", "qtr": "Winter 2016", "name": "Symposium: Issues in RTVF", "title": "SoC RTVF 398-0-21 Symposium: Issues in RTVF", "lmod": "1/9/16 6:39 PM (CT)", "section": "21", "instructors": [{"instructor_phone": "847/467-0483", "instructor_name": "Ozge   Samanci", "instructor_addr": "Louis Hall 221"}], "topic": "Graphic Novels", "course": "398-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "This class explores the meaning making potential of printed and digital comics. Participants will refine their understanding about the conventions and storytelling methods of the comics medium. We will read one graphic novel every week and discuss these texts under the light of additional readings such as representation of race and gender in comics, language and grammar of comics, representation of disability, affordances and conventions of the comics medium, impact of digital media on comics and humor, films remediating comics, comics remediating film. Participants who complete this course will learn to apply meaning making strategies of comics to other mediums such as film, interactive narrative, and computer games. Even though this is a theory-rhetoric-criticism course there will be a few hands on experimentations to stimulate the ideas for a lively discussion. No drawing skills are required. Students will make the readings, participate in class activities, participate discussions, make a group presentation, write compelling questions about theory readings, and will write a 5 pages paper.?"}], "path": "/class-descriptions/4610/SoC/RTVF/398-0/22303", "instructor": ["Ozge   Samanci"], "class_attributes": "", "id": "22303", "subject": "RTVF"}, {"class_mtg_info": [{"meet_t": "We 12:00PM - 2:50PM", "meet_l": "Louis Hall 106"}], "school": "SoC", "overview_of_class": "This is a performance class. In this class, students will learn the skills improvisers use to success in the film and television industry with a focus on character. The goal of the class is to gain a deeper understanding of how characters are revealed on stage and screen and how other characters move in relationship with them to build story. In the second part of the class we will attempt to improvise the hero's journey. The class will attend an improv performance in Chicago.", "qtr": "Winter 2016", "name": "Symposium: Issues in RTVF", "title": "SoC RTVF 398-0-22 Symposium: Issues in RTVF", "lmod": "1/9/16 6:39 PM (CT)", "section": "22", "instructors": [{"instructor_phone": "", "instructor_name": "Denise E Ryan", "instructor_addr": ""}], "topic": "Improvising Characters", "course": "398-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "This is a performance class. In this class, students will learn the skills improvisers use to success in the film and television industry with a focus on character. The goal of the class is to gain a deeper understanding of how characters are revealed on stage and screen and how other characters move in relationship with them to build story. In the second part of the class we will attempt to improvise the hero's journey. The class will attend an improv performance in Chicago."}, {"name": "Evaluation Method", "value": "Students will be graded on participation, collaboration and understanding of concepts learned, as well as tests on reading materials, a midterm, homework and an improvised long-form final. Students are required to see an improv show."}, {"name": "Class Materials (Required)", "value": "Truth in Comedy: Manual of Improvisation by Charna Halpern, Del Close and Kim Johnson, Meriwether Publishing Ltd., Colorado Springs, CO; copyright 1994.<br/> <br/>Save the Cat by Blake Snyder, Michael Wiese Productions, Studio City, CA; copyright 2005.<br/> <br/>Access to NU Canvas<br/> <br/>Scriptwriting software"}], "path": "/class-descriptions/4610/SoC/RTVF/398-0/22304", "instructor": ["Denise E Ryan"], "class_attributes": "", "id": "22304", "subject": "RTVF"}]