[{"class_mtg_info": [{"meet_t": "We 6:15PM - 9:15PM", "meet_l": "Parkes Hall 212"}], "school": "SCS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "37917", "title": "SCS POLI_SCI 390-CN-65 Special Topics", "class_attributes": "", "section": "37917", "instructors": [{"instructor_phone": "847 491 2595", "instructor_name": "Richard A Joseph", "instructor_addr": "218 Chambers Hall"}], "topic": "Growth, Democracy in Africa", "course": "390-CN", "descriptions": [{"name": "Overview of class", "value": "Growth, Democracy and Security: Africa in the Obama Era <br/><br/>&quot;After 1989, many authoritarian systems across the world collapsed while the fortunes of liberal democracy rose. In Africa, democratization received a boost from renewed economic growth. Free-market economies seemed a natural fit with liberalized political systems. Yet many autocratic regimes discovered they could open their economies to market forces while preventing the emergence of fully competitive political systems. The terrorist bombing of the U.S. embassies in Kenya and Tanzania in August 1998, followed by the attacks on the World Trade Center and the Pentagon in September 2001, added a complicating dimension: Stability and security, priorities of the Cold War era, returned to prominence in Africa and elsewhere.&quot;- R. Joseph, &quot;Growth, Security, and Democracy in Africa,&quot; Journal of Democracy (October 2014). <br/><br/>This course will include the core concerns of this article: &quot;Development without Democracy,&quot; &quot;New and Old Authoritarianism,&quot; &quot;Democracy Promotion and Security Dilemmas,&quot; and &quot;The Nigerian Experience.&quot; Other topics will be President Obama's Foreign Policy Vision and Impact, and the South African Experience. Students will read analyses of African and global developments, and guest lecturers will report on ongoing research connected to the topics. Students will be able to explore relevant issues and country experiences of interest to them. Real-world developments in Africa will be taken up in class sessions and connect to ongoing collaborative initiatives.<br/><br/>The instructor has just returned from delivering a major address in Nigeria on the topic. Read more at: http://www.tribuneonlineng.com/nigeria-must-increase-its-capacity-to-meet-domestic-regional-global-challenges-prof-richardjoseph."}, {"name": "Registration Requirements", "value": "None."}, {"name": "Learning Objectives", "value": "Students will acquire an increased understanding of core issues of economic growth, collective security, and democratization in Africa. They will follow ongoing developments and relate academic discourses to real-time policy analysis. The study of the Nigerian experience will enable students to understand key challenges in Africa's most populous country and largest economy. In their essays and term paper, they will pursue greater knowledge about the course topics and African countries of particular interest to them."}, {"name": "Teaching Method", "value": "Seminar-style teaching<br/>Short lectures<br/>Student reports on reading assignments<br/>Visiting Lecturers<br/>Short essays and a term paper<br/>Class dinner"}, {"name": "Evaluation Method", "value": "Attendance and class participation; student presentations; essays and final paper."}, {"name": "Class Materials (Required)", "value": "A course packet of published articles will be made available for purchase at Quartet Copies, 825 Clark St, Evanston."}, {"name": "Class Notes", "value": "The course will connect students with a new program initiative, &quot;State and Democratic Development in Africa.&quot; They can attend a colloquium on this subject on May 9 at the Buffett Institute on Global Affairs. There will be opportunities to participate in postings on the AfricaPlus website and the planning of a Forum on Governance and Democratic Development. A class dinner will be held in the instructor's nearby home."}], "lmod": "4/3/16 7:35 PM (CT)", "subject": "POLI_SCI"}]