[{"class_mtg_info": [{"meet_t": "Tu 6:15PM - 9:15PM", "meet_l": "Wieboldt Hall 417"}], "school": "SCS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "18477", "title": "SCS BIOL_SCI 312-CN-16 The Evolutionary Biology of Human Anatomy, Heath and Disease", "class_attributes": "", "section": "18477", "instructors": [{"instructor_phone": "", "instructor_name": "Brian T Shea", "instructor_addr": ""}], "topic": "", "course": "312-CN", "descriptions": [{"name": "Overview of class", "value": "This course utilizes an evolutionary perspective to understand key features of human anatomy, health and disease. Coverage will include review of some basic evolutionary processes, a brief overview of human evolutionary history, followed by a consideration of the primary body systems and regions in the human organism. Our focus will be on the historical context of selected human structures and their function/dysfunction across these systems. Some specific topics covered include: evolutionary compromises and plasticity in musculoskeletal structures; complex structures and birth defects (pharyngeal arches, etc.); human developmental genetics, environmental plasticity, and epigenetics in relation to health and disease; theories of &quot;mismatch&quot; between modern lifestyles and our evolved features (related to metabolism; allergy, the microbiome, cancer, etc.); population growth and zoonoses; and human life history and aging in evolutionary perspective. This course is suitable for students interested in human evolutionary biology and health, and those planning careers in the health sciences."}, {"name": "Registration Requirements", "value": "Introductory biology course background is helpful (e.g., BIOLSCI 215-219 or BIOLSCI 313). However, students will bring varied backgrounds and interests to the course, so contact the Instructor regarding permission if there are any questions."}, {"name": "Learning Objectives", "value": "Students will learn to distinguish proximate and ultimate biological explanations, and to apply these to basic questions regarding human structure, function, dysfunction and disease. They will also gain an understanding of the various regions and systems of the human body in terms of both ancient (vertebrate, mammal) and more recent (primate, human) features. Application of norm-of-reaction and epigenetic frameworks to our features will enhance students' understanding of multiple biological and environmental influences on human health and disease."}, {"name": "Teaching Method", "value": "Lecture; Readings; Problem sets; Group work; Discussion; Presentations; Research project"}, {"name": "Evaluation Method", "value": "homework, 20%; take-home midterm, 25%; essay/project, 25%; in-class final, 30%."}, {"name": "Class Materials (Required)", "value": "Lieberman, D.E. (2013) The Story of the Human Body - Evolution, Health and Disease. Pantheon, New York. Additional short readings and excerpts will be assigned most weeks, sometimes as a portion of the homework assignments. These are TBA (to be announced)."}], "lmod": "10/30/16 6:53 PM (CT)", "subject": "BIOL_SCI"}]