[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "2315 Campus Dr Clinic 1620"}], "school": "SoC", "overview_of_class": "Basic audiometric and immittance techniques; interpretation of test results. Introduction to amplification systems.", "qtr": "Fall 2017", "name": "Evaluation of the Peripheral Hearing Mechanism", "title": "SoC CSD 423-0-20 Evaluation of the Peripheral Hearing Mechanism", "lmod": "5/14/17 6:41 PM (CT)", "section": "20", "associated_classes": [{"component": "LAB", "room": "TBA", "meeting_time": "TBA"}], "topic": "", "course": "423-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Basic audiometric and immittance techniques; interpretation of test results. Introduction to amplification systems."}, {"name": "Learning Objectives", "value": "Objectives - The objectives of the course are twofold. The first part of the course will provide you with the theoretical background of hearing evaluation and the basic tests vital to the process. The second part will highlight the practical aspects of the process of hearing evaluation and familiarize you with test administration, interpretation, and diagnosis.<br/>The majority of the course will be taught in the traditional lecture format. However, you are encouraged to ask questions and make comments. Some group discussion activities are built into the course format.<br/>Please see attached list of KASA standards partially or fully satisfied by this course.<br/>The course is taught in conjunction with a laboratory section. Every student enrolled in this class is expected to attend the lab meetings. The administrative aspects of several tests will be taught during the lab-sessions. You are responsible for that material for tests and quizzes in this class."}, {"name": "Teaching Method", "value": "Lecture and laboratory."}, {"name": "Class Materials (Required)", "value": "Handbook of Clinical Audiology, by Jack Katz, ISBN:9781451191639. Price= $87.99"}], "instructor": ["Sumitrajit   Dhar"], "class_attributes": "", "id": "10919", "subject": "CSD"}]