[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "Allison Residential Comm 1021"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Winter 2017", "name": "22853", "title": "WCAS POLI_SCI 101-6-25 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "22853", "instructors": [{"instructor_phone": "847/491-8985", "instructor_name": "Kimberly Ruggles Marion Suiseeya", "instructor_addr": ""}], "topic": "Global Environmental Politics", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "&quot;Global Environmental Politics&quot; Prof. Kimberly R. Marion Suiseeya 101-6-25 Winter 2017<br/>Environmental problems like deforestation, biodiversity loss, climate change, and ocean and marine resource degradation have emerged as some of the most intractable problems that society faces. They transcend international borders, are scientifically complex, and generally involve large sets of diverse actors and power dynamics from global to local scales. In this seminar we will examine how policies, actions, and behaviors impact the environment and how these politics of the environment play out on a global scale."}, {"name": "Learning Objectives", "value": "By the end of this course students will be able to: <br/>- Identify and define the basic nature of various global environmental challenges<br/>- Compare and assess various environmental policy approaches<br/>- Describe general and specific challenges that make it difficult to address global environmental problems<br/>- Develop research and writing skills in order to communicate research findings to diverse audiences"}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Discussion, papers, presentations"}, {"name": "Class Materials (Required)", "value": "(1) Simon Nicholsen and Paul Wapner, Routledge, 2014, Global Environmental Politics: From Person to Planet by , ISBN-13: 978-1612056494<br/>(2) Peter Dauvergne and Jane Lister, Polity, Timber, 2011, ISBN-13: 978-0745649283"}], "lmod": "12/24/16 7:06 PM (CT)", "subject": "POLI_SCI"}]