[{"class_mtg_info": [{"meet_t": "MoWe 12:30PM - 1:50PM", "meet_l": "Kresge 4354 Art Hist. Sem. Rm."}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Spring 2017", "name": "37395", "title": "WCAS HUM 310-6-22 Global Humanities Lab", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "37395", "instructors": [{"instructor_phone": "", "instructor_name": "Christina Hilleboe Kiaer", "instructor_addr": ""}], "topic": "", "course": "310-6", "descriptions": [{"name": "Overview of class", "value": "The most famous artist of the twentieth century, Picasso is synonymous with the idea of modern art. Examining Picasso's work from his early scenes of bohemian Paris to his invention of cubism, his association with the surrealists, his famous protest mural Guernica of 1937, and his later political mural projects, we will ask: What is it that makes Picasso such a powerful sign of the modern, continuously venerated in museums, scholarship and popular culture? We will examine both his endlessly inventive formal experimentation?flirting with, but never fully embracing, abstraction?and the continuing resonance, in spite of well-deserved feminist and postcolonial critiques, of his images of intimacy, interiority, and sexuality, as well as terror and atavistic violence. <strong>Enrollment in this course is by application only. The application deadline is Tuesday, February 7, 2017 at 12 noon.</strong> <br/><br/>This course meets for the duration of the spring quarter, and includes a mandatory class trip to Madrid, Spain over the Memorial Day weekend to see the special exhibition &quot;Pity and Terror in Picasso: The Path to Guernica&quot; at the Reina Sofia Museum. The dates of the trip will be May 25-30, 2017, departing on the afternoon/evening of Thursday, May 25, and returning the following Tuesday, May 30 (which is during Weinberg College Reading Week).<br/><br/>Full details available at the Kaplan Humanities Institute website: <strong>humanities.northwestern.edu/undergraduate/global-humanities-lab</strong>"}, {"name": "Evaluation Method", "value": "Participation in class discussion, including presentation of readings and group work; regular written responses to assigned readings; an early short writing assignment (2-3 pp) and a final research paper related to the class trip to Madrid (8-10 pp)."}, {"name": "Class Materials (Required)", "value": "John Berger, <em>The Success and Failure of Picasso</em> (Vintage), ISBN 0679737251."}, {"name": "Class Notes", "value": "The deadline to apply is <strong>Tuesday, February 7, 2017 at 12 noon.</strong> We will aim to inform applicants of the decision by February 11, in advance of pre-registration for spring quarter."}], "lmod": "2/6/17 6:49 PM (CT)", "subject": "HUM"}]