[{"class_mtg_info": [{"meet_t": "MoWe 11:00AM - 12:20PM", "meet_l": "555 Clark B03"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "10625", "title": "WCAS ASIAN_AM 210-0-1 Introduction to Asian American Studies", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "10625", "instructors": [{"instructor_phone": "847/467-7114", "instructor_name": "Douglas Sadao Ishii", "instructor_addr": "Crowe Hall, Room 1117"}], "topic": "", "course": "210-0", "descriptions": [{"name": "Overview of class", "value": "Asian American Studies, as a part of Ethnic Studies, emerged from the interracial social movements and global solidarities of the 1960s and 1970s, and sought to value the histories, experiences, communities, and people who had been excluded from classrooms and curriculum. In this course, we will focus on the experiences of Asian and Asian American people from the 19th to the 21st centuries through an interdisciplinary lens. Our week-to-week explorations will ask key questions that characterize Asian American scholarship and activism, paying attention to intersections of identity and difference, as well as interracial and intraracial conflict and cooperation. What can we learn about race, rights, national metanarrative, agency, imperialism, capital, and diversity by centralizing Asian Americans?"}, {"name": "Registration Requirements", "value": "None."}, {"name": "Learning Objectives", "value": "- To develop a broad understanding of Asian American experiences from the 19th to the 21st centuries, as well as how they shape issues of identity, difference, and inequality in the U.S. today<br/>- To understand how and why scholars in Asian American Studies have used interdisciplinary methodologies to answer questions facing Asian American communities<br/>- To interrogate U.S. culture and social life in terms of the co-construction of race, class, gender, sexuality, and citizenship, as well as the influence of ethnicity, religion, and region<br/>- To practice college-level reading, writing, and presentation skills"}, {"name": "Teaching Method", "value": "Class participationGroup workLectureReadingsWriting assignments"}, {"name": "Evaluation Method", "value": "Class participation: 10%<br/>Exam, final: 20%<br/>Group project: 20%<br/>Presentations: 20%<br/>Quizzes: 30%<br/>"}, {"name": "Class Materials (Required)", "value": "Required: internet access for online at-home quizzes, and course readings outside the required text<br/><br/>Wu, Jean Yu-Wen Shen and Thomas Chen, eds. Asian American Studies Now: A Critical Reader (Rutgers University Press, 2010). ISBN: 978-0-8135-4575-2 <br/>NB: Please make sure you have this edition of the text, which has a yellow cover with blue accents"}], "lmod": "10/30/16 6:58 PM (CT)", "subject": "ASIAN_AM"}]