[{"class_mtg_info": [{"meet_t": "Tu 2:00PM - 4:50PM", "meet_l": "RCMA 1-180"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Spring 2016", "name": "38242", "title": "WCAS GERMAN 402-0-1 History of Literature and Critical Thought 1832-1900", "class_attributes": "", "section": "38242", "instructors": [{"instructor_phone": "847/467-2033", "instructor_name": "Jesse   Rosenberg", "instructor_addr": "j-rosenberg1@northwestern.edu"}], "topic": "", "course": "402-0", "descriptions": [{"name": "Overview of class", "value": "This graduate seminar will offer an in-depth look at the music, theories, and general cultural significance of Richard Wagner. Running concurrently alongside a survey of his ten principal works for the stage (from Der Fliegende Holländer through Parsifal) will be a consideration of selected critical essays by Wagner, as well as an examination of his relation to the intellectual and musical trends of his time as exemplified in the writings of Schopenhauer, Nietzsche, and others. Among the specific issues to be taken up are Wagner`s program of operatic &quot;reform,&quot; the role of the Leitmotive in the construction of Wagner's scores, Wagner`s anti-Semitism and the question of its possible influence on his operas, the Bayreuth Festspiel as a cultural phenomenon, mythological sources behind many of Wagner`s works, the many controversies regarding the staging of his operas since the second world war, and a selection of the varied methods which have been applied to the interpretation of his works (Marxist, Jungian, feminist, etc.)."}, {"name": "Evaluation Method", "value": "Grades will be based on <br/>1) two presentations to the class on a topic to be assigned by the instructor (20% each)<br/>2) regular contributions to class discussion informed by thorough assimilation of assigned readings, viewings, and listening (20%)<br/>3) and the submission of a final research paper approximately 15 pages in length (40%)."}], "lmod": "4/3/16 8:02 PM (CT)", "subject": "GERMAN"}]