[{"class_mtg_info": [{"meet_t": "Tu 2:00PM - 4:50PM", "meet_l": "Kresge 4354 Art Hist. Sem. Rm."}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Spring 2017", "name": "32454", "title": "WCAS ART_HIST 460-0-1 Studies in 20Th Century Art", "class_attributes": "", "section": "32454", "instructors": [{"instructor_phone": "", "instructor_name": "Christina Hilleboe Kiaer", "instructor_addr": ""}], "topic": "The Russian Avant-Garde", "course": "460-0", "descriptions": [{"name": "Overview of class", "value": "The Russian avant-garde has long been regarded as the most radical of the twentieth-century avant-gardes, because its &quot;art into life&quot; ambitions were developed and partially realized in a revolutionary context where all aspects of life, including relations of labor, gender, sexuality and ethnicity were subject to transformation. In the year of the 100th anniversary of the Bolshevik Revolution of 1917, this seminar will re-examine the Russian avant-garde art movements that anticipated, articulated, invented and protested some of the transformative ideas of the revolution, for better or for worse. How has the Russian revolutionary avant-garde put pressure on the very concept of the avant-garde? How has scholarship on, and the exhibition of, the Russian avant-garde evolved, with the fall of the Soviet Union and the rise of Putin's Russia? We will concentrate on Suprematism and Constructivism, as they developed before 1917 and evolved through the 1920s, often in relation to other forms of cultural production such as film, literature, theater and mass communication. All required texts will be in English; students from other disciplines are welcome."}, {"name": "Teaching Method", "value": "DiscussionReadings"}, {"name": "Evaluation Method", "value": "Class participationPresentationsProject, finalWriting assignmentsParticipation in class discussion, including presentation of readings and leadership of class discussion; regular written responses to assigned readings; final research project (ca. 12-15 pp)."}], "lmod": "2/21/17 6:44 PM (CT)", "subject": "ART_HIST"}]