[{"class_mtg_info": [{"meet_t": "We 5:30PM - 8:30PM", "meet_l": "Frances Searle Building 1483"}], "school": "SoC", "enrl_requirement": "", "qtr": "Winter 2017", "name": "25914", "title": "SoC CSD 339-0-1 Early Communication Intervention With Infants and Toddlers", "class_attributes": "", "section": "25914", "instructors": [{"instructor_phone": "", "instructor_name": "Megan York Roberts", "instructor_addr": ""}], "topic": "", "course": "339-0", "descriptions": [{"name": "Overview of class", "value": "Models of service systems, current practices in early intervention, legislation, infant development processes, and risk factors. Emphasis on individual family service planning, assessment, and intervention.<br/><br/>Course Description: This course will address the following areas concerned with early intervention of developmentally delayed/disabled or at risk infants and toddlers and their families: historical overview of the field and pertinent legislation, normal development in infants and toddlers, risk factors and potential outcomes, family roles, reactions and participation in the delivery of service, models of early intervention services, intervention teams and roles and responsibilities of the team members, specialized techniques for assessment and early intervention, and efficacy of service."}, {"name": "Registration Requirements", "value": "Course Requirements: Attendance is mandatory in any graduate level course. Grades are based on completion of live observations, participation in class discussions, short class presentation, midterm examination, brief homework assignments and a final examination. Late assignments will not be accepted, and will receive a grade of &quot;0&quot;. Late assignments consist of anything not turned in to the instructor in person, via a fellow student, via mail, via e-mail or under my door after the end of class the day it was due (M 4, F 4)."}, {"name": "Teaching Method", "value": "Method of Instruction: Class will involve lecture, discussions, required reading, video demonstration, live observation and small group projects. Students are responsible for participation in class activities to facilitate your learning,"}, {"name": "Class Materials (Required)", "value": "Readings for the class are listed on Canvas."}], "lmod": "12/25/16 6:46 PM (CT)", "subject": "CSD"}]