[{"class_mtg_info": [{"meet_t": "MoWe 12:30PM - 1:50PM", "meet_l": "Kresge 4354 Art Hist. Sem. Rm."}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "32436", "title": "WCAS ART_HIST 390-0-2 Undergraduate Seminar", "class_attributes": "", "section": "32436", "instructors": [{"instructor_phone": "", "instructor_name": "Christina Hilleboe Kiaer", "instructor_addr": ""}], "topic": "Picasso", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "The most famous artist of the twentieth century, Picasso is synonymous with the idea of modern art. Examining his work from his early scenes of bohemian Paris to his invention of cubism, his association with the surrealists, his famous protest mural Guernica of 1937, and his later political mural projects, we will ask: What is it that makes Picasso such a powerful sign of the modern, continuously venerated in museums, scholarship and popular culture? The seminar will examine both his endlessly inventive formal experimentation?flirting with, but never fully embracing, abstraction?and the continuing resonance, in spite of feminist and postcolonial critiques, of his images of intimacy, interiority, and sexuality, as well as terror and atavistic violence.<br/> <br/>This seminar will include a mandatory class trip to Madrid, Spain over the Memorial Day weekend to see the special exhibition &quot;Pity and Terror in Picasso: The Path to Guernica&quot; at the Reina Sofia Museum. The dates of the trip will be May 26-30. Please check your calendar to be sure that you are available to travel with us over the Memorial Day weekend before applying to the seminar. <br/><br/>International airfare and hotel will be covered. Students will be responsible for their own airport transportation, meals, any necessary passport or visa services, and other incidentals. All are welcome to apply for the seminar regardless of financial means. More information about the application process and/or financial aid can be found at http://www.humanities.northwestern.edu/undergraduate/global-humanities-lab.html."}, {"name": "Teaching Method", "value": "DiscussionField tripsSeminar"}, {"name": "Evaluation Method", "value": "Class participationPaper, finalPresentationsWriting assignments"}, {"name": "Class Materials (Required)", "value": "John Berger, The Success and Failure of Picasso , ISBN 0679737251"}], "lmod": "2/6/17 6:40 PM (CT)", "subject": "ART_HIST"}]