[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "555 Clark 230"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-registration - Reserved for Political Science students.", "qtr": "Spring 2017", "name": "35530", "title": "WCAS POLI_SCI 360-0-20 Contemporary African Politics", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "35530", "instructors": [{"instructor_phone": "", "instructor_name": "Martha Anne Wilfahrt", "instructor_addr": ""}], "topic": "", "course": "360-0", "descriptions": [{"name": "Overview of class", "value": "Students will develop a rich understanding of African politics from the pre-colonial period to the present, and will be able to analyze and discuss contemporary African politics in light of historical forces. Specifically, students will be able to analyze and discuss: local experiences of democracy and governance; the challenges of economic development; and national as well as international policy responses. The topics will be considered in light of: varied colonial experiences; nationalist and independence movements; international political economy; and informal sources of political power."}, {"name": "Registration Requirements", "value": "Attendance at first class required"}, {"name": "Learning Objectives", "value": "At the end of the quarter, students should have a strong empirical grasp on the continent's diversity of political experiences and be able to articulate prominent theoretical explanations to explain these trajectories. Students should leave the course able to apply a series of theories and frameworks to explain contemporary political issues in African politics."}, {"name": "Teaching Method", "value": "Lecture/Seminar mix"}, {"name": "Evaluation Method", "value": "In-class quizzes, midterm, take-home final, in-class presentation"}, {"name": "Class Materials (Required)", "value": "Course Reader<br/>van de Walle, Nic. 2001. African Economies and the Politics of Permanent Crisis, 1979-99. New York: Cambridge University Press."}], "lmod": "2/14/17 6:48 PM (CT)", "subject": "POLI_SCI"}]