[{"school": "WCAS", "overview_of_class": "Students will develop a rich understanding of African politics from the pre-colonial period to the present, and will be able to analyze and discuss contemporary African politics in light of historical forces. Specifically, students will be able to analyze and discuss: local experiences of democracy and governance; the challenges of economic development; and national as well as international policy responses. The topics will be considered in light of: varied colonial experiences; nationalist and independence movements; international political economy; and informal sources of political power.", "name": "Topics in African Studies", "section": "20", "topic": "Contemporary African Politics", "course": "390-0", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4620/WCAS/AFST/390-0/30865", "instructor": ["Martha Anne Wilfahrt"], "id": "30865", "subject": "AFST"}, {"school": "WCAS", "overview_of_class": "AFST 390-0-21 &quot;Global Democracy and World Disorder: Challenges in Africa and Beyond&quot;, Richard Joseph, Spring 2016 (combined with POLI_SCI 390-0-20, INTL_ST 390-0-24)<br/><br/> <br/>This course will explore the evolution from the &quot;democratic euphoria&quot; of the early 1990s, to the sober analyses of democratization later in that same decade, to the current theoretical and empirical challenges. The experiences of specific countries in a few world regions will be examined closely.<br/><br/>After the Cold War, the number of democracies in the world increased significantly. In recent years, however, that number has stagnated and even, by some accounts, declined. The global system today is characterized by growing insecurity and uncertainty. The aim of this course is to achieve a deeper understanding of these dynamics and their implications.<br/><br/>The expansion of liberal democracies and liberalized economies was adversely affected by the 9/11 Al Qaeda attack on the World Trade Center and the prolonged wars that followed in Iraq, Afghanistan, and Syria. The relentless upsurge in jihadist insurgencies has steadily shifted global priorities to the strengthening of security and political order. <br/><br/>The rise of China and the resurgence of authoritarianism in Russia have contributed to the complexities and uncertainties. So also have the erosion of state systems, forced migrations,and the upsurge in ethnic nationalism and religious sectarianism. The failures of the Arab Spring, and the fracturing of Iraq, Syria, and Libya have had wide ramifications.<br/><br/>Is liberal democracy being eclipsed by new forms of authoritarianism, or is it proving resilient and adaptive? Where are these trends and others evident? Writing in the Journal of Democracy about the &quot;renewed struggle between democracy and authoritarianism worldwide&quot;, Christopher Walker recently wrote: [Authoritarian] regimes show solidarity and coordination with one another, at least when it comes to contesting and containing democracy and the ideas central to it. Through this more internationalist approach and authoritarian learning, China, Russia, Iran, and other illiberal regimes have developed instruments to counter the democratic West's soft power.&quot; For these developments in Africa, see an essay by this course instructor: http://www.brookings.edu/research/opinions/2016/01/07-democracy-state-power-africa-joseph.", "name": "Topics in African Studies", "section": "21", "topic": "Global Democracy and World Disorder", "course": "390-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4620/WCAS/AFST/390-0/30866", "instructor": ["Richard A Joseph"], "id": "30866", "subject": "AFST"}, {"school": "WCAS", "overview_of_class": "AFST 390-0-22 &quot;The Politics of International Aid&quot;, Martha Wilfahrt (combined with POLI_SCI 390-0-27, INTL_ST 390-0-20)<br/> <br/><br/> Over the last fifty years, billions of dollars have been given to developing countries, yet critics argue that international aid is ineffectual and, worse yet, harmful to recipients. In this course, we will examine the politics surrounding the delivery of international aid, debating questions such as who gets to decides the aid agenda, which countries should receive what aid and, once delivered, how impact changes political dynamics in recipient communities. The substantive content of this course will expose students to current trends and debates in the world of international aid, highlighting how politics pervades even the most ?technical' of aid interventions.<br/><br/>The course blends traditional seminar-style discussions with the Harvard Business School case method. This teaching method asks students to collectively make a decision in a real-world case involving international aid. The case method highlights to students the complexities (including the many ethical dimensions) of aid work, encouraging students to develop their ability to articulate clear, persuasive arguments and engage in complex negotiations with their classmates in the process.", "name": "Topics in African Studies", "section": "22", "topic": "Division of the World", "course": "390-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4620/WCAS/AFST/390-0/34056", "instructor": ["Martha Anne Wilfahrt"], "id": "34056", "subject": "AFST"}, {"school": "WCAS", "overview_of_class": "AFST 390-0-24, &quot;Land Rights and Conflict in a Global Perspective&quot;, Prof. Kathleen Klaus, Spring 2016 (Combined with Poli_Sci 390-0-24, INTL ST 390-0-23) <br/><br/>For much of the world's population, land sustains livelihoods, shapes identities, and provides a source of investment and security. Yet the centrality of land in everyday life also means that it can become a source of contentious politics and violence. This class explores how struggles over access and rights to land shape different forms of conflict and violence: between squatters and state officials, different ethnic groups, or armed groups and the state. The course explores questions of land and conflict in several parts. We begin by examining the question of land meanings: what does land, property, and territory mean to different groups of people? How does this help us understand why people organize or fight around issues of land? Second, the course takes an historical and comparative view of the rules and institutions that shape people's rights and access to land. The third part of the class explores theories that link land to conflict and violence. We then apply these theories to explore a set of case studies of land-related conflict: from the recent armed uprising in Oregon to civil war in Colombia. The last part of the class moves toward policy considerations. How, for example, can a focus on land rights improve post-conflict resolution? The course is interdisciplinary in its approach, drawing heavily on political science and political geography. It should appeal to students interested in peace and conflict issues, environmental politics, international development, and human rights.", "name": "Topics in African Studies", "section": "24", "topic": "Land Rights &amp; Conflict in Global Perspective", "course": "390-0", "meeting_time": ["TuTh 9:30AM - 10:50AM"], "path": "/class-descriptions/4620/WCAS/AFST/390-0/37879", "instructor": ["Kathleen Fitzpatrick Klaus"], "id": "37879", "subject": "AFST"}]