[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "University Library 4722"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Spring 2017", "name": "32705", "title": "WCAS CLASSICS 101-6-1 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "32705", "instructors": [{"instructor_phone": "847/491-8029", "instructor_name": "Francesca   Tataranni", "instructor_addr": "Kresge Hall 4363"}], "topic": "Classicizing Chicago", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "Ancient Rome in Chicago: We walk by neoclassical buildings and are exposed to a variety of uses of classical imagery almost every day, which we completely take for granted. Where does this sense of familiarity come from? Although the ancient Greeks and Romans never made it to the new world, their legacy in America is reflected in literature, architecture, the visual arts, performing arts and sites devoted to recreation, education, politics, and business. The focus of this class is Chicago, the quintessential modern American city. By analyzing a wide variety of sources, from Eric Larson's No. 1 New York Times bestseller The Devil in the White City to some of the city's most significant skyscrapers, museums, theaters and stadiums, to Spike Lee's controversial film Chi-Raq, we will map the way Chicago's enduring, protean, at times antagonistic dialogue with classical antiquity has shaped the city's look, reputation, and identity."}, {"name": "Learning Objectives", "value": "The class will introduce students to the fast-growing field of classical reception studies, with a focus on the legacy of ancient Greece and Rome in modern America as reflected in the architecture, art and other forms of cultural production in Chicago. Students will discover the many ways in which the study of modernity's engagement with classical antiquity can enhance our understanding of how Western cultures think about themselves, their history, and their future. By the end of the course students should be able to do research using a wide variety of literary and non-literary sources and improve their ability to express their ideas in writing with clarity, precision, and persuasiveness."}, {"name": "Teaching Method", "value": "Class participationDiscussionGroup workLecturePresentationsReadingsWriting assignments"}, {"name": "Evaluation Method", "value": "AttendanceClass participationDiscussion sectionPapersPeer assessmentPresentationsWriting assignments"}, {"name": "Class Materials (Required)", "value": "Eric Larson, The Devil in the White City: Murder, Magic, and Madness at the Fair That Changed America, Vintage 2004. ISBN: 978-0375725609"}], "lmod": "2/16/17 6:45 PM (CT)", "subject": "CLASSICS"}]