[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "Parkes Hall 223"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Winter 2016", "name": "23151", "title": "WCAS ENGLISH 105-6-22 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "23151", "instructors": [{"instructor_phone": "847/491-4969", "instructor_name": "Penny Gail Hirsch", "instructor_addr": "555 Clark St., 202"}], "topic": "Writing about Community &amp; Identity", "course": "105-6", "descriptions": [{"name": "Overview of class", "value": "What creates community, why is community important, and who is considered a member? How does community affect personal identity, and in a democracy, does diversity enhance or challenge community? In this course, we will explore what you believe about community; consider the kind of community you have, or want, at home and at Northwestern; and then look more broadly at some forces that build or erode community. In this last area, we will examine the exploding prison population that threatens American communities and local programs designed to counter that trend. Each student will complete a final project that considers community in relation to a field of his or her choice, such as journalism, law, medicine, public policy, or higher education. At the same time, as we encounter the different genres in which people write about community-e.g. personal narratives, opinion pieces, academic studies-you will acquire techniques for becoming a more flexible and effective communicator, and thus a more powerful advocate for your values and beliefs."}, {"name": "Teaching Method", "value": "Discussion and workshop. Classes will include occasional field trips and guest speakers on neighborhood development, community policing, programs for at-risk teens, etc."}, {"name": "Evaluation Method", "value": "Grades will be based on two short papers (4-5 pages), a larger project (8-10 pages), and class participation (no midterm or final exam). All papers will be written in stages and revised."}, {"name": "Class Materials (Required)", "value": "A coursepack will include selections from books like the following: Bowling Alone: The Collapse and Revival of American Community by Robert Putnam. Portable Communities: The Social Dynamics of Online and Mobile Connectedness by Mary Chayko. The New Jim Crow: Mass Incarceration in the Age of Colorblindness by Michelle Alexander. We will also use documentaries, articles from the New York Times and the Daily Northwestern, &quot;writing for re-entry&quot; pieces written by former prisoners, and some student writing from previous seminars at NU."}], "lmod": "1/9/16 6:46 PM (CT)", "subject": "ENGLISH"}]