[{"school": "WCAS", "overview_of_class": "Lin Manuel Miranda called the 2016 Presidential election \"batshit crazy.\" The American Psychological Association has reported survey findings that the election was a \"source of significant stress for more than half of Americans.\" Other observers have argued that previous elections were even more bizarre, and that crazy might be the new norm. This seminar aims to explore the historical roots of the most discussed issues of the 2016 election in order to determine what kind of election it was, historically speaking. Where did Donald Trump's arguments about Mexican immigrants come from, and how do they compare with ideas about immigration articulated by previous candidates, Democratic and Republican? What's the history of outsiders in American politics; people without previous political experience running for elected office? Is Donald Trump a demagogue, were there others in American politics before him, and what does it mean to be a demagogue, anyway? What's the history of racism, white nationalism, and misogyny in American politics, and why was Hillary Clinton the first woman to win the nomination of one of the two major parties? What is the role of family dynasties?of the Clintons, or Bushes, for example?in presidential politics? Has the media ever been so maligned by a presidential candidate as they have been by Trump? What's the history of third parties in America? These are just a few of the questions we will ask and answer in this course. Ultimately, students will gain an understanding of the history of American presidential politics, and will come away with tools for historically contextualizing?and explaining with the tools available to historians?the seemingly inexplicable moment we're living in today.", "name": "First-Year Seminar-American History", "section": "20", "topic": "History of the 2016 Election", "course": "102-6", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4650/WCAS/HISTORY/102-6/21949", "instructor": ["Geraldo L Cadava"], "id": "21949", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "This course will introduce students to the history of modern Southeast Asia, from the middle of the nineteenth century to the end of the twentieth century, as it appears in well-known works of Western fiction. Students will read novels by Joseph Conrad, George Orwell, Graham Greene, and Christopher Koch, as well as works of literary criticism and historical contextualization. They will examine how images of Asia have been constructed in Western fiction and the ideological work those images have performed.", "name": "First-Year Seminar-American History", "section": "21", "topic": "Southeast Asia in Western Fiction", "course": "102-6", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4650/WCAS/HISTORY/102-6/21950", "instructor": ["Haydon Leslie Cherry"], "id": "21950", "subject": "HISTORY"}]