[{"class_mtg_info": [{"meet_t": "Tu 9:30AM - 12:20PM", "meet_l": "Parkes Hall 222"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Sociology/MORS PhD Students", "qtr": "Winter 2017", "name": "25732", "title": "WCAS SOCIOL 437-0-20 Economic Sociology", "class_attributes": "", "section": "25732", "instructors": [{"instructor_phone": "847/467-1251", "instructor_name": "Bruce Greenhow   Carruthers", "instructor_addr": "1808 Chicago Avenue, room 203."}], "topic": "", "course": "437-0", "descriptions": [{"name": "Overview of class", "value": "This course provides an introduction to economic sociology. It poses the key idea of &quot;embeddedness&quot; and develops it by exploring various connections between economic behavior and social processes and relations. The course is organized topically, and people are expected to read all the required material. The recommended material is optional (but weekly presenters may wish to consult it)."}, {"name": "Registration Requirements", "value": "Must be a graduate student."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Class participation, response papers, midterm and final exam."}, {"name": "Class Materials (Required)", "value": "The Sociology of Economic Life, Mark Granovetter and Richard Swedberg eds. Westview Press, 3rd ed. 2011. ISBN: 9780813344553<br/><br/>The Promise and Limits of Private Power: Promoting Labor Standards in a Global Economy, Richard M. Locke, Cambridge: Cambridge University Press, 2013. ISBN: 9781107670884<br/><br/>A Consumers' Republic: The Politics of Mass Consumption in Postwar America, Lizabeth Cohen, Knopf, 2002. ISBN: 978-0375707377<br/><br/>Capitalizing on Crisis: The Political Origins of the Rise of Finance, Greta Krippner, Cambridge: Harvard University Press, 2011. ISBN: 978-0674066199<br/><br/>Plastic Money: Constructing Markets for Credit Cards in Eight Postcommunist Countries, Akos Rona-Tas and Alya Guseva, Stanford: Stanford University Press, 2014. ISBN: 9780804768573<br/><br/>Economists and Societies: Discipline and Profession in the United States, Britain, and France, 1890s to 1990s, Marion Fourcade, Princeton: Princeton University Press, 2009. ISBN: 9780691148038"}, {"name": "Class Notes", "value": "Attendance at first class is strongly recommended."}], "lmod": "12/24/16 7:08 PM (CT)", "subject": "SOCIOL"}]