[{"class_mtg_info": [{"meet_t": "Tu 5:00PM - 8:00PM", "meet_l": "Technological Institute MG51"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24086", "title": "WCAS ENVR_SCI 390-0-21 Special Topics in Environmental Sciences", "class_attributes": "", "section": "24086", "instructors": [{"instructor_phone": "", "instructor_name": "Michael William Ribant", "instructor_addr": ""}], "topic": "Applied GIS", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "Geographic Information Systems (GIS) are computer systems that allow users to construct, visualize, and analyze geospatial data. While its use is trans-disciplinary, the course will focus on how to apply GIS techniques to important scientific questions in the environmental sciences. Specifically, students are introduced to exemplar problems in climate science, hydrology, and ecology that require geospatial analysis. Using these authentic scientific tasks as a motivational context, students learn the basic techniques for both acquiring and analyzing vector (i.e., points, lines, polygons) and raster (i.e., gridded) datasets. This includes spatial data acquired from airborne / spaceborne remote sensing, and other mapping techniques. Data is primarily analyzed using the professional standard in GIS software?ArcGIS?. Instruction will assume no prior experience using this software, however, basic computer proficiency is expected of incoming students."}, {"name": "Registration Requirements", "value": "ENVR SCI 201 or EARTH 201 or instructor permission"}, {"name": "Learning Objectives", "value": "Identify environmental problems suited to geospatial analysis; Analyze environmental data using a Geographical Information System (GIS); Integrate GIS analysis with other quantitative methods; Effectively communicate the results of geospatial analysis."}, {"name": "Teaching Method", "value": "THE CORE TEACHING METHODS ARE LECTURES, SUPERVISED LABORATORY SESSIONS, AND MENTORED INDEPENDENT RESEARCH. CLASS SESSIONS LAST TWO AND HALF HOURS AND CONVENE TWICE A WEEK (~0:45 LECTURE; ~1:45 LAB). HOWEVER, STUDENTS ARE EXPECTED TO COMMIT SUBSTANTIAL TIME OUTSIDE OF CLASS (&gt;5 HOURS PER WEEK) TO COMPLETE GIS PROJECTS AND SHOULD PLAN ACCORDINGLY. CLASSES STRONGLY BUILD OFF OF EACH OTHER. AS SUCH, COMPLETION OF WORK DURING ONE WEEK IS CONTINGENT ON COMPLETION OF WORK FROM PRIOR WEEKS."}, {"name": "Evaluation Method", "value": "In-class exercises; homework exercises; GIS reading response, weekly quizzes, midterm exam, student-designed final project"}, {"name": "Class Materials (Required)", "value": "Mastering ArcGIS, Seventh Edition (Spiral Bound) / Maribeth Price / ISBN: 9780078095146 / McGraw Hill"}], "lmod": "12/29/16 6:58 PM (CT)", "subject": "ENVR_SCI"}]