<<<<<<< HEAD
[{"school": "WCAS", "overview_of_class": "The course is team-taught by Professor Weil of the Slavic Department and Dr. Lyashenko of the Music School. (He lectures on Wednesdays and Fridays at 1 PM; she also teaches, conducts the chorus rehearsals on Tuesdays at 7 PM and the concert near the end of the Course.) The course will deal with Russian Operatic Music in the Context of Russian History and Culture. No previous singing experience is required; Dr. Lyashenko skillfully evokes the most beautiful sounds to the delight of the students. There is great pleasure and understanding to be gained from the intellectual depth and great passion of Russian Literature and Music.", "name": "Folklore, Music, Poetry", "section": "20", "location": "Kresge Centennial Hall 2-415", "topic": "", "course": "350-0", "meeting_time": ["WeFr 1:00PM - 1:50PM"], "path": "/class-descriptions/4660/WCAS/SLAVIC/350-0/34757", "instructor": ["Irwin A Weil", "Natalia E Lyashenko"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "34757", "subject": "SLAVIC"}]
=======
[{"school": "WCAS", "overview_of_class": "By using music, this course introduces students to the delights and understanding of great Russian Poetry. Professor Irwin Weil explains the historical and cultural background of some of the outstanding works by Russian Poets. Dr. Natalia Lyashenko, formerly the choral conductor of a major Russian Opera Company, conducts rehearsals of operatic choruses from operas based on works by these poets. The students, coached in the language by Professor Weil, get to sing in a concert exhibiting some of the extraordinary beauty of music created by Tchaikovsky and other fine Russian Composers. No previous knowledge of the language or the music is required.", "name": "Folklore, Music, Poetry", "section": "20", "location": "Kresge Centennial Hall 2-415", "topic": "", "course": "350-0", "meeting_time": ["WeFr 1:00PM - 1:50PM"], "path": "/class-descriptions/4660/WCAS/SLAVIC/350-0/34757", "instructor": ["Irwin A Weil", "Natalia E Lyashenko"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "34757", "subject": "SLAVIC"}]
>>>>>>> 550bd7c... Update Spring 2017 data
