[{"class_mtg_info": [{"meet_t": "We 6:15PM - 9:15PM", "meet_l": "Wieboldt Hall 504"}], "school": "SCS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "37919", "title": "SCS PSYCH 215-CN-15 Psychology of Personality", "class_attributes": "", "section": "37919", "instructors": [{"instructor_phone": "", "instructor_name": "James W Anderson", "instructor_addr": ""}], "topic": "", "course": "215-CN", "descriptions": [{"name": "Overview of class", "value": "Personality psychology is the study of an individual's characteristic patterns of thought, emotions, and behavior. This course takes a &quot;theories of personality&quot; approach. The six major theories of personality that underlie forms of psychotherapy are examined: classical psychoanalysis (Freud), person-centered theory (Carl Rogers), analytical psychology (Jung), cognitive theory, and modern psychodynamic theory. In addition to studying the basics of each theory, we will look at methods of investigation related to that theory and research on the effectiveness of the type of psychotherapy associated with that theory. The emphasis is on finding what of value can be taken from each approach. Teaching is done primarily through lectures in which there will be extensive examples given that illustrate the concepts. Questions and comments from students are encouraged. There will also be small group discussions from time to time. Carries social science credit."}, {"name": "Registration Requirements", "value": "PSYCH 110 or equivalent"}, {"name": "Learning Objectives", "value": "By the end of the course, students will be able to:<br/>-analyze the strengths and weakness of each theory of personality<br/>-show how the concept of a given theory relate to the way the theory views psychopathology<br/>-explain how the type of therapy associated with a theory has been developed with the aim of being effective at treating psychopathology<br/>-summarize the research findings about the efficacy of different forms of psychotherapy"}, {"name": "Teaching Method", "value": "Lecture<br/>Discussion<br/>Small group discussion"}, {"name": "Evaluation Method", "value": "Midterm, hour-long exam covering the first half of the course<br/>Final exam, hour-long, covering the second half of the course"}, {"name": "Class Materials (Required)", "value": "There will be a reading packet provided for sale at cost by the instructor. No books are to be purchased."}], "lmod": "4/3/16 7:37 PM (CT)", "subject": "PSYCH"}]