[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "University Hall 418"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "25067", "title": "WCAS HISTORY 393-0-40 Approaches to History", "class_attributes": "Historical Studies Distro Area<br/><br/>Attendance at 1st class mandatory<br/><br/>", "section": "25067", "instructors": [{"instructor_phone": "847/491-7444", "instructor_name": "Paul F Ramirez", "instructor_addr": "Harris Hall Room 233"}], "topic": "Catholicisms in the Americas", "course": "393-0", "descriptions": [{"name": "Overview of class", "value": "Apparitions, moving crucifixes, miraculous cures - these and other aspects of Catholicism have long posed intellectual and methodological challenges for students of the past. Participants in this course will explore manifestations of Catholicism in Latin America (the former colonies of Spain and Portugal), with special attention to the various texts, objects, and living communities that have assisted scholars in making sense of religious experience. We will consider ways of thinking and writing about religion, stressing recent developments and interdisciplinary exchanges, as well as reasons for doing so. How does an appreciation of human and divine interactions, sacraments, lay associations, and ritual specialists illuminate topics like slavery, gender, migration, labor regimes, colonialism, and nationalism?"}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Class participationReadingsReading journal 15%, weekly participation 25%, book analysis 15%, primary source analysis 15%, research presentation 10%, research proposal 20%"}, {"name": "Class Materials (Required)", "value": "Jennifer Scheper Hughes, Biography of a Mexican Crucifix: Lived Religion and Local Faith from the Conquest to the Present, ISBN 0195367073"}, {"name": "Class Notes", "value": "No P/N option, attendance at first class is mandatory<br/><br/>HISTORY AREA OF CONCENTRATION: Americas"}], "lmod": "1/9/16 6:48 PM (CT)", "subject": "HISTORY"}]