[{"school": "WCAS", "overview_of_class": "This course addresses a series of debates in anthropology about ?nature' and legitimacy in a variety of contexts that tend to be overlaid by heavy regulatory, if not bureaucratic, structures: sociocultural, political, biological, technological, legal, religious, economic. For this complex set of issues, there could be no better focus than the reproduction of society, especially that of children, across time and place. An explicit focus on reproduction and regulation makes clear connections to the core of the classic sociocultural anthropology canon. However, its application to contemporary debates in areas such as the technologies of birth control and assisted/biogenetic reproduction, international migration and ?integration,' human rights legislation, and the conveyance legitimacy across nations, generations and monetary currencies - all these offer rich new promise.", "name": "Topics in Anthropology", "section": "21", "topic": "Reproduction &amp; Its Regulation Across Time &amp; Space", "course": "490-0", "meeting_time": ["Tu 6:30PM - 9:00PM"], "path": "/class-descriptions/4640/WCAS/ANTHRO/490-0/10128", "instructor": ["Caroline H Bledsoe"], "id": "10128", "subject": "ANTHRO"}, {"school": "WCAS", "overview_of_class": "Within the Primate order an astounding range of physiological adaptations and behaviors are represented. What processes led to this extreme diversification? How can an understanding of primate diversity inform studies of human physiology and behavior? In this course we will use both classic and recent non-human primate studies to explore topics such as nutrition, growth, disease, sociality, cognition, and communication. We will also address the issue of primate-human conflict and conservation. At the end of this course, you will understand ecological and evolutionary theories relevant for explaining variation across the primate phylogeny and appreciate how studies of non-human primates impact our perspectives on human physiology and behavior.", "name": "Topics in Anthropology", "section": "22", "topic": "Primate Diversity: Foundations for Understanding H", "course": "490-0", "meeting_time": ["We 1:30PM - 4:00PM"], "path": "/class-descriptions/4640/WCAS/ANTHRO/490-0/18577", "instructor": ["Katherine Ryan Amato"], "id": "18577", "subject": "ANTHRO"}]