[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Frances Searle Building 3220"}], "school": "SoC", "enrl_requirement": "Enrollment Requirements: Reserved for Sophomores, Juniors, and Seniors from every undergraduate school only.", "qtr": "Fall 2016", "name": "16342", "title": "SoC COMM_ST 317-0-1 Voice, Violence, and Democracy", "class_attributes": "", "section": "16342", "instructors": [{"instructor_phone": "847/491-5853", "instructor_name": "Dilip P Gaonkar", "instructor_addr": "2240 Campus Dr. Rm 2-148 Frances Searle Building"}], "topic": "", "course": "317-0", "descriptions": [{"name": "Overview of class", "value": "This course has three objectives. The first objective is to try to understand how and why &quot;democracy&quot; today has come to be regarded as the only &quot;legitimate&quot; form of government. This was not always the case. After the brief and dramatic appearance more than two thousand years ago in the ancient Greece, &quot;democracy&quot; was regarded more often negatively as a dangerous and unstable form of government. However, since the late eighteenth century (after the two great revolutions, the American and the French), especially after 1945 (after the Second World War), democracy has had spectacular ascent as the only viable and legitimate form of &quot;self-governance&quot; and as an expression of &quot;popular sovereignty.&quot; It now dominates both our political speech and imagination. How did this happen? Is the world territorially divided and organized by the nation-states, culturally diverse and very uneven in terms of economic development, ready for democracy? <br/><br/>The second objective is to examine the phenomenon of growing disenchantment with democracy in the very midst its triumphal march. The discontent with democratic governance is no longer confined to &quot;new democracies&quot; in poor or developing countries where they are often afflicted with massive corruption, demagogic leadership, and electoral violence and fraud. Increasingly the mature democracies in advanced countries in Europe and North America are also suffering from legitimacy deficit due to issues related to economic inequality, high rate of unemployment or chronic under-employment, immigration, racial and religious conflicts. <br/><br/>The third, the most important, objective is to focus on the dialectic of voice (rhetoric) and violence in contemporary democracies. The traditional common place that &quot;voice&quot; replaces &quot;violence&quot; or persuasion obviates &quot;force&quot; in democratic societies is no longer true. The electoral politics and popular mobilizations in the global south, as evident in countries like India, Kenya, Egypt, and Indonesia (to name a few), continuously mix and manipulate the combustible interplay between voice and violence. Today's democratic regimes seem prone to a high degree of disorder even in Europe and North America as evident from the growing number of riots (Ferguson unrest, 2014) and other forms of protests (Occupy movement, 2011) in the last decade, especially since the financial crisis of 2009."}], "lmod": "10/30/16 6:48 PM (CT)", "subject": "COMM_ST"}]