[{"class_mtg_info": [{"meet_t": "MoWeFr 11:00AM - 11:50AM", "meet_l": "Locy Hall 110"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "33852", "title": "WCAS FRENCH 202-0-20 Writing Workshop", "class_attributes": "Attendance at 1st class mandatory<br/><br/>Prerequisites apply, see description<br/><br/>", "section": "33852", "instructors": [{"instructor_phone": "847/467-0899", "instructor_name": "Katia   Viot-Southard", "instructor_addr": "1860 S. Campus Drive, Crowe Hall #2-171"}], "topic": "", "course": "202-0", "descriptions": [{"name": "Overview of class", "value": "This course is designed to develop and improve writing skills through a variety of classroom activities: <br/>discussion, writing, editing. Students will learn how to write a college-level analytical paper. Selected grammar points will be discussed in class, and course content will be provided by a novel and two films. Homework will include short writing exercises and compositions as well as the preparation of grammar exercises related to the writing objectives. This course serves as prerequisite for most other 200 and 300-level French classes."}, {"name": "Registration Requirements", "value": "French 201 or 203, Placement (125-3 with consent of coordinator)"}, {"name": "Learning Objectives", "value": "It is expected by the end of term that students will be able to: <br/>? write up to 3 pages of French with ease, a certain degree of personal style, and few errors,<br/>? produce a well-organized and well-conceived paper on a personal, literary or cultural topic, <br/>? proofread their own work for the most basic errors made by Anglophones writing French"}, {"name": "Teaching Method", "value": "A collaborative workshop, with written and oral activities organized around communicative strategies."}, {"name": "Evaluation Method", "value": "The final grade will be based on class participation, homework, compositions, quizzes and progress."}, {"name": "Class Materials (Suggested)", "value": "Eric-Emmanuel Schmitt, Monsieur Ibrahim et les Fleurs du Coran (Magnard, 2004) (available at Norris) -Large (over 250,000 words) French-English, English-French Dictionary; Harper-Collins-Robert is recommended (available at Norris). You need a dictionary that shows contexts for different meanings of a word and contains verb tables. -Highly recommended but not required: Micro Robert de poche (or a good French-French dictionary) -Study packet available at Quartet Copies (Guide du cours and Manuel de Grammaire)"}], "lmod": "2/19/17 6:48 PM (CT)", "subject": "FRENCH"}]