[{"school": "WCAS", "overview_of_class": "Course Description<br/><br/>We are in an era where the world is awash in data.  More data being created all the time and the rate of data creation is accelerating.  The Science News (May 22, 2013) tells us that 90% of the data that existed then was created in the previous 2 years.  At the same time, the cost of storing and manipulating data has decreased dramatically.  This has presented enormous opportunities for those trained in how to manipulate that data and use it for practical purposes.  The skills required draw heavily from statistics and computer science, and have become a new area at the intersection of these fields, variously called data science, predictive analytics, or just applied statistics.<br/><br/>This course is the second quarter in a sequence that provides an introduction to fundamental topics in data science.  It will give a broad survey of methods for supervised learning and some experience with each of them, but will not give an in depth coverage of any of them.  More advanced topics and topics in unsupervised learning will be covered in subsequent courses (we anticipate that this will be Statistics 301-III), including substantial projects that will provide project based learning as those projects require in depth experience with methods.<br/><br/>Prerequisites<br/><br/> This course assumes a basic knowledge of the basic ideas of statistical inference (distributions, estimation and hypothesis testing), some experience with programming languages like R and Python and software for data analysis.  It also assumes knowledge of basic data science techniques at the level of those taught in Statistics 301-I.", "name": "Data Science, 2", "section": "1", "location": "STAT Sem Rm B02 - 2006 Sher", "topic": "", "course": "301-2", "meeting_time": ["MoWe 5:00PM - 6:20PM"], "path": "/class-descriptions/4610/WCAS/STAT/301-2/27860", "instructor": ["Larry Vernon Hedges", "Nathan M VanHoudnos"], "class_attributes": "Formal Studies Distro Area<br/><br/>", "id": "27860", "subject": "STAT"}]