[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "Cresap Laboratory 101"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Registration reserved for undergraduates who have taken and passed LING270 or LING370, graduate students, or permission of instructor.", "qtr": "Winter 2016", "name": "23581", "title": "WCAS LING 372-0-20 Pragmatics", "class_attributes": "Prerequisites apply, see description<br/><br/>", "section": "23581", "instructors": [{"instructor_phone": "847/491-7020", "instructor_name": "Gregory L Ward", "instructor_addr": "2016 Sheridan Road, Rm 203"}], "topic": "", "course": "372-0", "descriptions": [{"name": "Overview of class", "value": "Introduction to extra-semantic meaning, focusing on the role of context in utterance production and interpretation. Topics include the semantics-pragmatics boundary, implicature, reference, presupposition, speech acts, and information structure. Students will be expected to read and discuss several articles and text chapters each week, and will be evaluated on a combination of class participation, a midterm exam, and either a final exam or a research paper"}, {"name": "Registration Requirements", "value": "(A) undergrads with successful completion of LING 270 or LING 370;<br/>(B) graduate standing; or <br/>(C) permission of instructor."}, {"name": "Learning Objectives", "value": "To develop a deep understanding of current theoretical issues in pragmatics from a linguistic and philosophical perspective."}, {"name": "Teaching Method", "value": "To develop a deep understanding of current theoretical issues in pragmatics from a linguistic and philosophical perspective."}, {"name": "Evaluation Method", "value": "Class participationExam, finalExam, mid-termThe final grade will be based on class participation, a midterm, and either a final exam or a research paper."}, {"name": "Class Materials (Required)", "value": "Birner, Betty J. Introduction to Pragmatics. 2012. Wiley Blackwell"}], "lmod": "1/9/16 6:50 PM (CT)", "subject": "LING"}]