[{"school": "WCAS", "overview_of_class": "With the translation of the tales of A Thousand and One Nights from Arabic into French by Antoine Galland at the beginning of the eighteenth century, something of a revolution occurred in storytelling technique and theories of literary writing. Story upon story, without author or place of origin, these tales were told night after night by a cultured and courageous young woman named Shahrazad to a king bent on killing her in the morning. The cosmopolitan context of the stories together with the innovative strategies devised by its singular narrator not only suggested new directions for literary conception and writing in Europe, the translation and the acclaim it received drew the attention of the literary establishments in the Arabic and Islamic world as well. Abdelfattah Kilito tells us that until the event of this translation and its subsequent success, this text had received little attention in the Islamic world because it was considered a popular genre and thus not worthy of literary consideration. <br/><br/>This class is dedicated to the legacy of the ingenious narrator of Nights. Not only is Shahrazad arguably the best-known narrator in the history of literature, she is the inspiration for innumerable works of literature, literary theory, and feminist and political critique. Some writers follow in her footsteps, others challenge and modify both her stories and her status as a woman speaking under the threat of imminent death. But no matter the approach, Shahrazad remains one of literature's most unforgettable figures. <br/><br/>We will read in this course works of theory, history, and literature. Beginning with the history of the text itself, we move to the reading of a selection of tales in order to observe and understand their technique. These readings will be supplemented with theoretical and analytical texts, which will help us unveil the rich interpretive possibilities these tales offer. The second segment of the course is comprised of short stories and novels inspired by Nights, in particular its narrator, as well as some critical responses to this figure by writers from the Maghreb: Algeria, Morocco, and Tunisia. The final segment of the course will highlight some of the ways in which this text has inspired writers and critics more broadly and outside the Arab and the Islamic world. <br/><br/>***Abdelfattah Kilito, a world renowned specialist of A Thousand and One Nights, will be at Northwestern for one week and will attend our class in order to discuss the work with us in person.", "name": "The Maghreb and the Middle East", "section": "20", "location": "Kresge Centennial Hall 3-410", "topic": "Reading A Thousand and One Nights", "course": "365-0", "meeting_time": ["MoWeFr 10:00AM - 10:50AM"], "path": "/class-descriptions/4640/WCAS/FRENCH/365-0/12203", "instructor": ["Nasrin   Qader"], "class_attributes": "", "id": "12203", "subject": "FRENCH"}]