[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Annenberg Hall G30"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "36782", "title": "WCAS INTL_ST 290-0-20 Topics in International Studies", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "36782", "instructors": [{"instructor_phone": "", "instructor_name": "Margarita   Rayzberg", "instructor_addr": ""}], "topic": "Intro Int'l Dev: Issues and Practice", "course": "290-0", "descriptions": [{"name": "Overview of class", "value": "This course introduces students to both critical and practical perspectives on international development through a combination of readings, lectures, speakers, case studies, written assignments, and oral presentations. Students will learn about the history of international development from its colonial foundations to its present dynamics. In addition to the history, students will explore the ethical dilemmas involved in doing development work, the challenges of measuring development, the relationship between sustainability and development, and the role of identity in development. To complement the historical and theoretical perspectives, students will analyze mechanisms of development -government, private sector, nonprofit sector, and research - through case studies. Every week, students will hear from one or more thought leaders and practitioners working in various sectors of international development."}, {"name": "Learning Objectives", "value": "By the end of the course, students will be able to:<br/>? identify and explain the various phases of development and their achievements and shortcomings<br/>? identify and give examples of various mechanisms of development<br/>? develop an informed understanding of the ethical and empirical challenges of development<br/>? develop an improved sense of practice, by designing their own development intervention, according to their experience and interests"}, {"name": "Evaluation Method", "value": "Attendance &amp; Participation- 25%<br/>Reflection Papers- 45%<br/>Final Project- 30%"}, {"name": "Class Materials (Required)", "value": "The main text for the course is Understanding Development by John Rapley, 2nd edition. The book will be available at the bookstore as well as on reserve at the library.<br/>Other readings will be posted on Canvas."}, {"name": "Class Notes", "value": "This is a seminar course that depends on your active participation. This is especially true for when we have speakers. For this reason, I have a policy of no technology except during specific assignments. Make sure your cell phone is turned off. <br/><br/>Students in this class are encouraged to speak up and participate during class meetings. Because the class will represent a diversity of individual beliefs, backgrounds, and experiences, every member of this class must show respect for every other member of this class. I am firmly committed to diversity and equality in all areas of campus life. In this class I will work to promote an anti-discriminatory environment where everyone feels safe and welcome. I recognize that discrimination can be direct or indirect and take place at both institutional and personal levels. I believe that such discrimination is unacceptable and I am committed to providing equality of opportunity for all by eliminating any and all discrimination, harassment, bullying, or victimization. The success of this policy relies on the support and understanding of everyone in this class. We all have a responsibility not to be offensive to each other, or to participate in, or condone harassment or discrimination of any kind. If you experience discrimination, harassment, bullying or victimization of any kind and you do not feel comfortable bringing it up with me, please contact a Title IX coordinator (http://www.northwestern.edu/sexual-misconduct/get-help/title-ix-coordinators/index.html) and/or Campus Inclusion and Community (http://www.northwestern.edu/inclusion/respectnu/reporting-bias-hate-incidents/index.html)"}], "lmod": "2/7/17 6:44 PM (CT)", "subject": "INTL_ST"}]