[{"school": "WCAS", "overview_of_class": "", "name": "Special Topics In Philosophy", "section": "20", "location": "Cresap Laboratory 101", "topic": "Reference", "course": "390-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4660/WCAS/PHIL/390-0/34484", "instructor": ["Gregory L Ward"], "class_attributes": "", "id": "34484", "subject": "PHIL"}, {"school": "WCAS", "overview_of_class": "", "name": "Special Topics In Philosophy", "section": "21", "location": "Cresap Laboratory 101", "topic": "Reference", "course": "390-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4660/WCAS/PHIL/390-0/37360", "instructor": ["Gregory L Ward"], "class_attributes": "Graduate Students Only<br/><br/>", "id": "37360", "subject": "PHIL"}, {"school": "WCAS", "overview_of_class": "Life is Not Fair: Theories and Practices of Justice<br/> <br/>Why isn't life fair? How could we make it so? This is one of the central questions of philosophy and religion. This course will look at historical and comparative theories of justice from theological and philosophical sources in the Western Tradition. We will begin by a review of justice theory within the Hebrew Bible, the New Testament and the Quran, and consider the Enlightenment ideas of citizenship and contracts, asking how the theories work in our own time. We will explore how the concepts of fairness, treatment of the vulnerable, equity, freedom, rights and contracts expand our historical ideas about how to distribute social goods in a world of scarcity and finitude. We will critically examine the turn toward utility and happiness, then to contract theories of justice as modernity expanded our ideas of what is necessary, and what can be shared. We will explore contemporary theories of justice, including Rawls (and his critics,) Singer, Nussbaum. Sachs, and challenges to liberal theorists by liberation theology, African American political theory, and feminist critique. The class will conclude with an exploration of how justice theories are applied in practical terms against problems of access and distribution in American public life.", "name": "Special Topics In Philosophy", "section": "22", "location": "Parkes Hall 212", "topic": "Life is not Fair: Theories and Practices of Justic", "course": "390-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4660/WCAS/PHIL/390-0/34485", "instructor": ["Laurie S Zoloth"], "class_attributes": "", "id": "34485", "subject": "PHIL"}]