[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "Locy Hall 305"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Freshmen may not register for this course.", "qtr": "Winter 2017", "name": "22014", "title": "WCAS HISTORY 395-0-20 Research Seminar", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "22014", "instructors": [{"instructor_phone": "847/467-3896", "instructor_name": "Elie   Rekhess", "instructor_addr": "Harris Hall - Room 223"}], "topic": "Hamas &amp; &quot;Islamic Jihad&quot;", "course": "395-0", "descriptions": [{"name": "Overview of class", "value": "The seminar discusses the historical background to the rise of political Islam within the Palestinian society, reviewing three periods: Mandatory Palestine (1920s - 1940s), the West Bank and Gaza under Jordan and Egypt's rule (1948-1967), and Israel since 1967. The central part of the seminar focuses in more detail on Hamas, &quot;Islamic Jihad,&quot; and the Islamic Movement in Israel. It analyses the causes for the rise of revivalist Islam in the territories and in Israel since the 1970s. It deals with the ideology and political platform of Hamas as outlined in its &quot;Charter&quot; (the Islamicization of the Israel-Arab conflict, the Islamicization of the Palestinian nation identity). We will examine the doctrinal and practical principle of Jihad and the idea of martyrdom in Islam (Istishad). A special emphasis will be laid on suicide bombing from a doctrinal and practical point of view. The seminar examines the political participation of Hamas (Municipal, Legislative Council elections - 2006) and its relationship with the PLO. Finally the seminar reviews the rise of the Islamic Movement in Israel, its particular characteristics, the political divide of the movement (1996) and its role as a social, economic and cultural agent of change in the life of the Arab minority in Israel."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Exam, mid-term: (for 392 students)<br/>Papers: (for 392 students = 8 pgs. &amp; for 395 students = 15-20 pgs.)<br/>"}, {"name": "Class Materials (Required)", "value": "***Tentative until posted to Norris website***"}, {"name": "Class Notes", "value": "AREA OF CONCENTRATION: Middle East"}], "lmod": "12/24/16 7:00 PM (CT)", "subject": "HISTORY"}]