[{"class_mtg_info": [{"meet_t": "Th 1:00PM - 3:50PM", "meet_l": "Harris Hall L06"}], "school": "WCAS", "overview_of_class": "This upper-level seminar in medical anthropology examines the role of social markers of difference including race, class, nationality, gender, sexuality, age and religion in current debates and challenges in the theory and practice of global health. We will explore contemporary illness experiences and therapeutic interventions in sociocultural and historical context through case studies from the US, Brazil, and South Africa. Students will be introduced to key concepts such as embodiment, medicalization, structural violence, the social determinants of health, and biopolitics. Central questions of the seminar include: How do social categories of difference determine disease and health in individuals and collectivities? How is medical science influenced by economic and political institutions and by patient mobilization? How does social and economic inclusion/exclusion govern access to treatment as well as care of the self and others? The course will provide advanced instruction in anthropological and related social scientific research methods as they apply to questions of social inequality and public health policy in both the United States and in emerging economic powers. The course draws from historical accounts, contemporary ethnographies, public health literature, media reports, and films.", "qtr": "Fall 2017", "name": "The Social Determinants of Health", "title": "WCAS GBL_HLTH 322-0-20 The Social Determinants of Health", "lmod": "5/1/17 8:08 PM (CT)", "section": "20", "topic": "", "course": "322-0", "enrl_requirement": "Enrollment Requirements: No freshmen allowed. Pre-registration is for Global Health Studies Minor only. Registration is open to other students after pre-registration.", "descriptions": [{"name": "Overview of class", "value": "This upper-level seminar in medical anthropology examines the role of social markers of difference including race, class, nationality, gender, sexuality, age and religion in current debates and challenges in the theory and practice of global health. We will explore contemporary illness experiences and therapeutic interventions in sociocultural and historical context through case studies from the US, Brazil, and South Africa. Students will be introduced to key concepts such as embodiment, medicalization, structural violence, the social determinants of health, and biopolitics. Central questions of the seminar include: How do social categories of difference determine disease and health in individuals and collectivities? How is medical science influenced by economic and political institutions and by patient mobilization? How does social and economic inclusion/exclusion govern access to treatment as well as care of the self and others? The course will provide advanced instruction in anthropological and related social scientific research methods as they apply to questions of social inequality and public health policy in both the United States and in emerging economic powers. The course draws from historical accounts, contemporary ethnographies, public health literature, media reports, and films."}, {"name": "Class Materials (Required)", "value": "EDMONDS, Alexander. Pretty Modern: Beauty, Sex and Plastic Surgery in Brazil. Duke University Press, 2010. [Recommended]<br/>FASSIN, Didier. When Bodies Remember: Experience and Politics of AIDS in Post- Apartheid South Africa. Berkeley: University of California Press, 2007.<br/>FOUCAULT, Michel. The History of Sexuality, Vol. 1: An Introduction. 5th or later edition. New York: Vintage Books, 1990. [Recommended]<br/>GARCIA, Angela. The Pastoral Clinic: Addiction and Dispossession along the Rio Grande. Berkeley: University of California Press, 2010.<br/>KULICK, Don. Travesti: Sex, Gender, and Culture among Brazilian Transgendered Prostitutes. Chicago: University of Chicago Press, 1998.<br/>ROUSE, Carolyn. 2009. Uncertain Suffering: Racial Health Care Disparities and Sickle Cell Disease. Berkeley: University of California Press. [Recommended]<br/><br/>All books are on course reserves in the library. All other readings can be found on Canvas."}], "instructor": ["Peter Andrew Locke"], "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "id": "11907", "subject": "GBL_HLTH"}]