[{"class_mtg_info": [{"meet_t": "MoWe 5:00PM - 6:20PM", "meet_l": "STAT Sem Rm B02 - 2006 Sher"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "27860", "title": "WCAS STAT 301-2-1 Data Science, 2", "class_attributes": "Formal Studies Distro Area<br/><br/>", "section": "27860", "instructors": [{"instructor_phone": "847/467-4001", "instructor_name": "Larry Vernon Hedges", "instructor_addr": "2040 Sheridan Rd or 2006 Sheridan Rd"}, {"instructor_phone": "", "instructor_name": "Nathan M VanHoudnos", "instructor_addr": ""}], "topic": "", "course": "301-2", "descriptions": [{"name": "Overview of class", "value": "Course Description<br/><br/>We are in an era where the world is awash in data. More data being created all the time and the rate of data creation is accelerating. The Science News (May 22, 2013) tells us that 90% of the data that existed then was created in the previous 2 years. At the same time, the cost of storing and manipulating data has decreased dramatically. This has presented enormous opportunities for those trained in how to manipulate that data and use it for practical purposes. The skills required draw heavily from statistics and computer science, and have become a new area at the intersection of these fields, variously called data science, predictive analytics, or just applied statistics.<br/><br/>This course is the second quarter in a sequence that provides an introduction to fundamental topics in data science. It will give a broad survey of methods for supervised learning and some experience with each of them, but will not give an in depth coverage of any of them. More advanced topics and topics in unsupervised learning will be covered in subsequent courses (we anticipate that this will be Statistics 301-III), including substantial projects that will provide project based learning as those projects require in depth experience with methods.<br/><br/>Prerequisites<br/><br/> This course assumes a basic knowledge of the basic ideas of statistical inference (distributions, estimation and hypothesis testing), some experience with programming languages like R and Python and software for data analysis. It also assumes knowledge of basic data science techniques at the level of those taught in Statistics 301-I."}, {"name": "Learning Objectives", "value": "Learning Objectives<br/><br/> To help students and the instructor be clear on what you are supposed to learn from this course, I have developed a set of learning objectives, listed below:<br/> <br/>1. Without the aid of their notes, students will be able to explain the two broad classes of methods used in data science to develop predictive models.<br/>2. Students will be able to define basis expansions, describe how they are used to generalize linear regression and classification methods, and demonstrate how they are used with a real dataset.<br/>3. Students will be able to describe how smoothing splines can be used for filtering and feature extraction in regression models and apply these methods to real data.<br/>4. Students will be able to define kernel smoothing, describe how they are used to generalize linear regression and classification methods, and demonstrate how they are used with a real dataset.<br/>5. Students will be able to apply the PRIM and MARS algorithms are used to generalize regression models, and demonstrate how these are used in real data.<br/>6. Students will be able to describe the idea of projections pursuit, neural network models and use them to develop regression models.<br/>7. Students will be able to describe the idea of the vector support classifier, vector support machines and describe how it is applied to the analysis of random forests."}, {"name": "Evaluation Method", "value": "Evaluation<br/><br/>There will be four assignments that involve conceptual work, computation using R or Python, or both. There will also be a final project that involves carrying out an analysis of a dataset, developing a predictive model and describing what you concluded from it. This class is cumulative and therefore it is essential that the first four assignments be completed on time. Your final grade will depend on your cumulative work on these assignments plus the final project."}, {"name": "Class Materials (Required)", "value": "Textbooks<br/><br/>The required textbook is one of the standard textbook on data science and machine learning by two of the key innovators of these methods (denoted HTF in the course outline):<br/><br/>Hastie, T., Tibshirani, R., &amp; Friedman, J. (2013) The elements of statistical learning, by (2nd edition). New York: Springer. <br/><br/>Additional Reference<br/>Kuhn, M. &amp; Johnson, K. (2013). Applied predictive modeling. New York: Springer. <br/><br/>In addition students will use the computer software in R and Python, both of which are available for free download."}, {"name": "Class Notes", "value": "Approaching This Class<br/><br/>You may find two things useful in approaching this course. First, the course is cumulative. Although the individual concepts are relatively straightforward, they build upon one another so that getting behind seriously impedes learning new concepts. Keep up with the reading and assignments. Do the reading assigned before the date of the class in which it is discussed. Second, take responsibility for your own learning. I strongly suggest that you form study groups to work together on the material and discuss readings and assignments."}], "lmod": "1/9/16 6:54 PM (CT)", "subject": "STAT"}]