[{"class_mtg_info": [{"meet_t": "We 1:00PM - 3:30PM", "meet_l": "ANTHRO Sem Rm 104 - 1810 Hinmn"}], "school": "WCAS", "overview_of_class": "The human brain has properties that are unique in the animal kingdom, and is widely assumed to <br/>underlie our species' unusual level of sociality, ability for complex culture, and distinctive <br/>achievements in areas like technological innovation and the arts.  Recent scientific advances are <br/>allowing the brain's function to be probed through means of non-invasive imaging, which has <br/>led to an explosion of neuroscientific research and important developments in our understanding <br/>of how our brains work.  Yet the intense \"neuro-enthusiasm\" this has sparked has also <br/>contributed to new forms of biological reductionism and over-simplified notions of the brain's <br/>role in...well, nearly every aspect of human experience.  In this wide-ranging seminar we will <br/>explore the human brain from a range of complementary perspectives, with an overarching <br/>agenda of exploring the social and cultural ecology of mind and brain. One important area of <br/>inquiry will therefore include a consideration of development and the mechanisms of neuronal <br/>plasticity that link experiences with brain and mind through processes of learning, skill <br/>development, and memory.  The theme of embodiment will cross-cut many of the course <br/>discussions, and underscore the intimate connections between the brain and body that lead to <br/>reciprocal influences among brain, experience, and behavior. Because of the brain's role in <br/>regulating the body's many biological systems, neuronal plasticity also has effects that link our <br/>histories and experiences, such as stress or opportunity, to altered biological regulation, and thus <br/>health.  Topics explored will include: the brain in society; evolution of the social brain; neural <br/>plasticity and development; embodiment; emotion and reason in the brain; sex, gender, race, <br/>racism and the brain; and cultural neuroscience and the encultured brain.", "qtr": "Winter 2016", "name": "Bridging Seminar", "title": "WCAS ANTHRO 496-0-1 Bridging Seminar", "lmod": "1/9/16 6:43 PM (CT)", "section": "1", "instructors": [{"instructor_phone": "847/467-4302", "instructor_name": "Christopher W Kuzawa", "instructor_addr": "1810 Hinman Ave., Room #A63, EV Campus"}, {"instructor_phone": "847/491-7207", "instructor_name": "Rebecca A Seligman", "instructor_addr": "1810 Hinman Ave., Room #204, EV Campus"}], "topic": "", "course": "496-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "The human brain has properties that are unique in the animal kingdom, and is widely assumed to <br/>underlie our species' unusual level of sociality, ability for complex culture, and distinctive <br/>achievements in areas like technological innovation and the arts. Recent scientific advances are <br/>allowing the brain's function to be probed through means of non-invasive imaging, which has <br/>led to an explosion of neuroscientific research and important developments in our understanding <br/>of how our brains work. Yet the intense &quot;neuro-enthusiasm&quot; this has sparked has also <br/>contributed to new forms of biological reductionism and over-simplified notions of the brain's <br/>role in...well, nearly every aspect of human experience. In this wide-ranging seminar we will <br/>explore the human brain from a range of complementary perspectives, with an overarching <br/>agenda of exploring the social and cultural ecology of mind and brain. One important area of <br/>inquiry will therefore include a consideration of development and the mechanisms of neuronal <br/>plasticity that link experiences with brain and mind through processes of learning, skill <br/>development, and memory. The theme of embodiment will cross-cut many of the course <br/>discussions, and underscore the intimate connections between the brain and body that lead to <br/>reciprocal influences among brain, experience, and behavior. Because of the brain's role in <br/>regulating the body's many biological systems, neuronal plasticity also has effects that link our <br/>histories and experiences, such as stress or opportunity, to altered biological regulation, and thus <br/>health. Topics explored will include: the brain in society; evolution of the social brain; neural <br/>plasticity and development; embodiment; emotion and reason in the brain; sex, gender, race, <br/>racism and the brain; and cultural neuroscience and the encultured brain."}, {"name": "Class Notes", "value": "Anthropology graduate students only."}], "path": "/class-descriptions/4610/WCAS/ANTHRO/496-0/25120", "instructor": ["Christopher W Kuzawa", "Rebecca A Seligman"], "class_attributes": "Graduate Students Only<br/><br/>", "id": "25120", "subject": "ANTHRO"}]