[{"class_mtg_info": [{"meet_t": "We 2:00PM - 4:50PM", "meet_l": "ANTHRO Sem Rm 104 - 1810 Hinmn"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "10091", "title": "WCAS ANTHRO 389-0-1 Ethnographic Methods and Analysis", "class_attributes": "", "section": "10091", "instructors": [{"instructor_phone": "847/491-5132", "instructor_name": "Ana L Aparicio", "instructor_addr": "1810 Hinman Ave. #212"}], "topic": "", "course": "389-0", "descriptions": [{"name": "Overview of class", "value": "This course is designed to familiarize students with methods used in ethnographic research. We will study and discuss the importance of qualitative data collection &quot;tools&quot; such as participant-observation, oral histories, and interviewing. In addition to discussing the methods as technique, we will examine numerous issues that arise when we engage in ethnographic research; these include but are not limited to ethics, issues of gender, race, class, age, etc. The discussion of these (and other) issues will be based on the assigned readings and on students' experiences in their own &quot;field&quot; experience. The course will enable you to understand why certain methods are chosen for different kinds of research and which method(s) would be most appropriate for your research project. <br/>Student participation is critical in this course; you will be conducting fieldwork throughout the quarter. We will work through the research process as a collective, but it is up to the individual students (as researchers) to bring information to the class for discussion and analysis. Students will work on an ethnographic project during the quarter, learning (through practice) how to utilize particular methods of qualitative research. Students will keep &quot;field notes&quot; throughout the quarter; as we share field experiences and discuss readings, we will critically discuss the practice of fieldwork and the utilization of traditional field methods. Students are evaluated on class participation, field notes, and a final project."}, {"name": "Evaluation Method", "value": "The emphasis is on practical attempts at doing fieldwork. There will be several graded assignments: a proposal, several project write-ups, and a final report. The weekly reports will be turned in via email and discussed in class during the next session. The assignments should be short (2-3 pages), clear, and concise."}, {"name": "Class Materials (Required)", "value": "Emerson, R. et al. 1995. Writing Ethnographic Fieldnotes. IL: Univ of Chicago Press.<br/>Lofland, John &amp; L. Lofland. 1994. Analyzing Social Settings: A Guide to Qualitative Observation and Analysis. NY: Wadsworth Publishing Co.<br/>Twine, France Winddance &amp; J.Warren. 2000. Racing Research, Researching Race: Methodological Dilemmas in Critical Race Studies. NY: NYU Press."}, {"name": "Class Materials (Suggested)", "value": "LeCompte, M. and J. Schensul. 1999. Designing and Conducting Ethnographic Research, The Ethnographer's Toolkit, Volume 1. Walnut Creek, CA: AltaMira Press."}], "lmod": "10/30/16 6:58 PM (CT)", "subject": "ANTHRO"}]