[{"class_mtg_info": [{"meet_t": "MoWeFr 2:00PM - 2:50PM", "meet_l": "Harris Hall L07"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "25051", "title": "WCAS HISTORY 300-0-34 New Lectures in History", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "25051", "instructors": [{"instructor_phone": "847 4673032", "instructor_name": "Haydon Leslie Cherry", "instructor_addr": "Harris 217"}], "topic": "Modern Southeast Asia", "course": "300-0", "descriptions": [{"name": "Overview of class", "value": "This course is an introduction to the history of modern Southeast Asia, from the middle of the eighteenth century to the present. The region comprises eleven modern nation-states: its history can seem like a bewildering parade of princes, plenipotentiaries, presidents, and prime ministers. This course focuses, therefore, on the economic and social changes that have spanned the region in the past two hundred and fifty years. Topics include pre-colonial social structures and their relationship to patterns of economic activity; Southeast Asians' responses to the challenges and opportunities of their region's integration with new markets during the era of &quot;high colonialism&quot;; the social transformations that followed from depression, war, and decolonization in the middle of the twentieth century, including peasant rebellions and the birth of communism; and the rise of new elites and mass politics in the post-independence period."}, {"name": "Teaching Method", "value": "Lecture"}, {"name": "Evaluation Method", "value": "AttendanceClass participationPaper, mid-termClass attendance and participation, one take-home essay and one midterm essay, and a take-home final"}, {"name": "Class Materials (Required)", "value": "Michael Adas, The Burma Delta: Economic Development and Social Change on an Asian Rice Frontier. ISBN: 978-0299283544<br/><br/><br/>Multatuli, Max Havelaar. ISBN: 978-0140445169<br/><br/><br/>Botan, Letters from Thailand. ISBN: 978-9747551679<br/><br/><br/>Reading Packet"}, {"name": "Class Notes", "value": "HISTORY AREA OF CONCENTRATION: Asia/Middle East"}], "lmod": "1/9/16 6:48 PM (CT)", "subject": "HISTORY"}]