[{"class_mtg_info": [{"meet_t": "MoWeFr 9:00AM - 9:50AM", "meet_l": "Technological Institute L170"}], "school": "MEAS", "overview_of_class": "Elementary classical thermodynamics, applications of the first law and the second laws of thermodynamics to power and refrigeration cycles, mixtures and solutions, thermodynamic relations, chemical reactions, and phase and chemical equilibrium.", "qtr": "Spring 2017", "name": "Thermodynamics & Statistical Mechanics - II", "title": "MEAS MECH_ENG 322-0-1 Thermodynamics &amp; Statistical Mechanics - II", "lmod": "2/24/17 6:37 PM (CT)", "section": "1", "instructors": [{"instructor_phone": "847/467-1885", "instructor_name": "Seth H Lichter", "instructor_addr": "Techological Institute, Rm L493, 2145 Sheridan Rd, EV CAMPUS 3111"}], "topic": "", "course": "322-0", "enrl_requirement": "Enrollment Requirements: Prerequisite: Students must have completed MECH_ENG 220, or Thermodynamics offered through another department, prior to taking this course.", "descriptions": [{"name": "Overview of class", "value": "Elementary classical thermodynamics, applications of the first law and the second laws of thermodynamics to power and refrigeration cycles, mixtures and solutions, thermodynamic relations, chemical reactions, and phase and chemical equilibrium."}, {"name": "Registration Requirements", "value": "Thermodynamics concerns the foundation of all branches of physical sciences. Therefore, this course is highly recommended to all mechanical engineering students. Also, students in chemical and biomedical engineering will benefit by taking this course or one similar to it. Undergraduates usually take this course at the beginning of their third or fourth year."}, {"name": "Learning Objectives", "value": "Power generation/ consumption is an indispensable element of almost all engineering systems. Ecological considerations such as global warming and air pollution impose ever more stringent environmental constraints on power generation and propulsion systems. This course concerns the applications of the laws of classical thermodynamics to the analysis of performance and efficiency of engineering systems such as Rankine, Otto, Diesel, Brayton, Ericcson, and Stirling cycles. The fundamental thermodynamic relations are examined and applied to describe ideal and non-ideal mixtures. The applications of the laws of thermodynamics to chemically reactive systems, the concept of adiabatic flame temperature, as well as chemical and phase equilibrium are discussed.<br/><br/>Advanced Study: <br/>Students interested in pursuing further study in thermodynamics can take the following course:<br/>ME 325 Kinetic Theory and Statistical Thermodynamics"}, {"name": "Teaching Method", "value": "Lectures: <br/><br/>The course meets four days per week for 50-minute lectures. Topics Include:<br/><br/>Availability analysis<br/>Vapor and gas cycles<br/>Thermodynamic relations<br/>Reactive mixtures and chemical and phase equilibrium<br/>Detailed Syllabus"}, {"name": "Evaluation Method", "value": "Assignments and evaluations methods vary by instructor and may include homework, quizzes, and exams."}, {"name": "Class Materials (Required)", "value": "An Introduction to Thermal Physics, Daniel V. Schroeder, Addison-Wesley, 1st edition, 1999, ISBN 978-0201380279."}], "path": "/class-descriptions/4660/MEAS/MECH_ENG/322-0/31613", "instructor": ["Seth H Lichter"], "class_attributes": "", "id": "31613", "subject": "MECH_ENG"}]