[{"class_mtg_info": [{"meet_t": "TuTh 5:00PM - 6:20PM", "meet_l": "Cresap Laboratory 101"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Fall 2016", "name": "13194", "title": "WCAS LING 380-0-21 Spoken English for Non-Native Speakers", "class_attributes": "", "section": "13194", "instructors": [{"instructor_phone": "", "instructor_name": "Julia Margaret Moore", "instructor_addr": ""}, {"instructor_phone": "", "instructor_name": "Juri   Matsubara", "instructor_addr": ""}], "topic": "Pronunciation", "course": "380-0", "descriptions": [{"name": "Overview of class", "value": "This course focuses on developing and improving oral proficiency in spoken English, with an emphasis on the sound structure of American English used in the American academic environment. The class will address accuracy in pronunciation, stress patterns, intonation and prosody, linking, reduced sounds, and rhythm, as well as higher-level issues such as sociolinguistic, organizational, and strategic competence. Work on these skills will be helpful to students in a variety of academic contexts, including making class presentations, reporting on research at lab meetings, engaging in job interviews, and presenting papers and posters at conferences and colloquia. It is also applicable to teaching, including giving lectures, leading discussion sections or lab sections, and interacting with American undergraduate students. Active participation and evidence of progress towards proficiency must be demonstrated in order to achieve a satisfactory grade in the course."}, {"name": "Registration Requirements", "value": "Instructor consent required"}, {"name": "Learning Objectives", "value": "By the end of this course, students should be able to:<br/> <br/>Describe key features of the sound structure of English, including the articulation of consonants and vowels, word stress, linking, intonation, and prosody.<br/><br/>Prepare and deliver a short presentation in English.<br/><br/>Use instructor and peer feedback to identify their own specific strengths and weaknesses when using spoken English.<br/><br/>Demonstrate progress toward improved proficiency in oral English (intelligibility and effectiveness)."}, {"name": "Teaching Method", "value": "Small group activities, discussion, lecture, online exercises, and presentations."}, {"name": "Evaluation Method", "value": "Class participationHomeworkPresentations"}, {"name": "Class Materials (Required)", "value": "Well Said, 3rd Edition by Linda Grant (ISBN: 978-1-4240-0625-0)"}, {"name": "Class Notes", "value": "Students must complete an online form from English Language Programs in order to be eligible for the class and obtain a permission number. Contact elp@northwestern.edu for specific registration instructions."}], "lmod": "10/30/16 7:07 PM (CT)", "subject": "LING"}]