[{"school": "JOUR", "overview_of_class": "In this class, we will research, report and produce multi-lingual stories on a population largely ignored in mainstream media: Chinese students in the United States. More than 304,000 Chinese students spend more than $10 billion yearly in tuition and others costs in the U.S. Their stories give us insight into the global economy and the power and limit of global connectivity. Families of students from a rural province in China spend life savings on sending children to U.S. colleges, and top communist officials send their kids to Ivy League schools. Along with embracing expanded opportunities, some students struggle with isolation, racism and a fundamental change in identity and career expectations. At one Midwestern university, Chinese students have created a Mandarin sports network and an underground network of businesses - homemade dumplings, Chinese products and services. Online mentoring programs try to attract the money of students who feel isolated in their schools and homestays.<br/><br/>We will study the historical, cultural, economic and social factors that compel Chinese students to travel to the United States and other locations abroad for their education. Much of our reporting will be focused on universities in Illinois, but we will also report on campuses nationwide. Participants in our class will learn about and practice cross-cultural and multi-lingual (English and Chinese dialects) interviewing (with and without translators) and produce multimedia stories. We also will compare and contrast the interests and needs of global audiences, and discuss how different people engage with storytelling in distinct languages and media. Our class will develop pitches and stories in English and Mandarin to be considered for publication by editors from global media outlets, including the New York Times in Mandarin.<br/><br/>Knowledge of a Chinese language is not required, though students who understand and speak Mandarin and Cantonese are encouraged to participate. Some travel will be funded through a Northwestern University innovation grant.", "name": "Special Topics", "section": "20", "location": "Meets in Non-General PurposeRm", "topic": "The Chinese Student Experience: A Multilingual, Mu", "course": "490-0", "meeting_time": ["Mo 1:00PM - 3:50PM"], "path": "/class-descriptions/4660/JOUR/JOUR/490-0/33216", "instructor": ["Mei-Ling   Hopgood Reel"], "class_attributes": "", "id": "33216", "subject": "JOUR"}, {"school": "JOUR", "overview_of_class": "Learn to report and produce visual stories for the web using equipment you already own. This course is geared for students who are not making video their main focus but want to advance their video skill set. The course emphasizes video production basics to accompany and bolster existing reporting skills. You'll become proficient in methodologies for conceiving, creating, assembling, and distributing web-based and social-media-geared video. You'll develop shooting skills while thinking visually, utilizing your phone, DSLR, or camcorder. You'll become comfortable crafting and editing your video using Premiere on your laptop.", "name": "Special Topics", "section": "21", "location": "Meets in Non-General PurposeRm", "topic": "Mobile Web Video Production", "course": "490-0", "meeting_time": ["Mo 6:00PM - 8:50PM"], "path": "/class-descriptions/4660/JOUR/JOUR/490-0/37989", "instructor": ["Ivan Jason Meyers"], "class_attributes": "", "id": "37989", "subject": "JOUR"}, {"school": "JOUR", "overview_of_class": "Each quarter, multidisciplinary teams of students, faculty, and professionals come together to collaborate in the Knight Lab to produce cutting-edge digital work, research, and thought, innovating across every part of the media-making process. The Lab places students together on teams to work on an important problem for the future of media, rapidly moving beyond conversation and hypothesis to well-reasoned action during the quarter. Our process combines user and audience research, design thinking, critical and analytical work, iterative building, storytelling, new technology, and a healthy dose of experimentation?often within the confines of a single, specific problem. Projects are open by application. Spring 2017 includes projects on virtual reality, 3D photography, audience engagement, environmental reporting using sensors to measure air quality, and data explorations. Partners include ProPublica and Public Good Software. Full project details and application available at knightlab.com/class.", "name": "Special Topics", "section": "22", "location": "Fisk Hall 111", "topic": "Knight Lab", "course": "490-0", "meeting_time": ["TuTh 10:00AM - 11:50AM"], "path": "/class-descriptions/4660/JOUR/JOUR/490-0/33218", "instructor": ["Zach   Wise", "Emily Lauren Withrow"], "class_attributes": "Registration is By Application Only<br/><br/>", "id": "33218", "subject": "JOUR"}, {"school": "JOUR", "overview_of_class": "In this course, you will focus on an important facet of journalism: investigating potentially wrongful convictions. This class isn't about theory; it's about pursuing the truth about real murder cases, interviewing skittish sources in often tough neighborhoods and prisoners serving time?sometimes decades?for crimes they say they didn't commit. You will be introduced to a variety of investigative techniques, interviewing skills, approaches to developing sources and employing public records and databases. Of paramount importance in this class: your safety and adhering to the highest ethical<br/><br/>standards in journalism. You are expected to devote a tremendous amount of time in the field?weekdays and weekends?doing real shoe-leather journalism, knocking on doors, digging for information and determining whether there has been a miscarriage of justice. Keep in mind: Investigative reporting is hard. Expect to confront roadblocks. Anticipate spinning your wheels. There will be frustrations and setbacks. And along the way, hopefully, you will learn to think like an investigative reporter, you will learn by doing and you will do it by the most honorable methods and, so, come closer to discovering the truth?whatever that truth is. Prof. Klein is assisted in class by a licensed private detective and a research associate who works for The Medill Justice Project. Please see www.medilljusticeproject.org for more information.", "name": "Special Topics", "section": "24", "location": "Fisk Hall 307", "topic": "Medill Justice Project", "course": "490-0", "meeting_time": ["Tu 2:00PM - 4:50PM"], "path": "/class-descriptions/4660/JOUR/JOUR/490-0/33220", "instructor": ["Alec M Klein"], "class_attributes": "Registration is By Application Only<br/><br/>", "id": "33220", "subject": "JOUR"}, {"school": "JOUR", "overview_of_class": "Embedded reporting with science field research teams takes students for four to six weeks in the field to follow the retreat of the glaciers in Mongolia and Greenland, the impact of rising sea levels in the Yucatan and the source of much-needed thunderstorms on the Great Plains (a detective search that involved more than 100 scientists and teams from NOAA and NASA). Students also join science research facilities at CERN, in Munich and New Zealand and at other locations. This two-credit capstone course begins with seminars on field reporting strategies and on building narrative and visual stories from field experiences, sources and data. We also pitch stories in advance to major media partners prior to your departure. You file blogs, photos and stories for publication from the field. Once you return, you produce major in-depth narrative stories with photos and graphics and/or multimedia stories, working closely with your instructor. Students choosing to embed at a Washington D.C. site such as NIH can complete story production in D.C. or return to Chicago. We have some funding for embedded reporting to help offset travel expenses.", "name": "Special Topics", "section": "25", "location": "Meets in Non-General PurposeRm", "topic": "Science Field Research Reporting", "course": "490-0", "meeting_time": ["TBA"], "path": "/class-descriptions/4660/JOUR/JOUR/490-0/33221", "instructor": ["Abigail M Foerstner"], "class_attributes": "", "id": "33221", "subject": "JOUR"}, {"school": "JOUR", "overview_of_class": "Sports Marketing provides an in-depth look at concepts and methods in marketing communications for brands within the sports environment. Sports marketing includes topics such as acquisition and retention of fans, celebrity management, event execution, crisis interventions, sponsorship and partnerships, ticket pricing, social media and digital innovation, tie-ins between teams and retail, and understanding the business of sports. Students will develop an understanding of how marketing works in sports through readings, guest lectures, case analysis and discussions. The course will help students understand how to make decisions in ambiguous sports marketing environments, using financial and market analysis, and considering legal and ethical concerns.", "name": "Special Topics", "section": "26", "location": "McCormick Foundation Ctr 3107", "topic": "Sports Marketing", "course": "490-0", "meeting_time": ["We 6:00PM - 8:50PM"], "path": "/class-descriptions/4660/JOUR/JOUR/490-0/33222", "instructor": ["Candy   Lee"], "class_attributes": "", "id": "33222", "subject": "JOUR"}, {"school": "JOUR", "overview_of_class": "Technology shapes the way we tell stories, consistently presenting new challenges for modern journalists. From the way we present complex data on mobile screens, to building out immersive 360-degree environments for our audiences to explore, we must consider each technology carefully and assess what it brings to the story. Working with Knight Lab techniques and in the Device Lab, students in Applied Technology in Journalism will explore how to report and present stories using various technologies?from exploring programming languages such as JavaScript to emergent presentations such as VR (Virtual Reality) or VUI (voice user interfaces). Students will learn the basics of interactive storytelling through an in-depth study of nonlinear narrative structure, while learning to build their own stories during hands-on story-development labs.", "name": "Special Topics", "section": "27", "location": "Meets in Non-General PurposeRm", "topic": "Applied Technology in Journalism", "course": "490-0", "meeting_time": ["Th 10:00AM - 12:50PM"], "path": "/class-descriptions/4660/JOUR/JOUR/490-0/36522", "instructor": [""], "class_attributes": "", "id": "36522", "subject": "JOUR"}]