[{"class_mtg_info": [{"meet_t": "MoWeFr 10:00AM - 10:50AM", "meet_l": "Kresge 3354 German Seminar Rm."}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: PRE-REG only: Reserved for German majors.", "qtr": "Spring 2017", "name": "30906", "title": "WCAS GERMAN 115-0-20 Intensive Beginning German through Musical Journeys in Vienna", "class_attributes": "", "section": "30906", "instructors": [{"instructor_phone": "847/491-8290", "instructor_name": "Ingrid   Zeller", "instructor_addr": "1880 Campus Drive, Kresge Hall, Rm 3319"}], "topic": "Musical Journeys in Vienna", "course": "115-0", "descriptions": [{"name": "Overview of class", "value": "The course is intended for students from all disciplines who want to develop basic German language skills! The goals of the course include the acquisition of speaking, writing, reading, and listening skills in German, the building of a general vocabulary, and a foundation in grammar. Students in the course will also become acquainted with the rich musical culture of the European metropolis Vienna. Activities will draw on the lives and works of classical as well as contemporary and popular composers, including Mozart, Beethoven, Schubert, and Falco. Besides discussing excerpts from musical works such as Die Zauberflöte by Wolfgang Amadeus Mozart, Die Fledermaus by Johann Strauss, Jr., Lieder by Schubert and selected popular music, we will read short biographies, letters, poetry and prose, study maps and paintings, watch the film Amadeus and videos, and learn about historical events, art, and culture in Vienna and German-speaking Europe!"}, {"name": "Registration Requirements", "value": "None"}, {"name": "Teaching Method", "value": "Class participation, Discussion, Films/videos, Group work, Presentations, Readings, Simulation/role-play, Writing assignments"}, {"name": "Evaluation Method", "value": "Attendance, Class participation, Group work, Homework, Online work, Presentations, Final project, Quizzes, Simulation/role-play, Writing assignments"}, {"name": "Class Materials (Suggested)", "value": "Course Reader"}], "lmod": "2/8/17 6:42 PM (CT)", "subject": "GERMAN"}]