[{"class_mtg_info": [{"meet_t": "Tu 2:00PM - 4:50PM", "meet_l": "2122 Sheridan Rd Classroom 232"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Winter 2016", "name": "26488", "title": "WCAS AF_AM_ST 403-0-20 Theorizing Blackness and Diaspora", "class_attributes": "", "section": "26488", "instructors": [{"instructor_phone": "847/467-0448", "instructor_name": "Nitasha Tamar Sharma", "instructor_addr": "Crowe Hall 5-131"}], "topic": "", "course": "403-0", "descriptions": [{"name": "Overview of class", "value": "This core course in African American Studies offers students an historical, thematic, and comparative analysis of the literature and theories of diaspora and Blackness. More accurately, the course title should be &quot;Theorizing Blackness and Diasporas,&quot; as we unsettle the notion of fixed and singular diasporas for any group of people. Through a combination of articles and books, we will analyze race through the concept of &quot;Blackness&quot; alongside theories of diaspora that originated to describe Armenian as well as Jewish dispersal, settlements, and community formation. This course takes a comparative approach to both race and diaspora, as we analyze the transnational circulation of commodities, culture, and people within African, South Asian, and other diasporas across the hemispheres. Ultimately, students will become versed in the debates and theories of &quot;diaspora&quot; and &quot;Blackness&quot; in order to develop their own understanding of their relation to one another."}, {"name": "Teaching Method", "value": "DiscussionLectureclass presentations"}, {"name": "Evaluation Method", "value": "Tentative grading includes: c. 25% for oral presentations, c. 75% for written assignments"}, {"name": "Class Materials (Required)", "value": "The required readings includes some of the texts from the online course description and the required comprehensive reading lists. They will include a combination of books and articles for an average reading load of one book per week."}], "lmod": "1/9/16 6:42 PM (CT)", "subject": "AF_AM_ST"}]