[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Harris Hall L28"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "33295", "title": "WCAS ENGLISH 378-0-20 Studies in American Literature", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "33295", "instructors": [{"instructor_phone": "", "instructor_name": "Betsy J Erkkila", "instructor_addr": ""}], "topic": "Whitman and the Democratic Imaginary", "course": "378-0", "descriptions": [{"name": "Overview of class", "value": "This course will focus on the intersections between democratic revolution and revolutionary poetics in Walt Whitman's writings. We will focus in particular on the Whitman's democratic experiments with the language, style, and forms of poetry, and his daring representation of such subjects as the dignity of labor and the working classes, the body, sex, race, technology, comradeship, war, America, the globe, and the cosmos. We will begin by exploring the sources of Whitman's 1855 Leaves of Grass in the social and political struggles of his time. We will consider the fascinating intersections between personal and political crisis, homoeroticism and poetic experimentation in the 1860 Leaves of Grass. We will also look at Whitman's attempts to find new forms to give voice to the simultaneous carnage and intimacy of the Civil War as the first modern war in Drum-Taps and Sequel (1865). And we will conclude by reflecting on Whitman's struggle in his later writings to reconcile the revolutionary dream of democracy with a post-Civil War world increasingly dominated by the unleashed forces of economic expansion, materialism, selfism, and greed. The course will end with readings of poets and writers from Ginsberg to Neruda in the United States and elsewhere who continue to &quot;talk back&quot; to Whitman."}, {"name": "Teaching Method", "value": "Lecture and discussion."}, {"name": "Evaluation Method", "value": "Essay (3-4 pages); essay (8-10 pages); final examination."}, {"name": "Class Materials (Required)", "value": "Walt Whitman: Poetry and Prose. Available at Norris Bookstore."}], "lmod": "2/20/17 6:45 PM (CT)", "subject": "ENGLISH"}]