[{"class_mtg_info": [{"meet_t": "MoWe 1:00PM - 1:50PM", "meet_l": "Kresge Centennial Hall 2-415"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "20546", "title": "WCAS GERMAN 230-0-20 Berlin and the Culture of Democracy", "class_attributes": "Historical Studies Distro Area<br/><br/>Interdisciplinary Distro - See Rules<br/><br/>Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "20546", "instructors": [{"instructor_phone": "847/467-5173", "instructor_name": "Anna Maree Parkinson", "instructor_addr": "Kresge Hall, Rm 3321, 1880 Campus Drive"}], "associated_classes": [{"component": "DIS", "room": "Fisk Hall 114", "meeting_time": "Fr 1:00PM - 1:50PM"}, {"component": "DIS", "room": "Kresge Centennial Hall 2-425", "meeting_time": "Fr 1:00PM - 1:50PM"}], "topic": "", "course": "230-0", "descriptions": [{"name": "Overview of class", "value": "This class aims to introduce students to the history and culture of Berlin from 1900 to the present. Drawing on a wide range of media, from maps through film to music, the class concentrates on a series of transformative moments in German cultural history seen through the prism of Berlin. Students will engage with the varied historical, socio-political, and artistic changes in German culture throughout the twentieth century, including the vibrant and provocative culture of the 1920s and early 1930s, with a focus on changing forms of gender identity (the &quot;New Woman&quot;) and sexual subcultures (as in the film Cabaret). Further, students will examine the everyday and extraordinary history of German-Jews in Germany around the devastating caesura of the Jewish genocide executed by the National Socialists. After examining the megalomaniacal plans that the Nazis made for Berlin, the class turns to the devastated city of 1945 and the divided city of the Cold War, where the conflict between &quot;East&quot; and &quot;West&quot; emerges in the &quot;concrete&quot; form of the Berlin Wall. The final weeks concentrate on the events surrounding the collapse of the Wall and the creation of the Berlin Republic. Students will also encounter the changing face of national culture in light of the migration of the so-called Turkish &quot;guest workers&quot; of the post-War years, particularly through the art of later generations of Turkish-German authors and filmmakers in Berlin. In addition to reading major works of 20th-century literature, students will engage with visual media, in particular film, photography, and other visual art, to acquire a sense of the breathtaking scope of change in the urban context peculiar to twentieth century Berlin. Field trips to Berlin-related events in larger Chicago are an integral part of the syllabus. This course will demonstrate why cosmopolitan Berlin continues to attract attention and remains a magnetic international destination with a biography and personality all its own."}, {"name": "Registration Requirements", "value": "Course is taught entirely in English"}, {"name": "Learning Objectives", "value": "? Evaluate and discuss twentieth-century German (central European) history, beginning with the years immediately preceding WWI and ending with contemporary Berlin<br/>? Elaborate different approaches to the metropolis of Berlin and the idea of cosmopolitanism<br/>? Critically articulate diverse representations of gender and sexuality in the urban context of twentieth century Berlin<br/>? Elaborate aspects of the history of minority communities in Berlin (Jewish and Turkish in particular) <br/>? Define shifts in literary culture from the turn of the twentieth century to recent postmodernism<br/>? Experience and assess the change in the media landscape with the development of modern technologies of reproduction via photography, sound recordings, and films associated with Berlin"}, {"name": "Teaching Method", "value": "Discussion section: One 50-minute discussion session each Friday<br/>Field trips: At least one fieldtrip (dependent on cultural events on offer)<br/>Guest speakers: Speakers from a range of different fields across campus<br/>Lecture: Two 50-minute lectures per week (Mon and Wed)<br/>Readings: For each class (literary, theoretical, historical, and political)<br/>Writing assignments: At least three short papers, writing workshop<br/>"}, {"name": "Evaluation Method", "value": "Attendance: 5%<br/>Discussion section: 10%<br/>Exam, final: 15%<br/>Exam, mid-term: 10%<br/>Papers: 10 + 15 + 20 = 45%<br/>Quizzes: 3 x 5 = 15%<br/>"}, {"name": "Class Materials (Required)", "value": "? David Clay Large, Berlin. Basic Books. 2001. ISBN: 046502632X $26.95 (new on amazon.com)<br/>? Irmgard Keun, The Artificial Silk Girl. Other Press, 2011. (ISBN: 1590514548) $17.95 (new on amazon.com) <br/>? Additional materials will be made available through Canvas"}, {"name": "Class Notes", "value": "? Distribution numbers: IV, VI"}], "lmod": "12/24/16 6:59 PM (CT)", "subject": "GERMAN"}]