[{"class_mtg_info": [{"meet_t": "Tu 9:30AM - 12:20PM", "meet_l": "Locy Hall 318"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "27201", "title": "WCAS GBL_HLTH 390-0-24 Special Topics in Global Health", "class_attributes": "No Freshmen<br/><br/>", "section": "27201", "instructors": [{"instructor_phone": "847/467-2780", "instructor_name": "Noelle   Sullivan", "instructor_addr": "1812 Hinman Avenue, #303, Evanston"}], "topic": "HIV/AIDS in Africa", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "Most recent class description: This course explores challenges and politics surrounding HIV/AIDS in Africa. It considers four major themes: the historical and contemporary methodologies and debates surrounding HIV/AIDS research and intervention in Africa; the experience of living in the context of HIV/AIDS (including issues of gender, emotion, sexuality, diverse ideas about healing); the politics of HIV/AIDS; and HIV/AIDS and health infrastructures. Questions considered during the course will include: what are the trends in research methodologies relating to HIV/AIDS in Africa? What is known or well understood about HIV/AIDS in Africa, and what as yet is not well understood? What are the politics of the disease? How have large externally-funded programs shaped the ways that the disease is thought about, treated, and experienced? What does it mean to live in the context of HIV/AIDS, whether afflicted or affected by it? How do issues such as gender roles, love, ideas about health, desires for the future, and daily livelihood struggles shape how people think about HIV/AIDS in their daily lives? Overall, students will be asked to move beyond the statistics and epidemiology of the epidemic, and adopt a critical lens in order to understand the complexities of HIV/AIDS programs and experiences in Africa, and the politics of global health interventions more generally."}, {"name": "Class Materials (Required)", "value": "Course pack from Quartet<br/>Scrambling for Africa: AIDS, Expertise, and the Rise of Global Health Science (Johanna Crane)<br/>Love in the Time of AIDS: Inequality, Gender, and Rights in South Africa (Mark Hunter)<br/>Second Chances: Surviving AIDS in Uganda (Susan Reynolds Whyte)"}], "lmod": "1/9/16 6:47 PM (CT)", "subject": "GBL_HLTH"}]