[{"school": "WCAS", "overview_of_class": "In this capstone seminar, we explore how slavery as an institution has been a feature of global human societies since antiquity. We will examine various forms of captivity, servitude, and slavery-from the ancient world to the New World-we will explore competing and sometimes overlapping ideas and practices of slavery, look at debates about the nature and meaning of slavery, consider how iterations of the ideologies and practices of slavery and servitude manifested in sites less familiar in the American imagination. Taking a long view approach to &quot;slavery&quot; will help expand our conceptualization of the institution to a global scale. We will also engage material about the linkages and shifts between older forms of captivity and bonded labor and what scholars deem &quot;modern slavery&quot; as a result of new and radically evolving technologies. We will examine issues of human trafficking, sex trafficking, and child labor in tandem with the role that new technologies play in facilitating/foreclosing these forms of bonded and forced labor.", "name": "Integrating Project Seminar", "section": "20", "topic": "Slavery in Global Relational Perspective", "course": "395-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4650/WCAS/INTL_ST/395-0/24262", "instructor": ["Sureshi Madhuka   Jayawardene"], "id": "24262", "subject": "INTL_ST"}, {"school": "WCAS", "overview_of_class": "In a world of rapidly changing technologies, consumers and their commodities are now central to economic growth in most parts of the world. Consumer spending remains resilient, accounting for the bulk of economic activity in the world's largest economies. Where do the resources come from to sustain such growth? And for whom? What are the conditions that facilitated this current social, political economic climate? This course will explore different approaches to the study of consumption and the processes that entangle people and objects together on a global scale. Throughout the course we will examine how consumption practices shape the modern world by emphasizing its impact on individual behaviors, the environment, the economy and public policy. This class will address a wide variety of processes involved in the creation, exchange and consumption of commodities in a global historical context. Special attention will be paid to labor and social identities that are intricately tied to consumer practices and material objects.", "name": "Integrating Project Seminar", "section": "21", "topic": "Consumption &amp; Commodities in a Global Perspective", "course": "395-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4650/WCAS/INTL_ST/395-0/24263", "instructor": ["Khadene Kharla-Ann   Harris"], "id": "24263", "subject": "INTL_ST"}]