[{"class_mtg_info": [{"meet_t": "TuTh 4:00PM - 5:20PM", "meet_l": "Annenberg Hall 345"}], "school": "SESP", "overview_of_class": "This course will introduce students to social policy through a broad overview of some of the major social welfare programs in the U.S. and an assessment of the underlying values that contribute to their evolution.  In addition, we will examine the processes by which social policies are developed and refined. A substantial portion of the course will be devoted to social welfare policies designed to realize our national aspiration to secure equal opportunity for all Americans as well as to moderate what may be deemed unacceptable inequalities of wealth. Students will explore the interaction of various policies and programs including Social Security, welfare reform, taxation, child care subsidies, early childhood education, public education, as well as Medicare, Medicaid and the Obama Administration's Patient Protection and Affordable Care Act of 2010. Each student will be given the opportunity to delve more deeply into the complexities of a specific policy of his/her choice, and will in the process develop skills to analyze and offer recommendations for policy improvement.", "qtr": "Winter 2016", "name": "Introduction to Social Policy", "title": "SESP SOC_POL 201-0-20 Introduction to Social Policy", "lmod": "1/9/16 6:41 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Marvin R Cohen", "instructor_addr": ""}], "topic": "", "course": "201-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "This course will introduce students to social policy through a broad overview of some of the major social welfare programs in the U.S. and an assessment of the underlying values that contribute to their evolution. In addition, we will examine the processes by which social policies are developed and refined. A substantial portion of the course will be devoted to social welfare policies designed to realize our national aspiration to secure equal opportunity for all Americans as well as to moderate what may be deemed unacceptable inequalities of wealth. Students will explore the interaction of various policies and programs including Social Security, welfare reform, taxation, child care subsidies, early childhood education, public education, as well as Medicare, Medicaid and the Obama Administration's Patient Protection and Affordable Care Act of 2010. Each student will be given the opportunity to delve more deeply into the complexities of a specific policy of his/her choice, and will in the process develop skills to analyze and offer recommendations for policy improvement."}, {"name": "Teaching Method", "value": "Students will be expected to become familiar with the basic purposes and constructs of contemporary social policy. <br/><br/>In addition to the assigned readings and lectures, a number of shorter individual and group assignments will be given with detailed instructions and deadlines.<br/><br/>Each student is required to write a term paper (10 - 14 pages in length) on a topic of her or his choice. <br/><br/>Students are expected to attend and participate in all class sessions. <br/><br/>There will be two essay exams. A mid-term exam will be taken in class. The final will be a take-home exam."}, {"name": "Evaluation Method", "value": "Note: Assuming that a student fully participates in all aspects of this course, the student's final grade will generally be reflective of his/her best efforts, rather than premised on an uncompromising, mathematical formula. In this spirit, the following depiction of class activities can be relied upon as a rough estimate of how final grades will be determined.<br/><br/>Class participation, group assignments, and class presentations 20%<br/>Short assignments 10%<br/>Term Paper 30%<br/>Mid-term exam 20%<br/>Final exam 20%"}, {"name": "Class Materials (Required)", "value": "1) American Dream: Three Women, Ten Kids, and a Nation's Drive to End Welfare. 2004. Jason DeParle. New York, Viking<br/>2) Class and Schools: Using Social, Economic, and Educational Reform to Close the Black-White Achievement Gap. 2004. Richard Rothstein. Washington, D.C., Economic Policy Institute. <br/>3) Nickel and Dimed: On (Not) Getting By in America. 2001. Barbara Ehrenreich. New York, New York, Henry Holt and Company, LLC. <br/>4) Social Insurance: America's Neglected Heritage and Contested Future, 2014, Theodore R. Marmor et al, CQ Press<br/>5) The New Jim Crow. 2010. Michelle Alexander, New York, The New Press <br/>6) What Government Can Do: Dealing with Poverty and Inequality. 2000. Benjamin I. Page and James R. Simmons. Chicago, University of Chicago Press.<br/>7) Course Packet available at Quartet"}, {"name": "Class Materials (Suggested)", "value": "A Hope in the Unseen: An American Odyssey from the Inner City to the Ivy League.1998. Ron Suskind. New York, Broadway Books.<br/><br/>A Necessary Evil: A History of American Distrust of Government. 1999. Garry Wills. New York, Simon and Schuster.<br/><br/>Agendas, Alternatives, and Public Policies. 1995 (2nd Edition). John W. Kingdon. New York, Longman - Addison Wesley Longman, Inc. <br/><br/>The Conscience of a Liberal. 2007. Paul Krugman. New York, W.W. Norton and Company.<br/><br/>The Death and Life of the Great American School System, 2010, Diane Ravitch, Basic Books, New York.<br/><br/>Early Childhood Interventions: Proven Results, Future Promise. 2005. Lynn A. Karoly, M. Rebecca Kilburn and Jill S. Cannon. Santa Monica, California. Rand Corporation.<br/><br/>The End of Poverty: Economic Possibilities for Our Time. 2005. Jeffrey D. Sachs. New York, The Penguin Press.<br/><br/>Fads, Fallacies and Foolishness in Medical Care Management and Policy. 2007. T. R. Marmor, editor. New Jersey, World Scientific.<br/><br/>From Neurons to Neighborhoods: The Science of Early Childhood Development. 2000. Jack P. Shonkoff and Deborah A. Phillips, Editors. National Research Council and Institute of Medicine. Washington, D.C. National Academy Press.<br/><br/>The Healing of America: A global Quest for Better, Cheaper, and Fairer Health Care. 2009. T. R. Reid. New York. The Penguin Press.<br/><br/>Higher Ground: New Hope for the Working Poor and Their Children. 2007. Greg J. Duncan, Aletha C. Huston and Thomas S. Weisner. New York, N.Y., Russell Sage Foundation.<br/><br/>It Takes a Nation: A New Agenda for Fighting Poverty. 1997. Rebecca M. Blank. Princeton, New Jersey, Princeton University Press. <br/>Pinched: How the Great Recession Has Narrowed Our Futures &amp; What We Can Do About It, 2011, Don Peck, New York, Crown Publishers.<br/><br/>The Marriage Cure: Is wedlock really a way out of poverty? The New Yorker, August 18, 2003. Found on the website of the New America Foundation listed under the writings of senior fellow, Katherine Boo.<br/><br/>The Medicare Bind, The American Prospect, November 2011, pp. 24 - 35.<br/><br/>Racial Inequality and the Black Ghetto in Poverty &amp; Race, November/December 2004, Alexander Polikoff. <br/><br/>Saving Social Security: A Balanced Approach. 2004. Peter A. Diamond and Peter R. Orszag. Washington, D.C. Brookings Institution Press.<br/><br/>School `Reform': A Failing Grade, Diane Ravitch in The New York Review of Books, September 29, 2011, pp, 32 - 35.<br/><br/>The Collapse of American Criminal Justice, 2011, William J. Stuntz, The Belknap Press of Harvard University<br/><br/>The Second Bill of Rights: FDR's Unfinished Revolution and Why We Need It More Than Ever. 2004. Cass R. Sunstein. New York, Basic Books.<br/><br/>The Shame of the Nation: The Restoration of Apartheid Schooling in America. 2005. Jonathan Kozol. New York: Crown Publishers. <br/><br/>Social Security: The Phony Crisis. 1999. Dean Baker and Mark Weisbrot. Chicago: University of Chicago Press.<br/><br/>The Spirit Level: Why Greater Equality Makes Societies Stronger, 2009, Richard Wilkinson and Kate Pickett, Bloomsbury Press, New York.<br/><br/>The State of Working America 2006/2007. Lawrence Mishel, Jared Bernstein and Sylvia Allegretto. Economic Policy Institute. Ithaca, N.Y. Cornell University Press.<br/><br/>There Are No Children Here. 1991. Alex Kotlowitz. New York, Doubleday.<br/><br/> &quot;They Take Our Jobs&quot; and 20 other myths about immigration 2007. Aviva Chomsky. Boston, Beacon Press.<br/><br/>The Truly Disadvantaged: The Inner City, the Underclass, and Public Policy. 1987. William Julius Wilson. Chicago, University of Chicago Press. <br/><br/>Why School? Reclaiming Education for All of Us. 2009. Mike Rose. New York: The New Press.<br/><br/>The Working Poor: Invisible in America. 2005. David K. Shipler. New York, Vintage."}], "path": "/class-descriptions/4610/SESP/SOC_POL/201-0/26947", "instructor": ["Marvin R Cohen"], "class_attributes": "", "id": "26947", "subject": "SOC_POL"}]