[{"school": "WCAS", "overview_of_class": "This course explores historical formation of cities and citizens in the Middle East and the US since the 19th century by focusing on urban changes in Istanbul, Cairo and Chicago. We focus these global metropolitans to examine how urban space has reconfigured through histories of natural and man-made disasters, politics and economy. Urbanization, informality, gendered places, consumption, urban regeneration, local politics, crime and branding the city are some of the themes of our discussion. We study these themes in relation to two main questions: How do spatial changes engender new social practices and redefine cultural difference and vice versa?; How do power struggles at the intersection of local and global interests shape urban change? We try to answer these questions by drawing on readings in history, anthropology and sociology disciplines. The course will be of interest for history, sociology, anthropology, political science and urban studies majors, who are interested in learning about the politics, society and economy in Turkey and Egypt in comparison to urban trends in the US.", "name": "Topics in Sociological Analysis", "section": "20", "location": "Annenberg Hall 101", "topic": "Cities and Citizens", "course": "376-0", "meeting_time": ["Fr 12:00PM - 2:50PM"], "path": "/class-descriptions/4660/WCAS/SOCIOL/376-0/35568", "instructor": ["Ayca   Alemdaroglu"], "class_attributes": "", "id": "35568", "subject": "SOCIOL"}, {"school": "WCAS", "overview_of_class": "This undergraduate course examines connections between the natural environment, politics, and society across the global North and South. We will begin by discussing theories of environment-society relations in sociology and what we mean by \"environmental problems\" and \"environmental values.\" The remainder of the course will be organized into three substantive sections, on varieties of environmentalism; environment and development; and environment, inequality, and social justice. As we go through the readings, we will consider major themes such as the rise of organized collective action like environmental activism and individual responses like green consumerism and \"freeganism\"; the opportunities and limitations of institutional and policy responses to environmental degradation; the tensions between environmental protection and economic development; the relationship between environmental degradation and inequality within and among countries; and the roles of scientific knowledge and non-expert knowledge in making sense of environmental problems and solutions. Our substantive case studies will cover topics like water, energy, waste, and climate change.", "name": "Topics in Sociological Analysis", "section": "21", "location": "University Hall 121", "topic": "Environment, Politics, and Society", "course": "376-0", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4660/WCAS/SOCIOL/376-0/35569", "instructor": ["Maria   Akchurin"], "class_attributes": "", "id": "35569", "subject": "SOCIOL"}, {"school": "WCAS", "overview_of_class": "The remarkable transformation of HIV/AIDS from an inevitable death sentence to a manageable chronic illness in well-resourced countries like the United States is one of the most noteworthy scientific achievements of the past 35 years. Recent medical advances have made the goal of an AIDS-free generation plausible in the US, and the epidemic commands less and less public attention. Yet the rate of new HIV infections in the US hovers stubbornly at approximately 50,000/year, and HIV/AIDS is widely recognized as not only a medical epidemic but also a manifestation of complex inequalities at the intersections of race, class, gender, and sexuality. In this advanced undergraduate seminar, students will develop an in-depth understanding of the scope and dimensions of HIV/AIDS in the United States and abroad and consider the role of race, class, gender, and sexuality in the epidemic. We will also explore how social movements, public policies, and cultural representations (film, art, media, public debate, etc) have played integral roles in the epidemic and the response.", "name": "Topics in Sociological Analysis", "section": "23", "location": "Locy Hall 214", "topic": "Sociology of HIV/AIDS", "course": "376-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4660/WCAS/SOCIOL/376-0/35571", "instructor": ["Celeste Michele Watkins-Hayes"], "class_attributes": "", "id": "35571", "subject": "SOCIOL"}, {"school": "WCAS", "overview_of_class": "According to the latest statistics, the United States is home to over 55.5 million \"Latinos\" and \"Hispanics.\" In 2000, this population became the largest \"minority group\" in the country. Demographers forecast that within the century, this population will reach close to 100 million. Considerable popular and academic debate has ensued about the meaning and significance of these demographic trends. For some, Latino population growth represents a major domestic threat, and for others it is a beneficial and welcomed development. Implicated in these debates, but rarely discussed, is the sociohistorical and political process by which diverse and heterogeneous Latin American-descent communities came be imagined and understood as comprising a panethnic whole. In this course, we will examine this process with an analytic focus on the intersection of politics, race, and knowledge production.", "name": "Topics in Sociological Analysis", "section": "24", "location": "Locy Hall 111", "topic": "Race, Knowledge, and Latinidad", "course": "376-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4660/WCAS/SOCIOL/376-0/35572", "instructor": ["Michael D Rodriguez"], "class_attributes": "", "id": "35572", "subject": "SOCIOL"}, {"school": "WCAS", "overview_of_class": "This course explores the construction of gender in the Middle East. Drawing on the historical, sociological and anthropological research in the region, the course aims to question stereotypes about the subordination of Muslim women and to offer a systematic reading and an analytical discussion of the political, economic and cultural structures that inform gender relations and sexuality. The course starts with an examination of early Islam and religious sources with regard to women's status, then moves on to nationalist and modernization movements in the 19th and 20th centuries, and finally focuses on women and men's lives in contemporary Egypt, Turkey and Iran. In this framework, special attention is given to Islamist mobilizations, the family, sexuality, neoliberalism, women's labor and LGBT.", "name": "Topics in Sociological Analysis", "section": "25", "location": "Kresge 4531 MENA Seminar Rm", "topic": "Gender & Sexuality in the Middle East", "course": "376-0", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4660/WCAS/SOCIOL/376-0/35573", "instructor": ["Ayca   Alemdaroglu"], "class_attributes": "", "id": "35573", "subject": "SOCIOL"}]