[{"class_mtg_info": [{"meet_t": "Tu 6:00PM - 8:50PM", "meet_l": "303 E. Wacker Dr. 1623"}], "school": "JOUR", "enrl_requirement": "Enrollment Requirements: Only students in the MSJ program may enroll in these classes", "qtr": "Winter 2017", "name": "23866", "title": "JOUR JOUR 480-0-20 Special Topics", "class_attributes": "", "section": "23866", "instructors": [{"instructor_phone": "", "instructor_name": "Douglas M Foster", "instructor_addr": ""}], "topic": "Magazine Mashup", "course": "480-0", "descriptions": [{"name": "Overview of class", "value": "This course provides an overview of narrative strategies in the rapidly changing (and expanding) world of magazine journalism. It's designed as a dynamic place for students to read, view, and reflect upon storytelling approaches used by the best online and print reporters, editors and producers. How do they identify essential elements of a short piece, column, or full-length feature? Why do they curate material in particular ways to create a sense of identity &quot;bigger than the sum of the parts?&quot; What's expected in proposals from writers and producers who want to pursue a major project? In each meeting we'll engage directly on these questions, in person and via Skype, with top writers, producers, editors, and publishers. In brief exercises undertaken in class we'll also explore key elements of persuasive storytelling. The course is intended as the gateway for magazine-inclined students looking for a coherent three-quarter sequence: Magazine Mashup, Magazine Writing, and/or Magazine Editing, and the Narrative Capstone. It's designed to be useful for any student, no matter choice of specialization or medium, looking for a chance to think and reflect on the elements of good storytelling before employing those techniques in the second half of the program.<br/><br/>Highly recommended for students planning to take Magazine Writing and/or Magazine Editing in the third quarter, and for those considering Narrative or Documentary as a Capstone."}], "lmod": "12/29/16 6:45 PM (CT)", "subject": "JOUR"}]