[{"school": "WCAS", "overview_of_class": "Governments of all levels play an essential role in individual's day-to-day life, such as education, transportation, health and welfare. Some of the questions to be addressed in the course include but are not limited to the following: <br/>What are the roles of governments? How do government policies impact individual decision making and vise versa? Under what situation is the government intervention desirable? What are the reasons for different levels of governments, such as federal, state, and local governments? <br/>The goal of this course is to acquaint students with various aspects of government sectors and give students the ability to critically evaluate current policy debates.", "name": "First-Year Seminar", "section": "20", "location": "University Hall 312", "topic": "Government and You", "course": "101-6", "meeting_time": ["TuTh 9:30AM - 10:50AM"], "path": "/class-descriptions/4640/WCAS/ECON/101-6/11269", "instructor": ["Jannet K Chang"], "class_attributes": "", "id": "11269", "subject": "ECON"}, {"school": "WCAS", "overview_of_class": "In this seminar, we will look into the many different facets of the economics of gender. We will learn about economic decisions that individuals and households face from a unique gender perspective and ask ourselves: do women and men behave differently in economic circumstances? The topics we will cover include, among others: the status of women around the world, education, marriage, fertility, labor supply, bargaining power, and discrimination. For each topic, we will study concrete examples emanating from all over the world. Students will learn to use a wide variety of academic and not-so-academic resources (including empirical research articles, ethnographic descriptions, and popular press books).", "name": "First-Year Seminar", "section": "30", "location": "University Hall 318", "topic": "Why Gender Matters in Economics", "course": "101-6", "meeting_time": ["MoWe 9:30AM - 10:50AM"], "path": "/class-descriptions/4640/WCAS/ECON/101-6/11270", "instructor": ["Sara   Hernandez"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "11270", "subject": "ECON"}, {"school": "WCAS", "overview_of_class": "The rapid development of new technologies forces us to frequently revisit two age-old questions. First, how should we decide whether to adopt a cutting edge product for which the benefits and costs (perhaps in terms of compromised privacy, autonomy, security and ethics) are somewhat unknown? Second, to what degree should government regulators protect consumers of new goods and services? In this seminar, we will consider a range of government interventions - including laissez faire, paternalistic nudges, and the Nanny State - and explore ways various economic actors try to influence policy and adapt to an ever-changing economic environment. Our discussions will focus on topics such as drones and driverless vehicles, smart appliances and the Internet of Things, 3-D printing, virtual reality, sharing economy apps (Uber, Airbnb, TaskRabbit), performance enhancing drugs and implants, CRISPR and de-extinction, cybersecurity, police body cameras and wearables, space tourism and exploration, Bitcoin, nanobots, and other sci-fi ideas that have become reality.", "name": "First-Year Seminar", "section": "40", "location": "University Hall 118", "topic": "Regulating New Technologies", "course": "101-6", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4640/WCAS/ECON/101-6/11271", "instructor": ["James Andrew Hornsten"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "11271", "subject": "ECON"}, {"school": "WCAS", "overview_of_class": "The goal of this course will be to learn the basic tools of game theory and use them to explore various topics including sports, politics, and evolutionary biology. During class students will participate in \"economic experiments\" where they will interact strategically with each other to see how well theory matches actual outcomes. We will discuss what such experiments reveal about economic models of decision-making and strategic interaction.", "name": "First-Year Seminar", "section": "50", "location": "Annenberg Hall G32", "topic": "Experimenting in the Social Sciences", "course": "101-6", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4640/WCAS/ECON/101-6/11272", "instructor": ["Scott Richard Ogawa"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "11272", "subject": "ECON"}]