[{"school": "SoC", "overview_of_class": "This course is an introduction to audiology, which is a branch of science that studies hearing, balance and their related disorders. Its specialists, known as audiologist, are trained health-care professionals that specialize in identifying, diagnosing, treating and monitoring hearing and balance disorders. Audiologists use various testing strategies to determine whether an individual can hear within normal limits or if a balance problem exists. If a hearing loss or balance problem is identified, audiologists determine the region(s) of the system that are affected and the extent of the disorder.<br/> <br/> <br/>Registration Requirements: No prerequisites.<br/> <br/>Learning Objectives:<br/>Describe the field of audiology and many of the sub-specialty areas.<br/>Relate basic principles of sound to human hearing.<br/>Relate hearing disorders to the structure and function of the auditory system.<br/>Describe the different types of hearing loss and their causes.<br/>Describe evaluation procedures used in audiology AND hearing screening protocols identified in speech-language pathology (SLP) Scope of Practice documents.<br/> <br/> <br/>Teaching Method: Lecture and labs<br/> <br/>Evaluation Method: Exams and assignments<br/> <br/>Class Materials (Required):<br/> <br/> <br/>Class Materials (Suggested):<br/>1. Martin, Frederick N., & Clark, John Greer. (2012). Introduction to Audiology, Eleventh Edition. Boston, MA: Pearson; Allyn & Bacon. ISBN-13: 978-0-13-210821-8.<br/>2. Welling, Deborah R., & Ukstins, Carol A. (2013). Fundamentals of Audiology for the Speech-Language Pathologist. Burlington, MA: Jones & Bartlett Learning. ISBN 978-1-4496-6030-7.<br/> <br/> <br/>Class Notes:<br/>The instructor will be using Canvas.", "name": "Introduction to Audiology", "section": "20", "topic": "", "course": "318-0", "meeting_time": ["TuTh 9:30AM - 10:50AM"], "path": "/class-descriptions/4650/SoC/CSD/318-0/25908", "instructor": ["Jason Tait Sanchez"], "id": "25908", "subject": "CSD"}]