[{"class_mtg_info": [{"meet_t": "We 6:00PM - 8:50PM", "meet_l": "TBA"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Spring 2017", "name": "35677", "title": "WCAS PSYCH 306-0-20 Introduction to Clinical Psychology", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "35677", "instructors": [{"instructor_phone": "3126095300 ext 633", "instructor_name": "Jeffrey Harrison Sieracki", "instructor_addr": "The Family Institute, 618 Library Place"}], "topic": "", "course": "306-0", "descriptions": [{"name": "Overview of class", "value": "This course provides a broad overview of the practice of clinical psychology and its theoretical and research base. Although it is my expectation that anyone interested in psychology would enjoy this course, this is an especially ideal class for those that are thinking about pursuing an advanced degree in clinical psychology or a related field such as clinical social work, psychiatry, marriage and family therapy, or other graduate fields. Topics covered in this course will include the history of the field, conducting psychotherapy, major theoretical orientations, clinical assessment, and several challenges and controversies facing the field today. Students will also read a book about career and life planning in your twenties written by a clinical psychologist."}, {"name": "Registration Requirements", "value": "Psychology 303 (Psychopathology) is a prerequisite for this course. It is generally assumed that you will be familiar with the basics of abnormal psychology, differential diagnosis, and the DSM. However, if you are taking psychopathology concurrently with this course you should be fine."}, {"name": "Learning Objectives", "value": "1. Become familiar with the major paradigms within the field of clinical psychology and have an understanding of these paradigms from a historical context <br/>2. Learn about the many professional activities that clinical psychologists engage in (assessment, psychotherapy, research, consultation)<br/>3. Explore current controversies within the field of clinical psychology and think critically about the controversies<br/>4. Learn about the ethical and professional issues central to the field of clinical psychology<br/>5. Become better prepared for a career in clinical psychology or a related helping profession"}, {"name": "Teaching Method", "value": "Lecture, Readings, Guest speakers, Films/videos"}, {"name": "Class Materials (Required)", "value": "Kramer, G.P.; Bernstein, D.A. &amp; Phares, V. (2013) Introduction to Clinical Psychology (8th Edition). Upper Saddle River, New Jersey: Prentice Hall. ISBN-13: 9780205871858<br/><br/>Jay, M. (2013). The Defining Decade: Why your twenties matter - and how to make the most of them now. Twelve Publishing: New York ISBN-13: 9780446561754"}], "lmod": "2/6/17 8:44 AM (CT)", "subject": "PSYCH"}]