[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "University Hall 121"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "33298", "title": "WCAS ENGLISH 385-0-21 Topics in Combined Studies", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "33298", "instructors": [{"instructor_phone": "", "instructor_name": "Hosanna Grace Krienke", "instructor_addr": ""}], "topic": "Medical Humanities", "course": "385-0", "descriptions": [{"name": "Overview of class", "value": "Some medical conditions are more than physiological disorders; they become cultural boogeymen. At specific historical crossroads, such afflictions as the Bubonic Plague, tuberculosis, epilepsy, and AIDS came to symbolize a culture's heightened anxieties about the body, personal identity, and social ties. Meanwhile, disabilities like blindness or paralysis have much longer-acting legacies of cultural connotation. This course will examine the intellectual history of diseases and disabilities in Western culture. We will ask: When do physiological conditions accumulate cultural significance? How do the physical attributes of a medical condition interact with larger cultural structures of meaning-making? Do literary portrayals of such conditions reinforce or destabilize cultural notions of disease? Within modern-day controversies, what role do physicians play in navigating cultural conceptions of illness on behalf of their patients?<br/> <br/>In this class, we will examine the literary and historical record of specific medical conditions in order to understand how these conditions both accumulate and shed cultural meanings over time. In surveying this history, you will also have the opportunity to apply your findings to analyze contemporary medical controversies, such as those surrounding vaccinations &amp; autism, Zika &amp; birth control, or death with dignity legislation."}, {"name": "Teaching Method", "value": "Seminar Discussion"}, {"name": "Evaluation Method", "value": "Class participation, one oral presentation, and two papers (one literary close-reading and one argument paper)."}, {"name": "Class Materials (Required)", "value": "Howard Brody's Stories of Sickness 2nd ed.; Daniel Defoe's A Journal of a Plague Year; John Keats' poetry, Wilkie Collin's Poor Miss Finch; George Bernard Shaw's The Doctor's Dilemma, Tony Kushner's Angels in America."}], "lmod": "2/20/17 6:45 PM (CT)", "subject": "ENGLISH"}]