[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "University Hall 118"}], "school": "WCAS", "overview_of_class": "Health care and higher education illustrate \"mixed\" industries, in which private for-profit firms coexist and compete with nonprofit and governmental providers. This seminar focuses on how an economist can help to understand such matters as why such \"mixed\" industries exist, why the debate over health care and its insurance has been so protracted and divisive, why the cost of college education, and of health care, are so great and increasing so rapidly, why private nonprofit organizations, now over 1.3 million, are growing so rapidly in number and as a share of the U.S. economy, and why they are subsidized and in particular ways.", "qtr": "Spring 2017", "name": "First-Year Seminar", "title": "WCAS ECON 101-6-20 First-Year Seminar", "lmod": "2/26/17 6:45 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Burton Allen   Weisbrod", "instructor_addr": ""}], "topic": "Healthcare,Edu,&Nonprofits:An Economist's Perspect", "course": "101-6", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "descriptions": [{"name": "Overview of class", "value": "Health care and higher education illustrate \"mixed\" industries, in which private for-profit firms coexist and compete with nonprofit and governmental providers. This seminar focuses on how an economist can help to understand such matters as why such \"mixed\" industries exist, why the debate over health care and its insurance has been so protracted and divisive, why the cost of college education, and of health care, are so great and increasing so rapidly, why private nonprofit organizations, now over 1.3 million, are growing so rapidly in number and as a share of the U.S. economy, and why they are subsidized and in particular ways."}, {"name": "Registration Requirements", "value": "None."}, {"name": "Teaching Method", "value": "Group discussion of assigned readings and questions posed by the students and the instructor. Considerable responsibility will be placed on students to identify issues and pose topics for discussion. Students will be expected to contribute actively, not simply waiting to be called upon."}, {"name": "Evaluation Method", "value": "Thinking about issues, organizing ideas, and communicating them in clear written and oral forms are important goals of this Seminar. To help you advance on these path you will be required to write (a) 3-4 short (3-page maximum) commentaries on reading assignments, and (b) a first draft and a final version of one longer research paper (20-page maximum). In addition you will be expected to come to our seminar prepared to participate in class discussion of the reading assignment for that session. Seminar final grades will be based on (1) the short commentaries (total of 20%), (2) the draft of the course research paper, maximum length 10 pages (20%), (3) the final version of the course paper (20%), and your class participation (20%)."}, {"name": "Class Materials (Required)", "value": "We will cover material from many sources, including, for example, newspapers, magazines, journal articles, and books. Focus will be on your learning to appraise the arguments and evidence, on such topics as: What difference does it make whether human blood, for transfusions, and human organs, are available for sale? Should for-profit hospitals be prohibited (as they are in Canada)? Why are college tuitions so high and increasing so fast? Why do some universities, museums, and other nonprofits hold endowments, and why is there so much variation in their sizes? Why do corporations donate money, computers, pharmaceuticals, and other goods to nonprofits but not to private firms?"}, {"name": "Class Notes", "value": "My research as an applied micro-economist has ranged over such fields as the economics of health, education, poverty, the military draft, benefit-cost analysis of public programs, and measurement of performance. I am now writing a book on The Perils of Pay-for-Performance: why strong rewards in government and nonprofits don't work (Stanford University Press). I spent a year in Washington, DC, as a Senior Staff economist on the Council of Economic Advisors, and taught for many years at the University of Wisconsin, Madison, before coming to Northwestern and becoming Director of the Institute for Policy Research for five years. I enjoy music, bicycling and tennis, and occasionally pick up the saxophone."}], "path": "/class-descriptions/4660/WCAS/ECON/101-6/35264", "instructor": ["Burton Allen   Weisbrod"], "class_attributes": "WCAS First-Year Seminar<br/><br/>", "id": "35264", "subject": "ECON"}]