[{"school": "SoC", "overview_of_class": "555/Deb Tolchinsky/T 3-5:50 AMS 109<br/>Course description/learning objectives:<br/><br/>This course is the second in a three quarter MFA sequence in which students focus on creating a documentary media thesis project, whether a 12-20 minute film, an installation, a work of interactive media, or some other configuration. All principal photography or prototype construction should be finished by the start of the quarter so that students can engage primarily in post-production (image and sound editing) of the thesis project, with emphasis placed on transitioning from assemblage to refined structure and picture-lock. Throughout the course and according to a designated schedule, students will present works-in-progress to classmates, the instructor, and guests for collective feedback and evaluation. During class meetings we will chiefly focus on work-shopping your projects, sharing and analyzing questions and concerns of post-production, considering a range of<br/>creative strategies, and engaging with critical readings and discussions. Students will come out of the class with picture-lock of their thesis, and ready to undertake sound design and mix, color correction, titling, and exhibition in Thesis III.<br/><br/>Evaluation method:<br/>Media projects will be evaluated based upon creative merit (40%), technical merit (40%), and meeting goals of the assignment (20%). Various writing assignments will be required. In addition, twenty percent of a student's grade will be based upon participation/professionalism.<br/><br/>Class materials:<br/>1 to 2 TB (size dependent on the amount of footage you are working with) portable hard drive required as well as an additional/reliable means to back up all your material. This most likely means an additional 1 to 2TB hard drive.<br/>Cage Equipment deposit card must be on file $50<br/><br/>Texts<br/>In the Blink of an Eye by Walter Murch/2nd edition<br/>ISBN-13: 978-1879505629<br/>ISBN-10: 1879505622<br/>Additional readings on canvas", "name": "Thesis 2", "section": "20", "topic": "", "course": "555-0", "meeting_time": ["Tu 3:00PM - 5:50PM"], "path": "/class-descriptions/4650/SoC/RTVF/555-0/24574", "instructor": ["Debra K Tolchinsky"], "id": "24574", "subject": "RTVF"}]