[{"school": "SoC", "overview_of_class": "This course is an introduction to Stop Motion Animation with a focus on puppet animation. Students will be required to make a short (< 2 minutes) stop motion animation project for the class, so they need to arrive at the first class with a treatment and sketches for such a film.<br/> <br/>Learning Objectives <br/> <br/>Wire and ball and socket armature design, mold making, puppet creation in clay, latex or cloth, rigging for stop motion, motion control, set construction, cinematography and animation for stop motion.<br/><br/>Materials required will be based on student films. This will likely include some form of armature(s), modeling materials for puppet, background, set and props. There is a wide range in the possibilities in terms of price for these materials.", "name": "Topics in Cinematography", "section": "20", "location": "Louis Hall 106", "topic": "Stop-motion Animation", "course": "374-0", "meeting_time": ["Mo 9:00AM - 11:50AM"], "path": "/class-descriptions/4660/SoC/RTVF/374-0/34738", "instructor": ["Eric Adrian Patrick"], "class_attributes": "Prerequisites apply, see description<br/><br/>", "id": "34738", "subject": "RTVF"}, {"school": "SoC", "overview_of_class": "This is a unique course taught once every three years. Students will collaborate on a single science fiction short film project to be shot over the course of the quarter. The project will involve multiple visual effects in both production and post production ranging from the most simple in-camera effects to sophisticated 5-axis motion-control operations. We will incorporate old-school effects with set-building, miniatures, models, mirrors, and forced perspective, as well as cutting-edge motion control, virtual camera, some basic 3D animation, green screen and compositing. The course requires a substantial time investment on the part of the students, including at least two weekend days for shooting, and a considerable amount of time outside of class working on shots, building models, or doing post-production. The result is a really fantastic collaboration and a completed film. Students will be evaluated on quality of work, participation, and demonstrated mastery of techniques. Pre-requisite: 380", "name": "Topics in Cinematography", "section": "21", "location": "Louis Hall 106", "topic": "Special Effects Cinematography", "course": "374-0", "meeting_time": ["Tu 6:00PM - 8:50PM"], "path": "/class-descriptions/4660/SoC/RTVF/374-0/37377", "instructor": ["Jeff Clayton Brown"], "class_attributes": "Prerequisites apply, see description<br/><br/>", "id": "37377", "subject": "RTVF"}]