[{"class_mtg_info": [{"meet_t": "Th 12:00PM - 2:50PM", "meet_l": "Louis Hall 118"}], "school": "SoC", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24491", "title": "SoC RTVF 360-0-23 Topics in Media Writing", "class_attributes": "Prerequisites apply, see description<br/><br/>Sophomores Only<br/><br/>", "section": "24491", "instructors": [{"instructor_phone": "", "instructor_name": "Adam Lindsey Joyce", "instructor_addr": ""}], "topic": "Writing the Feature Film", "course": "360-0", "descriptions": [{"name": "Overview of class", "value": "Course Description: Students will study character, story, plot, dialogue, scene structure and screenplay format across various genres. The course will include reading, screening and discussion of feature films with the goal of a creating logline, treatment, character biography and generating the first half of a feature film for critique and feedback.<br/>Learning Objectives<br/>To understand the process of developing a story for the visual medium<br/>To understand the importance of character in relation to plot<br/>To strengthen the necessary elements of screenwriting (action, dialogue, etc.)<br/>To understand traditional and alternative screenplay structures and form.<br/>Appreciate the script's contribution to a successful film.<br/>Teaching Method<br/>Lectures, discussions, screenings, class reading, and writing assignments<br/>Evaluation Method<br/>Attendance, discussions, class participation, written assignments<br/>Class Materials (Required)<br/>Various electronic handouts<br/>Various Screenplays (TBA)<br/>Class Materials (Suggested)<br/>Screenplay - Syd Field<br/>Alternative Screenwriting - Ken Dancyger &amp; Jeff Rush<br/>The Hollywood Standard - Christopher Riley<br/>An Actor Prepares - Constantin Stanislavski<br/>Notes<br/>Most of the written work will be read out loud in class, including screenplay scenes. This is a vital component of the class, to better understand the written (and unwritten) words, as they move the story forward."}], "lmod": "12/24/16 6:47 PM (CT)", "subject": "RTVF"}]