[{"class_mtg_info": [{"meet_t": "We 6:15PM - 9:15PM", "meet_l": "Wieboldt Hall 409"}], "school": "SCS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "18449", "title": "SCS JRN_WRIT 390-CN-15 Topics in Journalism", "class_attributes": "", "section": "18449", "instructors": [{"instructor_phone": "", "instructor_name": "Charles F Whitaker", "instructor_addr": ""}], "topic": "Deconstructing the Blog", "course": "390-CN", "descriptions": [{"name": "Overview of class", "value": "The course is an exploration of the blogosphere with an eye toward understanding what makes a good blog and replicating those elements. Students will evaluate the work of the most successful (i.e. highly trafficked) blog sites and learn to create engaging blogs themselves. The objective is not only to gain a deeper understanding of blog culture and creation, but to help each student become branded bloggers in their own right. The course also touches on issues such as Search Engine Optimization (the key to driving traffic), libel and copyright law, as well as the basics of vivid writing. As is the case with most of the offerings in Northwestern's Medill School of Journalism, students will learn by doing. Sessions will be organized around subject areas to allow students the opportunity to try different blog formats (travel blogs, pop/culture/entertainment blogs, personal blogs, political blogs), with the goal of helping students find their voices as writers and social critics. Blog techniques, multi-media and incorporation of other news feeds will be explored, and guest speakers will talk about their approaches to generating ideas and traffic. Students needn't have previous journalism or HTML coding experience to take this course, though some basic knowledge about gathering information would be helpful."}, {"name": "Registration Requirements", "value": "Students needn't have previous journalism experience to take this course, though some basic knowledge about gathering information would be helpful. Since the blogs we create will be done in one of the free sites available to self-published bloggers (either WordPress or Blogspot), students needn't have any background in html coding either. What you will need is a wealth of ideas and opinions and a desire to share them with the world."}, {"name": "Teaching Method", "value": "As is the case with most of the offerings in Northwestern's Medill School of Journalism, students will learn by doing. Each session will be organized around subject areas to allow students the opportunity to try different blog formats. We will experiment with travel blogs, pop/culture/entertainment blogs, personal blogs, political blogs. The goal is to help students find their voices as writers and social critics.<br/><br/>We will share these expressions in class and work on honing our blog techniques, while also experimenting with multi-media and the incorporation of other news feeds to augment our commentary. <br/><br/>Guest speakers - local blogging luminaries - will also be on hand to talk about their approaches to generating ideas and traffic. Each week a different guest will share his or her experiences creating on online following."}, {"name": "Evaluation Method", "value": "Students will be evaluated on the enterprise and industry of their blogs, and the cogence and collegiality of their class participation. Each student will submit at least five blogs for review. They will be held to high standards of writing coherence and technical proficiency. Use of multi-media (photography, audio) is not be required, but will be a plus."}, {"name": "Class Materials (Required)", "value": "We will explore a variety of blogs and online forums, from traditional sites like Slate, Salon, and The Huffington Post to new ventures like The Stimulist."}], "lmod": "10/30/16 6:55 PM (CT)", "subject": "JRN_WRIT"}]