[{"class_mtg_info": [{"meet_t": "Mo 6:15PM - 9:15PM", "meet_l": "Tech Institute Lecture Room 4"}], "school": "SCS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "18417", "title": "SCS BIOL_SCI 217-CN-62 Physiology", "class_attributes": "", "section": "18417", "instructors": [{"instructor_phone": "", "instructor_name": "Emily Parker Updegraff", "instructor_addr": ""}], "topic": "", "course": "217-CN", "descriptions": [{"name": "Overview of class", "value": "This course is the second part in a four-course introductory biology sequence. You will learn fundamental principles in Human Physiology, covering all the major organ systems including Cardiovascular, Respiratory, Neural/Endocrine, Muscular, Renal/Digestive, Immune systems. You will also learn how different organ systems are structurally and functionally connected together to co-ordinate body functions. This course fulfills the requirements for medical, dental, and other professional school programs."}, {"name": "Learning Objectives", "value": "At the end of this course, students will be able to:<br/>? Define physiology <br/>? Describe the anatomy and functions of the categories of epithelia, parts of a neuron, muscles, the heart, the blood, the lungs, the kidney, the digestive system, the immune system, the endocrine system<br/>? Create a map to compare simple diffusion, protein-mediated transport <br/>? Explain how cascades and signal amplification play a role in signal transduction <br/>? Describe the different types of receptors for somatic and special senses. <br/>? Compare and contrast the anatomy and chemical communication of the sympathetic and parasympathetic branches.<br/>? Explain how receptors convert physical stimuli into electrical signals using the following terms: transduction, threshold, adequate stimulus, receptive field, receptor potential<br/>? Analyze the molecular events of excitation-contraction coupling and the contractile cycle.<br/>? Interpret the pressure changes that occur during the cardiac cycle and their relationship to flow through the heart and blood vessels.<br/>? Explain what creates blood pressure and how blood pressure changes as blood flows through the systemic circulation.<br/>? Analzye how pressures and lung volumes change during normal breathing, and how that affects air flow in the respiratory system.<br/>? Describe all the factors that influence gas exchange between the atmosphere and arterial blood<br/>? Explain the filtration barriers between the blood and the lumen of the nephron, and explain how they can be modified to control filtration.<br/>? Describe and differentiate between different types of primary lymphoid tissues and secondary lymphoid tissues."}, {"name": "Teaching Method", "value": "The class will be mostly lecture, with class participation required in the form of answering and asking questions. There will be one in-class presentation required."}, {"name": "Evaluation Method", "value": "Grades will be based on a midterm exam, final exam, reading quizzes, class participation, and an in-class presentation."}, {"name": "Class Materials (Required)", "value": "Textbook: Human Physiology, 7th ed. By Dee Unglaub Silverthorn."}], "lmod": "10/30/16 6:53 PM (CT)", "subject": "BIOL_SCI"}]