[{"class_mtg_info": [{"meet_t": "Tu 6:15PM - 9:15PM", "meet_l": "Kresge Centennial Hall 2-410"}], "school": "SCS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "27606", "title": "SCS PSYCH 314-CN-64 Topics in Psychology", "class_attributes": "", "section": "27606", "instructors": [{"instructor_phone": "", "instructor_name": "Renee Suzanne Engeln", "instructor_addr": "Swift 304"}], "topic": "Psychology of Beauty", "course": "314-CN", "descriptions": [{"name": "Overview of class", "value": "The purpose of this course is to thoughtfully consider psychological theory, methodology, and empirical data relating to questions such as the following: What is it that makes us find beautiful people beautiful? How can evolutionary psychology explain why we find certain features beautiful? Where does this theory fail in terms of predicting perceptions of beauty? Is beauty really in the eye of the beholder? How have beauty ideals shifted over history? How are gender roles and sexual orientation related to beauty and its pursuit? Why is beauty associated with femininity? What cultural biases help those perceived as beautiful and hurt those perceived as lacking in beauty? Are beautiful people happier or more successful? In what ways are beauty standards sometimes destructive? How do cultural standards of beauty affect disorders such as anorexia nervosa, bulimia nervosa, and body dysmorphic disorder? Carries social science credit."}, {"name": "Registration Requirements", "value": "PSYCH 110 or equivalent."}, {"name": "Learning Objectives", "value": "1. Mastery of the psychological theory and empirical data necessary to provide well-informed, scientific responses to the following questions:<br/>What is it that makes us find beautiful people beautiful?<br/>-How can evolutionary psychology explain why we find certain features attractive? Where does this theory fall short in terms of predicting perceptions of beauty?<br/>-Is beauty really in the eye of the beholder?<br/>-How are gender roles and sexual orientation related to beauty? Why is beauty generally associated with femininity?<br/>-What cultural biases help individuals who are perceived as beautiful and hurt those perceived as lacking in beauty?<br/>-Are beautiful people happier or more successful?<br/>-How do cultural definitions of beauty relate to disorders such as anorexia nervosa, bulimia nervosa, and body dysmorphic disorder?<br/>-How do media depictions of beauty shape self-perceptions?<br/>2. Development of the skills necessary to understand, interpret, and critique research on the above topics.<br/>3. Development of the skills necessary to conduct an empirically sound and theoretically interesting research project on one of the above topics."}, {"name": "Teaching Method", "value": "The teaching method will be a combination of lecture, class discussions, films, student presentations, and in-class activities/demonstrations."}, {"name": "Evaluation Method", "value": "Research presentation, two exams (one in-class, one take-home), blog, blog comments"}, {"name": "Class Materials (Required)", "value": "Course materials will be available online via Canvas and will include readings similar to those listed below.<br/><br/>Chiang, T. (2010). Liking what you see. From Stories of Your Life and Others. Beer Press. <br/><br/>Swami, V., &amp; Furnham, A. (2007). The Psychology of Physical Attraction. Routledge.<br/>(selected chapters)<br/><br/>Cantu, S. et al. (2014). Fertile and selectively flirty. Psychological Science.<br/><br/>Chocano, C. (2012). Girls love math: We can't stop doing it. New York Times.<br/><br/>Brumberg, J.J. (1998). The body project: An intimate history of American Girls. Vintage. (selected chapters)<br/><br/>Wolf, N. (2002). The beauty myth: How images of beauty are used against women. Harper Perennial. (selected chapters)<br/><br/>Edmonds, A. (2007). The poor have the right to be beautiful: Cosmetic surgery in neoliberal Brazil. The Journal of the Royal Anthropological Institute. <br/><br/>Ross, J. (2014). Must every YA action heroine be petite? The Atlantic.<br/><br/>Levine, M. (2001). Why I hate beauty. Psychology Today.<br/><br/>Hammermesh, D. S. (2013). Beauty pays: Why attractive people are more successful. Princeton University Press. (selected chapters).<br/><br/>Engeln, R. (2006). Buying the beauty standard or dreaming of a new life? Expectations associated with media ideals. Psychology of Women Quarterly.<br/><br/>Benzeval, M. et al. (2013). Does perceived physical attractiveness in adolescence predict better socioeconomic position in adulthood? Evidence from 20 years of follow up in a population cohort study. PLoS ONE.<br/><br/>Winkler, M.G., &amp; Cole, L.B. (1994). The Good Body: Asceticism in Contemporary Culture. Yale University Press. (selected chapters).<br/><br/>Pope, H.G. et al. (2000). Body image perception among men in three countries. American Journal of Psychiatry.<br/><br/>Bergling, T. (2006). Chasing Adonis: Gay men and the pursuit of perfection. Routledge.<br/><br/>Lanzieria, N., &amp; Cook, B.J. (2013). Examination of muscularity and body fat depictions in magazines that target heterosexual and gay men. Body Image.<br/><br/>Engeln, R., Sladek, M., &amp; Waldron, H. (2013). Body talk among college men: Contexts, correlates, and effects. Body Image.<br/><br/>Swami, V., &amp; Furnham, A. (2007). The body beautiful: Evolutionary and sociocultural perspectives. Palgrave MacMillan. (selected chapters).<br/><br/>Taylor, K.M. (2008). Going hungry: Writers on desire, self-denial, and overcoming anorexia. Anchor. (selected chapters).<br/><br/>Fredrickson, B., &amp; Roberts, T-A. (1997). Objectification Theory. Psychology of Women Quarterly."}], "lmod": "12/24/16 6:51 PM (CT)", "subject": "PSYCH"}]