[{"class_mtg_info": [{"meet_t": "MoWeFr 2:00PM - 2:50PM", "meet_l": "Technological Institute M128"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: PRE-REG:Math Majors Only", "qtr": "Spring 2017", "name": "34094", "title": "WCAS MATH 230-0-81 Differential Calculus of Multivariable Functions", "class_attributes": "", "section": "34094", "instructors": [{"instructor_phone": "", "instructor_name": "Scott Edward Schmieding", "instructor_addr": ""}], "topic": "", "course": "230-0", "descriptions": [{"name": "Overview of class", "value": "Vector algebra, vector functions, partial derivatives, optimization, Lagrange multipliers. Students may not receive credit for both 230 and 281-1, 285-2, 290-2, or 291-2. Prerequisite: 214 or 224.<br/><br/>THIS COURSE HAS MANDATORY EVENING MIDTERM EXAMINATIONS. PLEASE CHECK THE REGISTRAR'S WEBPAGE FOR DETAILS: http://www.registrar.northwestern.edu/registration/midterms.html<br/><br/>This exam takes precedence over scheduled meetings of other classes, including labs and discussion sections, held at this time, and it is up to the student to make arrangements for handling conflicts arising from such meetings. In special circumstances, arrangements for dealing with other unavoidable conflicts can be made by alerting the course coordinator at least two weeks ahead of time; he/she will decide if your conflict can be accommodated."}, {"name": "Registration Requirements", "value": "Math 224-0 or its equivalent"}, {"name": "Learning Objectives", "value": "Write coherent and logical solutions to mathematical problems.<br/><br/>Demonstrate problem-solving skills, by analyzing a problem, hypothesizing the outcome, and applying the techniques learned in class to solve the problem."}, {"name": "Teaching Method", "value": "Lecture and discussion sections meet three times a week. Classes are accompanied by discussion sections, which meet one day a week for problem solving and discussion under the supervision of a teaching assistant."}, {"name": "Class Materials (Required)", "value": "Custom Essential Calculus: Early Transcendentals Volume 2 <br/>Stewart James <br/>Cengage<br/>ISBN: 978-1285131658 <br/>  <br/>Custom Enhanced Web Assign Homework &amp; eBook LOE Instant Access for Multi Term Math &amp; Science, 1st Edition <br/>Stewart James <br/>Cengage<br/>ISBN: 978-1285184210"}, {"name": "Class Notes", "value": "Students may not receive credit for both 230-0 and any of the following: 290-2, 281-1, or 285-2"}], "lmod": "2/6/17 6:52 PM (CT)", "subject": "MATH"}]