[{"class_mtg_info": [{"meet_t": "MoWeFr 11:00AM - 11:50AM", "meet_l": "Locy Hall 305"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-registration - Reserved for Spanish Studies students.", "qtr": "Spring 2017", "name": "34878", "title": "WCAS PORT 115-2-20 Portuguese for Spanish Speakers", "class_attributes": "Prerequisites apply, see description<br/><br/>", "section": "34878", "instructors": [{"instructor_phone": "", "instructor_name": "Ana C Thome Williams", "instructor_addr": ""}], "topic": "", "course": "115-2", "descriptions": [{"name": "Overview of class", "value": "Portuguese 115-2 is the sequence of Portuguese 115-1. The course deepens concepts and usage of Portuguese in comparison and contrast to Spanish - or other Romance Languages. Emphasis on socio-linguistic and an interactive approach to develop an intercultural communicative competence that targets pronunciation, intonation, and sentence structure in patterns of spoken and written Portuguese. The course also highlights sociological and historical aspects of Portuguese speaking countries other than Brazil."}, {"name": "Registration Requirements", "value": "Port 115-1 or Placement test"}, {"name": "Learning Objectives", "value": "? To emphasize the development of written and spoken Brazilian Portuguese as the foundation for advanced training in the 4 skills in the language (listening, speaking, reading and writing);<br/>? To achieve an Intermediate language skill level (based upon on the ACTFL Proficiency Guidelines, 2012) that will focus on the development of the intercultural communicative competence in Portuguese;<br/>? To deepen vocabulary, grammar and discursive skills at the intermediate language level;<br/>? To offer insights into the history and culture of the Portuguese speaking countries of Europe, Africa and America.<br/>? Topics covered: Health, Housing, History and work in the Luso-african society."}, {"name": "Class Materials (Required)", "value": "Bem-Vindo! A Língua Portuguesa no Mundo da Comunicação . D Calles, M. H. de Ponce e S. Florissi. SBS Editora<br/><br/>Gramática Ativa 1, 2 Lamartine Bião Oberg. Editora Lidel, 2015"}, {"name": "Class Materials (Suggested)", "value": "Dicionários Bilíngue Português- Inglês/ Português-Espanhol Melhoramentos. São Paulo, Ática, 2010. <br/><br/>Modern Brazilian Portuguese Grammar: A Practical Guide. John Whitlam. Routledge, 2011."}], "lmod": "2/7/17 6:46 PM (CT)", "subject": "PORT"}]