[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "University Hall 122"}], "school": "WCAS", "overview_of_class": "This course will explore the strategies with which Native American writers have maintained and reconfigured their relations to place.  We will focus in particular on the strategies with which these writers have represented the histories attached to various places, against attempts by U.S. Americans to forget or efface them.  While European colonists and U.S. Americans conceptualized land as an alienable asset (as something that could be bought and sold), Native Americans' views of land were founded on kinship: land and animals were natural resources integrated with human life and thus resources that should be used carefully.  Similarly, because the land held the bones of past generations, it localized the past and created opportunities for unity in the present.  In the eighteenth and nineteenth centuries, as U.S. Americans claimed increasingly large plots of land and restricted Native groups to increasingly small, bounded areas, Native writers and activists contested dispossession, removal, and environmental catastrophe with a range of strategies, from political advocacy, to public lectures, military action, and public protests.  We'll read these early arguments for place and remembering alongside several contemporary novels and poems that recall the devastating effects of colonialism and that mobilize that past to assert Natives' ongoing presence.", "qtr": "Winter 2016", "name": "Studies in American Literature", "title": "WCAS ENGLISH 378-0-20 Studies in American Literature", "lmod": "1/9/16 6:47 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Kelly E Wisecup", "instructor_addr": ""}], "topic": "Native Am Lit: Place & Historical Memory", "course": "378-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "This course will explore the strategies with which Native American writers have maintained and reconfigured their relations to place. We will focus in particular on the strategies with which these writers have represented the histories attached to various places, against attempts by U.S. Americans to forget or efface them. While European colonists and U.S. Americans conceptualized land as an alienable asset (as something that could be bought and sold), Native Americans' views of land were founded on kinship: land and animals were natural resources integrated with human life and thus resources that should be used carefully. Similarly, because the land held the bones of past generations, it localized the past and created opportunities for unity in the present. In the eighteenth and nineteenth centuries, as U.S. Americans claimed increasingly large plots of land and restricted Native groups to increasingly small, bounded areas, Native writers and activists contested dispossession, removal, and environmental catastrophe with a range of strategies, from political advocacy, to public lectures, military action, and public protests. We'll read these early arguments for place and remembering alongside several contemporary novels and poems that recall the devastating effects of colonialism and that mobilize that past to assert Natives' ongoing presence."}, {"name": "Teaching Method", "value": "Lecture &amp; discussion."}, {"name": "Class Materials (Required)", "value": "William Apess, A Son of the Forest and Indian Nullification;<br/>Joseph Nicolar, Life and Traditions of the Red Man;<br/>David Cusick, Sketches of Ancient History of the Six Nations;<br/>Black Hawk, Autobiography of Ma-Ka-Tai-Me-She-Kia-Kiak, or Black Hawk;<br/>Elias Boudinot, An Address to the Whites, editorials in the Cherokee Phoenix;<br/>John Ridge, Essay by John Ridge;<br/>Diane Glancy, Pushing the Bear;<br/>Leslie Marmon Silko, Ceremony;<br/>Louise Erdrich, Tracks."}], "path": "/class-descriptions/4610/WCAS/ENGLISH/378-0/25466", "instructor": ["Kelly E Wisecup"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "25466", "subject": "ENGLISH"}]