[{"class_mtg_info": [{"meet_t": "MoWe 12:30PM - 1:50PM", "meet_l": "Swift Hall 107"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "32331", "title": "WCAS ANTHRO 255-0-01 Contemporary African Worlds", "class_attributes": "Ethics &amp; Values Distro Area<br/><br/>", "section": "32331", "instructors": [{"instructor_phone": "", "instructor_name": "Adia   Benton", "instructor_addr": ""}], "associated_classes": [{"component": "DIS", "room": "ANTHRO Sem Rm 104 - 1810 Hinmn", "meeting_time": "Mo 8:30AM - 9:20AM"}, {"component": "DIS", "room": "ANTHRO Sem Rm B07 - 1810 Hinmn", "meeting_time": "Tu 8:30AM - 9:20AM"}, {"component": "DIS", "room": "ANTHRO Sem Rm 104 - 1810 Hinmn", "meeting_time": "We 8:30AM - 9:20AM"}, {"component": "DIS", "room": "ANTHRO Sem Rm B07 - 1810 Hinmn", "meeting_time": "Th 8:30AM - 9:20AM"}], "topic": "", "course": "255-0", "descriptions": [{"name": "Overview of class", "value": "From antiquity until today the &quot;West&quot; (itself a troubled concept) imagined many things in Africa. Power, weakness, wealth, poverty, beauty, savagery, knowledge, ignorance, light, darkness. We are all heirs of these incoherent visions; a bequest that appears in widely held and constantly renewed beliefs and assumptions about the &quot;Dark Continent.&quot; Visions of Africa today revolve largely around a set of tropes developed in the 19th century - Africa as benighted, undeveloped, female, chaotic, famine-ridden, and incapable of self-governance. However, as with all instances when one position gazes at another, the result is both accurate and inaccurate. In this class we will turn our gaze on contemporary Africa from a cultural anthropological perspective. Using the tools of anthropology we will visit several arenas critical to contemporary African cultures - music &amp; dance, cinema, literature, sport, the body, technology, politics and development, among others. Through these various lenses we will attempt to better understand cultural choices and what we can say about Africa/ns from our perspective. That is, to recognize and value both internal and external views of the continent. Through these arenas and these perspectives we will better know issues of power, gender, hierarchy, spirituality, and economics. Will you arrive at an entirely accurate view of Africa and Africans? Never. The journey, however, will take you closer."}, {"name": "Teaching Method", "value": "DiscussionLecture"}, {"name": "Class Materials (Required)", "value": "Course reader"}], "lmod": "2/7/17 6:40 PM (CT)", "subject": "ANTHRO"}]