[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Locy Hall 214"}], "school": "WCAS", "overview_of_class": "The remarkable transformation of HIV/AIDS from an inevitable death sentence to a manageable chronic illness in well-resourced countries like the United States is one of the most noteworthy scientific achievements of the past 35 years. Recent medical advances have made the goal of an AIDS-free generation plausible in the US, and the epidemic commands less and less public attention. Yet the rate of new HIV infections in the US hovers stubbornly at approximately 50,000/year, and HIV/AIDS is widely recognized as not only a medical epidemic but also a manifestation of complex inequalities at the intersections of race, class, gender, and sexuality. In this advanced undergraduate seminar, students will develop an in-depth understanding of the scope and dimensions of HIV/AIDS in the United States and abroad and consider the role of race, class, gender, and sexuality in the epidemic. We will also explore how social movements, public policies, and cultural representations (film, art, media, public debate, etc) have played integral roles in the epidemic and the response.", "qtr": "Spring 2017", "name": "Sociology of Gender and Sexuality", "title": "WCAS GNDR_ST 331-0-20 Sociology of Gender and Sexuality", "lmod": "2/24/17 6:48 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Celeste Michele Watkins-Hayes", "instructor_addr": ""}], "topic": "Sociology of HIV/AIDS", "course": "331-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "The remarkable transformation of HIV/AIDS from an inevitable death sentence to a manageable chronic illness in well-resourced countries like the United States is one of the most noteworthy scientific achievements of the past 35 years. Recent medical advances have made the goal of an AIDS-free generation plausible in the US, and the epidemic commands less and less public attention. Yet the rate of new HIV infections in the US hovers stubbornly at approximately 50,000/year, and HIV/AIDS is widely recognized as not only a medical epidemic but also a manifestation of complex inequalities at the intersections of race, class, gender, and sexuality. In this advanced undergraduate seminar, students will develop an in-depth understanding of the scope and dimensions of HIV/AIDS in the United States and abroad and consider the role of race, class, gender, and sexuality in the epidemic. We will also explore how social movements, public policies, and cultural representations (film, art, media, public debate, etc) have played integral roles in the epidemic and the response."}], "path": "/class-descriptions/4660/WCAS/GNDR_ST/331-0/33909", "instructor": ["Celeste Michele Watkins-Hayes"], "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "id": "33909", "subject": "GNDR_ST"}, {"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Parkes Hall 224"}], "school": "WCAS", "overview_of_class": "The gender division of labor is a key organizing principle in all known societies, but it takes a fascinating array of forms. In industrialized and post-industrial societies, women have increasingly taken up paid employment and moved into formerly-masculine fields, driven by demand for women workers as the economy shifts toward the service sector, and more recently by feminist movements. Yet women are still doing the majority of caring and household labor, while men's take-up of traditionally feminine caring labor has been far more limited. Moreover, the sex segregation of occupations and substantial gendered earnings gaps remain. Meanwhile, much of the work formerly done by housewives has been \"outsourced\" to paid service workers, many of whom migrate from global South to global North to take up this work. Scholars debate about whether and how these arrangements will change, and whether they may be influenced by political initiatives, either top-down (e.g., affirmative action to recruit women to STEM fields) or bottom-up (e.g., cultural and media campaigns to validate new norms). In this course, we will investigate the ways in which work - paid and unpaid, in families and in places of employment - is organized by gender and other forms of power, difference and inequality, such as race, class and migration/citizenship status. We will examine family divisions of labor: how do men and women divide domestic work and care for children? Where does non-familial provision come into play? What are the consequences for outcomes in paid employment and in terms of the distribution of time, respect, and power? We will learn about the development of the modern economy and occupational sex segregation, as well as how different kinds of men and women are treated at work. Finally, we will consider the role of government policy in sustaining or changing these arrangements. By the end of the course, students should understand how gender influences the kinds of work we do and how it is rewarded, how gender interacts with other forms of difference and inequality, how the economy is organized along gendered lines, and how public policies and political processes shape the gendered world of work.", "qtr": "Spring 2017", "name": "Sociology of Gender and Sexuality", "title": "WCAS GNDR_ST 331-0-21 Sociology of Gender and Sexuality", "lmod": "2/24/17 6:48 PM (CT)", "section": "21", "instructors": [{"instructor_phone": "847/491-3719", "instructor_name": "Ann Shola   Orloff", "instructor_addr": "1808 Chicago Ave. Rm. 201"}], "topic": "Work & Occupations: Focus on Gender", "course": "331-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "The gender division of labor is a key organizing principle in all known societies, but it takes a fascinating array of forms. In industrialized and post-industrial societies, women have increasingly taken up paid employment and moved into formerly-masculine fields, driven by demand for women workers as the economy shifts toward the service sector, and more recently by feminist movements. Yet women are still doing the majority of caring and household labor, while men's take-up of traditionally feminine caring labor has been far more limited. Moreover, the sex segregation of occupations and substantial gendered earnings gaps remain. Meanwhile, much of the work formerly done by housewives has been &quot;outsourced&quot; to paid service workers, many of whom migrate from global South to global North to take up this work. Scholars debate about whether and how these arrangements will change, and whether they may be influenced by political initiatives, either top-down (e.g., affirmative action to recruit women to STEM fields) or bottom-up (e.g., cultural and media campaigns to validate new norms). In this course, we will investigate the ways in which work - paid and unpaid, in families and in places of employment - is organized by gender and other forms of power, difference and inequality, such as race, class and migration/citizenship status. We will examine family divisions of labor: how do men and women divide domestic work and care for children? Where does non-familial provision come into play? What are the consequences for outcomes in paid employment and in terms of the distribution of time, respect, and power? We will learn about the development of the modern economy and occupational sex segregation, as well as how different kinds of men and women are treated at work. Finally, we will consider the role of government policy in sustaining or changing these arrangements. By the end of the course, students should understand how gender influences the kinds of work we do and how it is rewarded, how gender interacts with other forms of difference and inequality, how the economy is organized along gendered lines, and how public policies and political processes shape the gendered world of work."}, {"name": "Evaluation Method", "value": "The class will have a mix of lectures, discussion and films. To encourage your participation in class discussions, I ask that you come to class prepared with questions about the readings and materials presented in lectures. You will post your questions on Canvas each week, and take part in online discussions with your classmates. I encourage you to bring your perspectives and your knowledge to wider communities beyond our classroom and Canvas discussion boards. You may want to post comments on relevant blogs, Facebook pages and Twitter accounts, or (especially considering the dearth of women or feminist editors and authors on Wikipedia) you might want to add new articles to Wikipedia, or to edit or add to existing articles.<br/><br/>There will also be informal assignments that I hope will help you to engage with the course subject matter, such as examining websites of different research and advocacy groups specializing in gender and work issues; these will be announced in class and posted on Canvas. The informal assignments will not be graded, but are required, and will comprise 15% of your grade.<br/><br/>Attendance is mandatory; if you need to miss class due to illness or to go to a necessary appointment, simply email me ahead of time and you will be excused. <br/><br/>To demonstrate your empirical knowledge and capacity to do critical analysis of the readings and general themes of the course through formal assignments, you will take an exam (60% of grade) towards the end of the quarter, and write a short final paper (25% of grade), due during exam week."}, {"name": "Class Materials (Required)", "value": "We will read four books, and a few articles which will be available online on Canvas. The following required books will be available for purchase at Norris (or online), and will also be placed on reserve:<br/><br/>Andrea Doucet, Do Men Mother? (Toronto: University of Toronto Press, 2007)<br/>ISBN-13: 978-0802085467<br/><br/>Anne Fausto-Sterling, Sex/gender: Biology in a social world (New York: Routledge, 2012) ISBN-13: 978-0415881463<br/><br/>Pierrette Hondagneu-Sotelo, Domestica: Immigrant Workers Cleaning and Caring in the Shadows of Affluence (Berkeley: University of California Press, 2001) ISBN-13: 978-0520251717<br/><br/>Rosabeth Moss Kanter, Men and Women of the Corporation (New York: Basic Books, 1993, second edition) ISBN-13: 978-0465044542<br/><br/>As a supplemental (not required) text for those who would like some background in gender studies, Raewyn Connell's Gender in World Perspective (Polity, second edition, 2009) is a good, short introduction (ISBN-13: 9780745645674). For those who would like more background about the social movements and political struggles that helped to shift policy and law pertaining to gender over the last century, have a look at Dorothy Sue Cobble, Linda Gordon and Astrid Henry, Feminism Unfinished: A Short, Surprising History of American Women's Movements (Liveright, 2014; ISBN-13: 978-1631490545)."}], "path": "/class-descriptions/4660/WCAS/GNDR_ST/331-0/33910", "instructor": ["Ann Shola   Orloff"], "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "id": "33910", "subject": "GNDR_ST"}]