[{"school": "WCAS", "overview_of_class": "The remarkable transformation of HIV/AIDS from an inevitable death sentence to a manageable chronic illness in well-resourced countries like the United States is one of the most noteworthy scientific achievements of the past 35 years. Recent medical advances have made the goal of an AIDS-free generation plausible in the US, and the epidemic commands less and less public attention. Yet the rate of new HIV infections in the US hovers stubbornly at approximately 50,000/year, and HIV/AIDS is widely recognized as not only a medical epidemic but also a manifestation of complex inequalities at the intersections of race, class, gender, and sexuality. In this advanced undergraduate seminar, students will develop an in-depth understanding of the scope and dimensions of HIV/AIDS in the United States and abroad and consider the role of race, class, gender, and sexuality in the epidemic. We will also explore how social movements, public policies, and cultural representations (film, art, media, public debate, etc) have played integral roles in the epidemic and the response.", "name": "Sociology of Gender and Sexuality", "section": "20", "location": "Locy Hall 214", "topic": "Sociology of HIV/AIDS", "course": "331-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4660/WCAS/GNDR_ST/331-0/33909", "instructor": ["Celeste Michele Watkins-Hayes"], "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "id": "33909", "subject": "GNDR_ST"}, {"school": "WCAS", "overview_of_class": "The gender division of labor is a key organizing principle in all known societies, but it takes a fascinating array of forms. In industrialized and post-industrial societies, women have increasingly taken up paid employment and moved into formerly-masculine fields, driven by demand for women workers as the economy shifts toward the service sector, and more recently by feminist movements. Yet women are still doing the majority of caring and household labor, while men's take-up of traditionally feminine caring labor has been far more limited. Moreover, the sex segregation of occupations and substantial gendered earnings gaps remain. Meanwhile, much of the work formerly done by housewives has been \"outsourced\" to paid service workers, many of whom migrate from global South to global North to take up this work. Scholars debate about whether and how these arrangements will change, and whether they may be influenced by political initiatives, either top-down (e.g., affirmative action to recruit women to STEM fields) or bottom-up (e.g., cultural and media campaigns to validate new norms). In this course, we will investigate the ways in which work - paid and unpaid, in families and in places of employment - is organized by gender and other forms of power, difference and inequality, such as race, class and migration/citizenship status. We will examine family divisions of labor: how do men and women divide domestic work and care for children? Where does non-familial provision come into play? What are the consequences for outcomes in paid employment and in terms of the distribution of time, respect, and power? We will learn about the development of the modern economy and occupational sex segregation, as well as how different kinds of men and women are treated at work. Finally, we will consider the role of government policy in sustaining or changing these arrangements. By the end of the course, students should understand how gender influences the kinds of work we do and how it is rewarded, how gender interacts with other forms of difference and inequality, how the economy is organized along gendered lines, and how public policies and political processes shape the gendered world of work.", "name": "Sociology of Gender and Sexuality", "section": "21", "location": "Parkes Hall 224", "topic": "Work & Occupations: Focus on Gender", "course": "331-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4660/WCAS/GNDR_ST/331-0/33910", "instructor": ["Ann Shola   Orloff"], "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "id": "33910", "subject": "GNDR_ST"}]