[{"class_mtg_info": [{"meet_t": "MoWe 9:30AM - 10:50AM", "meet_l": "Parkes Hall 223"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "25455", "title": "WCAS ENGLISH 324-0-20 Studies in Medieval Literature", "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "section": "25455", "instructors": [{"instructor_phone": "", "instructor_name": "Katharine Helen Breen", "instructor_addr": ""}], "topic": "The Middle Ages Go to the Movies", "course": "324-0", "descriptions": [{"name": "Overview of class", "value": "This course will set two famous medieval legends - the adventures of Robin Hood and the quest for the Holy Grail - in conversation with their modern film treatments. In investigating the legend of Robin Hood, we'll look at a series of popular medieval outlaw tales, including the scurrilous Reynard the Fox and the Gest of Robin Hood, in conjunction with the Adventures of Robin Hood (starring Errol Flynn, 1938), Robin Hood: Prince of Thieves (starring Kevin Costner, 1991), and perhaps Robin and Marian (starring Sean Connery and Audrey Hepburn, 1976). Our study of the Holy Grail will focus on the death of King Arthur and the accompanying disintegration of the Arthurian world, pairing the anonymous La Mort le Roi Artu with its retelling in Lancelot du Lac, and Sir Thomas Malory's Le Morte D'Arthur with Monty Python and the Holy Grail. In what ways do the modern retellings of these medieval tales give us new insight into the tales themselves? In what ways does the reconstruction of the middle ages serve purely modern ends? What kinds of different &quot;middle ages&quot; do these texts and their retellings imagine? In addition to this comparative work, we will pay attention to the films as films and to the medieval works as both oral performances and textual objects in order to think about the relationship between medium and message."}, {"name": "Teaching Method", "value": "Mostly discussion, some lecture."}, {"name": "Evaluation Method", "value": "Short writing exercises, oral presentation, one longer paper."}, {"name": "Class Materials (Required)", "value": "Reynard the Fox: A New Translation, ISBN 0871407361;<br/>Robin Hood and Other Outlaw Tales, ISBN 1580440673;<br/>a course reader."}], "lmod": "1/9/16 6:47 PM (CT)", "subject": "ENGLISH"}]