[{"class_mtg_info": [{"meet_t": "MoWeFr 11:00AM - 11:50AM", "meet_l": "Parkes Hall 213"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Spring 2016", "name": "31857", "title": "WCAS ENGLISH 105-6-22 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>Attendance at 1st class mandatory<br/><br/>", "section": "31857", "instructors": [{"instructor_phone": "847/491-4969", "instructor_name": "Penny Gail Hirsch", "instructor_addr": "555 Clark St., 202"}], "topic": "Rdng&amp;Wrtng Stories from Margin", "course": "105-6", "descriptions": [{"name": "Overview of class", "value": "What do we learn when we hear stories from people who are marginalized by society - or when we write about our own experiences with marginalization? The goal of this seminar is to answer those questions while becoming more enlightened and skillful writers ourselves. Toward that end, we will read narratives of survival and protest by people who have been marginalized by race, gender, poverty, politics, religion, war, or prison. As we do this reading, we will also look at (a) philosophical issues, such as the relationship between stories and &quot;truth&quot; (what's the line between fiction and non-fiction?) and (b) literary issues, such as whether mainstream stories are any different from &quot;stories from the margins.&quot; Then, focusing particularly on narratives related to our country's astonishingly high rate of incarceration, we will examine the power of stories to reshape our understanding of contemporary issues, including marginalization and inclusion at Northwestern.<br/><br/>Papers will involve analysis of personal experience, such as how you have benefited from, or have been challenged by, marginalization, as well as analysis and arguments based on research, exploring whether or how stories from the margin challenge our views of ourselves and the world."}, {"name": "Teaching Method", "value": "Discussion and workshop,"}, {"name": "Evaluation Method", "value": "Three papers and a short final reflection (approximately 25 pages total, including rough drafts). All papers will be written in stages and revised. Students will also write ungraded responses to class readings. Quarter grades will cover writing (approximately 70%) and class participation (30%, including attendance and online discussion). There is no midterm or final exam."}, {"name": "Class Materials (Suggested)", "value": "READING?will include works like the following: Andrew Pham, Catfish and Mandala: A 2-Wheeled Voyage Through the Landscape and Memory of Vietnam; Tim O'Brien, The Things They Carried; Marjane Satrapi, Persepolis and selections from Art Spiegelman; Selections from George Orwell, Ta-nehisi Coates, Thomas King, Junot Diaz, James Baldwin, Pearl Cleage, Alice Walker; Excerpts from Reading Across Borders: Storytelling and Knowledges of Resistance by philosopher Shari Stone-Mediatore; Excerpts from The New Jim Crow: Mass Incarceration in the Age of Colorblindness by Michelle Alexander and War on the Family: Mothers in Prison and the Families They Leave Behind by Renny Golden."}], "lmod": "4/3/16 7:57 PM (CT)", "subject": "ENGLISH"}]