[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "555 Clark B03"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Pre-registration - Reserved for Spanish Studies students.", "qtr": "Spring 2017", "name": "34883", "title": "WCAS SPANISH 363-0-1 Topics in US Latino/a Literary and Cultural Studies", "class_attributes": "Interdisciplinary Distro - See Rules<br/><br/>Literature &amp; Fine Arts Distro Area<br/><br/>Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "34883", "instructors": [{"instructor_phone": "847/467-3982", "instructor_name": "Frances R Aparicio", "instructor_addr": "Crowe Hall, Room 1131"}], "topic": "", "course": "363-0", "descriptions": [{"name": "Overview of class", "value": "Cultural Politics of Latino Language<br/><br/>This course examines the cultural politics of Latinx languages in the United States in the context of the history of U.S. imperialism and the colonial conditions that have framed language use, attitudes, and hybridity among US Latinx communities. We will first study the relationship of language to national imaginaries, the colonial erasure of Spanish and the racialization of Spanish in the US, the English Only Movement in the 1980s, and the colonial violence deployed against the use of Spanish. The second part of the course will focus on practices of linguistic hybridity that combine English and Spanish, both in speech as well as in literature. The course aims to contest dominant notions of Spanish as a global and profitable language, focusing on the cultural politics of English and Spanish among U.S. Latinx speakers, and to exhort students to think critically about the power differentials accorded to languages in the context of the U.S. racial, cultural and linguistic politics."}, {"name": "Class Notes", "value": "Basic reading knowledge of Spanish required. Open to students outside of the Spanish department who are interested in critically reflecting on language, bilingualism, and identity"}], "lmod": "2/12/17 7:03 PM (CT)", "subject": "SPANISH"}]