[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:50PM", "meet_l": "Annie May Swift Hall 103"}], "school": "SoC", "overview_of_class": "The central goal of the class is to help students perform and understand a selection of contemporary American short stories and three great American novels. Emphasis is on narratology and the adaptation and staging of fiction through solo and group performances. Prerequisite: Gen Cmn 103: the Analysis and Performance of Literature or its equivalent. The course requires solo and group performance and written analytical essays. We constantly use a workshop approach and experiment with different ways to adapt and stage fiction.", "qtr": "Winter 2017", "name": "Performance of Narrative Fiction", "title": "SoC PERF_ST 210-2-20 Performance of Narrative Fiction", "lmod": "2/5/17 6:37 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Carol Simpson   Stern", "instructor_addr": ""}], "topic": "", "course": "210-2", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "The central goal of the class is to help students perform and understand a selection of contemporary American short stories and three great American novels. Emphasis is on narratology and the adaptation and staging of fiction through solo and group performances. Prerequisite: Gen Cmn 103: the Analysis and Performance of Literature or its equivalent. The course requires solo and group performance and written analytical essays. We constantly use a workshop approach and experiment with different ways to adapt and stage fiction."}, {"name": "Teaching Method", "value": "Emphasis is placed on active involvement in classroom discussion and performance as a way to develop as performers and demonstrate experiential and intellectual understanding of the novels and short stories. The individual experiential engagement with the works and the development of skills in performance and adaptation are central to the class. Students have an active, creative role in shaping the experience of the course."}, {"name": "Evaluation Method", "value": "Two graded solo performances (3-5 min. each), and one graded group performance, and three analytical papers 5-7 pages in length. There may be pop quizzes. The final examination will depend on whether we need it or whether the class has amply demonstrated its commitment to our projects, in which case we would not have a final. If everyone gives there all and immerses themselves in the performances and readings, we will not hold the final. A decision regarding this matter will be made prior to the 7th week of the class."}, {"name": "Class Materials (Required)", "value": "Required Texts: Wolff, Tobias, ed., The Vintage Book of Contemporary Short Stories; Fitzgerald, F.S., The Great Gatsby; Hemingway, Ernest, The Sun Also Rises; and Faulkner, William, The Sound and the Fury."}], "path": "/class-descriptions/4650/SoC/PERF_ST/210-2/21656", "instructor": ["Carol Simpson   Stern"], "class_attributes": "", "id": "21656", "subject": "PERF_ST"}]