[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Technological Institute LG68"}], "school": "MEAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Fall 2016", "name": "13236", "title": "MEAS MAT_SCI 190-0-20 MS &amp; E Freshman Seminar", "class_attributes": "", "section": "13236", "instructors": [{"instructor_phone": "847/467-1363", "instructor_name": "Vinayak P Dravid", "instructor_addr": "1133 Cook Hall"}], "associated_classes": [{"component": "LAB", "room": "TBA", "meeting_time": "TBA"}], "topic": "", "course": "190-0", "descriptions": [{"name": "Overview of class", "value": "<br/>Have you ever wondered how a bug looks when magnified 10,000 times? How about 100,000 times? How about a music CD or a Pentium chip? Well...this course is all about &quot;structure&quot; of all types of materials, from metals to semiconductors to biological materials. This is a laboratory oriented course and is designed to teach materials science and engineering using scanning electron microscopy and scanning tunneling microscopy. First, principles of SEM and STM are taught in class, and the training in using these two types of microscopes is provided in the laboratory. Second, students carry out projects of their design on structure and properties of materials using SEM. Third, reporting of the project results via and oral presentation and a written report is required at the end of the quarter."}, {"name": "Registration Requirements", "value": "<br/>Open for all freshman or by permission of the instructor."}, {"name": "Teaching Method", "value": "<br/>Lectures and four/five 2-hour laboratories (organized per students' availability) are given during the first four weeks. From the fifth to the ninth week, groups of two students carry out their projects utilizing the knowledge and techniques acquired in the first four weeks. Individual discussion sessions with the instructor are to be arranged. Results of projects are reported orally in class and also in a written report at the end of the quarter. The course will utilize various multimedia tools, including 2-D, 3-D animation, video clips and much more."}, {"name": "Evaluation Method", "value": "<br/>The grading is based on results of a quiz at the end of the fourth week (25%) and the performance in laboratory sessions (25%). The hands on group project report (oral and written) accounts for the balance."}, {"name": "Class Materials (Required)", "value": "<br/>Scanning Electron Microscopy and X-ray Microanalysis, Goldstein et al. 3rd ed. (Springer, 2003.) ISBN: 9780306472923 ; extended lecture notes and references."}], "lmod": "10/30/16 6:43 PM (CT)", "subject": "MAT_SCI"}]