[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Technological Institute L221"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: REASON: Pre-registration is not allowed for this class. Please try again during regular registration.", "qtr": "Spring 2017", "name": "35126", "title": "WCAS CHEM 316-0-02 Medicinal Chemistry: the Organic Chemistry of Drug Design and Action", "class_attributes": "", "section": "35126", "instructors": [{"instructor_phone": "", "instructor_name": "Richard Bruce   Silverman", "instructor_addr": ""}], "topic": "", "course": "316-0", "descriptions": [{"name": "Overview of class", "value": "This is a survey course designed to show how organic chemistry plays a major role in the design, development, and action of drugs. Although concepts of biology, biochemistry, pharmacy, physiology, and pharmacology will be discussed, it is principally an organic chemistry course with the emphasis on physical interactions and chemical reactions and their mechanisms as applied to biological systems. We will see how drugs are discovered and developed; how they get to their site of action; what happens when they reach the site of action in their interaction with receptors, enzymes, and DNA; how resistance occurs; how the body gets rid of drugs, and what a medicinal chemist can do to avoid having the body eliminate them before they have produced their desired effect. The approaches discussed are those used in the pharmaceutical industry and elsewhere for the discovery of new drugs."}, {"name": "Registration Requirements", "value": "Prerequisite: Chemistry 210-3 or 212-3; or consent of instructor."}, {"name": "Class Materials (Required)", "value": "Richard B. Silverman and Mark W. Holladay, The Organic Chemistry of Drug Design and Drug Action, 3rd edition; Academic Press, 2014"}, {"name": "Class Notes", "value": "There are problem sets at the end of each chapter and answers in an appendix of the text."}], "lmod": "2/12/17 6:51 PM (CT)", "subject": "CHEM"}]