[{"class_mtg_info": [{"meet_t": "MoWe 12:30PM - 1:50PM", "meet_l": "1801 Hinman Ave 2225"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "33429", "title": "WCAS HISTORY 300-0-32 New Lectures in History", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "33429", "instructors": [{"instructor_phone": "", "instructor_name": "Adam Edward Plaiss", "instructor_addr": ""}], "topic": "History of the Great Lakeshore", "course": "300-0", "descriptions": [{"name": "Overview of class", "value": "As a region deserving particular study, America's Great Lakes do not spring to mind as readily as the South, New England, or Appalachia. This seminar will suggest, however, that the Great Lakeshore possesses a unique history that, when examined, sheds new light on larger narratives of American history, such as industrialization, immigration, and the decline of the middle class. We will find that the story of the Great Lakeshore offers a useful critique to the widely accepted cultural notions of American exceptionalism, individualism, and the beneficial progress of technology."}, {"name": "Teaching Method", "value": "Lecture"}, {"name": "Evaluation Method", "value": "Participation, Midterm, Response Papers"}, {"name": "Class Materials (Required)", "value": "TENTATIVE READING LIST: <br/>White, Richard. The Middle Ground: Indians, Empires, and Republics in the Great Lakes Region, 1650-1815. Cambridge University Press, 2010. ISBN: 0521183448 <br/><br/><br/>Cronon, William. Nature's Metropolis: Chicago and the Great West. W. W. Norton, 1991. ISBN:0393308731. <br/><br/><br/>Cohen, Lizabeth. Making a New Deal: Industrial Workers in Chicago, 1919-1939. Cambridge University Press, 2008. ISBN: 0521715350. <br/><br/><br/>McClelland, Edward. Nothin' But Blue Skies: The Heyday, Hard Times, and Hopes of America's Industrial Heartland. Bloomsbury Press, 2013. ISBN: 1608195295 <br/><br/><br/>Giffles, David. The Hard Way on Purpose: Essays and Dispatches from the Rust Belt. Scribner, 2014. ISBN: 1451692749"}, {"name": "Class Notes", "value": "HISTORY AREA OF CONCENTRATION: Americas"}], "lmod": "4/3/16 8:03 PM (CT)", "subject": "HISTORY"}]