[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "University Library 4670"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "33900", "title": "WCAS GNDR_ST 397-0-20 Feminist Theory", "class_attributes": "", "section": "33900", "instructors": [{"instructor_phone": "", "instructor_name": "Mary Golden Dietz", "instructor_addr": ""}], "topic": "", "course": "397-0", "descriptions": [{"name": "Overview of class", "value": "Ever since Simone de Beauvoir declared &quot;One is not born a woman but becomes one&quot; (The Second Sex, 1949) feminist theory has been a political and scholarly endeavor in tension with its key terms and categories (e.g. sex, gender, class, race, sexuality, women, lesbian, feminine, the body, identity/difference, subjectivity, patriarchy, biology, oppression, power, equality, freedom) and even in struggle with the identity of its very own subject. Imagine &quot;woman&quot;: Is this a shared, coherent, stable category born of female bodies marked as inferior and subordinate to men? Or is it hardly more than a fictitious unity that disintegrates once confronted with women's manifold diversities and lived experiences of race, ethnicity, (trans)nationality, age, and class? Perhaps not all women share the same gender? Consider &quot;sex&quot;: does the binary notion of sexual difference (male/female; man/woman) paradoxically undercut feminist goals by reaffirming the very heterosexual matrix they otherwise seeks to disrupt? If so, and &quot;woman&quot; has meaning only in heterosexual systems of thought, then should we conclude that when it comes to female sexuality lesbians are not women? Let's say they're not: Does that mean that all lesbians have the same sexuality, passions, fantasies, and desires? If not, then how do we &quot;queer&quot; lesbian? And what about &quot;gender&quot;? Is it the cultural construction of an already foundationally &quot;sexed&quot; body? Or is the sexed body only a prop for a naturalized hierarchical binary (m/f) that legitimates male over female and the domination of women by men? In that case, if the &quot;gender binary&quot; is only a harsh imposition that robs many persons (called &quot;women&quot;) of what belongs to them by right, then must gender be destroyed? Or might we think &quot;gender&quot; not as a fixed relation of subordination but as the creation of &quot;performative possibilities&quot; that constantly change and potentially subvert the injunctions of compulsory heterosexuality? Yet if feminism risks &quot;gender&quot; as purely performative and up for grabs, what happens to the identity of the feminist subject? Imagine there's no such thing as &quot;women&quot;. Is there anything left for feminism to liberate (or for masculinism to dominate)? If not, what's the point of a feminist politics? These are some of the theoretical and political questions with which feminist thinkers contend in mighty turbulence after Beauvoir. The aim of this course is to clarify and assess these issues (and others) through the reading and interpretation of a wide array of feminist texts from the 1970s to the present. Without striving for any final settlements or definitive resolutions (much less &quot;right answers&quot;), we'll make an effort to grasp the complexities of feminist theory and the challenges it poses to thinking through our own individual presuppositions and worldviews, whether &quot;feminist&quot; or not."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Mid-quarter text interpretive paper (5-6 pp); final text interpretive paper (5-6 pp); four 1 page single spaced topics papers (&quot;topoi&quot;) due every other week on a specific term/word/concept in one of the readings; class attendance and active participation in discussion"}, {"name": "Class Materials (Required)", "value": "Required Texts: Gender Trouble: Feminism and the Subversion of Identity. Judith Butler. [Routledge Press, 1999]: The Second Wave: A Reader in Feminist Theory. Linda Nicholson, ed. [Routledge Press, 1997]; The Straight Mind and Other Essays. Monique Wittig. [Beacon Press, 1992], also a Course Packet and selected essays, chapters, and articles made available on course website."}], "lmod": "2/19/17 6:48 PM (CT)", "subject": "GNDR_ST"}]