[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "Technological Institute LG72"}], "school": "MEAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "37544", "title": "MEAS MECH_ENG 416-0-1 Computational Nanodynamics", "class_attributes": "", "section": "37544", "instructors": [{"instructor_phone": "847/491-5282", "instructor_name": "Sinan   Keten", "instructor_addr": "Technological Institute, Rm A133, 2145 Sheridan Rd, EV CAMPUS"}], "topic": "", "course": "416-0", "descriptions": [{"name": "Overview of class", "value": "The objective of this course is to learn how to use theoretical and computational modeling tools to simulate dynamic solid mechanics phenomena at small scales. Topics covered include elementary concepts in dynamics, statistical mechanics, molecular interactions, coarse-graining strategies, and application of the molecular dynamics methodology to elasticity, self-assembly, vibrations, nanoindentation, fragmentation and fracture problems of relevance to nanoscale, biological and biomolecular systems. <br/><br/>Homework<br/><br/>There are three homework assignments during the term, due in one or two weeks. The purpose of the homework is to provide the student with an opportunity to gain hands-on experience in applying relevant theory and simulation tools to solve contemporary scientific problems. Homework problems involve using open-source codes compiled on Quest HPC system, as well as minor programming assignments. Homework material is integrated with in-class exercises, where the students can run simulations using an online NanoHub toolset developed for this class. <br/><br/>Project<br/><br/>Students will have the opportunity to apply the concepts that they have learned in class to a research problem of their own interest. Projects typically include an atomistic simulation aspect and some preliminary theoretical concepts on the expected observations. Topics can include and not be limited to self-assembly, elasticity of biomolecules, carbon nanostructures, reactive modeling of fracture, and system dynamics. Projects are evaluated based on a final presentation in class and a written report."}, {"name": "Evaluation Method", "value": "Homework 40%<br/>Paper Review &amp; Discussion 10%<br/>Project 50%"}, {"name": "Class Materials (Suggested)", "value": "There is no required textbook. Some great resources relevant to this class are provided below: <br/><br/>Molecular Dynamics<br/><br/>Computer Simulation of Liquids - Allen and Tildesley<br/>Atomistic Modeling of Materials Failure - Markus J. Buehler<br/>Understanding Molecular Simulations - Frenkel and Smit<br/><br/>Statistical Mechanics and Thermodynamics, Molecular Mechanics<br/><br/>Molecular Driving Forces - Dill and Bromberg<br/>Intermolecular and Surface Forces - Jacob Israelachvili"}], "lmod": "4/3/16 7:10 PM (CT)", "subject": "MECH_ENG"}]