[{"school": "WCAS", "overview_of_class": "In this seminar we will examine some of the fundamental ideas and questions behind democracy and provide a reading of their &quot;inventors&quot;. Some of the questions are: What is democracy? Is it a form of government, a value, an ideal, a political system, a form of life, a bit of all this? Is democracy always the best political solution (in wartime? general starvation?)? Why should the whole of the people decide and not the specialists in the respective questions? Are all democratically taken decisions automatically legitimate (what about minorities' rights?)? How should all citizens in a democracy participate in politics? By direct self-government of the people or by voting representatives? Is everything democratically decidable or does the individual have unalterable rights? Is tolerance and/or free speech necessary for democracy and how far can it go?", "name": "First-Year Seminar in Philosophy", "section": "20", "topic": "What is Democracy?", "course": "109-6", "meeting_time": ["MoWe 3:30PM - 4:50PM"], "path": "/class-descriptions/4640/WCAS/PHIL/109-6/13742", "instructor": ["Axel   Mueller"], "id": "13742", "subject": "PHIL"}, {"school": "WCAS", "overview_of_class": "This course will address various conceptions of the aims and value of a college education. We will look at arguments from various quarters: humanist, economic, sociological/political, and skeptical. We will consider the question of the value of a college education not only from the perspective of the person in college, but also from the perspective of the broader community.", "name": "First-Year Seminar in Philosophy", "section": "21", "topic": "What is College for?", "course": "109-6", "meeting_time": ["MoWe 9:30AM - 10:50AM"], "path": "/class-descriptions/4640/WCAS/PHIL/109-6/13743", "instructor": ["Sanford C Goldberg"], "id": "13743", "subject": "PHIL"}, {"school": "WCAS", "overview_of_class": "Isaiah Berlin once declared that romanticism brought about &quot;the greatest single shift in the consciousness of the West that has occurred.&quot; In this course, we will focus on romantic conceptions of poetry and language: particularly on the quintessentially romantic claim that art is capable of revealing truths that are inaccessible to us in any other manner. We will start with some precursors of the romantic movement in Germany (like Herder and Schiller), before proceeding to several representatives of the romantic movement in Germany and England (including the Schleiermacher, the Schlegels, and Shelley).", "name": "First-Year Seminar in Philosophy", "section": "22", "topic": "German Romanticism", "course": "109-6", "meeting_time": ["TBA"], "path": "/class-descriptions/4640/WCAS/PHIL/109-6/13744", "instructor": ["Mark Vinzenz Alznauer"], "id": "13744", "subject": "PHIL"}]