[{"class_mtg_info": [{"meet_t": "Tu 1:00PM - 4:50PM", "meet_l": "Helmerich Auditorium"}], "school": "SoC", "overview_of_class": "Called \"one of the pre-eminent national cinemas in the world\" in the 1990s both by Toronto International Film Festival and New York Film Festival, Iranian postrevolutionary cinema is a vital productive activity with its own special industrial, financial, and professional structures and unique ideological, thematic, generic, and aesthetic values, which has evolved over the decades to encompass several different types of cinemas. One of these is the \"art-house cinema\" that is widely viewed and praised outside the country.  This cinema is part of a more general transformation in the political culture of the country since the revolution of 1978-1979, but it is founded on the fertile grounds of a cinema that preceded the revolution, the \"new wave cinema.\" Both the new wave and the art-house movements were agents in the Iranian discourses and social formations of modernity.  This course examines their emergence, evolution, and diversity, including key auteurs, genres, and representation of women, in the context of Iranian national aspirations, contact with the west and the rest, and the Islamic religious values and a rich tradition of visual and performing arts.  <br/><br/>The course involves weekly readings, lectures, discussions, and film screenings. <br/> <br/>A major exciting component of the course involves working collectively to curate and produce an exhibition, \"The Art of Iranian Movie Posters,\" for the Block Museum for fall 2016.  The posters will come from Hamid Naficy's Iranian Movie Poster Collection deposited at Northwestern University Archive.  These have been scanned and will be available online for this class.  We will be working with the museum and the library staff to curate and prepare this exhibition.", "qtr": "Winter 2016", "name": "National Cinema", "title": "SoC RTVF 351-0-20 National Cinema", "lmod": "1/9/16 6:39 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Hamid   Naficy", "instructor_addr": ""}], "topic": "Iranian Cinema", "course": "351-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "Called &quot;one of the pre-eminent national cinemas in the world&quot; in the 1990s both by Toronto International Film Festival and New York Film Festival, Iranian postrevolutionary cinema is a vital productive activity with its own special industrial, financial, and professional structures and unique ideological, thematic, generic, and aesthetic values, which has evolved over the decades to encompass several different types of cinemas. One of these is the &quot;art-house cinema&quot; that is widely viewed and praised outside the country. This cinema is part of a more general transformation in the political culture of the country since the revolution of 1978-1979, but it is founded on the fertile grounds of a cinema that preceded the revolution, the &quot;new wave cinema.&quot; Both the new wave and the art-house movements were agents in the Iranian discourses and social formations of modernity. This course examines their emergence, evolution, and diversity, including key auteurs, genres, and representation of women, in the context of Iranian national aspirations, contact with the west and the rest, and the Islamic religious values and a rich tradition of visual and performing arts. <br/><br/>The course involves weekly readings, lectures, discussions, and film screenings. <br/> <br/>A major exciting component of the course involves working collectively to curate and produce an exhibition, &quot;The Art of Iranian Movie Posters,&quot; for the Block Museum for fall 2016. The posters will come from Hamid Naficy's Iranian Movie Poster Collection deposited at Northwestern University Archive. These have been scanned and will be available online for this class. We will be working with the museum and the library staff to curate and prepare this exhibition."}, {"name": "Class Materials (Required)", "value": "The course involves weekly readings, lectures, discussions, and film screenings. The primary assignment will involve faculty and students collaborating to organize and curate a major exhibition for the Block Museum, Art of Movie Posters?Iranian Cinema, for exhibition in autumn 2016 along with a film symposium and a film festival. The posters come from Professor Naficy's poster collection donated to Northwestern University."}], "path": "/class-descriptions/4610/SoC/RTVF/351-0/22292", "instructor": ["Hamid   Naficy"], "class_attributes": "", "id": "22292", "subject": "RTVF"}, {"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Locy Hall 314"}], "school": "SoC", "overview_of_class": "", "qtr": "Winter 2016", "name": "National Cinema", "title": "SoC RTVF 351-0-21 National Cinema", "lmod": "1/9/16 6:39 PM (CT)", "section": "21", "instructors": [{"instructor_phone": "8474914660", "instructor_name": "Scott P Durham", "instructor_addr": "1860 S. Campus Drive, Crowe Hall #2-163"}], "topic": "French Cinema", "course": "351-0", "enrl_requirement": "", "descriptions": [], "path": "/class-descriptions/4610/SoC/RTVF/351-0/27372", "instructor": ["Scott P Durham"], "class_attributes": "", "id": "27372", "subject": "RTVF"}]