[{"class_mtg_info": [{"meet_t": "TuTh 2:00PM - 3:20PM", "meet_l": "Technological Institute LG66"}], "school": "MEAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "32924", "title": "MEAS MAT_SCI 416-0-20 Kinetics", "class_attributes": "", "section": "32924", "instructors": [{"instructor_phone": "847/491-4391", "instructor_name": "David N Seidman", "instructor_addr": "1013 Cook Hall"}], "associated_classes": [{"component": "DIS", "room": "Technological Institute L160", "meeting_time": "Th 3:30PM - 4:50PM"}], "topic": "", "course": "416-0", "descriptions": [{"name": "Overview of class", "value": "Principles of Irreversible Thermodynamics; Driving Forces and Fluxes; Diffusion in the Presence of Stress; Diffusion Resulting from other Gradients; Diffusion Resulting from Discrete Jumps; Diffusion in Crystals; Diffusion Controlled versus Source/Sink Controlled Kinetics; Surface Rearrangements by Evaporation and Condensation; Coarsening of Microstructures due to Capillary Forces; Growth of Phases in Concentration Gradients; Growth of Phases in Thermal Gradients; Evaporation of Metal Crystals; Vapor-Liquid-Solid (VLS) Growth Mechanism of the Growth of Nanowires."}, {"name": "Registration Requirements", "value": "MSE 401 or consent of the instructor"}, {"name": "Teaching Method", "value": "Two lectures per week. Students are expected and encouraged to ask questions and participate in discussion during class. The solution of problems is an essential part of this course."}, {"name": "Evaluation Method", "value": "There will be two examinations and the homework will be graded."}, {"name": "Class Materials (Required)", "value": "&quot;Kinetic Processes in Materials,&quot; by R. W. Balluffi, S. M. Allen, and W. Craig Carter (Wiley-VCH)."}, {"name": "Class Materials (Suggested)", "value": "1. &quot;Diffusion in Solids,&quot; Martin E. Glicksman (John Wiley &amp; Sons, New York, 2000). <br/><br/>2. &quot;Atom Movements: Diffusion and Mass Transport in Solids,&quot; Jean Philibert, (Les Editions de Physique, Avenue du Hogar, Zone Industrielle de Courtaboeuf, B.P. 112, F-91944 Les Ulis Cedex A, France)."}], "lmod": "4/3/16 7:09 PM (CT)", "subject": "MAT_SCI"}]