[{"class_mtg_info": [{"meet_t": "Fr 12:00PM - 3:00PM", "meet_l": "Annie May Swift Hall 103"}], "school": "SoC", "enrl_requirement": "<br/>Add Consent: Instructor Consent Required<br/>", "qtr": "Fall 2016", "name": "17044", "title": "SoC PERF_ST 330-0-21 Topics in Performance Studies", "class_attributes": "", "section": "17044", "instructors": [{"instructor_phone": "847/491-3171", "instructor_name": "Paul C Edwards", "instructor_addr": "Annie May Swift Hall, Room G03"}], "topic": "New Script Workshop", "course": "330-0", "descriptions": [{"name": "Overview of class", "value": "Through workshop stagings, the fall 2016 TOPICS class assists playwrights in the development of new work that has been adapted from unconventional sources. Both of this quarter's playwrights will continue to develop work begun during summer, with the support of Undergraduate Research Grant funding, and will be members of the class.<br/><br/>PROJECTS FOR FALL 2016.<br/>1. KORI ALSTON: a series of new short plays with the working title 10 Plays by Red Hook, based on the URG-supported project &quot;Red Hook and Its Previous Performances.&quot; During the summer of 2016, Kori will conduct field research in the Red Hook section of Brooklyn, including research on the history of the neighborhood and interviews with people who live and work there.<br/>2. NOAH PERKINS: a new play based on the URG-supported project &quot;Clearing The Air: The Reality of Cannabis Consumers.&quot; During the summer of 2016, Noah will conduct field research in Seattle, Washington, including interviews with cannabis users and advocacy groups seeking change to America's cannabis laws. The project seeks, among other things, to challenge stereotypes of cannabis users."}, {"name": "Registration Requirements", "value": "Students may enroll in 330 TOPICS as performers, who will assist in the development of new work by both playwrights. To request permission: during SoC pre-registration, e-mail Paul Edwards at edwdoyle@northwestern.edu or edwdoyle1@gmail.com"}, {"name": "Evaluation Method", "value": "Weekly rehearsals and performances. Participation in groups for both plays. Short response papers throughout the quarter. Rehearsal outside of class required. Attendance at all class meetings mandatory."}], "lmod": "10/30/16 6:50 PM (CT)", "subject": "PERF_ST"}]