[{"class_mtg_info": [{"meet_t": "MoWeFr 12:30PM - 1:50PM", "meet_l": "Tech Institute Lecture Room 5"}], "school": "WCAS", "overview_of_class": "The environment and our natural resources are scarce yet their values are quite hard to determine. Furthermore, there are a variety of problems with the incentives to use them well. Using the tools of microeconomic analysis and some econometrics, this course will define and examine \"environmental problems\" in terms of economic efficiency. We will also discuss the methods (and shortcomings of these methods) used by economists and policymakers to place dollar values on environmental amenities (since such valuations will determine what policy options are deemed \"efficient\"), such as benefit-cost analysis. Then we will apply these tools to look at a particular set of environmental problems caused by negative externalities transmitted through naturally occurring amenities, and the effects of the policies we construct in response to these problems. <br/>NOTE: This class is not open to students who have taken Economics 370: Environmental & Natural Resource Economics.", "qtr": "Fall 2017", "name": "Environmental Economics", "title": "WCAS ECON 372-0-20 Environmental Economics", "lmod": "5/1/17 9:35 AM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Mark P Witte", "instructor_addr": ""}], "topic": "", "course": "372-0", "enrl_requirement": "Enrollment Requirements: Students who have previously taken ECON 370-0 are not allowed to take ECON 372-0 or ECON 373-0.", "descriptions": [{"name": "Overview of class", "value": "The environment and our natural resources are scarce yet their values are quite hard to determine. Furthermore, there are a variety of problems with the incentives to use them well. Using the tools of microeconomic analysis and some econometrics, this course will define and examine \"environmental problems\" in terms of economic efficiency. We will also discuss the methods (and shortcomings of these methods) used by economists and policymakers to place dollar values on environmental amenities (since such valuations will determine what policy options are deemed \"efficient\"), such as benefit-cost analysis. Then we will apply these tools to look at a particular set of environmental problems caused by negative externalities transmitted through naturally occurring amenities, and the effects of the policies we construct in response to these problems. <br/>NOTE: This class is not open to students who have taken Economics 370: Environmental & Natural Resource Economics."}, {"name": "Registration Requirements", "value": "Economics 310-1,2 Intermediate Microeconomics I & II, Economics 281 Introduction to Econometrics, or equivalents."}, {"name": "Learning Objectives", "value": "Understand the methods of estimating the social value of environmental resources<br/>Understand and apply fundamental tools and models of microeconomics to analyzing environmental questions, which involve cases where private market outcomes are not necessarily efficient (e.g., pollution, climate change)<br/>Understand and interpret relevant graphical analyses <br/>Use microeconomic tools to analyze important environmental regulatory policies <br/>Compare different institutional approaches to environmental policy (regulation, market based, common law) <br/>Understand the difficulties of formulating and evaluating environmental policy <br/>Understand the history and processes through which environmental policy has been made, and the difficulty of evaluating potentially corrective policies<br/>Familiarity with specific economic issues associated with environmental situations<br/>Understand the intertemporal tradeoffs in environmental issues, and the economic models used to evaluate them"}, {"name": "Teaching Method", "value": "The class will meet twice per week for 80 minute lectures, and there is a possibility of a TA section on Fridays if a TA is available for the class."}, {"name": "Evaluation Method", "value": "There will be homework, one midterm, written quizzes, and optional paper, and a final exam."}, {"name": "Class Materials (Required)", "value": "TBA"}, {"name": "Class Materials (Suggested)", "value": "TBA"}], "path": "/class-descriptions/4680/WCAS/ECON/372-0/12780", "instructor": ["Mark P Witte"], "class_attributes": "", "id": "12780", "subject": "ECON"}]