[{"class_mtg_info": [{"meet_t": "MoWeFr 2:00PM - 2:50PM", "meet_l": "Technological Institute L211"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "37257", "title": "WCAS PHYSICS 130-3-02 College Physics", "class_attributes": "Natural Sciences Distro Area<br/><br/>", "section": "37257", "instructors": [{"instructor_phone": "847/491-4568", "instructor_name": "Michael F Smutko", "instructor_addr": "Dearborn Observatory (2131 Tech Drive), Room 9A, Evanston"}], "associated_classes": [{"component": "DIS", "room": "Technological Institute L170", "meeting_time": "Th 2:00PM - 2:50PM"}, {"component": "DIS", "room": "Technological Institute L211", "meeting_time": "Th 2:00PM - 2:50PM"}], "topic": "", "course": "130-3", "descriptions": [{"name": "Overview of class", "value": "Overview of class: <br/>Wave phenomena, optics, quantum physics and special topics. Credit 1 quarter -course. Algebra-based physics primarily for Biology majors and premedical students who do not need to take calculus-based physics. Prerequisites: algebra and trigonometry, Physics 130-1,2 and concurrent registration in Physics 136-3.<br/><br/>Topics: <br/><br/>1. Waves in Elastic Medium <br/>2. Sound Waves <br/>3. Electromagnetic Waves<br/>4. The Nature and Propagation of Light <br/>5. Reflection and Refraction - Plane Waves and Plane Surfaces <br/>6. Reflection and Refraction - Spherical Waves and Spherical Surfaces <br/>7. Interference <br/>8. Diffraction <br/>9. Gratings and Spectra <br/>10. Polarization <br/>11. Light and Quantum Physics<br/>12. Waves and Particles<br/>13. Special Relativity <br/>14. Nuclear Physics"}, {"name": "Registration Requirements", "value": "Basic knowledge of High School algebra and trigonometry. Physics 130-1, 2.<br/>Concurrent enrollment in Physics 136-3."}, {"name": "Learning Objectives", "value": "We intend to teach the physical models of several natural phenomena at the level that students familiar with algebra and trigonometry can solve some of the simpler problems associated with the phenomena. We will demonstrate detailed strategies for solving these problems, point out how each strategy satisfies the assumptions of the models, and why other strategies might fail to satisfy some of these assumptions."}, {"name": "Teaching Method", "value": "Each lecture will detail the physical phenomenon under consideration and its mathematical model will be presented. Example problems will be presented for these phenomena along with relevant classroom demonstrations. Additional examples are provided in the textbook. During the weekly discussion period, the TA will demonstrate solutions to problems, answer questions about subject matter, and proctor a quiz."}, {"name": "Evaluation Method", "value": "Quizzes (best 5 out of 6) 20%<br/>Exam1: 25%<br/>Exam2: 25%<br/>Final Exam 30%"}, {"name": "Class Materials (Required)", "value": "Physics by Giancoli, 7th ed, publisher- Pearson<br/>scientific calculator"}, {"name": "Class Notes", "value": "Class supporting material will be posted to Canvas and students are expected to make use of this resource. Lecture slides, solutions to selected homework problems along with exam and quiz keys will be made available."}], "lmod": "4/3/16 8:15 PM (CT)", "subject": "PHYSICS"}]