[{"class_mtg_info": [{"meet_t": "Tu 2:00PM - 4:50PM", "meet_l": "University Library 4722"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Please contact the department of Spanish &amp; Portuguese to request a permission number, spanish-portuguese@northwestern.edu.", "qtr": "Winter 2017", "name": "24846", "title": "WCAS SPANPORT 420-0-1 Studies in 20th Century Literatures &amp; Cultures", "class_attributes": "", "section": "24846", "instructors": [{"instructor_phone": "", "instructor_name": "Lucille   Kerr", "instructor_addr": ""}], "topic": "", "course": "420-0", "descriptions": [{"name": "Overview of class", "value": "Testimonial narrative is among the most prominent-and most controversial-currents to have emerged in Latin America following the 1960s-1970s Boom era. Having now achieved canonical status within Latin American literary and cultural studies, the testimonial genre has generated discussion and debate inside and outside the academy about literature as an institution, authorship, truth, representation, memory, and subjectivity, among other topics.<br/><br/>Anchoring our work overall in the question &quot;How to read?&quot; we will begin by investigating the family of words and concepts that frame discussion of the genre and that testimonial works also interrogate. Next, we will take up theories and models of testimony drawn from a variety of sources inside and outside Latin America. The properly analytical body of the course will be organized around three clusters of materials, which offer different-yet related-angles from which to consider testimonial narrative. The first cluster will take Menchú's Me llamo Rigoberta Menchú as its focus, drawing into its orbit related testimonial narratives (e.g., Barnet), authorial theories of testimonio, and critical debates about the genre. The second cluster will center on Timerman's Preso sin nombre, celda sin número, focusing attention especially on the survivor-witness as the subject and object of testimonial works and theory, dramatized twenty years earlier by Walsh's Operación masacre. The third cluster will place in dialogue García Márquez's La aventura de Miguel Littín clandestino en Chile and Littín's film Acta General de Chile, and also set the stage for the &quot;concluding testimony&quot; of Patricio Guzmán's Nostalgia de la luz. The last two class sessions will be dedicated to seminar presentations that draw on materials from students' areas of research in relation to the seminar's topic.<br/><br/>The class will be conducted in English; primary texts are in Spanish (English editions can also be purchased to accompany original texts, if needed); secondary readings are in English and in Spanish."}], "lmod": "12/29/16 7:06 PM (CT)", "subject": "SPANPORT"}]