[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "University Hall 122"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "27423", "title": "WCAS ENVR_POL 390-0-1 Special Topics in Environmental Policy and Culture", "class_attributes": "Social &amp; Behavioral Sciences Distro Area<br/><br/>", "section": "27423", "instructors": [{"instructor_phone": "", "instructor_name": "Sinan   Erensu", "instructor_addr": ""}], "topic": "Global Commons, Dispossession and Resistance", "course": "390-0", "descriptions": [{"name": "Overview of class", "value": "Global commons today are a cause for concern and hope, both at the same time. On one hand, forests, rivers, oceans, and pastures across the world are increasing targets for extraction and urbanization projects. Large-scale corporate and state-led land grabs in the global South bring up questions of food security and sovereignty. The challenge of climate change points to the limits of contemporary capitalism and the scope of environmental degradation. On the other hand, citizens now turn to commons to find inspiration for alternative forms of work, consumption, management, and ownership. Global climate justice mobilization demands recognition of locally informed environmental practices. By investigating the historical, environmental and social dimensions of global commons, the course introduces an increasingly controversial policy realm. Yet it also puts nature into challenging conversations with legality, property, and sovereignty while discussing the cultural and political potential of the struggle for commons."}, {"name": "Teaching Method", "value": "Seminar, class discussions with some lecture component."}, {"name": "Evaluation Method", "value": "Discussion; response papers; midterm exam, final paper."}, {"name": "Class Materials (Required)", "value": "Please contact the Professor at erensu@northwestern.edu for class materials"}, {"name": "Class Materials (Suggested)", "value": "Attendance at first class required"}], "lmod": "12/29/16 6:58 PM (CT)", "subject": "ENVR_POL"}]