[{"class_mtg_info": [{"meet_t": "Th 6:15PM - 9:15PM", "meet_l": "Parkes Hall 214"}], "school": "SCS", "overview_of_class": "The intent of this course is to familiarize students with a wide range of Greek- and Latin-derived words encountered in scientific and primarily medical fields. Students learn the basic components and an understanding of the underlying principles of word formation, which includes acquiring a basic vocabulary of word roots, prefixes, and suffixes, much of which is a matter of applied memorization. It also includes analysis of words, aiming at an understanding of the relationship of their various components. Students will be able to develop, practice, reinforce and test these skills through a variety of in-class exercises, as well as regular tests (weekly quizzes, a midterm and a cumulative final exam). Once equipped with the knowledge of how all such words function, the meaning of thousands of scientific words encountered in context may be inferred with reasonable assurance of accuracy. <br/><br/>Another aim of the course is to acquaint students with the ancient Greek and Roman roots of scientific (specifically medical) inquiry. We will explore the ancients' philosophical ideas and understanding of the workings of the human body and mind and their views on health, healing, and disease patterns and patient care. We will also examine developments in science broadly speaking, and discoveries and advancements in ancient anatomy, physiology, surgery and pharmacology with ramifications for modern science in general, and medicine in particular.", "qtr": "Spring 2017", "name": "Scientific Vocabulary through Classical Roots", "title": "SCS CLASSICS 110-CN-66 Scientific Vocabulary through Classical Roots", "lmod": "2/22/17 6:41 PM (CT)", "section": "66", "instructors": [{"instructor_phone": "847/491-8043", "instructor_name": "Graziela Marieta Byros", "instructor_addr": "Kresge Hall 4357"}], "topic": "", "course": "110-CN", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "The intent of this course is to familiarize students with a wide range of Greek- and Latin-derived words encountered in scientific and primarily medical fields. Students learn the basic components and an understanding of the underlying principles of word formation, which includes acquiring a basic vocabulary of word roots, prefixes, and suffixes, much of which is a matter of applied memorization. It also includes analysis of words, aiming at an understanding of the relationship of their various components. Students will be able to develop, practice, reinforce and test these skills through a variety of in-class exercises, as well as regular tests (weekly quizzes, a midterm and a cumulative final exam). Once equipped with the knowledge of how all such words function, the meaning of thousands of scientific words encountered in context may be inferred with reasonable assurance of accuracy. <br/><br/>Another aim of the course is to acquaint students with the ancient Greek and Roman roots of scientific (specifically medical) inquiry. We will explore the ancients' philosophical ideas and understanding of the workings of the human body and mind and their views on health, healing, and disease patterns and patient care. We will also examine developments in science broadly speaking, and discoveries and advancements in ancient anatomy, physiology, surgery and pharmacology with ramifications for modern science in general, and medicine in particular."}, {"name": "Registration Requirements", "value": "None. No prior knowledge of Greek and Latin is required for this course."}, {"name": "Learning Objectives", "value": "-recognize and understand the meaning of individual components of medical/scientific terms and the ways in which they come together to form such terms<br/>-infer the meaning of previously unknown medical/scientific terms with reasonable assurance of accuracy, when encountering them in context<br/>-gain a broader sense of the early evolution of concepts, ideas, and practices that led to the gradual shaping of the medical profession and of scientific disciplines as they exist today."}, {"name": "Teaching Method", "value": "Class participation<br/>Discussion<br/>Group work<br/>Lecture"}, {"name": "Evaluation Method", "value": "Weekly quizzes<br/>Midterm exam<br/>Final exam<br/>Homework <br/>Class Participation<br/>Attendance"}, {"name": "Class Materials (Required)", "value": "1) Dunmore and Fleischer's Medical Terminology: Exercises in Etymology (3rd Edition) ISBN-10: 0803600321. (Available at Norris Center Bookstore, on Evanston campus). IMPORTANT: Since this is a workbook, please purchase a BRAND NEW 3rd edition, since a used one will likely have chapter exercises already filled in by a previous user - this will put you at a significant disadvantage in your preparation for tests and in practicing the concepts of the course, in general. <br/><br/>2) A good medical dictionary accessible online: I recommend Taber's Cyclopedic Medical Dictionary (22nd edition) edited by Clayton L. Thomas (Publisher: F.A. Davis). Taber's 22 (one year subscription) for tablet, smart phone App etc. may be purchased at http://www.tabers.com/tabersonline<br/><br/>Additional class materials (handouts, worksheets, PDFs of lecture slides) will be posted weekly on the CANVAS course site."}, {"name": "Class Notes", "value": "This is not an anatomy/ physiology/ pathology class: all discussions of these areas of knowledge/expertise will be very limited in scope, and this course does not aim at a comprehensive understanding of body systems and medical conditions."}], "path": "/class-descriptions/4660/SCS/CLASSICS/110-CN/38106", "instructor": ["Graziela Marieta Byros"], "class_attributes": "", "id": "38106", "subject": "CLASSICS"}]