[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Parkes Hall 223"}], "school": "WCAS", "overview_of_class": "The world of Henry James teems with dangerous secrets and social intrigue. As they navigate the hazardous waters of respectable society, James's characters engage in illicit affairs, spread rumors, and betray one another, concealing their pasts and excavating the private lives of others. In this course, we will read short works and two longer novels by James, paying special attention to the secrets and lies that abound in his fiction. As we untangle the enigmatic personal histories and treacherous relationships of his characters, we will examine how the social world of his fiction channels broader questions about cultural identity, including about nationality, gender, and class.  We will also dwell on the parallels between James's representations of social secrets and his aesthetic interest in questions about knowledge, narration, and interpretation.", "qtr": "Winter 2016", "name": "20th Century Fiction", "title": "WCAS ENGLISH 363-2-20 20th Century Fiction", "lmod": "1/9/16 6:47 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Maha Zehra Jafri", "instructor_addr": ""}], "topic": "Secrets, Lies, and Henry James", "course": "363-2", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "The world of Henry James teems with dangerous secrets and social intrigue. As they navigate the hazardous waters of respectable society, James's characters engage in illicit affairs, spread rumors, and betray one another, concealing their pasts and excavating the private lives of others. In this course, we will read short works and two longer novels by James, paying special attention to the secrets and lies that abound in his fiction. As we untangle the enigmatic personal histories and treacherous relationships of his characters, we will examine how the social world of his fiction channels broader questions about cultural identity, including about nationality, gender, and class. We will also dwell on the parallels between James's representations of social secrets and his aesthetic interest in questions about knowledge, narration, and interpretation."}, {"name": "Teaching Method", "value": "Discussion"}, {"name": "Evaluation Method", "value": "Essays, Canvas posts, class participation."}, {"name": "Class Materials (Required)", "value": "The Portrait of a Lady, The Aspern Papers, What Maisie Knew, The Turn of the Screw, &quot;The Beast in the Jungle,&quot; and &quot;The Figure in the Carpet.&quot;"}], "path": "/class-descriptions/4610/WCAS/ENGLISH/363-2/25461", "instructor": ["Maha Zehra Jafri"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "25461", "subject": "ENGLISH"}]