[{"class_mtg_info": [{"meet_t": "Tu 6:15PM - 9:15PM", "meet_l": "University Hall 121"}], "school": "SCS", "overview_of_class": "In this writing-intensive course, we read canonical and noncanonical American texts in order to develop some theoretical sophistication in reading narrative and crafting literary arguments. We explore different methods of interpreting narrative in terms of genre (What happens to us as readers when we place a text in a specific genre, such as the detective story or Great American Novel? How do generic expectations work on our interpretive experience?); aesthetic form (What do we mean when we call a writer's prose \"beautiful\" or a plot well-constructed? How do literary standards work to constitute values?); and ideological content (How do we judge a text's position in relation to historical and contemporary political issues, including-but not limited to-matters of gender, race and class?). Our focusing lens is the theme of criminality: What counts as transgression against norms, both within texts (Who are the criminals? Who makes the laws? What is appropriate punishment for crimes?) and in our wider literary culture (What makes a text obscene and therefore criminal? What makes a text worthy or unworthy of serious consideration? Who makes these literary \"laws\"?) As an introductory seminar and requirement for English majors, the course focuses deeply on the composition and revision of effective literary arguments. Students who enroll should have fulfilled the SCS writing requirement or taken equivalent writing courses.", "qtr": "Winter 2016", "name": "Introductory Seminar in Reading and Interpretation", "title": "SCS ENGLISH 298-CN-64 Introductory Seminar in Reading and Interpretation", "lmod": "1/9/16 6:41 PM (CT)", "section": "64", "instructors": [{"instructor_phone": "847/491-8916", "instructor_name": "William J Savage", "instructor_addr": "1908 Sheridan Road, OUSA"}], "topic": "Crime & Criminal in American Narratives", "course": "298-CN", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "In this writing-intensive course, we read canonical and noncanonical American texts in order to develop some theoretical sophistication in reading narrative and crafting literary arguments. We explore different methods of interpreting narrative in terms of genre (What happens to us as readers when we place a text in a specific genre, such as the detective story or Great American Novel? How do generic expectations work on our interpretive experience?); aesthetic form (What do we mean when we call a writer's prose &quot;beautiful&quot; or a plot well-constructed? How do literary standards work to constitute values?); and ideological content (How do we judge a text's position in relation to historical and contemporary political issues, including-but not limited to-matters of gender, race and class?). Our focusing lens is the theme of criminality: What counts as transgression against norms, both within texts (Who are the criminals? Who makes the laws? What is appropriate punishment for crimes?) and in our wider literary culture (What makes a text obscene and therefore criminal? What makes a text worthy or unworthy of serious consideration? Who makes these literary &quot;laws&quot;?) As an introductory seminar and requirement for English majors, the course focuses deeply on the composition and revision of effective literary arguments. Students who enroll should have fulfilled the SCS writing requirement or taken equivalent writing courses."}, {"name": "Learning Objectives", "value": "By the end of the course, students will be able to recognize what differentiates a literary argument from a mere description or book report (hint: an argumentative thesis statement); be able to construct a solid literary argument through effective use of evidence and construction of a paper, from word choice up to sentences, paragraphs, and overall argumentative structure. Students will also be well-versed in the differences between canonical &quot;Literature&quot; and popular fictions, different media, and how, as a culture, Americans think about crime and identity."}, {"name": "Class Materials (Required)", "value": "Students are expected to purchase books on their own. <br/><br/>Texts include:<br/><br/>Twain, Mark. Pudd'nhead Wilson; <br/>Hawthorne, Nathaniel. The Scarlet Letter;<br/>Fitzgerald, F. Scott. The Great Gatsby; <br/>Chandler, Raymond. The Big Sleep;<br/>Thompson, Jim. The Killer Inside Me; <br/>Azzarello and Risso, 100 Bullets: First Shot, Last Call; <br/>Algren, Nelson. The Man with the Golden Arm. <br/><br/>We will also view three films: The Big Sleep (1946), Thelma and Louise, and Pulp Fiction."}, {"name": "Class Notes", "value": "This class is always a lot of fun to teach and (I hope) to take. I strive to make it useful in a practical way ( to improve everyone's writing) and in a philosophical way: the material we discuss (American identity, the nature of crime and criminals) applies outside the classroom walls."}], "path": "/class-descriptions/4610/SCS/ENGLISH/298-CN/27776", "instructor": ["William J Savage"], "class_attributes": "", "id": "27776", "subject": "ENGLISH"}]