[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "2122 Sheridan Rd Classroom 231"}], "school": "WCAS", "overview_of_class": "This is the second, advanced urban politics course.  We will consider selected contemporary urban problems, policies and political processes, including the demographic and economic restructuring of cities and regions; the challenge of immigration; the fiscal crisis and urban development; the emergence of global cities; suburbanization and urban sprawl; race, class and inequality; housing policy; crime and justice; urban governance in a federal system; and the character of 21st Century urban politics and political movements. Note that there will be a special focus throughout (usually every Wednesday) on Chicago, a city that exhibits all of the promises and pathologies of urban life.", "qtr": "Winter 2016", "name": "Community Political Processes", "title": "WCAS POLI_SCI 321-0-20 Community Political Processes", "lmod": "1/9/16 6:52 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Wesley G Skogan", "instructor_addr": ""}], "topic": "", "course": "321-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "This is the second, advanced urban politics course. We will consider selected contemporary urban problems, policies and political processes, including the demographic and economic restructuring of cities and regions; the challenge of immigration; the fiscal crisis and urban development; the emergence of global cities; suburbanization and urban sprawl; race, class and inequality; housing policy; crime and justice; urban governance in a federal system; and the character of 21st Century urban politics and political movements. Note that there will be a special focus throughout (usually every Wednesday) on Chicago, a city that exhibits all of the promises and pathologies of urban life."}, {"name": "Registration Requirements", "value": "Attendance at first class required"}, {"name": "Learning Objectives", "value": "The goal of this course is to help you think critically and analytically about urban issues and to understand the relationship between cities and the institutional, social, economic and political forces that surround them."}, {"name": "Teaching Method", "value": "Lecture &amp; Discussion"}, {"name": "Evaluation Method", "value": "There will be an early course paper proposal followed by a course paper, plus mid-term and final exams. A detailed description of the paper requirements can be found on the course web site. The mid-term and final exams are also described on the web site, along with sample exam questions. The final exam must be held at the time scheduled by the Registrar. Your grade will be based on this formula: mid-term exam 25%; final exam 30%; paper 35%; class attendance and participation 10%."}, {"name": "Class Materials (Required)", "value": "Class Materials/Reading List: Kantor and Judd, American Urban Politics in a Global Age, Longman, 7th Edition"}], "path": "/class-descriptions/4610/WCAS/POLI_SCI/321-0/24398", "instructor": ["Wesley G Skogan"], "class_attributes": "", "id": "24398", "subject": "POLI_SCI"}]