[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Harris Hall 107"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "14142", "title": "WCAS RELIGION 210-0-20 Introduction to Buddhism", "class_attributes": "Ethics &amp; Values Distro Area<br/><br/>", "section": "14142", "instructors": [{"instructor_phone": "", "instructor_name": "Charles Scott Preston", "instructor_addr": ""}], "associated_classes": [{"component": "DIS", "room": "Kresge Centennial Hall 2-325", "meeting_time": "Th 2:00PM - 2:50PM"}, {"component": "DIS", "room": "University Library 5746", "meeting_time": "Th 3:00PM - 3:50PM"}, {"component": "DIS", "room": "Kresge Centennial Hall 2-430", "meeting_time": "Fr 9:00AM - 9:50AM"}, {"component": "DIS", "room": "Kresge Centennial Hall 2-430", "meeting_time": "Fr 10:00AM - 10:50AM"}, {"component": "DIS", "room": "Kresge Centennial Hall 4-410", "meeting_time": "Fr 11:00AM - 11:50AM"}, {"component": "DIS", "room": "Kresge Centennial Hall 2-343", "meeting_time": "Fr 12:00PM - 12:50PM"}, {"component": "DIS", "room": "Kresge Centennial Hall 2-425", "meeting_time": "Fr 12:00PM - 12:50PM"}, {"component": "DIS", "room": "Kresge Centennial Hall 2-343", "meeting_time": "Fr 1:00PM - 1:50PM"}, {"component": "DIS", "room": "University Library 5746", "meeting_time": "Th 4:00PM - 4:50PM"}], "topic": "", "course": "210-0", "descriptions": [{"name": "Overview of class", "value": "This course might be called an introduction to Buddhisms and Buddhists, with an emphasis on the plural. Throughout the course, we will study the various philosophies, traditions, and practices oriented around the Buddha and his teachings, the historical journey of Buddhist ideas and practices through Asia, the people who observe these forms of Buddhism (from followers of Amitabha to Zen), and interactions between Buddhist groups and governments. We will begin by studying the origin of Buddhism&#39;s fundamental teachings in the context of Indian religion and society, and we will proceed to trace the tradition and its developments in Sri Lanka, Southeast Asia, Tibet, China, Korea, and Japan. We will have occasion to look at Buddhism&#39;s spread to the United States and the politics of its return to modern India. Along the way, we will be analyzing primary texts and philosophies, viewing and discussing ritual practices, learning the socio-political contexts in which Buddhist ideas developed and exist today, noting transformative interactions with other religions, and hearing the stories and experiences of practicing Buddhists. One component of the course will be to visit a Buddhist religious site and to write about the experience."}, {"name": "Class Materials (Required)", "value": "Buddhism: Introducing the Buddhist Experience, Third Edition. Edited by Donald W. Mitchell and Sarah H. Jacoby. Oxford University Press, 2014.<br/>The Dhammapada: The Path of Perfection, trans. Juan Mascaro, Penguin Books, 1973.<br/>Sid Brown, The Journey of One Buddhist Nun: Even Against the Wind, SUNY Press, 2001.<br/>The Essential Zen. Edited by Kazuaki Tanahashi and David T. Schneider, HarperSanFrancisco, 1995."}], "lmod": "10/30/16 7:09 PM (CT)", "subject": "RELIGION"}]