[{"class_mtg_info": [{"meet_t": "We 4:00PM - 6:50PM", "meet_l": "Kresge 5531 Comp Lit. Sem. Rm."}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "24117", "title": "WCAS FRENCH 470-0-20 Topics in Literary Theory", "class_attributes": "", "section": "24117", "instructors": [{"instructor_phone": "847/491-8259", "instructor_name": "Alessia   Ricciardi", "instructor_addr": "1860 S. Campus Drive, Crowe Hall #2-133"}], "topic": "Agamben", "course": "470-0", "descriptions": [{"name": "Overview of class", "value": "This course provides an introduction to the philosophy of Giorgio Agamben, particularly the texts that he includes within the Homo Sacer cycle. We discuss the genealogy and influence of the pivotal concepts that he espouses such as homo sacer, bare life, and the state of exception. These notions have generated both vital interest and vehement controversies that seem likely to endure for quite some time. For example, does the notion of homo sacer help or hinder us from assessing the critical implications of the current global refugee crisis? Through such question, we examine the advantages and limits of Agamben's thought for contemporary discussions of biopolitics, political philosophy, the Shoah, and postcolonial studies. Finally, by considering Agamben's encounters with figures such as Melville, Kafka, and Levi, we ask whether his literary readings offer a more productive horizon than does the rest of his thought. Over the course of the term, we will cover texts by Agamben, Foucault, Schmitt, Benjamin, Butler, Levi, Kafka, and Melville."}, {"name": "Evaluation Method", "value": "? Participation in class discussion (20%)<br/>? Oral presentation of 10-15 minutes (10%)<br/>? Two short written assignments of 3 pages each in response to a specific text (30%)<br/>? Final paper of 12-13 pages (40 %)"}, {"name": "Class Materials (Required)", "value": "? Homo Sacer: Sovereign Power and Bare Life<br/>? Remnants of Auschwitz: The Witness and The Archive<br/>? State of Exception<br/>? Additional selections from Agamben's The Kingdom and the Glory, Opus Dei, and The Highest Poverty may be part of reading assignments <br/><br/>Secondary readings will include selections from Foucault on biopolitics, Benjamin's &quot;Critique of Violence,&quot; Levi's If This Is a Man, and Schmitt's Political Theology (excerpts), Butler's Precarious Life (excerpts), Svirsky, Marcelo and Simone Bignall, eds. Agamben and Colonialism, Weheliye, Alexander Habeas Viscus: Racializing Assemblages, Biopolitics, and Black Feminist Theories of the Human."}, {"name": "Class Notes", "value": "Taught seminar style."}], "lmod": "12/29/16 6:58 PM (CT)", "subject": "FRENCH"}]