[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "Swift Hall 107"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "31276", "title": "WCAS LING 270-0-20 Meaning", "class_attributes": "Formal Studies Distro Area<br/><br/>", "section": "31276", "instructors": [{"instructor_phone": "", "instructor_name": "Alexis Cornelia Wellwood", "instructor_addr": ""}], "topic": "", "course": "270-0", "descriptions": [{"name": "Overview of class", "value": "The ability to use language to communicate meaning is one of the most fundamental aspects of being human. But what is ?meaning'? We approach this difficult question by investigating what speakers know about how meaning is conveyed in language, including the distinction between what expressions literally mean, and the different shades of meaning that expressions can take on in different contexts of use. In carrying out this study, we plumb the linguist's toolkit (which includes tools borrowed from mathematics, logic, language acquisition, and cognitive neuroscience) to discover how linguistic scientists determine, in a rigorous way, what a given word or sentence means, and whether that word or sentence means the same thing across occasions of use. This inquiry will lead the student to an understanding of the scientific study of language, by examining how it plays out in the domain of linguistic meaning. And by the end of the course, students will have gained a deeper appreciation for one of the most important, yet still most elusive aspects of the human capacity for language."}, {"name": "Learning Objectives", "value": "- a deep understanding of several dimensions of meaning (including entailment, implicature, and presupposition)<br/>- working knowledge of several analytical tools used to investigate meaning"}, {"name": "Teaching Method", "value": "Discussion and Lecture"}, {"name": "Evaluation Method", "value": "Two take home exams"}, {"name": "Class Materials (Required)", "value": "There is a small textbook for this class. Additional readings will be made available on the course website. <br/><br/>Elbourne, Paul. Meaning: A slim guide to semantics. Oxford University Press, 2011."}, {"name": "Class Materials (Suggested)", "value": "Additional readings will be available on the blackboard website."}], "lmod": "4/3/16 8:10 PM (CT)", "subject": "LING"}]