[{"class_mtg_info": [{"meet_t": "Th 6:15PM - 9:15PM", "meet_l": "Parkes Hall 213"}], "school": "SCS", "overview_of_class": "This course is designed for those who have experience with college-level writing but who want to sharpen their writing and communication skills. Students learn to apply measures of excellence in business writing and communication. Assignments relate to business environments, including audience analysis, persuasive writing, verbal and interpersonal communication, and document design and graphics. Writers gain experience writing in collaborative environments. Students produce multiple drafts and receive feedback from their peers and the instructor. <br/><br/>This hybrid course combines in-class lecture and discussion on campus with online sessions. In-class meeting dates will be announced during the first class. Attendance at the first session is mandatory; attendance is required for all subsequent sessions. Absences for in-class meetings will significantly affect your final grade. Homework will be due in class and online.", "qtr": "Spring 2017", "name": "Intermediate Composition", "title": "SCS ENGLISH 205-CN-66 Intermediate Composition", "lmod": "2/24/17 6:42 PM (CT)", "section": "66", "instructors": [{"instructor_phone": "", "instructor_name": "Leslie   Fischer", "instructor_addr": "555 Clark St., 240"}], "topic": "Business Communication", "course": "205-CN", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "This course is designed for those who have experience with college-level writing but who want to sharpen their writing and communication skills. Students learn to apply measures of excellence in business writing and communication. Assignments relate to business environments, including audience analysis, persuasive writing, verbal and interpersonal communication, and document design and graphics. Writers gain experience writing in collaborative environments. Students produce multiple drafts and receive feedback from their peers and the instructor. <br/><br/>This hybrid course combines in-class lecture and discussion on campus with online sessions. In-class meeting dates will be announced during the first class. Attendance at the first session is mandatory; attendance is required for all subsequent sessions. Absences for in-class meetings will significantly affect your final grade. Homework will be due in class and online."}, {"name": "Registration Requirements", "value": "Prerequisite: ENGLISH 111 or equivalent."}, {"name": "Learning Objectives", "value": "Students will learn:<br/><br/>-The goals of effective business writing:<br/>Addresses particular readers <br/>Helps readers solve problems <br/>Is produced collaboratively <br/>Consists of words or graphics or both<br/>Reflects an organization's goals and culture<br/>Uses design to increase readability<br/><br/>-Writing and communication strategies and relate them to business environments, including audience analysis, persuasive writing, verbal and interpersonal communication, document design and graphics;<br/> <br/>-Independently and proactively, to identify current and potential professional challenges; devise a plan, and write documents that address those challenges;<br/><br/>-To relate to colleagues, gaining experience writing in collaborative environments. Although a project using more than one writer is not required, students will learn the value of both colleague review of writing and consulting colleagues during the research phase of projects;<br/><br/>-To develop and to select writing and communication strategies integral to professional development."}, {"name": "Teaching Method", "value": "The primary mode of teaching will be class discussion and writers' workshop. Students will be experienced to actively engage with the course material in class discussions, classroom writing activities, and writing and responding to their classmates' writing."}, {"name": "Class Materials (Required)", "value": "Texts may include the following. Visit the campus bookstore or its website to confirm materials for the course:<br/><br/>Mike Markel, Technical Communication. 10th edition. Bedford St. Martin's Press."}], "path": "/class-descriptions/4660/SCS/ENGLISH/205-CN/38066", "instructor": ["Leslie   Fischer"], "class_attributes": "", "id": "38066", "subject": "ENGLISH"}]