[{"class_mtg_info": [{"meet_t": "MoWe 3:30PM - 4:50PM", "meet_l": "University Library 4770"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Winter 2016", "name": "25420", "title": "WCAS ENGLISH 101-6-23 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "25420", "instructors": [{"instructor_phone": "", "instructor_name": "Jay A Grossman", "instructor_addr": ""}], "topic": "Big Books", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "One could search high and low through the annals of American literature without being able to find two BIGger BOOKS than the ones we will read in Winter 2016: Uncle Tom's Cabin and Moby-Dick. For one thing, both books are long, and part of what we will talk about are the specific pleasures and challenges of reading BIG BOOKS. How do we gauge, and thereby engage with, narratives of disproportionate scale and encyclopedic ambition? How do we lose, or find, our place in colossal fictional worlds?<br/><br/>But Stowe's Uncle Tom's Cabin and Melville's Moby-Dick are BIG BOOKS in another way, too. Each of them has been a hugely influential and profoundly consequential novel. Indeed, one cannot really understand American literary and cultural history if one is not familiar with these two BIG BOOKS. Harriet Beecher Stowe's novel was a watershed text for both sides in the Civil War. Upon meeting Stowe, Abraham Lincoln reportedly said to her, &quot;So you're the little woman who wrote the book that made this great war!&quot; Stowe's novel sold 300,000 copies in the first year?an unprecedented number?and her story became the basis for countless stage adaptations, spin-offs, parodies, editorials, refutations, and re-writes. (Check out some of them here: <a>http://utc.iath.virginia.edu</a>) The reputation of Melville's novel took longer to take shape?its early readers enjoyed the material about whaling, but didn't quite know what to make of the story of Ahab's obsession with the White Whale. But over the course of the twentieth century these views reversed themselves, and Ahab's maniacal quest has come to be widely recognized as one of the masterpieces of world literature. Our work in Winter 2016 will be, like Ahab, to take on these Leviathans, these BIG BOOKS, better to understand them and the worlds they shaped?including our own."}, {"name": "Teaching Method", "value": "Discussion"}, {"name": "Evaluation Method", "value": "Your final grade will be based on both your written work and your informed seminar participation. Papers completed later in the quarter will count more than earlier ones, and substantive revisions will count more than first versions."}, {"name": "Class Materials (Required)", "value": "-Harriet Beecher Stowe, Uncle Tom's Cabin; or, Life Among the Lowly (first published 1851).<br/><br/>-Herman Melville, Moby-Dick; or, The Whale (first published 1851)."}], "lmod": "1/9/16 6:46 PM (CT)", "subject": "ENGLISH"}]