[{"school": "WCAS", "overview_of_class": "What is Sex?<br/><br/>This course asks the question, &quot;What is sex?&quot; - from a feminist and queer perspective. We will use ethnography as the tool to look for answers. Turning away from recent preoccupations with sexuality as an identity or an orientation, our focus will be on sex itself - the sexed body and sex acts. The course is about &quot;Sex and?&quot;, where the ?and' includes &quot;and race&quot;, &quot;and class&quot;, &quot;and disability&quot;, &quot;and money&quot;, &quot;and violence&quot;?.. It is also about &quot;Sex in?&quot;, where the ?in' includes ?in Brazil', ?in Cuba', ?in Silicon Valley', ?in Peru'? (Most case studies are from the Americas, including the U.S., Canada, Latin America and the Caribbean). Our readings and discussions will be framed around four general themes: sexed bodies; sex work; sexual violence; sexual reproduction.", "name": "Topics in Anthropology", "section": "25", "topic": "Anthropological Study of Gender &amp; Sexuality", "course": "490-0", "meeting_time": ["Mo 6:00PM - 8:50PM"], "path": "/class-descriptions/4650/WCAS/ANTHRO/490-0/23130", "instructor": ["Mary J Weismantel"], "id": "23130", "subject": "ANTHRO"}, {"school": "WCAS", "overview_of_class": "Humans are primates. To understand humans and where we come from, we must also learn about what it is to be a nonhuman primate. This course will guide you through the remarkable diversity of primate behavioral strategies and ecological adaptations. You will learn about fundamental theoretical concepts in behavioral ecology (the discipline studying the evolutionary basis of animal behavior), and become familiar with both classic and recent, cutting-edge empirical research in primatology, an exciting and fast-paced subfield of biological anthropology. We will cover key topics that address some of the hallmarks of primates: sociality, cooperation, and intelligence. We will examine primate variation in feeding ecology, reproductive strategies, and development to trace our shared ancestry within this group of mammals. Infanticide, sexual coercion, and lethal aggression are part of the life of many primates and we will address these behaviors from an evolutionary perspective to understand when and why they are likely to occur. We will also consider the evidence for primate culture and how it compares to what we usually consider as ?culture' in humans. Finally, drawing on the biological and ecological characteristics of primates we will ask why so many primate species are facing extinction in the wild and what can be done to prevent that. By the end of this course you will have a solid understanding of the behavioral diversity across the Primate order and how humans fit in it, placing our own biology in a comparative perspective.<br/><br/>This course will feature two required practical sessions at The Field Museum and Lincoln Park Zoo, where you will learn and practice methods for observing and interpreting primate taxonomic diversity (at the Museum) and behavior (at the Zoo).", "name": "Topics in Anthropology", "section": "26", "topic": "Primate Behavioral Ecology", "course": "490-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4650/WCAS/ANTHRO/490-0/28154", "instructor": ["Alexander Ventsislavov Georgiev"], "id": "28154", "subject": "ANTHRO"}]