[{"class_mtg_info": [{"meet_t": "Tu 6:15PM - 9:15PM", "meet_l": "Technological Institute LG76"}], "school": "SCS", "overview_of_class": "This course simulates how teams can and should work together and how teams make decisions in \"the real world.\" Ideally, success in this class will help students succeed in other team settings on campus and elsewhere. Theories and research relating to the various processes by which leaders make decisions, affect group behavior, and engage groups in a variety of task- and strategy-related outcomes is covered, and group communication is stressed, with a particular emphasis on change and conflict.", "qtr": "Winter 2016", "name": "Team Leadership and Decision Making", "title": "SCS COMM_ST 250-CN-64 Team Leadership and Decision Making", "lmod": "1/9/16 6:41 PM (CT)", "section": "64", "instructors": [{"instructor_phone": "", "instructor_name": "Adam Joseph Goodman", "instructor_addr": ""}], "topic": "", "course": "250-CN", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "This course simulates how teams can and should work together and how teams make decisions in &quot;the real world.&quot; Ideally, success in this class will help students succeed in other team settings on campus and elsewhere. Theories and research relating to the various processes by which leaders make decisions, affect group behavior, and engage groups in a variety of task- and strategy-related outcomes is covered, and group communication is stressed, with a particular emphasis on change and conflict."}, {"name": "Learning Objectives", "value": "This course is intended to help you learn how to reliably and repeatedly work with others in a disciplined and collegial manner now and for the future. It does not provide ready answers to simple questions that can be applied in a formulaic manner. Nor will memorization of facts or models aid your success. Your success depends on your ability to:<br/>-Think critically<br/>-Ask great questions<br/>-Synthesize the lecture material, small group work, and readings<br/>-Express yourself in a concise and effective manner<br/>-Challenge and play well with your peers and us<br/>-Diagnose and overcome indifference, freeloading and failure"}, {"name": "Class Materials (Required)", "value": "Materials may include the following:<br/><br/>Harvard Business School Press. (2013). HBR's 10 Must Reads on Making Smart Decisions. Boston, MA, USA: Harvard Business Press.<br/>Harvard Business Review. (2011). HBR's 10 Must Reads on Change. Boston, MA, USA: Harvard Business Publishing.<br/>Harvard Business School Press. (2013). HBR's 10 Must Reads on Teams. Boston, MA, USA: Harvard Business Press.<br/>Each student will also buy four Harvard Business School case studies that are assigned as the course proceeds."}, {"name": "Class Materials (Suggested)", "value": "Recommended Text: Ellet, W. (2007). The Case Study Handbook: How to Read, Discuss, and Write Persuasively About Cases . Boston, MA, USA: Harvard Business School Press."}, {"name": "Class Notes", "value": "A key goal for the course is to simulate how teams can and should work together and how teams also make decisions - in the &quot;real world.&quot; Ideally, your success in this class will help you succeed in other team settings on campus and elsewhere. So, this course is organized in a manner that is different than you might expect. My goal is that you be supported by me and, at the same time, challenged by the way this course works. If you're ready for something different, then this class is for you!"}], "path": "/class-descriptions/4610/SCS/COMM_ST/250-CN/27767", "instructor": ["Adam Joseph Goodman"], "class_attributes": "", "id": "27767", "subject": "COMM_ST"}]