[{"school": "WCAS", "overview_of_class": "In the early eighteenth century, men often suggested that women writing for money was equivalent to women displaying their bodies publicly. Society saw women's writing as transgressive, scandalous, gratuitous, even obscene. In a word, women's writing?no matter how normative in its intentions?was almost always perceived as queer. Over the course of the eighteenth century, a normative strand of \"proper\" women's fiction began to emerge; yet women's writing remained controversial and has continued to challenge heteropatriarchal social norms to the present day. This class will look at social discourses designed to discipline and domesticate women's writing, but we will focus on the varied, shrewd, and often playful methods employed by women to subvert such discourses and expectations. We will be exploring many related questions. What does it mean for a woman to write \"queerly\"? How does queerness show up in both content and in subversive narrative structures? How can we account for the ever-shifting definition of the normative and, therefore, the queer? How do race and class intersect with queer femininity across time? <br/><br/>We will read women's writing from a variety of genres across time: Aphra Behn's play The Rover, Anne Lister's diary, Emily Dickinson's poetry, Virginia Woolf's Orlando, Audre Lorde's essays, Emma Donoghue's queer fairy tales, Octavia Butler's Fledgling, and Alison Bechdel's comic strip, Dykes to Watch Out For.", "name": "Gender, Sexuality, and Literature", "section": "20", "location": "Kresge Centennial Hall 2-420", "topic": "Prostitutes of the Pen: Queer Women?s Writing from", "course": "361-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4660/WCAS/GNDR_ST/361-0/33914", "instructor": ["Hannah Molly Chaskin"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "33914", "subject": "GNDR_ST"}, {"school": "WCAS", "overview_of_class": "What was queer life like when terms such as \"homosexuality,\" \"gay,\" and \"lesbian\" were new, and few people used them or knew what they meant? What possibilities did queer people imagine for how their lives could turn out, with no firmly established vocabularies or role models available? How did queer people express their political beliefs, desires, and aspirations before the onset of social movements after World War II? How do these queer imaginaries look different from or similar to those that would come after? To investigate the sexual and gendered contours of this period, we will explore how authors in the early twentieth century tackled these and related questions in literature, grappling with the political and social challenges and possibilities of the time. The seminar is organized around three key sites of literary production - London, New York, and Paris - and the writers who resided in them, thus taking part in new cross-cultural experiments and innovations in art and literature. These cities were locations where authors from around the world entered debates about what it meant to experience non-normative sexuality and gender in the first few decades of a new century, a period of political and social unrest not unlike our own.<br/><br/>To these ends, we will explore a survey of queer literature from the first half of the twentieth century, ranging from fiction by Oscar Wilde, Nella Larsen, and Virginia Woolf to poetry by Langston Hughes, Federico Garcia Lorca, and the Baroness Elsa von Freytag-Loringhoven. We will also read several short pieces of relevant contemporary scholarship and theory on the history of sexuality, queer literature, and transnational studies.", "name": "Gender, Sexuality, and Literature", "section": "21", "location": "Kresge Centennial Hall 2-420", "topic": "Before Activism: Global Queer Modernisms", "course": "361-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4660/WCAS/GNDR_ST/361-0/33915", "instructor": ["Todd G Nordgren"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>", "id": "33915", "subject": "GNDR_ST"}]