[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "University Hall 101"}], "school": "WCAS", "enrl_requirement": "<br/>Add Consent: Department Consent Required<br/>", "qtr": "Spring 2016", "name": "31179", "title": "WCAS HUM 370-4-20 Special Topics in the Humanities", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "31179", "instructors": [{"instructor_phone": "847/491-3418", "instructor_name": "Melissa A Macauley", "instructor_addr": "Harris Hall Room 344"}], "topic": "China and the West", "course": "370-4", "descriptions": [{"name": "Overview of class", "value": "Modern world history is a story of cultural, economic, and biological interchange. This seminar explores some of the ways people and things circulated between China and &quot;the West&quot; (primarily Great Britain but also continental Europe and, to a lesser extent, the United States) from roughly 1839 to the mid-twentieth century. The course primarily will focus on the Euro-American influence on modern China, but we will not ignore the question of how China contributed to the transformation of the modern West. We will concentrate on particular topics (intellectual and scientific exchange, the transformation of women's lives, the opium trade, the missionary enterprise, war, and treaty ports as sites of cultural hybridity and change). Students will also write a term paper on a particular topic of interest to them."}, {"name": "Registration Requirements", "value": "No prerequisites."}, {"name": "Teaching Method", "value": "SeminarThe class will begin with two lectures to ensure that all seminar participants have a basic historical knowledge of the subject."}, {"name": "Evaluation Method", "value": "Discussion, one short (2-3 pages) analytical paper, one term paper (10-15 pages)."}, {"name": "Class Materials (Required)", "value": "TBA, but will include a mixture of primary source material [for example, J.D. Frodsham, tr., <em>The First Chinese Embassy to the West: The Journals of Kuo Sung-t'ao, Liu Hsi-hung, and Chang Te-yi</em>; and F.S. Liu, &quot;Adultery as Crime in China,&quot; China Law Review (1935)] and scholarly historical studies (for example Xu Guoqi, <em>Strangers on the Western Front: Chinese Workers in the Great War</em>; and Jonathan Spence, <em>God's Chinese Son: The Taiping Heavenly Kingdom of Hong Xiuquan</em>)."}], "lmod": "4/3/16 8:08 PM (CT)", "subject": "HUM"}]