[{"class_mtg_info": [{"meet_t": "TuTh 11:00AM - 12:20PM", "meet_l": "Technological Institute M164"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "22730", "title": "WCAS PHIL 255-0-20 Theory of Knowledge", "class_attributes": "Ethics &amp; Values Distro Area<br/><br/>", "section": "22730", "instructors": [{"instructor_phone": "847/491-2557", "instructor_name": "Jennifer Amy Lackey", "instructor_addr": "Crowe 1-144"}], "associated_classes": [{"component": "DIS", "room": "Kresge 3438 Philosophy Sem. Rm", "meeting_time": "Mo 9:00AM - 9:50AM"}, {"component": "DIS", "room": "Kresge 3438 Philosophy Sem. Rm", "meeting_time": "Mo 10:00AM - 10:50AM"}, {"component": "DIS", "room": "University Library 4722", "meeting_time": "Mo 11:00AM - 11:50AM"}, {"component": "DIS", "room": "University Library 4770", "meeting_time": "Mo 2:00PM - 2:50PM"}], "topic": "", "course": "255-0", "descriptions": [{"name": "Overview of class", "value": "Navigating the world as epistemic agents comes with great responsibility. Our beliefs guide every aspect of our lives?from choices about our friends and lifelong partners to our votes for political leaders and our decisions about life-and-death matters. Should our beliefs be responsive to only truth-related features, such as evidence and reliability, or do our relationships with others also bear on the appropriateness of our beliefs? How should our belief-forming practices respond to worries about implicit bias that are likely to impact the credibility we afford to members of marginalized groups? How much should we rely on our own abilities as epistemic agents, and how much should we defer to others? Can we have knowledge in domains rife with deep disagreement, such as in ethics and politics? These are some of the questions we will take up in this class, with particular attention paid to the ways in which our places in the social world impact our status as knowers."}, {"name": "Learning Objectives", "value": "The abilities to think, read, and write critically, to develop and defend arguments, and to appropriately justify one's views will be emphasized as central learning objectives."}, {"name": "Teaching Method", "value": "Discussion sectionLectureSeminar"}, {"name": "Evaluation Method", "value": "The final grade for the course will be determined in the following way: <br/>Three paper outlines, worth 5% of the final grade.<br/>One 4-5 page, double-spaced paper, worth 15% of the final grade. <br/>One 5-6 page, double-spaced paper, worth 20% of the final grade.<br/>One 6-7 page, double-spaced paper, worth 30% of the final grade. <br/>Reading reports and class participation, worth 30% of the final grade."}, {"name": "Class Materials (Required)", "value": "Course packet."}], "lmod": "12/29/16 7:03 PM (CT)", "subject": "PHIL"}]