[{"class_mtg_info": [{"meet_t": "Th 6:15PM - 9:15PM", "meet_l": "University Hall 102"}], "school": "SCS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "27574", "title": "SCS FINANCE 202-CN-66 Introduction to Finance", "class_attributes": "", "section": "27574", "instructors": [{"instructor_phone": "", "instructor_name": "William J Arndt", "instructor_addr": ""}], "topic": "", "course": "202-CN", "descriptions": [{"name": "Overview of class", "value": "Heavy emphasis on the basic mathematics underlying financial concepts, including present value and future value of lump sum and annuities. We will then explore how this mathematical foundation helps us to value stocks and bonds. We will then turn our attention to how the same fundamentals help managers to evaluate whether to invest in a proposed project or not. Wrapping it up, we will consider how financial professionals view risk and how risk considerations are accounted for in evaluating investments in real or financial assets. Throughout the course, we will consider what role finance plays in the world economy."}, {"name": "Registration Requirements", "value": "Comfortable with college algebra, financial accounting, basic economics and statistics."}, {"name": "Learning Objectives", "value": "The primary objective is for you to be familiar with the capital budgeting process that most companies go through periodically. You should also be much more comfortable with basic financial considerations in investing in any asset - whether a financial or real (e.g., machinery, factories) asset."}, {"name": "Teaching Method", "value": "Lecture/discussion. Emphasis in the lectures will be on the use of M.S. Excel to facilitate the valuation of different kinds of financial and real assets. Discussion will primarily be online during those weeks in which the class does not meet. Discussion will cover assigned reading from the textbook and/or from the additional reading assignments regarding the role of finance in the world economy and the financial crisis of 2007-2009."}, {"name": "Evaluation Method", "value": "Midterm exam, homework, case project, discussion, and final exam."}], "lmod": "12/24/16 6:50 PM (CT)", "subject": "FINANCE"}]