[{"class_mtg_info": [{"meet_t": "TuTh 3:30PM - 4:50PM", "meet_l": "University Hall 318"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Freshmen may not register for this course.", "qtr": "Winter 2017", "name": "27740", "title": "WCAS HISTORY 395-0-30 Research Seminar", "class_attributes": "", "section": "27740", "instructors": [{"instructor_phone": "847/467-2906", "instructor_name": "Caitlin Annette Fitz", "instructor_addr": "Harris Hall - Room 205"}], "topic": "Age of American Revolutions", "course": "395-0", "descriptions": [{"name": "Overview of class", "value": "The half century between 1775 and 1825 was an age of American revolutions. From the shot heard ?round the world to the independence of Bolivia fifty years later, most of the Western Hemisphere?including all of Brazil, all of mainland Spanish America, much of British America, and the most lucrative colony in French America?broke away from Europe. People throughout the Americas were rejecting absolutism and embracing constitutionalism, and this new order for the New World raised powerful questions. How would wars against European authority impact social, racial, and gender hierarchies at home? How would enslaved men and women respond when they heard their masters talking of liberty? And in the multiracial nations that did emerge, who?if anyone?would be entitled to vote? In the process of addressing these questions, we will also focus on the art of historical research: how to find topics, frame research questions, identify and interpret sources, and build arguments. Although students can write their research papers on any of the revolutions that rocked the Western Hemisphere in this era, a plurality of our in-class discussions will focus on U.S. responses to Haitian and Latin American independence, and on what those responses suggest about the United States in this age of American revolutions."}, {"name": "Teaching Method", "value": "Seminar"}, {"name": "Evaluation Method", "value": "Class participationPaper, final: (17-20 pgs.)<br/>Papers: (short assignments leading to the final research paper)<br/>"}, {"name": "Class Materials (Required)", "value": "***Tentative until posted to Norris website***<br/>Alfred Young. The Shoemaker and the Tea Party. 9780807054055.<br/>Marixa Lasso. Myths of Harmony: Race and Republicanism During the Age of Revolution, Colombia. 9780822959656."}, {"name": "Class Notes", "value": "AREA OF CONCENTRATION: Americas"}], "lmod": "12/25/16 7:00 PM (CT)", "subject": "HISTORY"}]