[{"class_mtg_info": [{"meet_t": "Tu 6:30PM - 9:00PM", "meet_l": "Parkes Hall 212"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "25087", "title": "WCAS ANTHRO 389-0-20 Ethnographic Methods and Analysis", "class_attributes": "Department Majors/Minors Only<br/><br/>", "section": "25087", "instructors": [{"instructor_phone": "", "instructor_name": "Jesse Stewart Mumm", "instructor_addr": ""}], "topic": "", "course": "389-0", "descriptions": [{"name": "Overview of class", "value": "This course entails designing and carrying out a local fieldwork project through a variety of exploratory ethnographic methods. The aims are to provide students with experience for future research, exposure to varied methods, confidence for being creative with research methods, and a solid basis for evaluating research in general.<br/>In collaboration with a partner, students will devise a local fieldwork project on a topic that can lend itself to the methods at hand: participant observation, taking field notes, open ended interviews, commentaries on texts, writing and analyzing surveys, etc. The project should build on and develop a theoretical question relevant to anthropology. Each week will entail some reading and a methods assignment that you can tailor to your own project. Class time will be devoted to comparing methods as well as problems encountered during the week. The last assignment will be a write-up of the project in a short paper along with a class presentation."}, {"name": "Registration Requirements", "value": "Sociocultural anthropology majors have priority in enrolling for this class."}, {"name": "Class Materials (Required)", "value": "- Booth, Wayne C., Gregory G. Colomb, &amp; Joseph M. Williams. 2008. The Craft of Research, 3rd Ed.<br/>- Emerson, R. et al. 2011. Writing Ethnographic Fieldnotes. IL: Univ of Chicago Press.<br/>- Weston, Anthony. 2008. A Rulebook for Arguments (Hackett Student Handbooks.)"}], "lmod": "1/9/16 6:43 PM (CT)", "subject": "ANTHRO"}]