[{"school": "SoC", "overview_of_class": "Through workshop stagings, the fall 2016 TOPICS class assists playwrights in the development of new work that has been adapted from unconventional sources. Both of this quarter's playwrights will continue to develop work begun during summer, with the support of Undergraduate Research Grant funding, and will be members of the class.<br/><br/>PROJECTS FOR FALL 2016.<br/>1. KORI ALSTON: a series of new short plays with the working title 10 Plays by Red Hook, based on the URG-supported project \"Red Hook and Its Previous Performances.\" During the summer of 2016, Kori will conduct field research in the Red Hook section of Brooklyn, including research on the history of the neighborhood and interviews with people who live and work there.<br/>2. NOAH PERKINS: a new play based on the URG-supported project \"Clearing The Air: The Reality of Cannabis Consumers.\" During the summer of 2016, Noah will conduct field research in Seattle, Washington, including interviews with cannabis users and advocacy groups seeking change to America's cannabis laws. The project seeks, among other things, to challenge stereotypes of cannabis users.", "name": "Topics in Performance Studies", "section": "21", "location": "Annie May Swift Hall 103", "topic": "New Script Workshop", "course": "330-0", "meeting_time": ["Fr 12:00PM - 3:00PM"], "path": "/class-descriptions/4640/SoC/PERF_ST/330-0/17044", "instructor": ["Paul C Edwards"], "class_attributes": "", "id": "17044", "subject": "PERF_ST"}, {"school": "SoC", "overview_of_class": "STAGING THE UNUSUAL<br/>This is a course devoted to exploring imaginative ways of staging those texts or parts of texts (stories, plays, novels, operas, poems) that are \"impossible.\" How do we bring the entirety of the world into the confines of the theatre? When a text was not originally intended for the stage, how do we make the audience see what the text allows a reader to see? What are the tricks of the trade and what new theatrical tricks might we invent? How do we develop images that are complex, apt and striking? Assignments will draw from both dramatic and non-dramatic texts and may include such exercises as staging the same literary event in multiple ways, staging the \"epic\" event, handling narrative and internal thought, compression of text, etc.", "name": "Topics in Performance Studies", "section": "22", "location": "Meets in Non-General PurposeRm", "topic": "Staging the Unusual", "course": "330-0", "meeting_time": ["Mo 2:00PM - 5:00PM"], "path": "/class-descriptions/4640/SoC/PERF_ST/330-0/17994", "instructor": ["Mary Alice Zimmerman"], "class_attributes": "", "id": "17994", "subject": "PERF_ST"}]