[{"school": "WCAS", "overview_of_class": "This course deals with the important but often misunderstood relationship between Jews and Muslims in the milieu of the Islamic Middle Ages. Focus will be on cross-cultural and political relations. Among the subjects discussed: The formation of Muslim attitudes towards the Jews and Judaism; the social and political condition of minorities in medieval Islamic lands; the cultural symbiosis that characterized Jewish-Muslim relations at the time; and the manner in which Jewish creativity in that milieu affected the development of modern Judaism.", "name": "New Lectures in History", "section": "24", "topic": "Jews &amp; Muslims in the Islamic Middle Age", "course": "300-0", "meeting_time": ["We 4:00PM - 6:50PM"], "path": "/class-descriptions/4610/WCAS/HISTORY/300-0/25046", "instructor": ["Jacob   Lassner"], "id": "25046", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "The Spanish Empire ended definitively in 1898 with the loss of Cuba, Puerto Rico and the Philippines in a short and disastrous war with the United States, whose victory marked its emergence as a global empire. Sixty years later that successor empire was unable to contain a revolution in Cuba that created an enduring communist state. This course focuses on those two imperial moments in Cuba, combining the social history of colonial rule and revolt with a Latin American perspective on critical moments in international relations. Readings span the writings of slaves, revolutionaries, soldiers, diplomats and muckraking journalists, to consider why Spanish rule endured so long in Cuba; why it eventually failed; and what the implications of that failure were for the island's twentieth-century history. Finally, the same question is applied to revolutionary Cuba: why did it endure so long?", "name": "New Lectures in History", "section": "26", "topic": "Revolution and Empire in Cuba", "course": "300-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4610/WCAS/HISTORY/300-0/25047", "instructor": ["Paul James Gillingham"], "id": "25047", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "The first part of the class consists of introductory sessions dealing with the major historical concepts of political Islam (the Umma, religion and state, the lslamic response to the challenge of the West - 19th C.) It discusses the Modernist Trend (Salafiyya), the rise of Islamic Fundamentalism and Islamic Revivalism in the Middle East in the 20th and 21st centuries. The class  discusses the historical background to the rise of political Islam within the Palestinian society, reviewing three periods:  Mandatory Palestine (1920s - 1940s), the West Bank and Gaza under Jordan and Egypt's rule (1948-1967), and Israel since 1967. The central part of the course focuses in more detail on Hamas, &quot;Islamic Jihad,&quot; and the Islamic Movement in Israel.  It analyses the causes for the rise of revivalist Islam in the territories and in Israel since the 1970s.  It deals with the ideology and political platform of Hamas as outlined in its &quot;Charter&quot; (the Islamicization of the Israel-Arab conflict, the Islamicization of the Palestinian nation identity). We will examine the doctrinal and practical principle of Jihad and the idea of martyrdom in Islam (Istishad). A special emphasis will be laid on suicide bombing from a doctrinal and practical point of view. The seminar examines the political participation of Hamas (Municipal, Legislative Council elections - 2006) and its relationship with the PLO. Finally the class reviews the rise of the Islamic Movement in Israel, its particular characteristics, the political divide of the movement (1996) and its role as a social, economic and cultural agent of change in the life of the Arab minority in Israel.", "name": "New Lectures in History", "section": "28", "topic": "Hamas and &quot;Islamic Jihad&quot;", "course": "300-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4610/WCAS/HISTORY/300-0/25048", "instructor": ["Elie   Rekhess"], "id": "25048", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "This course takes students along a sonorous trip through Latin America and the Spanish-speaking Caribbean. We will travel from country to country studying son in Cuba, samba in Brazil, tango in Argentina, corrido in Mexico, and vallenato in Colombia, among others, in order to comprehend how certain sounds became emblems of modern nations. We will also navigate the circuits in which certain sounds, such as cumbia, salsa, rock, hip hop, and reggaeton crossed geographic boundaries and evolved into transnational genres that express the collective experience of exile and migration of large populations. We address these histories in an interdisciplinary manner, reading history, anthropology, sociology, and ethnomusicology, and analyzing critically song lyrics, music videos, feature films, and documentaries. The goal is to help students understand why popular music has been a vehicle of nation-state formation in the region. By the end of the course, students should be able to explain how popular music in Latin America figures in struggles over hegemony, socio-economic mobility, and urbanization, as a means of protests and revolt, as a field for developing patterns of consumption for emerging national markets, and as symbolic currency in international negotiations involving issues of representation, legitimacy, and self-determination.", "name": "New Lectures in History", "section": "30", "topic": "Music &amp; Nation in Latin Americ", "course": "300-0", "meeting_time": ["MoWe 12:30PM - 1:50PM"], "path": "/class-descriptions/4610/WCAS/HISTORY/300-0/25049", "instructor": ["Lina M Britto"], "id": "25049", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "This course examines the historical significance of popular music in the United States from the late nineteenth century to the present. No musical training is necessary to enroll in the course, however we will think about how to analyze musical sound as &quot;text.&quot; More crucially, we will focus on the cultural, social, political, and economic dimensions (the &quot;context&quot;) of genres ranging from Tin Pan Alley to blues, jazz, rhythm and blues, country, folk, soul, rock, disco, hip-hop, and classical. We will explore popular music as an art form, a business, an activity of identity-making, a phenomenon encompassing both conflict and consensus, and a key area in the life of Americans. Students are expected to attend lectures, discussion sections, and complete all reading, listening, and viewing assignments. There will be three short essays in the course focused on using a song, a performer, and a genre to analyze the broader cultural history of the US. There will also be a number of shorter assignments.", "name": "New Lectures in History", "section": "32", "topic": "U.S. Popular Music History", "course": "300-0", "meeting_time": ["TuTh 12:30PM - 1:50PM"], "path": "/class-descriptions/4610/WCAS/HISTORY/300-0/25050", "instructor": ["Michael J Kramer"], "id": "25050", "subject": "HISTORY"}, {"school": "WCAS", "overview_of_class": "This course is an introduction to the history of modern Southeast Asia, from the middle of the eighteenth century to the present. The region comprises eleven modern nation-states: its history can seem like a bewildering parade of princes, plenipotentiaries, presidents, and prime ministers. This course focuses, therefore, on the economic and social changes that have spanned the region in the past two hundred and fifty years. Topics include pre-colonial social structures and their relationship to patterns of economic activity; Southeast Asians' responses to the challenges and opportunities of their region's integration with new markets during the era of &quot;high colonialism&quot;; the social transformations that followed from depression, war, and decolonization in the middle of the twentieth century, including peasant rebellions and the birth of communism; and the rise of new elites and mass politics in the post-independence period.", "name": "New Lectures in History", "section": "34", "topic": "Modern Southeast Asia", "course": "300-0", "meeting_time": ["MoWeFr 2:00PM - 2:50PM"], "path": "/class-descriptions/4610/WCAS/HISTORY/300-0/25051", "instructor": ["Haydon Leslie Cherry"], "id": "25051", "subject": "HISTORY"}]