[{"class_mtg_info": [{"meet_t": "Th 6:15PM - 9:15PM", "meet_l": "Wieboldt Hall 509"}], "school": "SCS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "27660", "title": "SCS RTVF 398-CN-16 Issues in Radio/Television/Film", "class_attributes": "", "section": "27660", "instructors": [{"instructor_phone": "", "instructor_name": "Reem Ghattas Hilu", "instructor_addr": ""}], "topic": "Media in the 1980s", "course": "398-CN", "descriptions": [{"name": "Overview of class", "value": "So much of what we take for granted in our contemporary media environment can be traced back to the innovations and trends in media of the 1980s. That decade saw the rise of cable TV and home video technologies, a boom in blockbusters and special effects films, conglomeration in media industries, and the spread of computers, video games, and digital media. In this course, we will interrogate films, television shows, and video games of the 1980s in order to see what they tell us about this period and the desires and fantasies popular at this time. We will explore the relationship between films like Rambo and The Empire Strikes Back to 1980s Cold War politics. The decade also saw a renewed cultural conservativism and we will analyze the influence this had on the style and narratives in films, television, and video games. In addition, we will consider the way that changes in technology and industry led to developments such as the growth of cable channels like MTV and Nickelodeon and the increasing prominence of blockbuster films. The class will include screenings of films and television programs from the 1980s as well as occasional video game demos. Carries humanities credit."}, {"name": "Registration Requirements", "value": "None."}, {"name": "Learning Objectives", "value": "1. Identify key developments in media industries during the 1980s.<br/>2. Analyze film, television, and game texts for their formal and narrative characteristics. <br/>3. Place media texts from the 1980s into their social and cultural contexts.<br/>4. Evaluate the relationship between media of the 1980s and contemporary media."}, {"name": "Teaching Method", "value": "In addition to active listening during lectures, students will be expected to complete all assigned readings and screenings before class. Every week lecture will be supplemented by small group activities, work in pairs, or short in class writing exercises. Attendance and participation in class discussions are an integral part of the course."}, {"name": "Evaluation Method", "value": "Assessment may include multiple short written papers of approximately 2 pages that engage with readings and screenings, one exam consisting of short answer and essay questions, a short presentation, and one longer paper. Class participation and attendance will make up an integral part of students' grades for the term."}, {"name": "Class Materials (Required)", "value": "Reading and screening materials for the course will be made available on Canvas."}, {"name": "Class Materials (Suggested)", "value": "This course will require that students watch approximately one film per week outside of class time. These films will be made available for streaming on Canvas."}], "lmod": "12/24/16 6:51 PM (CT)", "subject": "RTVF"}]