[{"class_mtg_info": [{"meet_t": "Tu 2:00PM - 4:50PM", "meet_l": "Swift Hall 210"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2017", "name": "35679", "title": "WCAS PSYCH 314-0-21 Special Topics in Psychology", "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "section": "35679", "instructors": [{"instructor_phone": "847/491-3652", "instructor_name": "Sara Cantonia Broaders", "instructor_addr": "Swift 243, 2029 Sheridan Road"}], "topic": "Psychology and Weird Beliefs", "course": "314-0", "descriptions": [{"name": "Overview of class", "value": "Lots of people have beliefs that other people think are just plain weird. Why do people have these beliefs? We'll look at &quot;weird&quot; beliefs within our culture as well as some cross-cultural examples, and try to understand what leads people to develop and maintain these beliefs. Another issue is that one person's &quot;weird&quot; belief may be another person's firmly held conviction. From this perspective, we'll also try to understand which beliefs are rational. Among the topics we may cover are: superstition, parapsychology, ghosts, witchcraft, alien abduction, evolution vs. creationism, repressed memories of abuse, and dissociative identity disorder. Students will use a wide variety of academic and popular media resources (including empirical research articles, ethnographic descriptions, philosophical arguments, popular press books, and documentary films) to explore the bases for these beliefs and practices."}, {"name": "Registration Requirements", "value": "Prerequisites: Psych 110<br/>Students who have taken the First-Year Seminar on this topic may NOT take this course."}, {"name": "Teaching Method", "value": "Primarily discussion supplemented with videos and some brief lectures."}, {"name": "Evaluation Method", "value": "Grades will be based on weekly written discussion questions, an independent research paper, and class participation."}, {"name": "Class Materials (Required)", "value": "In addition to the required books, we will have articles and chapters from a variety of other sources that will be available through the Canvas course management system. The required books are most likely to be:<br/>1. Clancy, S.A. (2005). Abducted: How people come to believe they were kidnapped by aliens. Harvard University Press. ISBN: 0-674-01879-6<br/>2. Gilovich, T. (1991). How we know what isn't so: The fallibility of human reason in everyday life. Free Press. ISBN: 0-02-911706-2<br/>3. Miller, K.R. (2008). Only a theory: Evolution and the battle for America's soul. Viking Press. ISBN: 978-0143115663<br/>4. Sagan, C. (1996). The demon-haunted world. Ballantine Books. ISBN: 0-345-40946-9<br/>5. Shermer, M. (2011). The believing brain. New York: Henry Holt. ISBN: 978-0-8050-9125-0 <br/>6. Wiseman, R. (2010). Paranormality: Why we see what isn't there. ISBN: 978-0-9568756-5-5"}], "lmod": "2/19/17 6:52 PM (CT)", "subject": "PSYCH"}]