[{"class_mtg_info": [{"meet_t": "We 6:15PM - 9:15PM", "meet_l": "Lunt Hall 107"}], "school": "SCS", "overview_of_class": "This course is an introduction to signed numbers, equations, exponents, polynomials, factoring, graphing and geometry. <br/><br/>Recommended for students who would benefit from reviewing high school algebra. This course does not count for credit if taken after any higher mathematics course.", "qtr": "Fall 2017", "name": "Algebra", "title": "SCS MATH 101-CN-65 Algebra", "lmod": "9/12/17 6:54 PM (CT)", "section": "65", "topic": "", "course": "101-CN", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "This course is an introduction to signed numbers, equations, exponents, polynomials, factoring, graphing and geometry. <br/><br/>Recommended for students who would benefit from reviewing high school algebra. This course does not count for credit if taken after any higher mathematics course."}, {"name": "Learning Objectives", "value": "A. Apply the properties of real numbers to integers and rational numbers. <br/>B. Perform the fundamental operations with integers and rational numbers. <br/>C. Perform the algebraic operations and factoring with polynomials. <br/>D. Perform multiplication and division with rational expressions. <br/>E. Solve first degree equations and inequalities in one variable. <br/>F. Solve graph of first degree equations in two variables. <br/>G. Solve systems of first degree equations in two variables. <br/>H. Solve second degree equations in one variable by factoring"}, {"name": "Teaching Method", "value": "Methods of instruction may include lecture, discussion, demonstration, group work, audio-visual aids and regularly assigned homework."}, {"name": "Evaluation Method", "value": "This course will be considered completed if a minimum average of 60% has been achieved. Chapter test will be given and the final grade will be based on the average of the chapter tests. <br/><br/>Averages Grade <br/>90-100 A <br/>80-89 B <br/>70-79 C <br/>60-69 D <br/>59-below F"}, {"name": "Class Materials (Required)", "value": "Texts may include the following. Visit the campus bookstore or its website to confirm materials for the course: <br/><br/>Intermediate Algebra, 11th Edition, Marvin L. Bittinger, Addison Wesley Publishing Co. ISBN 9780321613363"}], "instructor": ["Rodolfo   Maglio"], "class_attributes": "", "id": "17506", "subject": "MATH"}]