[{"school": "WCAS", "overview_of_class": "Between the 8th and the 16th century?a timeframe bracketed by the rise of Islam in West Africa and the development of trade along its Atlantic coast?West African polities rose and fell, actors in a history that was stimulated by trans-Saharan trade and the external quest for West African gold. In this course students will learn about major sites that reveal the history of West Africa's &quot;Age of Empires&quot; and trans-Saharan trade and will gain exposure to scholarship that addresses the expansive impact of this period. Additionally, students will consider the methodologies that are used to study cultures in the absence of expansive written and material records; ponder the usefulness and relevance of terms including &quot;global&quot; and &quot;medieval&quot; for thinking about this epoch beyond Eurocentric frames of reference; and be exposed to issues relevant to the trade and collecting of antiquities from Africa.", "name": "Undergraduate Seminar", "section": "1", "topic": "West Africa?s Age of Empires and the Trans-Saharan", "course": "390-0", "meeting_time": ["We 2:00PM - 4:50PM"], "path": "/class-descriptions/4650/WCAS/ART_HIST/390-0/21618", "instructor": ["Kathleen Bickford Berzock", "Christina E Normore"], "id": "21618", "subject": "ART_HIST"}, {"school": "WCAS", "overview_of_class": "Archaeology and nationalism have been closely intertwined at least since the idea of the nation-state emerged in the wake of the French Revolution. Archaeology offers nationalist agendas the possibility of filling in national historical records and extending the past into prehistory; its results can be displayed in museums or at entire sites, potentially reaching a new audience outside the written word. In turn, nationalism contributed significantly to the emergence of archaeology as a modern discipline.<br/><br/>Drawing on new critical approaches and examples selected from a wide geographical range, this course explores the role of archaeology in the creation and elaboration of national identities. Issues include the institutionalization of archaeology; the development of museums and practices of display and interpretation; the creation of archaeological sites as national monuments and tourist destinations; cultural property legislation and repatriation of artifacts; and archaeology and monuments under totalitarian regimes.", "name": "Undergraduate Seminar", "section": "2", "topic": "Archaeology and Nationalism.", "course": "390-0", "meeting_time": ["TuTh 11:00AM - 12:20PM"], "path": "/class-descriptions/4650/WCAS/ART_HIST/390-0/21619", "instructor": ["Ann C Gunter"], "id": "21619", "subject": "ART_HIST"}]