[{"class_mtg_info": [{"meet_t": "TuTh 9:30AM - 10:50AM", "meet_l": "Harris Hall L05"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "12098", "title": "WCAS ENGLISH 397-0-20 Research Seminar for Literature Majors", "class_attributes": "Department Majors Only<br/><br/>", "section": "12098", "instructors": [{"instructor_phone": "", "instructor_name": "Kelly E Wisecup", "instructor_addr": ""}], "topic": "Medicine, Disease and Colonialism", "course": "397-0", "descriptions": [{"name": "Overview of class", "value": "This seminar will explore the connections among colonialism, the global spread of disease, and the medical theories and practices that emerged in response. Many scholars have attributed Europeans' conquest of America to their sometimes unwitting and sometimes knowing communication of diseases to which Native Americans had no immunity, while scholars such as Cindy Patton have explored the ways that approaches to describing AIDS have also produced conceptions of Africa and the tropics as colonial spaces. We will explore the scholarly, imaginative, and nonfiction responses to colonial illnesses, in order to investigate the relations between medicine and literature and to develop research and writing strategies for interdisciplinary studies and for considering disease and its cures from multiple cultural perspectives. Working closely with the instructor, students will develop the research tools needed to navigate scholarly databases and archives; to frame critical research questions; to evaluate articles from multiple disciplines; and to produce an annotated bibliography; project proposal; and final 12-15 page research paper."}, {"name": "Teaching Method", "value": "Seminar-style discussion; workshops."}, {"name": "Evaluation Method", "value": "Canvas posts, attendance and discussion, annotated bibliography; essays."}, {"name": "Class Materials (Required)", "value": "Cindy Patton, Globalizing AIDS; Alan Bewell, Romanticism and Colonial Disease; Priscilla Wald, Contagious; and fiction by Charles Brockden Brown; John Edgar Wideman; Toni Morrison, and others."}, {"name": "Class Notes", "value": "Prerequisites: Open to juniors and seniors only. Students must successfully complete 4-6 300-level English courses before taking English 397."}], "lmod": "10/30/16 7:04 PM (CT)", "subject": "ENGLISH"}]