[{"school": "WCAS", "overview_of_class": "Modern world history is a story of cultural, economic, and biological interchange. This seminar explores some of the ways people and things circulated between China and &quot;the West&quot; (primarily Great Britain but also continental Europe and, to a lesser extent, the United States) from roughly 1839 to the mid-twentieth century. The course primarily will focus on the Euro-American influence on modern China, but we will not ignore the question of how China contributed to the transformation of the modern West. We will concentrate on particular topics (intellectual and scientific exchange, the transformation of women's lives, the opium trade, the missionary enterprise, war, and treaty ports as sites of cultural hybridity and change). Students will also write a term paper on a particular topic of interest to them.", "name": "Special Topics in the Humanities", "section": "20", "topic": "China and the West", "course": "370-4", "meeting_time": ["TuTh 3:30PM - 4:50PM"], "path": "/class-descriptions/4620/WCAS/HUM/370-4/31179", "instructor": ["Melissa A Macauley"], "id": "31179", "subject": "HUM"}, {"school": "WCAS", "overview_of_class": "Politics, Society, and Biography in the United States from the New Deal to the Great Recession?<br/> <br/>This course aims to give Northwestern undergraduates a foundation of knowledge and critical reasoning skills that will enable them to develop and refine their own understanding of how and why public policy in the United States has developed historically in the ways that it has?and not in other ways it might have developed. Social policy, industrial relations, health care, fiscal policy, and financial regulation are among the policy areas that we will consider. Why is social spending in the United States relatively stingy? Why is so much of it channeled through the private sector? Why is the unionization rate so low? Why are so many people uninsured? Why have top marginal tax rates for personal income tended to be relatively low since the late-1980s? Why is the regulation of the U.S. financial system so fragmented and decentralized? The course will begin chronologically with the New Deal and end with the Great Recession. The main readings for the course will consist of selected biographies of major social and political figures. These biographies are meant to provide a uniquely valuable window into the policy-making process ? helping students to understand policy developments from the bottom-up as well as the top-down.", "name": "Special Topics in the Humanities", "section": "21", "topic": "Politics Through Biography", "course": "370-4", "meeting_time": ["MoWe 2:00PM - 3:20PM"], "path": "/class-descriptions/4620/WCAS/HUM/370-4/31180", "instructor": ["Anthony S Chen"], "id": "31180", "subject": "HUM"}, {"school": "WCAS", "overview_of_class": "Apocalypse: Environment, History, Science and Religion in the West<br/><br/>The theme of the &quot;end of days&quot; threatens to overwhelm us in popular media; even the United States government is capitalizing on the obsession with the &quot;zombie&quot; apocalypse to encourage emergency preparedness. Apocalypses are not just exciting stories, they have long roots in the Western tradition, particularly in Christianity, science, and the Enlightenment, and they have many uses. They can narrate a great victory for the morally righteous, become a foil for a critique of enlightenment or industrial progress, and unveil the gateway to utopia. Apocalyptic stories also often reinforce previously held assumptions about humans, nature, and human nature, holding within them a regenerative moment when humanity (or some select part of it) could finally get things right. As a result, the end of days makes an excellent category of historical analysis.<br/><br/>In this class, we will take a long view on the history of Western apocalypse stories both providential and dystopian. Our guiding query will be always to ask: what work did these narratives do for people in different historical contexts? What can the examination these narratives tell us about history in these various times and places? Our reading will focus heavily on the histories of empire, science, religion, and nature/environment in Europe (particularly Britain) and America. Specific themes will include the link between the revolutionary and the apocalyptic, human and divine agency, limits/scarcity and growth/abundance, utopias, concepts of time, and history.", "name": "Special Topics in the Humanities", "section": "22", "topic": "Apocalypse: Environ, Hist, Sci, Relig", "course": "370-4", "meeting_time": ["MoWe 9:30AM - 10:50AM"], "path": "/class-descriptions/4620/WCAS/HUM/370-4/31181", "instructor": ["Sheila Two Wille"], "id": "31181", "subject": "HUM"}]