[{"school": "WCAS", "overview_of_class": "In 2014, President Obama said, &quot;We are and always will be a nation of immigrants.&quot; What can we learn about the implications of that historical fact by reading stories written by and about immigrants to this country? The goal of this seminar is to answer that question as well as these others: How do immigrant experiences differ based on the era and country of origin, and in what ways are they similar? What happens to the relationships between parents and children through the process of acculturation into American society? How do social institutions and structures impact the lives of immigrants as they seek to pursue the American Dream? How do differences in national origin connect with other differences, particularly gender, race, ethnicity, and class?<br/><br/>We will read novels, memoirs, and poetry that range from the beginning to the end of the 20th century and that tell stories of immigrants from Barbados, China, Mexico, Russia, and elsewhere.", "name": "First-Year Seminar", "section": "20", "topic": "Immigrant Stories", "course": "105-6", "meeting_time": ["MoWeFr 10:00AM - 10:50AM"], "path": "/class-descriptions/4620/WCAS/ENGLISH/105-6/31855", "instructor": ["Charles S Yarnoff"], "id": "31855", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "One of the many benefits of attending Northwestern is its proximity to one of the greatest cities in the world: Chicago. However, with classes and other commitments, it is often challenging for NU students to get beyond Chicago's front doors: Millennium Park or Wrigley Field or Michigan Avenue. In this course, we will explore a Chicago neighborhood and get to know Chicago better by listening to and learning from some of its residents. Students will be encouraged to continue their exploration of Chicago by focusing on an aspect that appeals to them, e.g. Chicago politics, theatre, business, education, safety, health, etc.?whatever interests the individual student.", "name": "First-Year Seminar", "section": "21", "topic": "Chicago Voices", "course": "105-6", "meeting_time": ["TuTh 9:30AM - 10:50AM"], "path": "/class-descriptions/4620/WCAS/ENGLISH/105-6/31856", "instructor": ["Jeanne Elizabeth   Herrick"], "id": "31856", "subject": "ENGLISH"}, {"school": "WCAS", "overview_of_class": "What do we learn when we hear stories from people who are marginalized by society - or when we write about our own experiences with marginalization? The goal of this seminar is to answer those questions while becoming more enlightened and skillful writers ourselves. Toward that end, we will read narratives of survival and protest by people who have been marginalized by race, gender, poverty, politics, religion, war, or prison. As we do this reading, we will also look at (a) philosophical issues, such as the relationship between stories and &quot;truth&quot; (what's the line between fiction and non-fiction?) and (b) literary issues, such as whether mainstream stories are any different from &quot;stories from the margins.&quot; Then, focusing particularly on narratives related to our country's astonishingly high rate of incarceration, we will examine the power of stories to reshape our understanding of contemporary issues, including marginalization and inclusion at Northwestern.<br/><br/>Papers will involve analysis of personal experience, such as how you have benefited from, or have been challenged by, marginalization, as well as analysis and arguments based on research, exploring whether or how stories from the margin challenge our views of ourselves and the world.", "name": "First-Year Seminar", "section": "22", "topic": "Rdng&amp;Wrtng Stories from Margin", "course": "105-6", "meeting_time": ["MoWeFr 11:00AM - 11:50AM"], "path": "/class-descriptions/4620/WCAS/ENGLISH/105-6/31857", "instructor": ["Penny Gail Hirsch"], "id": "31857", "subject": "ENGLISH"}]