[{"school": "WCAS", "overview_of_class": "The fundamental purpose of this course is the expanding of our students' horizons -<br/>especially through movies. The students will be introduced to the Latin-American culture<br/>through this engaging media; and help the students in the class to learn about events in<br/>specific cultures which have contributed to the panorama of the Latin-American's world<br/>community - for instance, the Mexican revolution, life in Cuba during the dictatorship of<br/>Castro, Chile in the 1970's, and so on. In addition to these memorable and salient references<br/>to contemporary history, the films will also teach students about the daily life of their<br/>protagonists with respect to food and meals, family and community traditions, the raising and<br/>education of children, etc. Such information provides a means for the student to grow in<br/>mindfulness of the quotidian lives of other peoples, as well as offering enjoyment to the<br/>whole class through sharing the viewing of much that is beautiful, uplifting, and thought provoking.<br/>Participating in the course will enhance critical thinking because students will<br/>learn how to evaluate and compare real events as recorded and portrayed in different movies.", "name": "Residence-Linked Seminar - VI (Literature and Fine Arts)", "section": "20", "location": "Meets in Non-General PurposeRm", "topic": "The Silver Mirror", "course": "280-6", "meeting_time": ["Tu 3:00PM - 5:50PM"], "path": "/class-descriptions/4610/WCAS/GEN_LA/280-6/26617", "instructor": ["Rifka   Cook"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>Permission of Instructor<br/><br/>", "id": "26617", "subject": "GEN_LA"}, {"school": "WCAS", "overview_of_class": "This seminar will develop criteria for thinking about dance. Through discussion and written assignments the class will explore diverse perspectives in responding to dance performance/events.  Students will be challenged to experience a wide range of forms, styles, and venues.", "name": "Residence-Linked Seminar - VI (Literature and Fine Arts)", "section": "21", "location": "Meets in Non-General PurposeRm", "topic": "Responding to Dance", "course": "280-6", "meeting_time": ["Mo 3:00PM - 5:00PM", "Fr 6:00PM - 8:00PM"], "path": "/class-descriptions/4610/WCAS/GEN_LA/280-6/27716", "instructor": ["Susan A Lee"], "class_attributes": "Literature &amp; Fine Arts Distro Area<br/><br/>Permission of Instructor<br/><br/>", "id": "27716", "subject": "GEN_LA"}, {"school": "WCAS", "overview_of_class": "Alice's Adventures in Wonderland and Through the Looking Glass are two of the most celebrated children's books of all time. The critic Harold Bloom put them on his list of 100 Great Books of Western Literature. The familiar characters of: Alice, The Mad Hatter, the March Hare, the Cheshire cat, the Caterpillar, the White Rabbit, Tweedledum and Tweedledee are all part of our collective cultural awareness.    Somewhat less familiar is the language of the book, especially in relation to the characters and the story.  \"Begin at the beginning, and go on till you come to the end: then stop.\" Or \"Take care of the sense, and the sounds will take care of themselves.\"  Or \"Why sometimes I've believed as many as six impossible things before breakfast.\" Or \"If you don't know where you are going, any road will get you there\" are all a part of our literary cultural awareness and regularly encountered in political discourse, journalism, critical writing, and literature, According to Harold Bloom, Satire, allusion, and symbolism weave deeper and mysterious meanings, lending a measure of immortality to Carroll's remarkable fantasy. This class will be an exploration of the language of both Alice's Adventures In Wonderland And Through The Looking Glass, looked at through its relation to the world of Victorian English culture and society.   The purpose is to introduce students to literature through the art of the oral tradition, exploring how the rich layers of verbal expression support Lewis Carroll's writing and the role of the live, immediate performer in communicating this to an audience.", "name": "Residence-Linked Seminar - VI (Literature and Fine Arts)", "section": "22", "location": "Meets in Non-General PurposeRm", "topic": "An Exploration Through Performance Of The Language", "course": "280-6", "meeting_time": ["MoWe 2:00PM - 3:30PM"], "path": "/class-descriptions/4610/WCAS/GEN_LA/280-6/27717", "instructor": ["Linda H. Gates"], "class_attributes": "Permission of Instructor<br/><br/>", "id": "27717", "subject": "GEN_LA"}]