[{"class_mtg_info": [{"meet_t": "Th 4:00PM - 6:50PM", "meet_l": "Scott Hall 201 Ripton Room"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Fall 2016", "name": "12804", "title": "WCAS POLI_SCI 450-0-20 Contemporary Theory and Research in Comparative Politics", "class_attributes": "Graduate Students Only<br/><br/>", "section": "12804", "instructors": [{"instructor_phone": "", "instructor_name": "Jeffrey A Winters", "instructor_addr": "Scott, #403"}], "topic": "Proseminar in Comaparative Politics", "course": "450-0", "descriptions": [{"name": "Overview of class", "value": "Comparative Politics covers a range of issues spanning the entire globe (including the US, even if it is treated as a separate field). This seminar will expose students to some of the foundational works in Comparative. The concepts, theories, and analyses contained in these readings will provide essential building blocks for students to pursue further reading on their own and in other courses in comparative politics and political economy."}, {"name": "Learning Objectives", "value": "This seminar will introduce students to major foundational works in comparative politics, starting from Marx and Weber and continuing through Perry Anderson, Schumpeter, Polanyi, Moore, Skocpol, Benedict Anderson, among others."}, {"name": "Teaching Method", "value": "Seminar."}, {"name": "Evaluation Method", "value": "Weekly short thought pieces on the readings and a final essay exam."}, {"name": "Class Materials (Required)", "value": "This list is subject to modification: A. Gerth and C.W. Mills, From Max Weber: Essays in Sociology; Robert Tucker, The Marx-Engels Reader; Perry Anderson, Lineages of the Absolutist State; Joseph Schumpeter, Capitalism, Socialism, and Democracy; Karl Polanyi, The Great Transformation; Samuel Huntington, Political Order in Changing Societies; Benedict Anderson, Imagined Communities; Jeffrey Winters, Oligarchy."}, {"name": "Class Notes", "value": "Assignment for first seminar session: Gerth &amp; Mills, From Max Weber, Chs 4, 6, 8-13. Also &quot;The Protestant Ethic and the ?Spirit' of Capitalism&quot;: Chapter I-III and V. PDF: http://www.d.umn.edu/cla/faculty/jhamlin/1095/The%20Protestant%20Ethic%20and%20the%20Spirit%20of%20Capitalism.pdf"}], "lmod": "10/30/16 7:09 PM (CT)", "subject": "POLI_SCI"}]