[{"class_mtg_info": [{"meet_t": "TuTh 12:30PM - 1:50PM", "meet_l": "University Library Video Theat"}], "school": "SoC", "overview_of_class": "This course examines the histories of Latin American dances and their relationship to developing notions of race and nation in the region. It studies the historical emergence and transformation of categories like \"indigeneity,\" \"blackness,\" and \"whiteness\" and how dance practices became associated with these identifications. It also traces dance developments in relation to nation-state formation and social stratification. In short, it explores a paradox: How did dance serve as a source of local cohesion and division by underscoring shared culture as well as racial, gender, and class hierarchies? Weekly readings move forward chronologically from the fifteenth century to present day.", "qtr": "Fall 2016", "name": "Special Topics in Dance Research", "title": "SoC DANCE 335-0-20 Special Topics in Dance Research", "lmod": "10/30/16 6:50 PM (CT)", "section": "20", "instructors": [{"instructor_phone": "", "instructor_name": "Elizabeth Bowlsby Schwall", "instructor_addr": ""}], "topic": "Dance, Race & Nation in Latin America", "course": "335-0", "enrl_requirement": "", "descriptions": [{"name": "Overview of class", "value": "This course examines the histories of Latin American dances and their relationship to developing notions of race and nation in the region. It studies the historical emergence and transformation of categories like &quot;indigeneity,&quot; &quot;blackness,&quot; and &quot;whiteness&quot; and how dance practices became associated with these identifications. It also traces dance developments in relation to nation-state formation and social stratification. In short, it explores a paradox: How did dance serve as a source of local cohesion and division by underscoring shared culture as well as racial, gender, and class hierarchies? Weekly readings move forward chronologically from the fifteenth century to present day."}, {"name": "Evaluation Method", "value": "2 Response Papers, 1 Mid-Term, 1 Final"}, {"name": "Class Materials (Required)", "value": "READING LIST:<br/>? Peter Wade, &quot;The Meaning of ?Race' and ?Ethnicity,'&quot; in Race and Ethnicity in Latin America (London: Pluto Press, 1997), 5-24.<br/>? Jane Desmond, &quot;Embodying Difference: Issues in Dance and Cultural Studies&quot; Cultural Critique 26 (Winter 1993-1994), 33-63.<br/>? Friar Bernardino de Sahagún, The Florentine Codex: General History of the Things of New Spain, Book Two: The Ceremonies. Trans. Anderson and Dibble. Santa Fe: School of American Research and the U. of Utah Press, 1950: 66-77.<br/>? Paul Scolieri, &quot;On the Areíto: Discovering Dance in the New World,&quot; in Dancing the New World: Aztecs, Spaniards, and the Choreography of Conquest (Austin: University of Texas, 2013), 24-43.<br/>? Deborah Poole, &quot;The Inca Operatic,&quot; Vision, Race, and Modernity: A Visual Economy of the Andean Image World (Princeton: Princeton University Press, 1997), 25-57.<br/>? Genevière Fabre, &quot;The Slave Ship Dance,&quot; in Black Imagination and the Middle Passage, eds. Maria Diedrich, Henry Louis Gates, Jr., and Carl Pedersen (New York: Oxford University Press, 1999), 33-46.<br/>? João José Reis, &quot;Batuque: Dance between Repression and Concession, Bahia, 1808-1855,&quot; Bulletin of Latin American Research 24, 2 (2005), 201-214.<br/>? Sara Johnson, &quot;French Set Girls and Transcolonial Performance,&quot; in Fear of French Negroes: Transcolonial Collaboration in the Revolutionary Americas (Berkeley: University of California Press, 2012), 122-156.<br/>? Domingo F. Sarmiento, Facundo, or Civilization and Barbarism (1845), excerpt.<br/>? John Charles Chasteen, &quot;Black Kings, Blackface Carnival, and Nineteenth-Century Origins of Tango,&quot; in Latin American Popular Culture: An Introduction, eds. William H. Beezley and Linda A. Curcio-Nagy (Wilmington, DE: SR Books, 2000), 52-67.<br/>? José Martí, &quot;Our America,&quot; in Selected Writings, 288-295.<br/>? Jill Lane, &quot;Introduction: ImpersoNation in Our America&quot; and &quot;National Rhythm, Racial Adulteration, and the Danzón, 1881-1882,&quot; in Blackface Cuba, 1840-1895 (Philadelphia: University of Pennsylvania Press, 2005), 1-17, 149-179.<br/>? Robin Moore and Alejandro Madrid, &quot;Race, Morality, and the Circulation of Danzón, 1870-1940,&quot; in Danzón: Circum-Caribbean Dialogues in Music and Dance (New York: Oxford University Press, 2013), 75-116.<br/>? Lara Putnam, &quot;The Weekly Reggae: Cosmopolitan Music and Race-Conscious Moves in a ?World a Jazz,' 1910s-1930s,&quot; in Radical Moves: Caribbean Migrants and the Politics of Race in the Jazz Age (Chapel Hill: University of North Carolina Press, 2013), 153-195.<br/>? Rick A. López, &quot;The Noche Mexicana and the Exposition of Popular Art: Two Ways of Exalting Indianness,&quot; in The Eagle and the Virgin: Nation and Cultural Revolution in Mexico, 1920-1940, eds. Mary Kay Vaughan and Stephen Lewis (Durham: Duke University Press, 2006), 23-42.<br/>? Amelia M. Kiddle, &quot;Cabretistas and Indias Bonitas: Gender and Representations of Mexico in the Americas during the Cárdenas Era,&quot; Journal of Latin American Studies 42 (2010), 263-291.<br/>? John Charles Chasteen, &quot;The Prehistory of Samba: Carnival Dancing in Rio de Janeiro, 1840-1917,&quot; Journal of Latin American Studies, 28, 1 (Feb. 1996), 29-47.<br/>? Micol Seigel, &quot;The Disappearing Dance: Maxixe's Imperial Erasure,&quot; Black Music Research Journal 25, 1-2 (2005), 93-117.<br/>? Vernon Castle, Modern Dancing (New York: World Syndicate, Co. 1914), 19-29, 37-42, 83-133.<br/>? Matthew B. Karush, &quot;Blackness in Argentina: Jazz, Tango and Race before Perón,&quot; Past and Present, 216 (Aug. 2012), 215-245.<br/>? Kate Ramsey, &quot;Without One Ritual Note: Folklore Performance and the Haitian State, 1935-1946,&quot; Radical History Review, 84 (Fall 2002), 7-42.<br/>? Katherine Dunham, Island Possessed (Garden City, NY: Doubleday, 1969), excerpts.<br/>? Robin Moore, &quot;Black Music in a Raceless Society: Afrocuban Folklore and Socialism,&quot; Cuban Studies 37 (2006), 1-32.<br/>? Suki John, &quot;The Técnica Cubana,&quot; in Caribbean Dance from Abakuá to Zouk: How Movement Shapes Identity, ed. Susanna Sloat (Gainesville, FL: University Press of Florida, 2002), 73-80.<br/>? Katherine Borland, &quot;Mrimba: Dance of the Revolutionaries, Dance of the Folk,&quot; Radical History Review 84 (Fall 2002), 77-107."}], "path": "/class-descriptions/4640/SoC/DANCE/335-0/11188", "instructor": ["Elizabeth Bowlsby Schwall"], "class_attributes": "Attendance at 1st class mandatory<br/><br/>", "id": "11188", "subject": "DANCE"}]