[{"school": "WCAS", "overview_of_class": "In this course we will engage with the works (poetry, autobiographies, novels, short stories etc.) of women writers from India and Pakistan. We will explore how women writers - from the 16th century devotional poet Mirabai to modern and contemporary feminist authors writing in English, Hindi, Urdu, Malayalam, Telugu, and Bengali - continue to articulate and re-imagine the female experience in South Asian societies, offering fierce challenges to the foundations of patriarchy.", "name": "Advanced Topics in Asian Languages and Cultures", "section": "20", "topic": "Indo-Pakistani Women Writers", "course": "390-0", "meeting_time": ["MoWe 11:00AM - 12:20PM"], "path": "/class-descriptions/4620/WCAS/ASIAN_LC/390-0/32071", "instructor": ["Laura Rebecca Brueck"], "id": "32071", "subject": "ASIAN_LC"}, {"school": "WCAS", "overview_of_class": "This course explores the interaction between cybernetic technologies and cultural production in modern Japan. We focus on how visual and literary media have been used to represent such technologies (robotics, cybernetics, and the Internet) as well as how these technologies have shaped forms of cultural production in late 20th and early 21st century Japan. The notion of the &quot;cyber&quot; - its origins in cybernetics and ensuing proliferation of meanings - forms the conceptual core of the course. After considering early definitions of this term, we turn to how Japanese manga, animation, film, and cultural theory explore the ways in which cybernetic technologies, like cyborgs and cyberspace, have expanded our understanding of human subjectivity and agency, transformed social relations, and blurred boundaries between the human and the animal, the biological and the artificial, and the physical and non-physical.", "name": "Advanced Topics in Asian Languages and Cultures", "section": "21", "topic": "Cyber-Japan", "course": "390-0", "meeting_time": ["MoWe 11:00AM - 12:20PM"], "path": "/class-descriptions/4620/WCAS/ASIAN_LC/390-0/32072", "instructor": ["Patrick James Noonan"], "id": "32072", "subject": "ASIAN_LC"}, {"school": "WCAS", "overview_of_class": "The relatively recent growth of research on men and masculinities is impressive. The majority of the academic works published in the English-speaking world, however, comes from within the Western world and from Western perspectives. At the same time, East Asian men are becoming increasingly visible in mediated forms around the world, in films, print, and online media. This course tries to bridge the lack of academic explorations of East Asian masculinities with the wealth of material available. Together we will explore the construction of masculinities in East Asian cultures, past and present. We will study men and masculinities in pre-modern and contemporary China, Japan, and Korea, respectively, and also in the dynamic interactions between East Asian cultures. We will read and discuss sources that depict fragile scholars, Shaolin monks, ninjas, boys love, and K-pop stars. Our aim will be to enhance our understandings of East Asian identities and cultures as well as Western conceptions of gender and sexuality.", "name": "Advanced Topics in Asian Languages and Cultures", "section": "22", "topic": "East Asian Masculinities", "course": "390-0", "meeting_time": ["TuTh 2:00PM - 3:20PM"], "path": "/class-descriptions/4620/WCAS/ASIAN_LC/390-0/32073", "instructor": ["Paola   Zamperini"], "id": "32073", "subject": "ASIAN_LC"}]