[{"class_mtg_info": [{"meet_t": "MoWe 9:30AM - 10:50AM", "meet_l": "Harris Hall L28"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "37208", "title": "WCAS CLASSICS 320-0-21 Greek and Roman History", "class_attributes": "Historical Studies Distro Area<br/><br/>", "section": "37208", "instructors": [{"instructor_phone": "847/491-8029", "instructor_name": "Francesca   Tataranni", "instructor_addr": "Crowe Hall 3-171"}], "topic": "The Foundation of Rome", "course": "320-0", "descriptions": [{"name": "Overview of class", "value": "By conducting a critical survey of the main literary sources available for the study of Rome from her mythic foundation to the establishment of the Republic, this course provides a wide-ranging exploration of how the history of early Rome was shaped through centuries. While exploring the genesis and development of the legendary traditions concerning the beginnings of Rome, students will engage questions which are central to understanding the politics of Roman identity at various stages of the city's growth and expansion. What do the stories of Aeneas, Romulus and Remus, the Sabine women, the rape of Lucretia and the expulsion of the kings from Rome tell us about the way the Romans of the Republican and Early Imperial ages conceived of their past? How and with what results did these legends aim to provide mythic justification for the centrality of Rome to the history of the Mediterranean world? Besides examining the historical and political dynamics which account for the fluid, multifaceted, at times even conflicting nature of the literary tradition, students will learn about important archaeological discoveries of the last half-century which have revolutionized our thinking about the origins of Rome."}, {"name": "Teaching Method", "value": "Lecture, discussion, in-class presentations"}, {"name": "Evaluation Method", "value": "Class participation and attendance, two mid-term exams, a short presentation, final research paper"}, {"name": "Class Materials (Required)", "value": "Livy. The History of Rome. Books 1-5, Hackett 2006 [978-0-87220-723-3] Allen Mandelbaum, The Aeneid of Virgil, Bantam Classics 2006 [978-0-55321-041-5] Secondary readings will be posted to CANVAS."}, {"name": "Class Notes", "value": "No P/N"}], "lmod": "4/3/16 7:53 PM (CT)", "subject": "CLASSICS"}]