[{"class_mtg_info": [{"meet_t": "Tu 6:00PM - 8:50PM", "meet_l": "Parkes Hall 215"}], "school": "WCAS", "enrl_requirement": "", "qtr": "Winter 2017", "name": "21879", "title": "WCAS ASIAN_AM 394-0-1 Professional Linkage Program", "class_attributes": "", "section": "21879", "instructors": [{"instructor_phone": "taoki@saic.edu", "instructor_name": "Tatsuyuki   Aoki", "instructor_addr": "Crowe Hall, Room 1135"}], "topic": "Asian Identity in Cinema", "course": "394-0", "descriptions": [{"name": "Overview of class", "value": "This course looks at America's perceptions of Asians through their portrayal in American mainstream media in contrast to those made in Asia by Asian filmmakers. It is a survey and discussion oriented case studies of representation of Asian and Asian American icons. By comparing films made by Asians and those produced by the American mainstream, major differences in their perspectives and approaches are found. In doing this, the class investigates issues of representation and misrepresentation in mass culture stereotypes of Asians to show how they have been rooted in confusions surrounding cultural differences between Asians and Asian Americans. The course presents Hollywood films; mainstream Asian films, independent works from as well as other visual media such as Youtube submissions and commercial application both the Asian and Asian American communities.<br/>?"}, {"name": "Registration Requirements", "value": "None"}, {"name": "Teaching Method", "value": "The class will be conducted based on lectures, discussion and viewing movies and other visual presentation works. Students are required to satisfy all recommended reading materials and viewing assigned works. One mid term project presentation and final research paper is requited."}, {"name": "Evaluation Method", "value": "Attendance: 15%<br/>Class participation: 20%<br/>Paper, final: 25%<br/>Paper, mid-term: 20%<br/>Writing assignments: 20%<br/>"}, {"name": "Class Materials (Required)", "value": "All materials for this course will be made available on Canvas - no purchase necessary."}, {"name": "Class Notes", "value": "Attendance, weekly journal writing required."}], "lmod": "12/24/16 6:54 PM (CT)", "subject": "ASIAN_AM"}]