[{"class_mtg_info": [{"meet_t": "MoWeFr 2:00PM - 2:50PM", "meet_l": "Technological Institute LG62"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Winter 2017", "name": "21152", "title": "WCAS BIOL_SCI 104-6-20 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>Freshmen/Sophomores Only<br/><br/>", "section": "21152", "instructors": [{"instructor_phone": "847/491-5061", "instructor_name": "Michele M McDonough", "instructor_addr": "Hogan Hall, Room - 2-100"}], "topic": "Origins of American Obesity", "course": "104-6", "descriptions": [{"name": "Overview of class", "value": "Many of the diseases that killed thousands in the early 1900s have been conquered, causing a remarkable decline in overall mortality. While the prevailing health concerns have changed in the last one hundred years, there are still many health challenges facing our population today. Most of us obtain our scientific knowledge about health risks from the internet and other media sources, but, in this wealth of information, it is not always easy to discern fact from ficition. Discussions in this course will focus on assessing the validity or reliability of information regarding a few of the modern health risks. Specific topics will include but will not be limited to: What are the causes of the current obesity epidemic?; Should we consume genetically modified foods?; What food additives and processing procedures are safe?; Should antibiotic usage be restricted?"}, {"name": "Teaching Method", "value": "Writing assignments: Several short papers, outlines, final research paper. <br/>Term Project Presentations: Student presentations<br/>Discussion: Class discussion"}, {"name": "Evaluation Method", "value": "Short papers and assignments- 55%; presentations and class participation-30%; Term Project- 15%<br/><br/>Approximately 3-4 writing assignments (~ 3 pages), 1 term project, a small number of other short assignments, 1 class debate."}, {"name": "Class Materials (Required)", "value": "There are no textbooks required for this course but there will be assigned PDFs and other materials posted on Canvas."}], "lmod": "12/29/16 6:54 PM (CT)", "subject": "BIOL_SCI"}]