[{"class_mtg_info": [{"meet_t": "MoWe 2:00PM - 3:20PM", "meet_l": "Scott Hall 212"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Freshmen and Sophomores", "qtr": "Winter 2017", "name": "22852", "title": "WCAS POLI_SCI 101-6-23 First-Year Seminar", "class_attributes": "WCAS First-Year Seminar<br/><br/>", "section": "22852", "instructors": [{"instructor_phone": "847/491-2644", "instructor_name": "Reuel R Rogers", "instructor_addr": "Scott, #315"}], "topic": "Racial Politics in the Obama Era", "course": "101-6", "descriptions": [{"name": "Overview of class", "value": "&quot;Racial Politics in the Obama Era&quot; Prof. Reuel Rogers Winter 2017 101-6-23<br/>The election of Barack Obama, the country's first Black president, marked a historic watershed in American race relations. His presidency prompted both heady expectations for greater racial tolerance and inclusion as well as grim worries about racial backlash and conflict. This course will examine shifts in American racial politics during the Obama presidency. We will consider Blacks' political fortunes, racial attitudes across groups, reactions to demographic and economic change, and racial dynamics in party politics and specific public policy areas over the course of the Obama era."}, {"name": "Registration Requirements", "value": "First year students only Attendance at first class is required."}, {"name": "Learning Objectives", "value": "Although this is a political science seminar, students are not expected to have background knowledge in the subject area; nor should you necessarily have plans to make political science your major. The goal of the seminar is to help you become engaged, thoughtful students while studying a topic that interests you. The course is designed to teach intellectual skills: how to read carefully and critically, think logically, speak effectively, and write clearly, concisely, and convincingly. The emphasis will be on active discussions and writing assignments that allow you to hone these fundamentals of academic inquiry."}, {"name": "Teaching Method", "value": "Seminar with active discussion"}, {"name": "Evaluation Method", "value": "Class Participation 25%<br/>Short Papers 40%<br/>Final Paper 35%"}, {"name": "Class Materials (Required)", "value": "Course Reserves or Course Reader"}], "lmod": "12/24/16 7:06 PM (CT)", "subject": "POLI_SCI"}]