[{"class_mtg_info": [{"meet_t": "Mo 6:15PM - 9:15PM", "meet_l": "McMillen Crowe Hall 3-130"}], "school": "SCS", "enrl_requirement": "", "qtr": "Winter 2016", "name": "27835", "title": "SCS SPANISH 101-B-62 Elementary Spanish II", "class_attributes": "", "section": "27835", "instructors": [{"instructor_phone": "847/491-8280", "instructor_name": "Elena   Lanza", "instructor_addr": "1-200 Kresge"}], "topic": "", "course": "101-B", "descriptions": [{"name": "Overview of class", "value": "This course is part two of a three-quarter sequence based on the competency (or &quot;can do&quot;) and the communicative approaches. The course is designed for adults who wish to learn Spanish in a dynamic way and it is designed to help students achieve pragmatic, linguistic and cultural competencies adequate for a beginning level. This is a student-centered course in which the student will learn how to interact in the target language in basic real-life situations, both orally and in writing, as well as to develop the necessary skills to become an independent learner outside of the classroom. The intercultural nature of all the activities and tasks to be completed by the student will also help the student to become more aware of the rich and varied cultures within the Spanish-speaking world. The topics and textbook are aligned with the interests of adult learners. Carries humanities credit (two-course limit for language courses)."}, {"name": "Registration Requirements", "value": "Only students who have never taken Spanish before should enroll in this course. Students with previous Spanish experience (high school or college, studied abroad, etc), should enroll in SPANISH 102. Students with questions prior to registering should contact the instructor.<br/><br/>By the time a student takes this course, s/he should know how to:<br/><br/>-Give and request personal information (name, age, address, profession/occupation, phone numbers, marital status, talk about the family?)<br/>-Describe something's or someone's physical appearance and personality (descriptive adjectives, as well as clothing)<br/>-Express likes/dislikes/preferences<br/>-Give (and ask for) directions (and talk about transportation, location, frequency?)<br/>-Express obligation"}, {"name": "Learning Objectives", "value": "-Offer and invite, accept or reject an invitation<br/>-Talk about plans and intentions; suggest activities in the future<br/>-Compare<br/>-Talk about the past<br/>-Express opinions and (dis)agreement<br/>-Make and confirm reservations; talk about travel"}, {"name": "Teaching Method", "value": "Class participation<br/>Films / videos<br/>Group work<br/>Listening exercises<br/>Online work <br/>Problem sets<br/>Readings<br/>Simulation / role-play<br/>Writing assignments"}, {"name": "Evaluation Method", "value": "Class Participation &amp; Attendance - 15%<br/>Weekly Quizzes - 20%<br/>Homework Assignments - 15%<br/>In-class Compositions (2) - 10%<br/>Exam I - 15%<br/>Exam II - 20% <br/>Oral Exam - 5%"}, {"name": "Class Materials (Required)", "value": "Available at Norris Bookstore:<br/><br/>Textbook: Alonso, Montserrat and Rocío Prieto. Embarque 1 &amp; 2, Madrid: Edelsa, 2011.<br/>Manual (Libro de ejercicios): Alonso, Montserrat and Rocío Prieto. Embarque 1, Madrid: Edelsa, 2011."}], "lmod": "1/9/16 6:42 PM (CT)", "subject": "SPANISH"}]