[{"class_mtg_info": [{"meet_t": "Th 9:00AM - 12:00PM", "meet_l": "No Room Needed"}], "school": "TGS", "enrl_requirement": "", "qtr": "Spring 2016", "name": "38244", "title": "TGS NUIN 470-0-1 Cellular &amp; Molecular Basis of Information Storage", "class_attributes": "", "section": "38244", "instructors": [{"instructor_phone": "", "instructor_name": "Anis   Contractor", "instructor_addr": ""}], "topic": "", "course": "470-0", "descriptions": [{"name": "Overview of class", "value": "This is a literature-based course designed to give students a framework to understand the current state of our knowledge about the cellular to system basis for information processing and storage. Weekly classes will be facilitated by faculty experts in specific areas of neural plasticity and information storage. Students will read papers assigned by the lecturer before each class and submit two relevant questions to for each paper (to then be discussed in class). Thus, seminal papers on each topic will be considered in class, whilst an overview of the important questions will be provided by the faculty facilitator. In each lecture consideration will be given how the information reviewed can be translated to problems related to issues of mental health."}, {"name": "Class Notes", "value": "Topics to be covered:<br/>03/31/16 Neurogenesis in the hippocampus, what is it good for? Anis Contractor <br/>04/07/16 No class (Anis Out of Town)<br/>04/14/16: TBD Richard Miller<br/>04/21/16 Motor learning and plasticity in the cortex Gordon Shepherd (new papers can be uploaded)<br/>04/28/16 Sensory systems and information processing: Sleep and smell Jay Gottfried <br/>05/05/16 CA1 Plasticity and navigation: sharp wave pre-play and re-play. Dan Dombeck <br/>05/11/16 (Day change Wed morning) &quot;Sex Differences in Mechanisms of Synaptic Modulation.&quot; Catherine Woolley <br/>05/19/16: The hippocampus and memory Joel Voss <br/>05/26/16 Basal ganglia plasticity and related disorders Mark Bevan<br/>06/02/16 Substrates for anxiety-based learning; Jelena Radulovic <br/>06/06/14 Final Examination."}], "lmod": "4/3/16 7:41 PM (CT)", "subject": "NUIN"}]