[{"class_mtg_info": [{"meet_t": "Tu 6:00PM - 8:50PM", "meet_l": "TBA"}], "school": "WCAS", "enrl_requirement": "Enrollment Requirements: Reserved for Asian American Studies majors and minors", "qtr": "Spring 2017", "name": "32480", "title": "WCAS ASIAN_AM 394-0-20 Professional Linkage Program", "class_attributes": "", "section": "32480", "instructors": [{"instructor_phone": "taoki@saic.edu", "instructor_name": "Tatsuyuki   Aoki", "instructor_addr": "Crowe Hall, Room 1135"}], "topic": "Asian American Arts in Practice", "course": "394-0", "descriptions": [{"name": "Overview of class", "value": "This course will examine the cross-cultural work of Asian American artists with a focus on regional arts and culture, the influence of nationally and internationally known artists, and historical analyses of Asian American music and visual arts. For this class, we will look at the phenomenal development of new and traditional music, performing arts, and visual arts in Chicago and the Bay Area in the last 20 years. This research-based class also investigates many influential cyber arts and/or non-arts movement such as Youtube submissions, internet-based performing activities and web page presentations. Themes that will be addressed are the forming of new cultural and artistic communities and their impact on the mainstream culture, collaboration between communities and cultures on the local and transnational levels, and community and economic development issues in the arts and society."}, {"name": "Registration Requirements", "value": "None."}, {"name": "Evaluation Method", "value": "Attendance: 10<br/>Class participation: 10<br/>Paper, final: 30<br/>Paper, mid-term: 20<br/>Research project: 20<br/>Writing assignments: 10<br/>The class will be conducted based on lectures, discussion and listening/viewing musical and performing works as well as meeting with guest artists and community leaders. Students are required to satisfy all recommended reading materials and listening and/or reviewing musical works. One mid term project presentation and final research paper is requited. In some cases the class will take extra field trip to live performances."}, {"name": "Class Materials (Required)", "value": "All materials for this course will be made available on Canvas - no purchase necessary."}, {"name": "Class Notes", "value": "Attendance at first class mandatory."}], "lmod": "2/13/17 6:41 PM (CT)", "subject": "ASIAN_AM"}]