[{"class_mtg_info": [{"meet_t": "Tu 2:00PM - 4:50PM", "meet_l": "Frances Searle Building 1483"}], "school": "SoC", "enrl_requirement": "Enrollment Requirements: Reserved for Comm Studies juniors.  Majors who study abroad a full year may enroll senior year.  Comm_ST 394-0 may not be repeated.", "qtr": "Winter 2017", "name": "23537", "title": "SoC COMM_ST 394-0-20 Communication Studies Research Seminar", "class_attributes": "Attendance at 1st class mandatory<br/><br/>Juniors Only<br/><br/>", "section": "23537", "instructors": [{"instructor_phone": "847/491-2260", "instructor_name": "Kathleen Galvin   Wilkinson", "instructor_addr": "SEARLE 2240 Campus Dr 1-165"}], "topic": "Family Comm About Health", "course": "394-0", "descriptions": [{"name": "Overview of class", "value": "Family communication and health communication represent two areas in the communication studies field that emerged in the last quarter of the 20th Century. Currently scholars are beginning to work at the intersection of these areas with the goals of understanding and potentially altering families' interactions regarding members' health. The concept of &quot;health&quot; will be broadly interpreted, including physical and psychological health.<br/>This course addresses the intersection of family members as they address the issues of health. It will examine: (1) family theories that shed light on such interactions, (2) communication patterns that tend to emerge around certain health-related issues. This course explores the intersection of illness/disability/death and family communication. Relying on a set of theoretical frameworks. including family systems theory, topics to be addressed include: child and adult cancer, addictions, genetics, disabilities, death, cultural health norms, and health prevention practices.<br/>This course is designed specifically to focus on both academic and professional writing. Therefore the topic of writing will be addressed in most classes and assignments will be designed to foster skill development in writing for the public as well as an academic audience. This may include writing editorials, creating tweets, or pamphlets for teens. A final paper is required."}, {"name": "Class Materials (Required)", "value": "Miller-Day. M. (Ed.) (2011) Family Communication, Connections and Health Transitions. Peter Lanq: New York<br/><br/>978-1433110696"}], "lmod": "12/24/16 6:45 PM (CT)", "subject": "COMM_ST"}]